         TITLE 'ISPF - FIND  FUNCTION'                         SS NOV85 00010000
* FIND SUPPORT                                                 SS MAY85 00020000
ISPFIND  DS    0H          ****    FIND  SUBCOMMAND  ****      SS MAY85 00030000
         USING *,R4                                            SS NOV85 00040000
         L     R15,SPFOPER           FIRST BLANK AFTER CMD     SS MAY85 00050000
         CLI   $TLEX(14),4           EX BYTE SET FOR RFIND     SS AUG86 00060000
         BNE   ISPFIND4              NO, CONTINUE              SS AUG86 00070000
         LA    R14,46                SCAN COUNT                SS AUG86 00080000
         BAS   R2,ISPCKBLK           FIND NON BLANK            SS AUG86 00090000
         LTR   R15,R15               ANY OPERANDS              SS AUG86 00100000
         BZ    ISPFLG03              NO STRING                 SS AUG86 00110000
         CLI   0(R15),C'F'           RFIND AND F TOGETHER      SS AUG86 00120000
         BE    ISPFIND5              YES, CHECK BLANK          SS AUG86 00130000
         CLI   0(R15),X'86'          LOW CASE F                SS AUG86 00140000
         BNE   ISPFIND4              NO, CONTINUE              SS AUG86 00150000
ISPFIND5 DS    0H                       *                      SS AUG86 00160000
         CLI   1(R15),C' '           F-BLANK                   SS AUG86 00170000
         BNE   ISPFIND4              NO, CONTINUE              SS AUG86 00180000
         LA    R15,1(R15)            SKIP F                    SS AUG86 00190000
ISPFIND4 DS    0H                                              SS AUG86 00200000
         LA    R14,46                TRY FOR 46 BYTES          SS MAY85 00210000
         LH    R1,SPFTBPFD         FIND INDEX CODE             SS NOV85 00220000
         L     R1,ISPFDPR(R1)      GET PARSE TABLE             SS NOV85 00230000
         BAS   R2,ISPPARSI           PARSE ROUTINE             SS NOV85 00240000
         C     R15,ISPL8             RETURN CODE               SS MAY85 00250000
         BH    ISPFLGX9                                        SS OCT88 00260000
         CLI   SPFPRRC,8           NO STRING                   SS MAY85 00270000
         BE    ISPFLG03                                        SS MAY85 00280000
         TM    SPFPRBI,X'03'       PREFIX OR SUFFIX            SS MAY85 00290000
         BO    ISPFLGX2            BOTH.. ERROR                SS MAY85 00300000
         TM    SPFPRBI,X'05'       WORD OR SUFFIX              SS MAY85 00310000
         BO    ISPFLGX2            BOTH.. ERROR                SS MAY85 00320000
         TM    SPFPRBI,X'06'       WORD OR PREFIX              SS MAY85 00330000
         BO    ISPFLGX2            BOTH.. ERROR                SS MAY85 00340000
         MVC   SPFTFF,SPFPRBI                                  SS NOV85 00350000
         NI    SPFTFF2,255-X'02'   CLEAR AT TOP/BOTTOM         SS NOV85 00360000
         NI    SPFTFF2,255-X'18'   CLEAR REPEAT FIND/SEC NUM   SS JAN86 00370000
         OI    SPFTFF2,X'01'       HAVE STRING                 SS NOV85 00380000
         TM    SPFPRBI2,X'80'      HAVE SECONDED NUMBER        SS NOV85 00390000
         BZ    *+8                                             SS NOV85 00400000
         OI    SPFTFF2,X'10'                                   SS NOV85 00410000
         NI    SPFPRBI2,255-X'80'  CLEAR                       SS NOV85 00420000
* SPFTFST IS SET TO START OF FIELD FOR SEARCH                  SS NOV85 00430000
* SPFTFED IS SET TO LENGTH OF FIELD                            SS NOV85 00440000
         LH    R1,SPFTBPFD         FIND INDEX CODE             SS NOV85 00450000
         LTR   R1,R1               INDEX 0                     SS NOV85 00460000
         BZ    ISPFINDS            YES, FOR SESSION LOG        SS NOV85 00470000
         L     R1,ISPFDCK(R1)      GET CHECK TABLE             SS NOV85 00480000
ISPFINDL CLI   0(R1),X'FF'         END OF TABLE                SS NOV85 00490000
         BE    ISPFLGX2            MUST BE KEY CONFLICT        SS NOV85 00500000
         CLC   0(2,R1),SPFPRBI2    COMPARE BYTES 2 AND 3       SS NOV85 00510000
         BE    ISPFINDF            GOT A MATCH                 SS NOV85 00520000
         LA    R1,06(,R1)          NEXT ENTRY                  SS NOV85 00530000
         B     ISPFINDL            LOOP                        SS NOV85 00540000
* THE FOLLOWING ARE FOR SESSION LOG                            SS NOV85 00550000
* OTHERS COULD BE SET FOR OTHER TABLES                         SS NOV85 00560000
ISPFINDS LA    R1,SPFLINE                                      SS NOV85 00570000
         ST    R1,SPFTFST          STARTING LOCATION           SS NOV85 00580000
         LA    R1,158                                          SS OCT88 00590000
         STH   R1,SPFTFED          SET LENGTH                  SS NOV85 00600000
         B     ISPFIND3                                        SS NOV85 00610000
* THIS IS END OF PARAMETERS FOR LOG FIND                       SS NOV85 00620022
ISPFINDF DS    0H                  GOOD ONE                    SS NOV85 00630000
         LH    R14,2(R1)           GET FIELD OFFSET            SS NOV85 00640000
         LA    R14,SPWRKC(R14)     CALC ADDRESS                SS NOV85 00650000
         ST    R14,SPFTFST         STARTING LOCATION           SS NOV85 00660023
         LH    R14,4(R1)           LENGTH                      SS NOV85 00670000
         STH   R14,SPFTFED         SET LENGTH                  SS NOV85 00680000
         B     ISPFIND3                                        SS NOV85 00690000
ISPFIND3 DS    0H                                              SS NOV85 00700000
         TM    SPFTFF,X'40'        OFFSET FLAG                 SS NOV85 00710000
         BZ    ISPFLG01            NO                          SS NOV85 00720000
         LH    R1,SPFTFED          LENGTH                      SS JAN86 00730000
         LA    R1,1(,R1)           BASE 1                      SS JAN86 00740000
         C     R1,SPFPRNU          CHECK RANGE                 SS JAN86 00750000
         BL    ISPFLGX1            RANGE ERROR                 SS JAN86 00760000
         TM    SPFTFF2,X'10'       ENDING RANGE ALSO           SS JAN86 00770000
         BZ    ISPFLGD1            SKIP SECOND RANGE CHECK     SS JAN86 00780000
         C     R1,SPFPRNU2         CHECK RANGE                 SS JAN86 00790000
         BL    ISPFLGX1            RANGE ERROR                 SS JAN86 00800000
         CLC   SPFPRNU,SPFPRNU2    SECOND MUST FOLLOW FIRST    SS JAN86 00810000
         BH    ISPFLGX1            RANGE ERROR                 SS JAN86 00820000
ISPFLGD1 DS    0H                                              SS JAN86 00830000
         BCTR  R1,0                BASE 0                      SS JAN86 00840000
         SH    R1,SPFPRLN          LAST POSSIBLE POSITION      SS JAN86 00850000
         BM    ISPFLGX3            LENGTH ERROR                SS JAN86 00860000
         L     R14,SPFPRNU         OFFSET                      SS JAN86 00870000
         BCTR  R14,0               REF TO ZERO                 SS JAN86 00880000
         CR    R14,R1              AFTER LAST POSSIBLE POSITIONSS JAN86 00890000
         BH    ISPFLGX3            YES, LENGTH ERROR           SS JAN86 00900000
         L     R15,SPFTFST         STARTING LOCATION           SS JAN86 00910000
         AR    R15,R14             ADD POSITION                SS JAN86 00920000
         ST    R15,SPFTFST         NEW STARTING LOCATION       SS JAN86 00930000
         TM    SPFTFF2,X'10'       ENDING RANGE                SS JAN86 00940000
         BZ    ISPFLGA1            NO                          SS JAN86 00950000
         L     R15,SPFPRNU2        GET IT                      SS JAN86 00960000
         BCTR  R15,0               REF TO ZERO                 SS JAN86 00970000
         CR    R15,R1              AFTER LAST POSSIBLE POSITIONSS JAN86 00980000
         BH    *+6                 YES                         SS JAN86 00990000
         LR    R1,R15              NO, USE THIS POSITION       SS JAN86 01000000
         SR    R1,R14              LAST MINUS FIRST            SS JAN86 01010000
         BZ    ISPFLGA1            NO LENGTH, USE ONLY FIRST   SS JAN86 01020000
         LA    R1,1(,R1)           PLUS 1                      SS JAN86 01030000
         STH   R1,SPFTFED          SET LENGTH OF SEARCH        SS JAN86 01040000
         NI    SPFTFF,255-X'40'    TURN OFF POSITION           SS NOV85 01050000
         B     ISPFLGA1                                        SS NOV85 01060000
ISPFLG01 DS    0H                                              SS NOV85 01070000
         LH    R1,SPFTFED                                      SS NOV85 01080000
         SH    R1,SPFPRLN          ALLOW FOR LENG OF STRING    SS NOV85 01090000
         BM    ISPFLGX3            TO LONG                     SS NOV85 01100000
         BZ    ISPFLGC1                                        SS NOV85 01110000
         LA    R1,1(,R1)                                       SS NOV85 01120000
         STH   R1,SPFTFED          SET LENGTH                  SS NOV85 01130000
         B     ISPFLGA1                                        SS NOV85 01140000
ISPFLGC1 DS    0H                                              SS NOV85 01150000
         OI    SPFTFF,X'40'        USE POSITION                SS NOV85 01160000
         B     ISPFLGA1                                        SS NOV85 01170000
ISPFLGX1 DS    0H                                              SS NOV85 01180000
         MVC   SPFMSGID,ISPPDSM SETUP MESSAGE                  SS NOV85 01190000
         MVI   SPFMSGID+7,C'A'                                 SS NOV85 01200000
         MVI   SPFMSGID+6,C'5'     RANGE ERROR                 SS NOV85 01210000
         B     ISPFLGX9            RETURN WITH ERROR           SS DEC87 01220000
ISPFLGX2 DS    0H                                              SS NOV85 01230000
         MVC   SPFMSGID,ISPPDSM SETUP MESSAGE                  SS NOV85 01240000
         MVI   SPFMSGID+7,C'A'                                 SS NOV85 01250000
         MVI   SPFMSGID+6,C'7'     CONFLICT ERROR              SS NOV85 01260000
         B     ISPFLGX9            RETURN WITH ERROR           SS DEC87 01270000
ISPFLGX3 DS    0H                                              SS NOV85 01280000
         MVC   SPFMSGID,ISPPDSM SETUP MESSAGE                  SS NOV85 01290000
         MVI   SPFMSGID+7,C'A'                                 SS NOV85 01300000
         MVI   SPFMSGID+6,C'3'     OPERAND LENGTH ERROR        SS NOV85 01310000
         B     ISPFLGX9            RETURN WITH ERROR           SS DEC87 01320000
ISPFLGX9 DS    0H                       *                      SS DEC87 01330000
         LH    R15,SPFTBPFD        FIND INDEX                  SS OCT88 01340000
         SLL   R15,1               TIMES 1 FOR OFFSET          SS OCT88 01350000
         LA    R0,ISPFLGXX(R15)         *                      SS OCT88 01360000
         LA    R15,168             ERROR PROMPT PANEL          SS DEC87 01370000
         BR    R3                  RETURN TO ROUTER            SS DEC87 01380000
ISPFLGA1 DS    0H                                              SS NOV85 01390000
         LH    R2,SPFPRLN          LENGTH OF STRING            SS NOV85 01400000
         CH    R2,ISPFLGLM         CHECK FOR LIMIT             SS OCT88 01410000
         BH    ISPFLGX3            TOO LONG                    SS OCT88 01420045
         CH    R2,ISPFZERO         CHECK FOR ZERO             DRK DEC09 01420148
         BE    ISPFLGX3            TOO SHORT, TAKE LONG ROAD  DRK DEC09 01421046
         STH   R2,SPFTFDL                                      SS NOV85 01430000
         LA    R1,SPFFDSAV                                     SS NOV85 01440000
         ST    R1,SPFTFDS          SAVE COMPARE STG ADDR       SS NOV85 01450000
         LH    R1,SPFPRLN                                      SS MAY85 01460000
         L     R15,SPFPRSR                                     SS MAY85 01470000
         MVI   SPFFDSAV,C' '       BLANK FIND VARIABLE        DRK DEC02 01471021
         MVC   SPFFDSAV+1(31),SPFFDSAV  RIPPLE                DRK DEC02 01472021
         EX    R1,ISPFLGMV         EXECUTE MVC CHAR            SS MAY85 01480000
         TM    SPFPRBI,X'80'       ASIS                        SS MAY85 01490000
         BO    ISPFLG04            DO NOT FORCE UPPER CASE     SS MAY90 01500000
         MVI   SPFINPUT,C' '       SETUP BLANK LINE            SS MAY85 01510000
         MVC   SPFINPUT+1(79),SPFINPUT  RIPPLE                ABL APR86 01520000
         LH    R1,SPFTFDL          FIND STRING LENGTH          SS NOV85 01530000
         EX    R1,ISPFLGOC         EXECUTE OR CHAR             SS MAY85 01540000
         B     ISPFLG04                                        SS NOV85 01550000
ISPFLGOC OC    SPFFDSAV,SPFINPUT   FORCE UPPER CASE            SS MAY85 01560000
ISPFLGMV MVC   SPFFDSAV(0),0(R15)  SAVE COMPARE STRING         SS NOV85 01570000
ISPFLG03 DS    0H                                              SS NOV85 01580000
         OI    SPFTFF2,X'08'       REPEAT FIND                 SS NOV85 01590000
ISPFLG04 BAS   R2,ISPFNDI                                      SS NOV85 01600000
ISPFIND2 DS    0H                                              SS NOV85 01610000
         LA    R15,100              ROUTE TO TBDISPLAY         SS NOV85 01620000
         B     ISPROUT              RETURN TO ROUTER           SS NOV85 01630000
ISPFLGLM DC    H'31'                MAX STRING LENGTH          SS OCT88 01640000
ISPFZERO DC    H'-1'                ZERO STRING LENGTH        DRK DEC09 01641048
         DROP  R4                                              SS NOV85 01650000
         SPACE 2                                                        01660000
ISPFDPR  DS    0F                                              SS NOV85 01670000
         DC    A(ISPPARFD)     0   PARSE LIST ADDRESS          SS NOV85 01680000
         DC    A(ISPPARF2)     4   MEMLIST SOURCE              SS NOV85 01690000
         DC    A(ISPPARF3)     8   MEMLIST LOAD MOD            SS NOV85 01700000
         DC    A(ISPPARF4)    12   LISTA                       SS NOV85 01710000
         DC    A(ISPPARF5)    16   LISTV                       SS NOV85 01720000
         DC    A(ISPPARF6)    20   LISTC/LISTF                 SS OCT88 01730000
         DC    A(ISPPARF7)    24   TCT                         SS OCT88 01740000
         DC    A(ISPPARF8)    28   CAX                         SS OCT88 01750000
         DC    A(ISPPARF9)    32   FILTER                      SS OCT88 01760000
         DC    A(ISPPARFA)    36   CSECT                       SS OCT88 01770000
ISPFDCK  DS    0F                                              SS NOV85 01780000
         DC    A(0)                TABLE ADDRESSES             SS NOV85 01790000
         DC    A(ISPFDCK2)                                     SS NOV85 01800000
         DC    A(ISPFDCK3)                                     SS NOV85 01810000
         DC    A(ISPFDCK4)                                     SS NOV85 01820000
         DC    A(ISPFDCK5)                                     SS NOV85 01830000
         DC    A(ISPFDCK6)                                     SS OCT88 01840000
         DC    A(ISPFDCK7)                                     SS OCT88 01850000
         DC    A(ISPFDCK8)                                     SS OCT88 01860000
         DC    A(ISPFDCK9)                                     SS OCT88 01870000
         DC    A(ISPFDCKA)                                     SS OCT88 01880000
ISPFLGXX DS    0H                PROMPT PANEL                  SS OCT88 01890000
         DC    CL8'&P.OPFTS'   0   LOG FIND PROMPT             SS OCT88 01900000
         DC    CL8'&P.MNFTM'   4   MEMLIST SOURCE              SS OCT88 01910000
         DC    CL8'&P.MNFTU'   8   MEMLIST LOAD MOD            SS OCT88 01920000
         DC    CL8'&P.LAFTA'  12   LISTA                       SS OCT88 01930000
         DC    CL8'&P.LVFTV'  16   LISTV                       SS OCT88 01940000
         DC    CL8'&P.LCFTC'  20   LISTC/LISTF                 SS OCT88 01950000
         DC    CL8'&P.TTFTT'  24   TCT                         SS OCT88 01960000
         DC    CL8'&P.CXFTX'  28   CAX                         SS OCT88 01970000
         DC    CL8'&P.FLFTF'  32   FILTER                      SS OCT88 01980000
         DC    CL8'&P.CSFTS'  36   CSECT                       SS OCT88 01990000
* PARSE PARM LIST FOR FIND                                     SS MAR85 02000000
         DS    0F                                    MATCHES   SS MAR85 02010000
***                                                  ========= SS MAR85 02020000
ISPPARFD DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 02030000
         DC    X'51',X'40',X'00',X'00',F'1',F'158' NUMERIC     SS OCT88 02040000
         DC    X'51',X'00',X'80',X'00',F'2',F'158' NUMERIC2    SS OCT88 02050000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 02060020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 02070000
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 02080000
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 02090000
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 02100000
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 02110000
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 02120000
         DC    X'FF'                                           SS MAY85 02130000
         DS    0F                                    MATCHES   SS MAR85 02140000
***                                                  ========= SS MAR85 02150000
ISPPARF2 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 02160000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 02170000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 02180000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 02190020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 02200020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 02210020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 02220020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 02230020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 02240020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 02250020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 02260000
         DC    X'33',X'00',X'40',X'00',CL8'USERID'   U/USER    SS NOV85 02270000
         DC    X'21',X'00',X'40',X'00',CL8'ID'       ID        SS NOV85 02280000
         DC    X'34',X'00',X'20',X'00',CL8'CDATE'    C/CDATE   SS NOV85 02290000
         DC    X'34',X'00',X'20',X'00',CL8'CREATED'  C/CREAT  ABL APR86 02300000
         DC    X'34',X'00',X'10',X'00',CL8'MDATE'    M/MDATE   SS NOV85 02310000
         DC    X'33',X'00',X'10',X'00',CL8'MODIFIED' M/MODI   ABL APR86 02320000
         DC    X'22',X'00',X'00',X'04',CL8'MOD'      MOD      ABL APR86 02330000
         DC    X'22',X'00',X'08',X'00',CL8'SIZE'     SIZ       SS NOV85 02340000
         DC    X'22',X'00',X'04',X'00',CL8'VERSION'  VER       SS NOV85 02350000
*REDUND. DC    X'22',X'00',X'04',X'00',CL8'VERMOD'   VER       SS NOV85 02360000
         DC    X'23',X'00',X'00',X'02',CL8'INIT'     INIT     ABL APR86 02370000
         DC    X'22',X'00',X'02',X'00',CL8'TTR'      TTR       SS NOV85 02380000
         DC    X'24',X'00',X'01',X'00',CL8'ALIASOF'  ALIAS     SS NOV85 02390000
         DC    X'22',X'00',X'00',X'01',CL8'MEMBER'  REDUNDANT  SS NOV85 02400000
         DC    X'33',X'00',X'00',X'01',CL8'NAME'    REDUNDANT  SS MAY88 02410000
         DC    X'FF'                                           SS MAY88 02420000
         DS    0H                                              SS NOV85 02430000
ISPFDCK2 DC    X'0000',AL2(MEM2VMOD-SPWRKC),AL2(MEM2TTR+8-MEM2VMOD)     02440000
         DC    X'0010',AL2(MEM2VMOD-SPWRKC),AL2(MEM2TTR+8-MEM2VMOD)     02450000
*SPFDCK2 DC    X'0000',AL2(MEMLNAME-SPWRKC),H'07'              SS NOV85 02460000
         DC    X'0001',AL2(MEMLNAME-SPWRKC),H'07'              SS NOV85 02470000
         DC    X'4000',AL2(MEM2MID-SPWRKC),H'07'               SS NOV85 02480000
         DC    X'2000',AL2(MEM2CDAT-SPWRKC),H'07'              SS NOV85 02490000
         DC    X'1000',AL2(MEM2MDAT-SPWRKC),H'07'              SS NOV85 02500000
         DC    X'0800',AL2(MEM2CSIZ-SPWRKC),H'05'              SS NOV85 02510000
         DC    X'0400',AL2(MEM2VMOD-SPWRKC),H'07'              SS NOV85 02520000
         DC    X'0004',AL2(MEM2VMOD-SPWRKC+3),H'02'           ABL APR86 02530000
         DC    X'0002',AL2(MEM2ISIZ-SPWRKC),H'05'             ABL APR86 02540000
         DC    X'0200',AL2(MEM2TTR-SPWRKC),H'05'               SS NOV85 02550000
         DC    X'0100',AL2(MEM2ALIS-SPWRKC),H'07'              SS NOV85 02560000
         DC    X'FFFF'              END OF TABLE               SS NOV85 02570000
         DS    0F                                    MATCHES   SS MAR85 02580000
***                                                  ========= SS MAR85 02590000
ISPPARF3 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 02600000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 02610000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 02620000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 02630020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 02640020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 02650020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 02660020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 02670020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 02680020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 02690020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 02700000
******   DC    X'23',X'00',X'40',X'00',CL8'ATTR'     ATTR      SS NOV85 02710000
         DC    X'33',X'00',X'20',X'00',CL8'DATE'     D/DATE    SS NOV85 02720000
         DC    X'23',X'00',X'20',X'00',CL8'LENLKED'  LENL     ABL JAN87 02730000
         DC    X'21',X'00',X'20',X'00',CL8'LKED'     LK       ABL JAN89 02731000
         DC    X'23',X'00',X'10',X'00',CL8'LENGTH'   LENG      SS NOV85 02732000
         DC    X'23',X'00',X'10',X'00',CL8'SIZE'     SIZE      SS NOV85 02733000
         DC    X'24',X'00',X'08',X'00',CL8'ENTRY'    ENTRY     SS NOV85 02734000
         DC    X'23',X'00',X'00',X'80',CL8'MAIN'     MAIN      SS NOV85 02735000
         DC    X'24',X'00',X'00',X'40',CL8'MATCH'    MATCH     SS NOV85 02736000
         DC    X'22',X'00',X'00',X'20',CL8'SSI'      SSI       SS NOV85 02737000
         DC    X'22',X'00',X'02',X'00',CL8'TTR'      TTR       SS NOV85 02738000
         DC    X'24',X'00',X'01',X'00',CL8'ALIASOF'  ALIAS     SS NOV85 02739000
         DC    X'22',X'00',X'00',X'01',CL8'MEMBER'  REDUNDANT  SS NOV85 02740000
         DC    X'33',X'00',X'00',X'01',CL8'NAME'    REDUNDANT  SS MAY88 02750000
         DC    X'FF'                                           SS MAY85 02760000
         DS    0H                                              SS NOV85 02770000
*                                                             DRK JUN00 02770115
*        INCLUDE YYYY/MM/DD DATE VARIABLE --------.           DRK JUN00 02770215
*                                                 |           DRK JUN00 02770315
*                                                 V           DRK JUN00 02771015
ISPFDCK3 DC    X'0000',AL2(MEMLNAME-SPWRKC),AL2(MEM2LDAX+10-MEMLNAME)   02780014
         DC    X'0010',AL2(MEMLNAME-SPWRKC),AL2(MEM2LDAX+10-MEMLNAME)   02790014
*SPFDCK3 DC    X'0000',AL2(MEMLNAME-SPWRKC),H'07'              SS NOV85 02800000
         DC    X'0001',AL2(MEMLNAME-SPWRKC),H'07'              SS NOV85 02810000
*        DC    X'4000',AL2(MEM2ATT1-SPWRKC),H'27'              SS NOV85 02820000
         DC    X'2000',AL2(MEM2LDAT-SPWRKC),H'07'              SS NOV85 02830000
         DC    X'1000',AL2(MEM2LENG-SPWRKC),H'05'              SS NOV85 02840000
         DC    X'0800',AL2(MEM2ENTY-SPWRKC),H'05'              SS NOV85 02850000
         DC    X'0080',AL2(MEM2MNAM-SPWRKC),H'07'              SS NOV85 02860000
         DC    X'0040',AL2(MEM2MTTR-SPWRKC),H'07'              SS NOV85 02870000
         DC    X'0020',AL2(MEM2SSI-SPWRKC),H'07'               SS NOV85 02880000
         DC    X'0200',AL2(MEM2TTR-SPWRKC),H'05'               SS NOV85 02890000
         DC    X'0100',AL2(MEM2ALIS-SPWRKC),H'07'              SS NOV85 02900000
         DC    X'FFFF'              END OF TABLE               SS NOV85 02910000
         DS    0F                                    MATCHES   SS MAR85 02920000
***                                                  ========= SS MAR85 02930000
ISPPARF4 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 02940000
         DC    X'51',X'40',X'00',X'00',F'1',F'44' NUMERIC     ABL APR86 02950000
         DC    X'51',X'00',X'80',X'00',F'2',F'44' NUMERIC2    ABL APR86 02960000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 02970020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 02980020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 02990020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 03000020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 03010020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 03020020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 03030020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 03040000
         DC    X'21',X'00',X'00',X'01',CL8'DDNAME'   DD        SS NOV85 03050000
         DC    X'22',X'00',X'08',X'00',CL8'DSNAME'   DSN      ABL APR86 03060000
         DC    X'22',X'00',X'40',X'00',CL8'VOLUME'   VOL       SS NOV85 03070000
         DC    X'22',X'00',X'20',X'00',CL8'MEMBER'   MEM       SS NOV85 03080000
         DC    X'21',X'00',X'10',X'00',CL8'ALLOC'    AL        SS NOV85 03090000
*REDUND. DC    X'21',X'00',X'10',X'00',CL8'ALOC'     AL        SS NOV85 03100000
         DC    X'FF'                                           SS MAY85 03110000
         DS    0H                                              SS NOV85 03120000
ISPFDCK4 DC    X'0000',AL2(SPFADDNM-SPWRKC),AL2(SPFAFLAG+8-SPFADDNM)    03130000
         DC    X'0010',AL2(SPFADDNM-SPWRKC),AL2(SPFAFLAG+8-SPFADDNM)    03140000
*SPFDCK4 DC    X'0000',AL2(SPFADDNM-SPWRKC),H'07'              SS NOV85 03150000
         DC    X'0001',AL2(SPFADDNM-SPWRKC),H'07'              SS NOV85 03160000
         DC    X'0800',AL2(SPFADSN-SPWRKC),H'43'              ABL APR86 03170000
         DC    X'4000',AL2(SPFAVOL-SPWRKC),H'05'               SS NOV85 03180000
         DC    X'2000',AL2(SPFAMEM-SPWRKC),H'07'               SS NOV85 03190000
         DC    X'1000',AL2(SPFAALLC-SPWRKC),H'03'              SS NOV85 03200000
         DC    X'FFFF'              END OF TABLE               SS NOV85 03210000
         DS    0F                                    MATCHES   SS MAR85 03220000
***                                                  ========= SS MAR85 03230000
ISPPARF5 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 03240000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 03250000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 03260000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 03270020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 03280020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 03290020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 03300020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 03310020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 03320020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 03330020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 03340000
         DC    X'31',X'00',X'00',X'01',CL8'VOLUME'   V/VO      SS NOV85 03350000
         DC    X'31',X'00',X'08',X'00',CL8'INDC'     I/IN     ABL APR86 03360000
         DC    X'22',X'00',X'40',X'00',CL8'ADDRESS'  ADD       SS NOV85 03370000
         DC    X'FF'                                           SS MAY85 03380000
         DS    0H                                              SS NOV85 03390000
*                                                             DRK JUN00 03390113
*        INCLUDE NEW LISTV VARIABLES -------------.           DRK JUN00 03391015
*                                                 |           DRK JUN00 03392013
*                                                 V           DRK JUN00 03393013
ISPFDCK5 DC    X'0000',AL2(SPFVVOL-SPWRKC),AL2(SPFVVIRS+5-SPFVVOL)      03400013
         DC    X'0010',AL2(SPFVVOL-SPWRKC),AL2(SPFVVIRS+5-SPFVVOL)      03410013
         DC    X'0001',AL2(SPFVVOL-SPWRKC),H'05'               SS NOV85 03420000
         DC    X'0800',AL2(SPFVINDC-SPWRKC),H'07'             ABL APR86 03430000
         DC    X'4000',AL2(SPFVADDR-SPWRKC),H'03'             DRK MAY98 03440003
         DC    X'FFFF'              END OF TABLE               SS NOV85 03450000
         DS    0F                                    MATCHES   SS MAR85 03450120
***                                                  ========= SS MAR85 03450220
ISPPARF6 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 03460000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 03470000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 03480000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 03490020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 03500020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 03510020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 03520020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 03530020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 03540020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 03550020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 03560000
         DC    X'21',X'00',X'40',X'00',CL8'DSNAME'   DS        SS OCT88 03570000
         DC    X'31',X'00',X'20',X'00',CL8'VOLUME'   V/VO      SS OCT88 03580000
         DC    X'21',X'00',X'10',X'00',CL8'DSORG'    DS        SS OCT88 03590000
         DC    X'21',X'00',X'08',X'00',CL8'RECFM'    RE        SS OCT88 03600000
         DC    X'34',X'00',X'04',X'00',CL8'CDATE'    C/CDATE   SS OCT88 03610000
         DC    X'34',X'00',X'04',X'00',CL8'CREATED'  C/CREAT   SS OCT88 03620000
         DC    X'34',X'00',X'02',X'00',CL8'RDATE'    R/RDATE   SS OCT88 03630000
         DC    X'34',X'00',X'02',X'00',CL8'REFER'    R/REFER   SS OCT88 03640000
         DC    X'FF'                                           SS OCT88 03650000
         DS    0H                                              SS NOV85 03651000
ISPFDCK6 DC    X'0000',AL2(SPFCCAT-SPWRKC),AL2(SPFCFREE+6-SPFCCAT)      03660000
         DC    X'0010',AL2(SPFCCAT-SPWRKC),AL2(SPFCFREE+6-SPFCCAT)      03670000
         DC    X'4000',AL2(SPFCDSN-SPWRKC),H'43'               SS OCT88 03680000
         DC    X'2000',AL2(SPFCVOL-SPWRKC),H'05'               SS OCT88 03690000
         DC    X'1000',AL2(SPFCDSOR-SPWRKC),H'02'             DRK NOV08 03700043
         DC    X'0800',AL2(SPFCRF-SPWRKC),H'04'                SS OCT88 03710000
         DC    X'0400',AL2(SPFCCDAT-SPWRKC),H'09'             DRK SEP11 03720051
         DC    X'0200',AL2(SPFCRDAT-SPWRKC),H'09'             DRK SEP11 03730051
         DC    X'FFFF'              END OF TABLE               SS NOV85 03740000
         DS    0F                                    MATCHES   SS MAR85 03741120
***                                                  ========= SS MAR85 03742020
ISPPARF7 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 03750000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 03760000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 03770000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 03780020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 03790020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 03800020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 03810020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 03820020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 03830020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 03840020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 03850000
         DC    X'22',X'00',X'40',X'00',CL8'COMMAND'  COM      ABL APR86 03860000
         DC    X'FF'                                           SS OCT88 03870000
         DS    0H                                              SS NOV85 03871000
ISPFDCK7 DC    X'0000',AL2(SPFTCMDD-SPWRKC),H'249'             SS MAY90 03880000
         DC    X'0010',AL2(SPFTCMDD-SPWRKC),H'249'             SS MAY90 03890000
         DC    X'4000',AL2(SPFTCMDD-SPWRKC),H'249'             SS MAY90 03900000
         DC    X'FFFF'              END OF TABLE               SS NOV85 03910000
         DS    0F                                    MATCHES   SS MAR85 03910120
***                                                  ========= SS MAR85 03910220
ISPPARF8 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 03920000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 03930000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 03940000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 03950020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 03960020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 03970020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 03980020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 03990020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 04000020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 04010020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 04020000
         DC    X'31',X'00',X'20',X'00',CL8'DSNAME'   D/DS      SS OCT88 04030000
         DC    X'31',X'00',X'10',X'00',CL8'VOLUME'   V/VO      SS OCT88 04040000
         DC    X'FF'                                           SS OCT88 04050000
         DS    0H                                              SS NOV85 04051000
ISPFDCK8 DC    X'0000',AL2(SPFXDATA-SPWRKC),AL2(SPFXDSN+43-SPFXDATA)    04060000
         DC    X'0010',AL2(SPFXDATA-SPWRKC),AL2(SPFXDSN+43-SPFXDATA)    04070000
         DC    X'2000',AL2(SPFXDSN-SPWRKC),H'43'               SS OCT88 04080000
         DC    X'1000',AL2(SPFXVOL-SPWRKC),H'05'               SS OCT88 04090000
         DC    X'FFFF'              END OF TABLE               SS NOV85 04100000
         DS    0F                                    MATCHES   SS MAR85 04101120
***                                                  ========= SS MAR85 04102020
ISPPARF9 DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 04110000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 04120000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 04130000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 04140020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 04150020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 04160020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 04170020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 04180020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 04190020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 04200020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 04210000
         DC    X'22',X'00',X'40',X'00',CL8'PREFIX'   PRE       SS OCT88 04220000
         DC    X'23',X'00',X'20',X'00',CL8'PATTERNS' PATT      SS OCT88 04230000
         DC    X'23',X'00',X'10',X'00',CL8'PAT1'     PAT1      SS OCT88 04240000
         DC    X'23',X'00',X'08',X'00',CL8'PAT2'     PAT2      SS OCT88 04250000
         DC    X'23',X'00',X'04',X'00',CL8'PAT3'     PAT3      SS OCT88 04260000
         DC    X'FF'                                           SS OCT88 04270000
         DS    0H                                              SS NOV85 04271000
ISPFDCK9 DC    X'0000',AL2(SPFFPRFX-SPWRKC),AL2(SPFFPAT3+8-SPFFPRFX)    04280000
         DC    X'0010',AL2(SPFFPRFX-SPWRKC),AL2(SPFFPAT3+8-SPFFPRFX)    04290000
         DC    X'4000',AL2(SPFFPRFX-SPWRKC),H'17'              SS OCT88 04300000
         DC    X'2000',AL2(SPFFPAT1-SPWRKC),H'26'              SS OCT88 04310000
         DC    X'1000',AL2(SPFFPAT1-SPWRKC),H'08'              SS OCT88 04320000
         DC    X'0800',AL2(SPFFPAT2-SPWRKC),H'08'              SS OCT88 04330000
         DC    X'0400',AL2(SPFFPAT3-SPWRKC),H'08'              SS OCT88 04340000
         DC    X'FFFF'              END OF TABLE               SS NOV85 04350000
         DS    0F                                    MATCHES   SS MAR85 04351120
***                                                  ========= SS MAR85 04352020
ISPPARFA DC    X'80',X'00',X'00',X'00',CL8' ' STRING           SS MAY85 04360000
         DC    X'51',X'40',X'00',X'00',F'1',F'08' NUMERIC      SS MAY85 04370000
         DC    X'51',X'00',X'80',X'00',F'2',F'08' NUMERIC2     SS NOV85 04380000
         DC    X'31',X'80',X'00',X'00',CL8'ASIS'     A/AS     DRK DEC02 04390020
         DC    X'34',X'20',X'00',X'00',CL8'FIRST'    F/FIRST   SS MAY85 04400020
         DC    X'23',X'10',X'00',X'00',CL8'PREVIOUS' PREV      SS MAY85 04410020
         DC    X'33',X'18',X'00',X'00',CL8'LAST'     L/LAST    SS MAY85 04420020
         DC    X'33',X'04',X'00',X'00',CL8'WORD'     W/WORD    SS MAY85 04430020
         DC    X'23',X'02',X'00',X'00',CL8'PREFIX'   PREF      SS MAY85 04440020
         DC    X'23',X'01',X'00',X'00',CL8'SUFFIX'   SUFF      SS MAY85 04450020
         DC    X'22',X'00',X'00',X'10',CL8'ANY'      ANY      ABL APR86 04460000
         DC    X'21',X'00',X'40',X'00',CL8'ADDRESS'  AD        SS OCT88 04470000
         DC    X'31',X'00',X'20',X'00',CL8'NAME'     N/NA      SS OCT88 04480000
         DC    X'31',X'00',X'10',X'00',CL8'CSECT'    C/CS      SS OCT88 04490000
         DC    X'31',X'00',X'08',X'00',CL8'ENTRY'    E/EN      SS OCT88 04500000
         DC    X'22',X'00',X'04',X'00',CL8'SEGMENT'  SEG       SS OCT88 04510000
         DC    X'31',X'00',X'04',X'00',CL8'MODE'     M/MO      SS OCT88 04520000
         DC    X'FF'                                           SS OCT88 04530000
         DS    0H                                              SS NOV85 04531000
ISPFDCKA DC    X'0000',AL2(SPFSNAME-SPWRKC),AL2(SPFSSEG+4-SPFSNAME)     04540000
         DC    X'0010',AL2(SPFSNAME-SPWRKC),AL2(SPFSSEG+4-SPFSNAME)     04550000
         DC    X'4000',AL2(SPFSHADR-SPWRKC),H'05'              SS OCT88 04560000
         DC    X'2000',AL2(SPFSNAME-SPWRKC),H'07'              SS OCT88 04570000
         DC    X'1000',AL2(SPFSCSEC-SPWRKC),H'07'              SS OCT88 04580000
         DC    X'0800',AL2(SPFSENTR-SPWRKC),H'07'              SS OCT88 04590000
         DC    X'0400',AL2(SPFSSEG-SPWRKC),H'02'               SS OCT88 04600000
         DC    X'FFFF'              END OF TABLE               SS NOV85 04610000
         TITLE 'ISPF - FIND   LEVEL 1 SUBROUTINE'              SS NOV85 04620000
*  FIND STRING IN TABLE                                        SS MAY85 04630000
ISPFND   DS    0H                                              SS NOV85 04640000
         USING ISPFND,R4                                       SS MAY85 04650000
         BAS   R2,ISPQUERY                                     SS NOV85 04660000
         TM    SPFTBPF1,SPFTLOG    THIS LOG                    SS NOV85 04670000
         BZ    ISPFLG02                                        SS NOV85 04680000
         MVC   SPFTTOP,SPFSTART    SAVE START /TOP             SS MAY85 04690000
         MVC   SPFTTOP2,SPFTTOP    SAVE HERE ALSO              SS JUL87 04700000
         MVC   SPFTSIZE,SPFLAST    SAVE BOTTOM/SIZE            SS NOV85 04710000
         MVC   SPFTCRP,SPFCRP      SAVE CURRENT                SS NOV85 04720000
ISPFLG02 DS    0H                                              SS MAY85 04730000
         TM    SPFTFF2,X'08'       REPEAT FIND                 SS NOV85 04740000
         BO    ISPFLG05                                        SS NOV85 04750000
         MVC   SPFTCCRP,SPFTCRP    INIT TO CURRENT             SS NOV85 04760000
         MVC   SPFTFTOP,SPFTTOP    INIT CURRENT PLACE          SS APR86 04770000
         TM    SPFTFF,X'10'        BACKWARD SEARCH             SS MAY85 04780000
         BO    ISPFLG60                                        SS MAY85 04790000
         CLC   SPFTFTOP,ISPL1      AT TOP                      SS MAY85 04800000
         BNE   ISPFLG10                                        SS MAY85 04810000
         OI    SPFTFF2,X'02'       FROM TOP                    SS MAY85 04820000
         B     ISPFLG10                                        SS MAY85 04830000
ISPFLG05 DS    0H                                              SS MAY85 04840000
         MVI   SPFINPUT,C' '       SETUP BLANK LINE            SS MAY85 04850000
         MVC   SPFINPUT+1(157),SPFINPUT RIPPLE                 SS OCT88 04860000
         L     R2,SPFTFDS          STING ADDRESS               SS NOV85 04870000
         CLI   0(R2),0             ANY STRING                  SS NOV85 04880000
         BE    ISPFLGEM            CANNOT DO REPEAT FIND       SS MAY85 04890000
         TM    SPFTFF2,X'01'       HAVE STRING                 SS MAY85 04900000
         BZ    ISPFLGEM            NO, NO REPEAT FIND          SS MAY85 04910000
         TM    SPFTFF,X'10'        BACKWARD SEARCH             SS MAY85 04920000
         BO    ISPFLG50            START HERE                  SS MAY85 04930000
         CLC   SPFTFTOP,SPFTTOP    STILL SAME PLACE            SS MAY85 04940000
         BNE   ISPFLG07                                        SS MAY85 04950000
         TM    SPFTFF,X'20'        FIRST KEY WORD              SS MAY85 04960000
         BO    ISPFLG15            NO, THEN USE CURRENT        SS MAY85 04970000
         TM    SPFTBPF1,SPFTLOG    THIS LOG                    SS OCT88 04980000
         BO    ISPFLG28            YES, THEN RESTART AT HERE   SS OCT88 04990000
         L     R15,SPFTTOP         SET NEW PLACE               SS MAY85 05000000
         LA    R15,1(,R15)                                     SS MAY85 05010000
         C     R15,SPFTSIZE        BOTTOM                      SS MAY85 05020000
         BH    ISPFLGEN            RAN OFF BOTTOM              SS MAY85 05030000
         ST    R15,SPFTTOP                                     SS MAY85 05040000
         ST    R15,SPFTTOP2        SAVE HERE ALSO              SS JUL87 05050000
         B     ISPFLG30                                        SS MAY85 05060000
ISPFLG07 DS    0H                                              SS MAY85 05070000
         MVC   SPFTFTOP,SPFTTOP    INIT CURRENT PLACE          SS APR86 05080000
         NI    SPFTFF,255-X'20'    RESET FIRST                 SS MAY85 05090000
ISPFLG10 DS    0H                  PROCESS FIND                SS MAY85 05100000
         TM    SPFTFF,X'20'        FIRST KEY WORD              SS MAY85 05110000
         BZ    ISPFLG30            NO, THEN USE CURRENT        SS MAY85 05120000
ISPFLG15 DS    0H                  GO TO TOP                   SS MAY85 05130000
         NI    SPFTFF,255-X'20'    RESET FIRST                 SS MAY85 05140000
         OI    SPFTFF2,X'02'       FROM TOP                    SS MAY85 05150000
         BAS   R2,ISPTOP           START AT TOP                SS MAY85 05160000
         LA    R15,1                                           SS MAY85 05170000
         ST    R15,SPFTCRP         NOW AT TOP                  SS MAY85 05180000
         BAS   R2,ISPSKIP                                      SS MAY85 05190000
         LTR   R15,R15                                         SS MAY85 05200000
         BNZ   ISPFLGEN            RAN OFF BOTTOM              SS MAY85 05210000
         B     ISPFLG40                                        SS MAY85 05220000
ISPFLG28 DS    0H                                              SS OCT88 05230000
         L     R15,SPFTTOP         START SEARCH HERE           SS OCT88 05240000
         S     R15,SPFTCRP         RELATIVE POSITION           SS OCT88 05250000
         BAS   R2,ISPSKIP          POSITION SUBR               SS OCT88 05260000
         MVC   SPFTCRP,SPFTTOP     UPDATE                      SS OCT88 05270000
         L     R15,SPFTFRST        RESTART HERE                SS OCT88 05280000
         L     R14,SPFTFRSK        WITH THIS COUNT             SS OCT88 05290000
         B     ISPFLG48            JUMP RIGHT  IN              SS OCT88 05300000
ISPFLG30 DS    0H                                              SS MAY85 05310000
         L     R15,SPFTTOP         START SEARCH HERE           SS MAY85 05320000
         S     R15,SPFTCRP         RELATIVE POSITION           SS MAY85 05330000
         BAS   R2,ISPSKIP          POSITION SUBR               SS MAY85 05340000
         MVC   SPFTCRP,SPFTTOP     UPDATE                      SS NOV85 05350000
ISPFLG40 DS    0H                                              SS MAY85 05360000
         TM    SPFTFF,X'80'        ASIS                        SS MAY85 05370000
         BO    ISPFLG42            DO NOT FORCE UPPER CASE     SS MAY85 05380000
         L     R2,SPFTFST          STRING LOCATION             SS NOV85 05390000
         L     R15,SPFTFST         STARTING FIND LOCATION      SS NOV85 05400000
         LH    R14,SPFTFDL         LENGTH OF STRING            SS NOV85 05410000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS NOV85 05420000
         BO    *+8                 YES, SKIP SEARCH LEN        SS NOV85 05430000
         AH    R14,SPFTFED         LENGTH OF SEARCH            SS NOV85 05440000
         EX    R14,ISPFLG41        EXEC OC                     SS NOV85 05450000
         B     ISPFLG42                                        SS NOV85 05460000
ISPFLG41 OC    0(0,R15),SPFINPUT   FORCE ALL UPPER CASE        SS NOV85 05470000
ISPFLG42 DS    0H                                              SS MAY85 05480000
         L     R15,SPFTFST         STARTING FIND LOCATION      SS NOV85 05490000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS MAY85 05500000
         BO    ISPFLG47            DO COMPARE HERE             SS MAY85 05510000
ISPFLG45 DS    0H                                              SS MAY85 05520000
         LH    R14,SPFTFED         LENGTH OF SEARCH            SS NOV85 05530000
ISPFLG46 DS    0H                                              SS MAY85 05540000
         SR    R1,R1               FOR IC                      SS MAY85 05550000
         L     R2,SPFTFDS          COMPARE STRING ADDRESS      SS NOV85 05560000
         IC    R1,0(R2)            FIRST CHAR                  SS NOV85 05570000
         BAS   R2,ISPCLI           FIND MATCH                  SS MAY85 05580000
         LTR   R15,R15             ANY                         SS MAY85 05590000
         BZ    ISPFLG49                                        SS MAY85 05600000
ISPFLG47 DS    0H                                              SS MAY85 05610000
         LH    R1,SPFTFDL          LENGTH OF COMPARE STRING    SS NOV85 05620000
         L     R2,SPFTFDS          COMPARE STRING ADDRESS      SS NOV85 05630000
         EX    R1,ISPFLGCL                                     SS MAY85 05640000
         BE    ISPFLG80                                        SS MAY85 05650000
ISPFLG48 DS    0H                                              SS MAY85 05660000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS MAY85 05670000
         BO    ISPFLG49            YES TRY NEXT LINE           SS MAY85 05680000
         LA    R15,1(,R15)         CONTINUE NEXT CHAR          SS MAY85 05690000
         BCT   R14,ISPFLG46        IF MORE CHAR                SS MAY85 05700000
ISPFLG49 DS    0H                                              SS MAY85 05710000
         LA    R15,1               SKIP ONE                    SS MAY85 05720000
         BAS   R2,ISPSKIP                                      SS MAY85 05730000
         LTR   R15,R15                                         SS MAY85 05740000
         BNZ   ISPFLGEN            RAN OFF BOTTOM              SS MAY85 05750000
         L     R15,SPFTCRP         KEEP                        SS MAY85 05760000
         LA    R15,1(,R15)              POINTER                SS MAY85 05770000
         ST    R15,SPFTCRP                      UP TO DATE     SS MAY85 05780000
         B     ISPFLG40                                        SS MAY85 05790000
ISPFLGEN DS    0H                                              SS MAY85 05800000
         MVC   SPFMSGID,ISPPDSM    INIT MESSAGE                SS MAY85 05810000
         MVI   SPFMSGID+7,C'F'                                 SS MAY85 05820000
         TM    SPFTFF2,X'02'       WE START AT TOP             SS MAY85 05830000
         BZ    ISPFLGE2                                        SS MAY85 05840000
         MVI   SPFTFF2,0           FORCE NEW FIND              SS MAY85 05850000
         MVI   SPFMSGID+6,C'1'                                 SS MAY85 05860000
         B     ISPFLGE4                                        SS MAY85 05870000
ISPFLGE2 DS    0H                                              SS MAY85 05880000
         MVI   SPFMSGID+6,C'2'                                 SS MAY85 05890000
         OI    SPFTFF,X'20'        FORCE FIRST NEXT TIME       SS MAY85 05900000
ISPFLGE4 DS    0H                                              SS MAY85 05910000
         MVI   SPFVZCMD,C' '       BLANK                       SS MAY85 05920000
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS MAY85 05930000
         LA    R15,8               NO COMMANDS FOUND           SS MAY85 05940000
         BR    R3                                              SS MAY85 05950000
ISPFLGCL CLC   0(0,R15),0(R2)      COMPARE TEXT                SS NOV85 05960000
*SPFLGCL CLC   0(0,R15),SPFFDSAV   COMPARE TEXT                SS MAY85 05970000
ISPFLG50 DS    0H                  REPEAT FIND PREV            SS MAY85 05980000
         CLC   SPFTTOP,SPFTFTOP    STILL SAME PLACE            SS NOV85 05990000
         BNE   ISPFLG57                                        SS MAY85 06000000
         TM    SPFTFF,X'08'        LAST  KEY WORD              SS MAY85 06010000
         BO    ISPFLG65            YES, SET                    SS MAY85 06020000
         TM    SPFTBPF1,SPFTLOG    THIS LOG                    SS OCT88 06030000
         BO    ISPFLG68            YES, THEN RESTART AT HERE   SS OCT88 06040000
         B     ISPFLG69                                        SS MAY85 06050000
ISPFLG57 DS    0H                                              SS MAY85 06060000
         MVC   SPFTFTOP,SPFTTOP    INIT CURRENT PLACE          SS APR86 06070000
         NI    SPFTFF,255-X'08'    RESET LAST                  SS MAY85 06080000
         B     ISPFLG69                                        SS MAY85 06090000
ISPFLG60 DS    0H                  PROCESS FIND PREV/LAST      SS MAY85 06100000
         TM    SPFTFF,X'20'        FIRST KEYWORD               SS MAY85 06110000
         BO    ISPFLGEC            CONFLICT WITH PREV/LAST     SS MAY85 06120000
         TM    SPFTFF,X'08'        LAST  KEY WORD              SS MAY85 06130000
         BZ    ISPFLG69            NO, THEN USE CURRENT        SS MAY85 06140000
ISPFLG65 DS    0H                  GO TO TOP                   SS MAY85 06150000
         NI    SPFTFF,255-X'08'    RESET LAST                  SS MAY85 06160000
         OI    SPFTFF2,X'02'       FROM BOTTOM                 SS MAY85 06170000
         BAS   R2,ISPBOTM          START AT BOTTOM             SS MAY85 06180000
         LTR   R15,R15                                         SS MAY85 06190000
         BNZ   ISPFLGET            RAN OFF BOTTOM              SS MAY85 06200000
         L     R15,SPFTSIZE                                    SS MAY85 06210000
         ST    R15,SPFTCRP         NOW AT BOTTOM               SS MAY85 06220000
         B     ISPFLG70                                        SS MAY85 06230000
ISPFLG68 DS    0H                                              SS OCT88 06240000
         L     R15,SPFTTOP         START SEARCH HERE           SS OCT88 06250000
         S     R15,SPFTCRP         RELATIVE POSITION           SS OCT88 06260000
         BAS   R2,ISPSKIP          POSITION SUBR               SS OCT88 06270000
         MVC   SPFTCRP,SPFTTOP     UPDATE                      SS OCT88 06280000
         L     R15,SPFTFRST        RESTART HERE                SS OCT88 06290000
         L     R14,SPFTFRSK        WITH THIS COUNT             SS OCT88 06300000
         B     ISPFLG78            JUMP RIGHT  IN              SS OCT88 06310000
ISPFLG69 DS    0H                                              SS MAY85 06320000
         L     R15,SPFTTOP         START SEARCH HERE           SS MAY85 06330000
         S     R15,SPFTCRP         RELATIVE POSITION           SS MAY85 06340000
         BAS   R2,ISPSKIP          POSITION SUBR               SS MAY85 06350000
         MVC   SPFTCRP,SPFTTOP     UPDATE                      SS NOV85 06360000
         B     ISPFLG79            BACK UP ONE                 SS MAY85 06370000
ISPFLG70 DS    0H                                              SS MAY85 06380000
         L     R2,SPFTFST          STRING LOCATION             SS NOV85 06390000
         L     R15,SPFTFST         STARTING FIND LOCATION      SS NOV85 06400000
         TM    SPFTFF,X'80'        ASIS                        SS MAY85 06410000
         BO    ISPFLG72            DO NOT FORCE UPPER CASE     SS MAY85 06420000
         LH    R14,SPFTFDL         LENGTH OF STRING            SS NOV85 06430000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS NOV85 06440000
         BO    *+8                 YES, SKIP SEARCH LEN        SS NOV85 06450000
         AH    R14,SPFTFED         LENGTH OF SEARCH            SS NOV85 06460000
         EX    R14,ISPFLG41        EXEC OC                     SS NOV85 06470000
ISPFLG72 DS    0H                                              SS MAY85 06480000
         L     R15,SPFTFST         STARTING FIND LOCATION      SS NOV85 06490000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS MAY85 06500000
         BO    ISPFLG77            DO COMPARE HERE             SS MAY85 06510000
ISPFLG75 DS    0H                                              SS MAY85 06520000
         LH    R14,SPFTFED         LENGTH OF SEARCH            SS NOV85 06530000
         ALR   R15,R14             POSITION TO END OF STRING   SS MAY85 06540000
         BCTR  R15,0               ADJUST START POSITION       SS DEC85 06550000
ISPFLG76 DS    0H                                              SS MAY85 06560000
         SR    R1,R1               FOR IC                      SS MAY85 06570000
         L     R2,SPFTFDS          COMPARE STRING ADDRESS      SS NOV85 06580000
         IC    R1,0(R2)            FIRST CHAR                  SS NOV85 06590000
         BAS   R2,ISPCLIB          FIND MATCH                  SS MAY85 06600000
         LTR   R15,R15             ANY                         SS MAY85 06610000
         BZ    ISPFLG79                                        SS MAY85 06620000
ISPFLG77 DS    0H                                              SS MAY85 06630000
         LH    R1,SPFTFDL          LENGTH OF COMPARE STRING    SS NOV85 06640000
         L     R2,SPFTFDS          COMPARE STRING ADDRESS      SS NOV85 06650000
         EX    R1,ISPFLGCL                                     SS MAY85 06660000
         BE    ISPFLG80                                        SS MAY85 06670000
ISPFLG78 DS    0H                                              SS MAY85 06680000
         TM    SPFTFF,X'40'        POSITION NUMBER             SS MAY85 06690000
         BO    ISPFLG79            YES TRY NEXT LINE           SS MAY85 06700000
         BCTR  R15,0               CONTINUE NEXT CHAR          SS MAY85 06710000
         BCT   R14,ISPFLG76        IF MORE CHAR                SS MAY85 06720000
ISPFLG79 DS    0H                                              SS MAY85 06730000
         LA    R15,1               SKIP                        SS MAY85 06740000
         LNR   R15,R15                  -1                     SS MAY85 06750000
         BAS   R2,ISPSKIP                                      SS MAY85 06760000
         LTR   R15,R15                                         SS MAY85 06770000
         BNZ   ISPFLGET            RAN OFF TOP                 SS MAY85 06780000
         L     R15,SPFTCRP         KEEP                        SS NOV85 06790000
         BCTR  R15,0                    POINTER                SS MAY85 06800000
         ST    R15,SPFTCRP                      UP TO DATE     SS NOV85 06810000
         B     ISPFLG70                                        SS MAY85 06820000
ISPFLGET DS    0H                                              SS MAY85 06830000
         MVC   SPFMSGID,ISPPDSM    INIT MESSAGE                SS MAY85 06840000
         MVI   SPFMSGID+7,C'F'                                 SS MAY85 06850000
         TM    SPFTFF2,X'02'       WE START AT BOTTOM          SS MAY85 06860000
         BZ    ISPFLGE6                                        SS MAY85 06870000
         NI    SPFTFF2,255-X'03'   FORCE NEW FIND              SS MAY85 06880000
         MVI   SPFMSGID+6,C'1'                                 SS MAY85 06890000
         B     ISPFLGE8                                        SS MAY85 06900000
ISPFLGE6 DS    0H                                              SS MAY85 06910000
         MVI   SPFMSGID+6,C'3'                                 SS MAY85 06920000
         OI    SPFTFF,X'08'        FORCE LAST NEXT TIME        SS MAY85 06930000
ISPFLGE8 DS    0H                                              SS MAY85 06940000
*        BAS   R2,ISPBOTM          RESET RECORD POINTER        SS NOV85 06950000
         MVC   SPFTTOP,SPFTFTOP    RESET START                 SS NOV85 06960000
         MVI   SPFVZCMD,C' '       BLANK                       SS MAY85 06970000
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS MAY85 06980000
         LA    R15,8               NO COMMANDS FOUND           SS MAY85 06990000
         BR    R3                                              SS MAY85 07000000
ISPFLGEM DS    0H                                              SS MAY85 07010000
         MVC   SPFMSGID,ISPPDSM    INIT MESSAGE                SS MAY85 07020000
         MVI   SPFMSGID+7,C'A'                                 SS MAY85 07030000
         MVI   SPFMSGID+6,C'2'                                 SS MAY85 07040000
         LA    R15,8                                           SS MAY85 07050000
         BR    R3                                              SS MAY85 07060000
ISPFLGEC DS    0H                                              SS MAY85 07070000
         MVC   SPFMSGID,ISPPDSM    INIT MESSAGE                SS MAY85 07080000
         MVI   SPFMSGID+7,C'A'                                 SS MAY85 07090000
         MVI   SPFMSGID+6,C'7'                                 SS MAY85 07100000
         LA    R15,8                                           SS MAY85 07110000
         BR    R3                                              SS MAY85 07120000
ISPFLG80 DS    0H                                              SS MAY85 07130000
         TM    SPFTFF,X'07'   4+2+1 WORD, PREFIX, SUFFIX       SS MAY85 07140000
         BZ    ISPFLG89             NONE, THIS IS A MATCH      SS MAY85 07150000
         LR    R2,R15               BACK                       SS MAY85 07160000
         BCTR  R2,0                      UP ONE                SS MAY85 07170000
         CLI   0(R2),C'$'           NATIONAL CHAR              SS MAY85 07180000
         BE    ISPFLG82             YES                        SS MAY85 07190000
         CLI   0(R2),C'@'           NATIONAL CHAR              SS MAY85 07200000
         BE    ISPFLG82             YES                        SS MAY85 07210000
         CLI   0(R2),C'#'           NATIONAL CHAR              SS MAY85 07220000
         BE    ISPFLG82             YES                        SS MAY85 07230000
         CLI   0(R2),X'81'          LOWER CASE A               SS MAY85 07240000
         BNL   ISPFLG82             NORMAL CHAR                SS MAY85 07250000
*  MUST BE SPECIAL CHAR                                        SS MAY85 07260000
         TM    SPFTFF,X'06'         WORD OR PREFIX             SS MAY85 07270000
         BZ    ISPFLG88             SUFFIX,  NO MATCH          SS MAY85 07280000
         B     ISPFLG84             NEXT TEST                  SS MAY85 07290000
ISPFLG82 DS    0H                                              SS MAY85 07300000
         TM    SPFTFF,X'06'         WORD OR PREFIX             SS MAY85 07310000
         BNZ   ISPFLG88             NO MATCH                   SS MAY85 07320000
ISPFLG84 DS    0H                   NO MATCH                   SS MAY85 07330000
         LA    R2,1(,R15)           SKIP                       SS MAY85 07340000
         AH    R2,SPFTFDL                OVER STRING           SS MAY85 07350000
         CLI   0(R2),C'$'           NATIONAL CHAR              SS MAY85 07360000
         BE    ISPFLG85             YES                        SS MAY85 07370000
         CLI   0(R2),C'@'           NATIONAL CHAR              SS MAY85 07380000
         BE    ISPFLG85             YES                        SS MAY85 07390000
         CLI   0(R2),C'#'           NATIONAL CHAR              SS MAY85 07400000
         BE    ISPFLG85             YES                        SS MAY85 07410000
         CLI   0(R2),X'81'          LOWER CASE A               SS MAY85 07420000
         BNL   ISPFLG85             NORMAL CHAR                SS MAY85 07430000
*  MUST BE SPECIAL CHAR                                        SS MAY85 07440000
         TM    SPFTFF,X'05'         WORD OR SUFFIX             SS MAY85 07450000
         BZ    ISPFLG88             PREFIX,  NO MATCH          SS MAY85 07460000
         B     ISPFLG89             GOOD MATCH                 SS MAY85 07470000
ISPFLG85 DS    0H                                              SS MAY85 07480000
         TM    SPFTFF,X'05'         WORD OR SUFFIX             SS MAY85 07490000
         BZ    ISPFLG89             PREFIX, GOOD MATCH         SS MAY85 07500000
ISPFLG88 DS    0H                   NO MATCH                   SS MAY85 07510000
         TM    SPFTFF,X'10'         BACKWARD SEARCH            SS MAY85 07520000
         BO    ISPFLG78             CONTINUE HERE              SS MAY85 07530000
         B     ISPFLG48             ELSE CONTINUE HERE         SS MAY85 07540000
ISPFLG89 DS    0H                                              SS MAY85 07550000
         NI    SPFTFF2,255-X'02'   NO LONGER AT TOP/BOTTOM     SS MAY85 07560000
         ST    R15,SPFTFRST        FIND RESTART ADDR IF NEEDED SS OCT88 07570000
         ST    R14,SPFTFRSK        WITH THIS COUNT             SS OCT88 07580000
ISPFLG90 DS    0H                                              SS MAY85 07590000
         MVC   SPFTFTOP,SPFTCRP    SAVE FOUND LOCATION         SS NOV85 07600000
         MVC   SPFTTOP,SPFTCRP     DISPLAY FROM NEW LOCATION   SS NOV85 07610000
         TM    SPFTBPF1,SPFTLOG    THIS LOG                    SS NOV85 07620000
         BZ    ISPFLG99            NO, SKIP CURSOR POSITIONING SS OCT88 07630000
         MVC   SPFSTART,SPFTCRP    UPDATE START                SS NOV85 07640000
         MVC   SPFCRP,SPFTCRP      UPDATE                      SS NOV85 07650000
         MVC   SPFTCCRP,SPFTCRP    SET FOR CURSOR POSITIONING  SS NOV88 07660000
         LA    R14,SPFLIN2         IS IT                       SS OCT88 07670000
         CR    R15,R14                  IN SECOND PART         SS OCT88 07680000
         BNL   ISPFLG95            YES  *                      SS OCT88 07690000
         TM    SPFTBPF3,SPFTBTYL+SPFTBTYD  CAN WE USE THIS PAN SS OCT88 07700000
         BNZ   ISPFLG91                 YES                    SS OCT88 07710000
         LH    R1,SPFTBPIP              NO, SWAP PANELS LEFT   SS OCT88 07720000
         LNR   R1,R1                    FOR SWAP CODE          SS OCT88 07730000
         BAS   R2,ISPSTKI               DO IT                  SS OCT88 07740000
         BAS   R2,ISPSETST              UPDATE STATUS          SS OCT88 07750000
         L     R15,SPFTFRST             GET RESTART ADDRESS    SS OCT88 07760000
ISPFLG91 DS    0H                       *                      SS OCT88 07770000
         LA    R14,SPFLIN1-1       1-79                        SS OCT88 07780031
         SR    R15,R14             CALC POSITION               SS OCT88 07790000
         ST    R15,SPFCUOFF             AND SET                SS OCT88 07800000
         OI    SPFTFLG1,SPFTYOFF        *                      SS OCT88 07810000
         CLI   SPFPANEL+6,C'W'     WIDE PANEL?                DRK JUL04 07810131
         BE    *+4+6+4             YES                        DRK JUL04 07810231
         MVC   SPFCURSR,VPDSLN1    NO, NAME FOR CURSOR         SS OCT88 07810331
         B     ISPFLG99                                       DRK JUL04 07810431
         MVC   SPFCURSR,VPDSLN1W   NAME FOR CURSOR (WIDE)     DRK JUL04 07811031
         B     ISPFLG99            DONE                        SS OCT88 07830000
ISPFLG95 DS    0H                       *                      SS OCT88 07840000
         TM    SPFTBPF3,SPFTBTYR+SPFTBTYD  CAN WE USE THIS PAN SS OCT88 07850000
         BNZ   ISPFLG96                 YES                    SS OCT88 07860000
         LH    R1,SPFTBPIP              NO, SWAP PANELS LEFT   SS OCT88 07870000
         LNR   R1,R1                    FOR SWAP CODE          SS OCT88 07880000
         BAS   R2,ISPSTKI               DO IT                  SS OCT88 07890000
         BAS   R2,ISPSETST              UPDATE STATUS          SS OCT88 07900000
         L     R15,SPFTFRST             GET RESTART ADDRESS    SS OCT88 07910000
ISPFLG96 DS    0H                       *                      SS OCT88 07920000
         LA    R14,SPFLIN2-1       80-158                      SS OCT88 07930028
         SR    R15,R14             CALC OFFSET                 SS OCT88 07940026
         CLI   SPFPANEL+6,C'W'     WIDE PANEL?                DRK JUL04 07940130
         BNE   *+4+4               NO                         DRK JUL04 07940229
         LA    R15,79(R15)         YES, ADJUST OFFSET         DRK JUL04 07941029
         ST    R15,SPFCUOFF        SET OFFSET                  SS OCT88 07950028
         OI    SPFTFLG1,SPFTYOFF        *                      SS OCT88 07960000
         CLI   SPFPANEL+6,C'W'     WIDE PANEL?                DRK JUL04 07960130
         BE    *+4+6+4             YES                        DRK JUL04 07962029
         MVC   SPFCURSR,VPDSLN2    NO, NAME FOR CURSOR         SS OCT88 07970029
         B     ISPFLG99                                       DRK JUL04 07970128
         MVC   SPFCURSR,VPDSLN1W   NAME FOR CURSOR (WIDE)     DRK JUL04 07971028
ISPFLG99 DS    0H                                              SS OCT88 07980000
         SR    R15,R15             GOOD COMMAND                SS MAY85 07990000
         BR    R3                                              SS MAY85 08000000
         DROP  R4                                             DRK NOV98 08001010
         SPACE 2                                              ABL JUN85 08010000
         TITLE 'ISPF - SORT  FUNCTION'                         SS NOV85 08020000
* SORT SUPPORT                                                 SS MAY85 08030000
ISPSORT  DS    0H          ****    SORT  SUBCOMMAND  ****      SS MAY85 08040000
         USING *,R4                                            SS NOV85 08050000
         LTR   R0,R0               FUNCTION ENTRY              SS OCT88 08060000
         BNZ   ISPSORTN            NEW SORT                    SS OCT88 08070000
         TM    SPFTFLG3,SPFTSORT   SORTED TABLE                SS AUG86 08080000
         BZ    ISPSORIV            NO, INVALID MSG             SS AUG86 08090000
         L     R15,SPFOPER           FIRST BLANK AFTER CMD     SS MAY85 08100000
         LA    R14,46                TRY FOR 46 BYTES          SS MAY85 08110000
         LH    R1,SPFTBPFD         SORT INDEX CODE             SS NOV85 08120000
         L     R1,ISPSRPR(R1)      GET PARSE TABLE             SS NOV85 08130000
         LTR   R1,R1               SORT VALID FOR THIS TABLE   SS AUG86 08140000
         BZ    ISPSORIV            NO   *                      SS AUG86 08150000
         BAS   R2,ISPPARSI           PARSE ROUTINE             SS NOV85 08160000
         C     R15,ISPL8             RETURN CODE               SS MAY85 08170000
         BH    ISPSORX3            ERROR                       SS DEC87 08180000
* SPFTFST IS SET TO START OF FIELD FOR SEARCH                  SS NOV85 08190000
* SPFTFED IS SET TO LENGTH OF FIELD                            SS NOV85 08200000
         LH    R1,SPFTBPFD         SORT INDEX CODE             SS NOV85 08210000
         L     R1,ISPSRCK(R1)      GET CHECK TABLE             SS NOV85 08220000
         LTR   R1,R1               GOOD ADDR                   SS AUG86 08230000
         BZ    ISPSORIV            NO, INVALID MSG             SS AUG86 08240000
ISPSORTL CLI   0(R1),X'FF'         END OF TABLE                SS NOV85 08250000
         BE    ISPSORX2            MUST BE KEY CONFLICT        SS NOV85 08260000
         CLC   0(2,R1),SPFPRBI2    COMPARE BYTES 2 AND 3       SS NOV85 08270000
         BE    ISPSORTF            GOT A MATCH                 SS NOV85 08280000
         LA    R1,06(,R1)          NEXT ENTRY                  SS NOV85 08290000
         B     ISPSORTL            LOOP                        SS NOV85 08300000
ISPSORTF DS    0H                  GOOD ONE                    SS NOV85 08310000
         LH    R14,2(R1)           GET LIST  OFFSET            SS NOV85 08320000
         LA    R14,ISPSORT(R14)    CALC ADDRESS OF LIST        SS NOV85 08330000
         ST    R14,SPFTSORA        SAVE ADDRESS OF SORT LIST   SS AUG86 08340000
         NI    SPFTFLG3,255-SPFTSDEF  ASSUME NOT DEFAULT       SS AUG86 08350000
         CLI   5(R1),0             DEFAULT SORT                SS OCT88 08360000
         BE    *+8                 NO, DO SORT NOW             SS OCT88 08370000
         OI    SPFTFLG3,SPFTSDEF   YES, FLAG AS DEFAULT        SS AUG86 08380000
         BAS   R2,ISPTSORT         DO SORT                     SS AUG86 08390000
         B     ISPSREX2            DONE                        SS AUG86 08400000
ISPSORX2 DS    0H                                              SS NOV85 08410000
         MVC   SPFMSGID,ISPPDSM SETUP MESSAGE                  SS NOV85 08420000
         MVI   SPFMSGID+7,C'A'                                 SS NOV85 08430000
         MVI   SPFMSGID+6,C'7'     CONFLICT ERROR              SS NOV85 08440000
ISPSORX3 DS    0H                  RETURN WITH ERROR           SS DEC87 08450000
         LH    R15,SPFTBPFD        FIND INDEX                  SS OCT88 08460000
         SLL   R15,1               TIMES 1 FOR OFFSET          SS OCT88 08470000
         LA    R0,ISPSORXX(R15)         *                      SS OCT88 08480000
         LA    R15,168                  *                      SS DEC87 08490000
         B     ISPROUT                  *                      SS DEC87 08500000
ISPSREX2 DS    0H                                              SS NOV85 08510000
         LA    R15,100              ROUTE TO TBDISPLAY         SS NOV85 08520000
         B     ISPROUT              RETURN TO ROUTER           SS NOV85 08530000
ISPSORIV DS    0H                                              SS NOV85 08540000
         LA    R15,28               ROUTE TO ISPINVAL          SS NOV85 08550000
         B     ISPROUT              RETURN TO ROUTER           SS NOV85 08560000
* SET SORT DEFAULT FOR NEW SORT         *                      SS OCT88 08570000
ISPSORTN DS    0H                  NEW SORT                    SS OCT88 08580000
         XC    SPFPRBI2(2),SPFPRBI2 ZERO FOR DEFAULT           SS OCT88 08590000
         LR    R1,R0               GET INDEX                   SS OCT88 08600000
         LA    R1,SPFSRTDF(R1)     GET ADDRESS IF ENTRY        SS OCT88 08610000
         CLI   0(R1),C'*'          IS IT SET                   SS OCT88 08620000
         BNE   *+10                     *                      SS OCT88 08630000
         MVC   SPFPRBI2(2),1(R1)   COPY IT                     SS OCT88 08640000
* SPFTFST IS SET TO START OF FIELD FOR SEARCH                  SS OCT88 08650000
* SPFTFED IS SET TO LENGTH OF FIELD                            SS OCT88 08660000
         LH    R1,SPFTBPFD         SORT INDEX CODE             SS OCT88 08670000
         L     R1,ISPSRCK(R1)      GET CHECK TABLE             SS OCT88 08680000
         LTR   R1,R1               GOOD ADDR                   SS OCT88 08690000
         BZ    ISPSORT8            NO, INVALID MSG             SS OCT88 08700000
ISPSORT3 CLI   0(R1),X'FF'         END OF TABLE                SS OCT88 08710000
         BE    ISPSORT8            MUST BE KEY CONFLICT        SS OCT88 08720000
         CLC   0(2,R1),SPFPRBI2    COMPARE BYTES 2 AND 3       SS OCT88 08730000
         BE    ISPSORT4            GOT A MATCH                 SS OCT88 08740000
         LA    R1,06(,R1)          NEXT ENTRY                  SS OCT88 08750000
         B     ISPSORT3            LOOP                        SS OCT88 08760000
ISPSORT4 DS    0H                  GOOD ONE                    SS OCT88 08770000
         LH    R14,2(R1)           GET LIST  OFFSET            SS OCT88 08780000
         LA    R14,ISPSORT(R14)    CALC ADDRESS OF LIST        SS OCT88 08790000
         ST    R14,SPFTSORA        SAVE ADDRESS OF SORT LIST   SS OCT88 08800000
         NI    SPFTFLG3,255-SPFTSDEF  ASSUME NOT DEFAULT       SS OCT88 08810000
         CLI   5(R1),0             DEFAULT SORT                SS OCT88 08820000
         BE    *+8                 NO, DO SORT NOW             SS OCT88 08830000
         OI    SPFTFLG3,SPFTSDEF   YES, FLAG AS DEFAULT        SS OCT88 08840000
         BAS   R2,ISPTSORT         DO SORT                     SS OCT88 08850000
         OI    SPFTFLG3,SPFTSORT   NOW A SORTED TABLE          SS OCT88 08860000
ISPSORT0 DS    0H                       *                      SS OCT88 08870000
         SR    R15,R15                  *                      SS OCT88 08880000
         BR    R3                       *                      SS OCT88 08890000
ISPSORT8 DS    0H                       *                      SS OCT88 08900000
         LA    R15,8                    *                      SS OCT88 08910000
         BR    R3                       *                      SS OCT88 08920000
         DROP  R4                                              SS NOV85 08930000
         SPACE 2                                                        08940000
ISPSORTV DC    A(VPDFSRT) LIST OF DEFAULT VARIABLES            SS OCT88 08950032
ISPSRPR  DS    0F                                              SS NOV85 08960000
         DC    A(0)            0   PARSE LIST ADDRESS          SS NOV85 08970000
         DC    A(ISPPARS2)     4   MEMLIST SOURCE              SS NOV85 08980000
         DC    A(ISPPARS3)     8   MEMLIST LOAD MOD            SS NOV85 08990000
         DC    A(0)           12   LISTA                       SS NOV85 09000000
         DC    A(ISPPARS5)    16   LISTV                       SS NOV85 09010000
         DC    A(ISPPARS6)    20   LISTC/LISTF                 SS NOV85 09020000
         DC    A(0)           24   TCT                         SS NOV85 09030000
         DC    A(ISPPARS7)    28   CAX                         SS NOV85 09040000
         DC    A(0)           32   FILTER                      SS NOV85 09050000
         DC    A(ISPPARS8)    38   CSECTS                      SS NOV85 09060000
ISPSRCK  DS    0F                                              SS NOV85 09070000
         DC    A(0)                TABLE ADDRESSES             SS NOV85 09080000
         DC    A(ISPSRCK2)                                     SS NOV85 09090000
         DC    A(ISPSRCK3)                                     SS NOV85 09100000
         DC    A(0)                                            SS NOV85 09110000
         DC    A(ISPSRCK5)                                     SS NOV85 09120000
         DC    A(ISPSRCK6)    20   LISTC/LISTF                 SS NOV85 09130000
         DC    A(0)           24   TCT                         SS NOV85 09140000
         DC    A(ISPSRCK7)    28   CAX                         SS NOV85 09150000
         DC    A(0)           32   FILTER                      SS NOV85 09160000
         DC    A(ISPSRCK8)    38   CSECTS                      SS NOV85 09170000
ISPSORXX DS    0H                PROMPT PANEL                  SS OCT88 09180000
         DC    CL8' '          0                               SS OCT88 09190000
         DC    CL8'&P.MNSOM'   4   MEMLIST SOURCE PROMPT       SS OCT88 09200000
         DC    CL8'&P.MNSOU'   8   MEMLIST LOAD MOD            SS OCT88 09210000
         DC    CL8' '         12                               SS OCT88 09220000
         DC    CL8'&P.LVSOV'  16   LISTV                       SS OCT88 09230000
         DC    CL8'&P.LCSOC'  20   LISTC/LISTF                 SS OCT88 09240000
         DC    CL8' '         24                               SS OCT88 09250000
         DC    CL8'&P.CXSOX'  28   CAX                         SS OCT88 09260000
         DC    CL8' '         32                               SS OCT88 09270000
         DC    CL8'&P.CSSOS'  36   CSECT                       SS OCT88 09280000
* TABLE OF LOCATE INFORMATION AS RELATE TO SORT OPTIONS        SS OCT88 09290000
ISPSORTZ DC    XL8'00'          NULL ENTRY                  0  SS OCT88 09300000
         DC    AL2(MEMLNAME-SPWRKC),AL1(7),AL1(0)           1  SS OCT88 09310000
         DC    AL2(SPFVVOL-SPWRKC),AL1(5),AL1(0)            2  SS OCT88 09320000
* PARSE PARM LIST FOR SORT                                     SS MAR85 09330000
         DS    0F                                    MATCHES   SS MAR85 09340000
***   MEMLIST SOURCE                                 ========= SS MAR85 09350004
ISPPARS2 DC    X'31',X'00',X'80',X'00',CL8'ASCEND'   A/AS     DRK NOV02 09360019
*SPPARS2 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS AUG86 09361017
         DC    X'31',X'00',X'00',X'01',CL8'DESCEND'  D/DE     DRK NOV02 09370019
*        DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS AUG86 09371017
         DC    X'31',X'00',X'40',X'00',CL8'ID'       I/ID     ABL JAN87 09380000
         DC    X'34',X'00',X'20',X'00',CL8'CDATE'    C/CDATE   SS NOV85 09390000
         DC    X'34',X'00',X'20',X'00',CL8'CREATED'  C/CREAT  ABL APR86 09400000
         DC    X'34',X'00',X'10',X'00',CL8'MDATE'    M/MDATE   SS NOV85 09410000
         DC    X'32',X'00',X'10',X'00',CL8'MODIFIED' M/MOD    ABL APR86 09420000
         DC    X'22',X'00',X'10',X'00',CL8'CHANGED'  CHA      DRK MAR02 09421016
         DC    X'32',X'00',X'10',X'00',CL8'LAST'     L/LAS     SS MAY88 09430000
         DC    X'32',X'00',X'08',X'00',CL8'SIZE'     S/SIZ    ABL JAN87 09440000
         DC    X'32',X'00',X'04',X'00',CL8'VERMOD'   V/VER    ABL JAN87 09450000
*REDUND. DC    X'32',X'00',X'04',X'00',CL8'VERSION'  V/VER    ABL JAN87 09460000
         DC    X'32',X'00',X'02',X'00',CL8'TTR'      T/TTR    ABL JAN87 09470000
         DC    X'22',X'00',X'00',X'00',CL8'MEMBER'  REDUNDANT  SS NOV85 09480000
         DC    X'33',X'00',X'00',X'00',CL8'NAME'               SS MAY88 09490000
         DC    X'FF'                                           SS MAY85 09500000
         DS    0H                                              SS NOV85 09510000
ISPSRCK2 DC    X'0000',AL2(ISPSRL01-ISPSORT),H'1'  MEM         SS AUG86 09520000
         DC    X'8000',AL2(ISPSRL01-ISPSORT),H'1'  MEM         SS AUG86 09530000
         DC    X'0001',AL2(ISPSRL02-ISPSORT),H'0'  MEM DES     SS AUG86 09540000
         DC    X'8200',AL2(ISPSRL03-ISPSORT),H'0'  TTR         SS AUG86 09550000
         DC    X'0200',AL2(ISPSRL03-ISPSORT),H'0'  TTR         SS AUG86 09560000
         DC    X'0201',AL2(ISPSRL04-ISPSORT),H'0'  TTR DES     SS AUG86 09570000
         DC    X'C000',AL2(ISPSRL05-ISPSORT),H'0'  ID          SS AUG86 09580000
         DC    X'4000',AL2(ISPSRL05-ISPSORT),H'0'  ID          SS AUG86 09590000
         DC    X'4001',AL2(ISPSRL06-ISPSORT),H'0'  ID  DES     SS AUG86 09600000
         DC    X'D000',AL2(ISPSRL07-ISPSORT),H'0'  ID MDATE A  SS DEC87 09610000
         DC    X'5000',AL2(ISPSRL08-ISPSORT),H'0'  ID MDATE    SS DEC87 09620000
         DC    X'5001',AL2(ISPSRL08-ISPSORT),H'0'  ID MDATE D  SS AUG86 09630000
         DC    X'9000',AL2(ISPSRL09-ISPSORT),H'0'  MDATE AS    SS DEC87 09640000
         DC    X'1000',AL2(ISPSRL10-ISPSORT),H'0'  MDATE       SS DEC87 09650000
         DC    X'1001',AL2(ISPSRL10-ISPSORT),H'0'  MDATE DES   SS AUG86 09660000
         DC    X'C800',AL2(ISPSRL11-ISPSORT),H'0'  ID SIZE A   SS DEC87 09670000
         DC    X'4800',AL2(ISPSRL12-ISPSORT),H'0'  ID SIZE     SS DEC87 09680000
         DC    X'4801',AL2(ISPSRL12-ISPSORT),H'0'  ID SIZE D   SS AUG86 09690000
         DC    X'E000',AL2(ISPSRL15-ISPSORT),H'0'  ID CDATE A  SS DEC87 09700000
         DC    X'6000',AL2(ISPSRL16-ISPSORT),H'0'  ID CDATE    SS DEC87 09710000
         DC    X'6001',AL2(ISPSRL16-ISPSORT),H'0'  ID CDATE D  SS AUG86 09720000
         DC    X'C400',AL2(ISPSRL19-ISPSORT),H'0'  ID VRMD A   SS DEC87 09730000
         DC    X'4400',AL2(ISPSRL20-ISPSORT),H'0'  ID VERMOD   SS DEC87 09740000
         DC    X'4401',AL2(ISPSRL20-ISPSORT),H'0'  ID VRMD D   SS AUG86 09750000
         DC    X'8400',AL2(ISPSRL21-ISPSORT),H'0'  VERMOD AS   SS DEC87 09760000
         DC    X'0400',AL2(ISPSRL22-ISPSORT),H'0'  VERMOD      SS DEC87 09770000
         DC    X'0401',AL2(ISPSRL22-ISPSORT),H'0'  VERMOD DES  SS AUG86 09780000
         DC    X'8800',AL2(ISPSRL23-ISPSORT),H'0'  SIZE AS     SS DEC87 09790000
         DC    X'0800',AL2(ISPSRL24-ISPSORT),H'0'  SIZE        SS DEC87 09800000
         DC    X'0801',AL2(ISPSRL24-ISPSORT),H'0'  SIZE DES    SS AUG86 09810000
         DC    X'A000',AL2(ISPSRL25-ISPSORT),H'0'  CDATE AS    SS DEC87 09820000
         DC    X'2000',AL2(ISPSRL26-ISPSORT),H'0'  CDATE       SS DEC87 09830000
         DC    X'2001',AL2(ISPSRL26-ISPSORT),H'0'  CDATE DES   SS AUG86 09840000
         DC    X'FFFF'              END OF TABLE               SS NOV85 09850000
ISPSORTM DS    0C                       *                      SS AUG86 09860000
ISPSRL01 DC    C'(MEMLNAME,C,A)'                               SS AUG86 09870000
ISPSRL02 DC    C'(MEMLNAME,C,D)'                               SS AUG86 09880000
ISPSORTT DS    0C                       *                      SS AUG86 09890000
ISPSRL03 DC    C'(MEMLXTTR,C,A,MEMLALIS,C,A,MEMLNAME,C,A)'     SS AUG86 09900000
ISPSRL04 DC    C'(MEMLXTTR,C,D,MEMLALIS,C,A,MEMLNAME,C,A)'     SS AUG86 09910000
ISPSRL05 DC    C'(MEMLMID,C,A,MEMLNAME,C,A)'                   SS AUG86 09920000
ISPSRL06 DC    C'(MEMLMID,C,D,MEMLNAME,C,A)'                   SS AUG86 09930000
ISPSRL07 DC    C'(MEMLMID,C,A,MEMLMCEN,C,A,MEMLMDAT,C,A,'     Y2K AUG97 09940001
         DC    C'MEMLMTIM,C,A,MEMLNAME,C,A)'                  Y2K AUG97 09941001
ISPSRL08 DC    C'(MEMLMID,C,A,MEMLMCEN,C,D,MEMLMDAT,C,D,'     Y2K AUG97 09950001
         DC    C'MEMLMTIM,C,D,MEMLNAME,C,A)'                  Y2K AUG97 09951001
ISPSRL09 DC    C'(MEMLMCEN,C,A,MEMLMDAT,C,A,'                 Y2K AUG97 09960001
         DC    C'MEMLMTIM,C,A,MEMLNAME,C,A)'                  Y2K AUG97 09961001
ISPSRL10 DC    C'(MEMLMCEN,C,D,MEMLMDAT,C,D,'                 Y2K AUG97 09970001
         DC    C'MEMLMTIM,C,D,MEMLNAME,C,A)'                  Y2K AUG97 09971001
ISPSRL11 DC    C'(MEMLMID,C,A,MEMLCSIS,C,A,MEMLCSIZ,C,A,'     DRK AUG09 09980044
         DC    C'MEMLNAME,C,A)'                                         09981044
ISPSRL12 DC    C'(MEMLMID,C,A,MEMLCSIS,C,D,MEMLCSIZ,C,D,'     DRK AUG09 09990044
         DC    C'MEMLNAME,C,A)'                                         09991044
ISPSRL15 DC    C'(MEMLMID,C,A,MEMLCCEN,C,A,MEMLCDAT,C,A,'     Y2K AUG97 10000001
         DC    C'MEMLNAME,C,A)'                               Y2K AUG97 10001001
ISPSRL16 DC    C'(MEMLMID,C,A,MEMLCCEN,C,D,MEMLCDAT,C,D,'     Y2K AUG97 10010001
         DC    C'MEMLNAME,C,A)'                               Y2K AUG97 10011001
ISPSRL19 DC    C'(MEMLMID,C,A,MEMLVMOD,C,A,MEMLNAME,C,A)'               10020000
ISPSRL20 DC    C'(MEMLMID,C,A,MEMLVMOD,C,D,MEMLNAME,C,A)'               10030000
ISPSRL21 DC    C'(MEMLVMOD,C,A,MEMLNAME,C,A)'                           10040000
ISPSRL22 DC    C'(MEMLVMOD,C,D,MEMLNAME,C,A)'                           10050000
ISPSRL23 DC    C'(MEMLCSIS,C,A,MEMLCSIZ,C,A,MEMLNAME,C,A)'    DRK AUG09 10060044
ISPSRL24 DC    C'(MEMLCSIS,C,D,MEMLCSIZ,C,D,MEMLNAME,C,A)'    DRK AUG09 10070044
ISPSRL25 DC    C'(MEMLCCEN,C,A,MEMLCDAT,C,A,MEMLNAME,C,A)'    Y2K AUG97 10080001
ISPSRL26 DC    C'(MEMLCCEN,C,D,MEMLCDAT,C,D,MEMLNAME,C,A)'    Y2K AUG97 10090001
         DS    0F                                    MATCHES   SS MAR85 10100000
***   MEMLIST LOAD MOD                               ========= SS MAR85 10110004
ISPPARS3 DC    X'31',X'00',X'80',X'00',CL8'ASCEND'   A/AS     DRK DEC06 10120033
*SPPARS3 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS AUG86 10121033
         DC    X'31',X'00',X'00',X'01',CL8'DESCEND'  D/DE     DRK DEC06 10130033
*        DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS AUG86 10131033
         DC    X'23',X'00',X'40',X'00',CL8'MAIN'     MAIN     DRK JUL07 10140036
         DC    X'22',X'00',X'20',X'00',CL8'DATE'     DAT      DRK DEC06 10140136
*        DC    X'32',X'00',X'20',X'00',CL8'DATE'     D/DAT     SS NOV85 10141033
         DC    X'23',X'00',X'20',X'00',CL8'LENLKED'  LENL     ABL JAN87 10150000
         DC    X'21',X'00',X'20',X'00',CL8'LKED'     LK       ABL JAN89 10160000
         DC    X'23',X'00',X'10',X'00',CL8'LENGTH'   LENG      SS NOV85 10170000
         DC    X'32',X'00',X'10',X'00',CL8'SIZE'     S/SIZ    ABL JAN87 10180000
         DC    X'23',X'00',X'08',X'00',CL8'MODE'     MODE     DRK JUL07 10181036
         DC    X'23',X'00',X'04',X'00',CL8'ATTR'     ATTR     DRK JUL07 10182036
         DC    X'32',X'00',X'02',X'00',CL8'TTR'      T/TTR    ABL JAN87 10190000
         DC    X'23',X'00',X'01',X'00',CL8'AUTH'     AUTH     DRK JUL07 10191036
         DC    X'21',X'00',X'01',X'00',CL8'ACODE'    AC/ACODE DRK JUL07 10192042
         DC    X'32',X'00',X'00',X'00',CL8'MEMBER'  REDUNDANT  SS NOV85 10200000
         DC    X'33',X'00',X'00',X'00',CL8'NAME'    REDUNDANT  SS MAY88 10210000
         DC    X'FF'                                           SS MAY85 10220000
         DS    0H                                              SS NOV85 10230000
ISPSRCK3 DC    X'0000',AL2(ISPSRL01-ISPSORT),H'1'  MEM         SS AUG86 10240000
         DC    X'8000',AL2(ISPSRL01-ISPSORT),H'1'  MEM         SS AUG86 10250000
         DC    X'0001',AL2(ISPSRL02-ISPSORT),H'0'  MEM    DESC SS AUG86 10260000
         DC    X'8200',AL2(ISPSRL03-ISPSORT),H'0'  TTR         SS AUG86 10270000
         DC    X'0200',AL2(ISPSRL03-ISPSORT),H'0'  TTR         SS AUG86 10280000
         DC    X'0201',AL2(ISPSRL04-ISPSORT),H'0'  TTR    DESC SS AUG86 10290000
         DC    X'9000',AL2(ISPSRL35-ISPSORT),H'0'  LENG   AS   SS DEC87 10300000
         DC    X'1000',AL2(ISPSRL36-ISPSORT),H'0'  LENG        SS DEC87 10310000
         DC    X'1001',AL2(ISPSRL36-ISPSORT),H'0'  LENG   DESC SS AUG86 10320000
         DC    X'A000',AL2(ISPSRL37-ISPSORT),H'0'  LKEDDATE AS SS DEC87 10330000
         DC    X'2000',AL2(ISPSRL38-ISPSORT),H'0'  LKEDDATE    SS DEC87 10340000
         DC    X'2001',AL2(ISPSRL38-ISPSORT),H'0'  LK     DESC SS AUG86 10350000
         DC    X'B000',AL2(ISPSRL39-ISPSORT),H'0'  LK LEN AS   SS DEC87 10360000
         DC    X'3000',AL2(ISPSRL40-ISPSORT),H'0'  LK LEN      SS DEC87 10370000
         DC    X'3001',AL2(ISPSRL40-ISPSORT),H'0'  LK LEN DESC SS AUG86 10380000
         DC    X'C000',AL2(ISPSRL41-ISPSORT),H'0'  MAIN       DRK JUL07 10381037
         DC    X'4000',AL2(ISPSRL41-ISPSORT),H'0'  MAIN       DRK JUL07 10382037
         DC    X'4001',AL2(ISPSRL42-ISPSORT),H'0'  MAIN DESC  DRK JUL07 10382139
         DC    X'8800',AL2(ISPSRL43-ISPSORT),H'0'  MODE       DRK JUL07 10383039
         DC    X'0800',AL2(ISPSRL43-ISPSORT),H'0'  MODE       DRK JUL07 10384039
         DC    X'0801',AL2(ISPSRL44-ISPSORT),H'0'  MODE DESC  DRK JUL07 10384139
         DC    X'8400',AL2(ISPSRL45-ISPSORT),H'0'  ATTR       DRK JUL07 10385039
         DC    X'0400',AL2(ISPSRL45-ISPSORT),H'0'  ATTR       DRK JUL07 10386039
         DC    X'0401',AL2(ISPSRL46-ISPSORT),H'0'  ATTR DESC  DRK JUL07 10386139
         DC    X'8100',AL2(ISPSRL47-ISPSORT),H'0'  AUTH       DRK JUL07 10387039
         DC    X'0100',AL2(ISPSRL47-ISPSORT),H'0'  AUTH       DRK JUL07 10388039
         DC    X'0101',AL2(ISPSRL48-ISPSORT),H'0'  AUTH DESC  DRK JUL07 10389039
         DC    X'FFFF'              END OF TABLE               SS NOV85 10390000
ISPSRL35 DC    C'(MEMLXLEN,C,A,MEMLNAME,C,A)'                 DRK OCT99 10400012
ISPSRL36 DC    C'(MEMLXLEN,C,D,MEMLNAME,C,A)'                 DRK OCT99 10410012
ISPSRL37 DC    C'(MEMLLCEN,C,A,MEMLLDAT,C,A,MEMLNAME,C,A)'    Y2K AUG97 10420001
ISPSRL38 DC    C'(MEMLLCEN,C,D,MEMLLDAT,C,D,MEMLNAME,C,A)'    Y2K AUG97 10430001
ISPSRL39 DC    C'(MEMLLCEN,C,A,MEMLLDAT,C,A,MEMLXLEN,C,A,'    Y2K AUG97 10440012
         DC    C'MEMLNAME,C,A)'                               Y2K AUG97 10441001
ISPSRL40 DC    C'(MEMLLCEN,C,D,MEMLLDAT,C,D,MEMLXLEN,C,D,'    Y2K AUG97 10450012
         DC    C'MEMLNAME,C,A)'                               Y2K AUG97 10451001
ISPSRL41 DC    C'(MEMLMNAM,C,A,MEMLNAME,C,A)'                 DRK JUL07 10452037
ISPSRL42 DC    C'(MEMLMNAM,C,D,MEMLNAME,C,A)'                 DRK JUL07 10452140
ISPSRL43 DC    C'(MEMLMODE,C,A,MEMLNAME,C,A)'                 DRK JUL07 10453039
ISPSRL44 DC    C'(MEMLMODE,C,D,MEMLNAME,C,A)'                 DRK JUL07 10453140
ISPSRL45 DC    C'(MEMLATT1,C,A,MEMLATT2,C,A,MEMLDC,C,A,'      DRK JUL07 10454039
         DC    C'MEMLTEST,C,A,MEMLNAME,C,A)'                  DRK JUL07 10454139
ISPSRL46 DC    C'(MEMLATT1,C,D,MEMLATT2,C,D,MEMLDC,C,D,'      DRK JUL07 10454240
         DC    C'MEMLTEST,C,D,MEMLNAME,C,A)'                  DRK JUL07 10455040
ISPSRL47 DC    C'(MEMLAPF,C,A,MEMLNAME,C,A)'                  DRK JUL07 10456039
ISPSRL48 DC    C'(MEMLAPF,C,D,MEMLNAME,C,A)'                  DRK JUL07 10457040
         DS    0F                                    MATCHES   SS MAR85 10460000
***   LISTV                                          ========= SS MAR85 10470004
ISPPARS5 DC    X'31',X'00',X'80',X'00',CL8'ASCEND'   A/AS     DRK DEC06 10481034
*SPPARS5 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS AUG86 10482034
         DC    X'22',X'00',X'10',X'00',CL8'DEVTYPE'  DEV      DRK DEC06 10482135
*        DC    X'32',X'00',X'10',X'00',CL8'DEVTYPE'  D/DEV    ABL JAN87 10482235
         DC    X'31',X'00',X'00',X'01',CL8'DESCEND'  D/DE     DRK DEC06 10483034
*        DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS AUG86 10484034
         DC    X'22',X'00',X'10',X'00',CL8'TYPE'     TYP       SS NOV85 10500000
         DC    X'31',X'00',X'40',X'00',CL8'VOLUME'   V/VO      SS NOV85 10520000
         DC    X'22',X'00',X'20',X'00',CL8'ADDRESS'  ADD      DRK DEC06 10531034
*        DC    X'32',X'00',X'20',X'00',CL8'ADDRESS'  A/ADD    ABL JAN87 10532034
         DC    X'31',X'00',X'08',X'00',CL8'SPACE'    S/SP      SS NOV85 10540000
         DC    X'31',X'00',X'08',X'00',CL8'FREE'     F/FR      SS MAY88 10550000
         DC    X'22',X'00',X'08',X'00',CL8'TOTAL'    TOT      ABL JAN87 10560000
         DC    X'33',X'00',X'04',X'00',CL8'LARGEST'  L/LARG    SS NOV85 10570000
         DC    X'31',X'00',X'02',X'00',CL8'COUNT'    C/CO     DRK JUL98 10572004
         DC    X'31',X'00',X'01',X'00',CL8'USED'     U/US     DRK AUG98 10573006
         DC    X'FF'                                           SS MAY85 10580000
         DS    0H                                              SS NOV85 10590000
ISPSRCK5 DC    X'0000',AL2(ISPSRL50-ISPSORT),H'1'  VOL         SS AUG86 10600000
         DC    X'C000',AL2(ISPSRL50-ISPSORT),H'1'  VOL         SS AUG86 10610000
         DC    X'8000',AL2(ISPSRL50-ISPSORT),H'1'  VOL         SS AUG86 10620000
         DC    X'4000',AL2(ISPSRL50-ISPSORT),H'1'  VOL         SS AUG86 10630000
         DC    X'4001',AL2(ISPSRL51-ISPSORT),H'0'  VOL DES     SS AUG86 10640000
         DC    X'0001',AL2(ISPSRL51-ISPSORT),H'0'  VOL DES     SS AUG86 10650000
         DC    X'A000',AL2(ISPSRL52-ISPSORT),H'0'  ADDR        SS AUG86 10660000
         DC    X'2000',AL2(ISPSRL52-ISPSORT),H'0'  ADDR        SS AUG86 10670000
         DC    X'2001',AL2(ISPSRL53-ISPSORT),H'0'  ADDR DES    SS AUG86 10680000
         DC    X'9000',AL2(ISPSRL54-ISPSORT),H'0'  TYPE VOL    SS AUG86 10690000
         DC    X'1000',AL2(ISPSRL54-ISPSORT),H'0'  TYPE VOL    SS AUG86 10700000
         DC    X'1001',AL2(ISPSRL55-ISPSORT),H'0'  TYPE DES    SS AUG86 10710000
         DC    X'D000',AL2(ISPSRL54-ISPSORT),H'0'  TYPE VOL    SS AUG86 10720000
         DC    X'5000',AL2(ISPSRL54-ISPSORT),H'0'  TYPE VOL    SS AUG86 10730000
         DC    X'5001',AL2(ISPSRL55-ISPSORT),H'0'  TYPE DES    SS AUG86 10740000
         DC    X'8800',AL2(ISPSRL56-ISPSORT),H'0'  TOTAL       SS AUG86 10750000
         DC    X'0800',AL2(ISPSRL56-ISPSORT),H'0'  TOTAL       SS AUG86 10760000
         DC    X'0801',AL2(ISPSRL57-ISPSORT),H'0'  TOTAL DES   SS AUG86 10770000
         DC    X'8400',AL2(ISPSRL58-ISPSORT),H'0'  LARG        SS AUG86 10780000
         DC    X'0400',AL2(ISPSRL58-ISPSORT),H'0'  LARG        SS AUG86 10790000
         DC    X'0401',AL2(ISPSRL59-ISPSORT),H'0'  LARG DES    SS AUG86 10800000
         DC    X'9800',AL2(ISPSRL60-ISPSORT),H'0'  TYPE TOTAL  SS AUG86 10810000
         DC    X'1800',AL2(ISPSRL60-ISPSORT),H'0'  TYPE TOTAL  SS AUG86 10820000
         DC    X'1801',AL2(ISPSRL61-ISPSORT),H'0'  TYPE TOT D  SS AUG86 10830000
         DC    X'9400',AL2(ISPSRL62-ISPSORT),H'0'  TYPE LARG   SS AUG86 10840000
         DC    X'1400',AL2(ISPSRL62-ISPSORT),H'0'  TYPE LARG   SS AUG86 10850000
         DC    X'1401',AL2(ISPSRL63-ISPSORT),H'0'  TYPE LARG D SS AUG86 10860000
         DC    X'8200',AL2(ISPSRL64-ISPSORT),H'0'  COUNT      DRK JUL98 10861004
         DC    X'0200',AL2(ISPSRL64-ISPSORT),H'0'  COUNT      DRK JUL98 10862004
         DC    X'0201',AL2(ISPSRL65-ISPSORT),H'0'  COUNT DES  DRK JUL98 10863004
         DC    X'9200',AL2(ISPSRL66-ISPSORT),H'0'  TYPE COUNT DRK JUL98 10864004
         DC    X'1200',AL2(ISPSRL66-ISPSORT),H'0'  TYPE COUNT DRK JUL98 10865004
         DC    X'1201',AL2(ISPSRL67-ISPSORT),H'0'  TYPE CNT D DRK JUL98 10866004
         DC    X'8100',AL2(ISPSRL68-ISPSORT),H'0'  USED       DRK AUG98 10867006
         DC    X'0100',AL2(ISPSRL68-ISPSORT),H'0'  USED       DRK AUG98 10868006
         DC    X'0101',AL2(ISPSRL69-ISPSORT),H'0'  USED DES   DRK AUG98 10869006
         DC    X'9100',AL2(ISPSRL6A-ISPSORT),H'0'  TYPE USED  DRK AUG98 10869106
         DC    X'1100',AL2(ISPSRL6A-ISPSORT),H'0'  TYPE USED  DRK AUG98 10869206
         DC    X'1101',AL2(ISPSRL6B-ISPSORT),H'0'  TYPE USE D DRK AUG98 10869306
         DC    X'FFFF'              END OF TABLE               SS NOV85 10870000
ISPSRL50 DC    C'(PDSVVOL,C,A)'                                SS AUG86 10880000
ISPSRL51 DC    C'(PDSVVOL,C,D)'                                SS AUG86 10890000
ISPSRL52 DC    C'(PDSVXADD,C,A)'                               SS AUG86 10900000
ISPSRL53 DC    C'(PDSVXADD,C,D)'                               SS AUG86 10910000
ISPSRL54 DC    C'(PDSVTYPE,C,A,PDSVVOL,C,A)'                   SS AUG86 10920000
ISPSRL55 DC    C'(PDSVTYPE,C,D,PDSVVOL,C,A)'                   SS AUG86 10930000
ISPSRL56 DC    C'(PDSVTCYL,C,A,PDSVTTRK,C,A,PDSVVOL,C,A)'      SS AUG86 10940000
ISPSRL57 DC    C'(PDSVTCYL,C,D,PDSVTTRK,C,D,PDSVVOL,C,A)'      SS AUG86 10950000
ISPSRL58 DC    C'(PDSVLCYL,C,A,PDSVLTRK,C,A,PDSVVOL,C,A)'      SS AUG86 10960000
ISPSRL59 DC    C'(PDSVLCYL,C,D,PDSVLTRK,C,D,PDSVVOL,C,A)'      SS AUG86 10970000
ISPSRL60 DC    C'(PDSVTYPE,C,A,PDSVTCYL,C,A,PDSVTTRK,C,A,PDSVVOL,C,A)'  10980000
ISPSRL61 DC    C'(PDSVTYPE,C,A,PDSVTCYL,C,D,PDSVTTRK,C,D,PDSVVOL,C,A)'  10990000
ISPSRL62 DC    C'(PDSVTYPE,C,A,PDSVLCYL,C,A,PDSVLTRK,C,A,PDSVVOL,C,A)'  11000000
ISPSRL63 DC    C'(PDSVTYPE,C,A,PDSVLCYL,C,D,PDSVLTRK,C,D,PDSVVOL,C,A)'  11010000
ISPSRL64 DC    C'(PDSVCNTK,C,A,PDSVCNT,C,A,PDSVVOL,C,A)'      DRK JUL98 11011005
ISPSRL65 DC    C'(PDSVCNTK,C,D,PDSVCNT,C,D,PDSVVOL,C,A)'      DRK JUL98 11012005
ISPSRL66 DC    C'(PDSVTYPE,C,A,PDSVCNTK,C,A,PDSVCNT,C,A,'     DRK JUL98 11013005
         DC    C'PDSVVOL,C,A)'                                DRK JUL98 11013105
ISPSRL67 DC    C'(PDSVTYPE,C,A,PDSVCNTK,C,D,PDSVCNT,C,D,'     DRK JUL98 11014005
         DC    C'PDSVVOL,C,A)'                                DRK JUL98 11015005
ISPSRL68 DC    C'(PDSVSPCU,C,A,PDSVVOL,C,A)'                  DRK AUG98 11016006
ISPSRL69 DC    C'(PDSVSPCU,C,D,PDSVVOL,C,A)'                  DRK AUG98 11017006
ISPSRL6A DC    C'(PDSVTYPE,C,A,PDSVSPCU,C,A,PDSVVOL,C,A)'     DRK AUG98 11018006
ISPSRL6B DC    C'(PDSVTYPE,C,A,PDSVSPCU,C,D,PDSVVOL,C,A)'     DRK AUG98 11019106
         DS    0F                                    MATCHES   SS MAR85 11020000
***   LISTC/LISTF                                    ========= SS MAR85 11030000
ISPPARS6 DC    X'31',X'00',X'80',X'00',CL8'ASCEND'   A/AS     DRK DEC06 11040034
*SPPARS6 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS OCT88 11041034
         DC    X'31',X'00',X'00',X'01',CL8'DESCEND'  D/DE     DRK DEC06 11050034
*        DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS OCT88 11051034
         DC    X'21',X'00',X'40',X'00',CL8'DSNAME'   DS        SS OCT88 11060000
         DC    X'31',X'00',X'20',X'00',CL8'VOLUME'   V/VO      SS OCT88 11070000
         DC    X'25',X'00',X'10',X'00',CL8'LEVEL2'   LEVEL2    SS OCT88 11080000
         DC    X'21',X'00',X'10',X'00',CL8'L2'       L2        SS OCT88 11090000
         DC    X'32',X'00',X'08',X'00',CL8'SUFFIX'   S/SUF     SS OCT88 11100000
         DC    X'34',X'00',X'04',X'00',CL8'CDATE'    C/CDATE   SS OCT88 11110000
         DC    X'34',X'00',X'04',X'00',CL8'CREATED'  C/CREAT   SS OCT88 11120000
         DC    X'34',X'00',X'02',X'00',CL8'RDATE'    R/RDATE   SS OCT88 11130000
         DC    X'34',X'00',X'02',X'00',CL8'REFER'    R/REFER   SS OCT88 11140000
         DC    X'21',X'00',X'01',X'00',CL8'SIZE'     SI        SS OCT88 11150000
         DC    X'FF'                                           SS OCT88 11160000
         DS    0H                                              SS OCT88 11170000
ISPSRCK6 DC    X'0000',AL2(ISPSRL70-ISPSORT),H'1'  DSN+VOL     SS OCT88 11180000
         DC    X'4000',AL2(ISPSRL70-ISPSORT),H'1'  DSN+VOL     SS OCT88 11190000
         DC    X'C000',AL2(ISPSRL70-ISPSORT),H'1'  DSN+VOL ASC SS OCT88 11200000
         DC    X'4001',AL2(ISPSRL71-ISPSORT),H'0'  DSN DES     SS OCT88 11210000
         DC    X'0001',AL2(ISPSRL71-ISPSORT),H'0'  DSN DES     SS OCT88 11220000
         DC    X'2000',AL2(ISPSRL72-ISPSORT),H'0'  VOL         SS OCT88 11230000
         DC    X'6000',AL2(ISPSRL72-ISPSORT),H'0'  VOL+DSN     SS OCT88 11240000
         DC    X'A000',AL2(ISPSRL72-ISPSORT),H'0'  VOL  ASC    SS OCT88 11250000
         DC    X'E000',AL2(ISPSRL72-ISPSORT),H'0'  VOL+DSN ASC SS OCT88 11260000
         DC    X'2001',AL2(ISPSRL73-ISPSORT),H'0'  VOL DES     SS OCT88 11270000
         DC    X'6001',AL2(ISPSRL74-ISPSORT),H'0'  VOL+DSN DES SS OCT88 11280000
         DC    X'2400',AL2(ISPSRL7E-ISPSORT),H'0'  VOL+CDAT    SS OCT88 11290000
         DC    X'A400',AL2(ISPSRL7E-ISPSORT),H'0'  VOL+CDA ASC SS OCT88 11300000
         DC    X'2401',AL2(ISPSRL7F-ISPSORT),H'0'  VOL+CDA DES SS OCT88 11310000
         DC    X'6400',AL2(ISPSRL7E-ISPSORT),H'0'  VOL+CDAT    SS OCT88 11320000
         DC    X'E400',AL2(ISPSRL7E-ISPSORT),H'0'  VOL+CDA ASC SS OCT88 11330000
         DC    X'6401',AL2(ISPSRL7F-ISPSORT),H'0'  VOL+CDA DES SS OCT88 11340000
         DC    X'2200',AL2(ISPSRL7G-ISPSORT),H'0'  VOL+RDAT    SS OCT88 11350000
         DC    X'A200',AL2(ISPSRL7G-ISPSORT),H'0'  VOL+RDA ASC SS OCT88 11360000
         DC    X'2201',AL2(ISPSRL7H-ISPSORT),H'0'  VOL+RDA DES SS OCT88 11370000
         DC    X'6200',AL2(ISPSRL7G-ISPSORT),H'0'  VOL+RDAT    SS OCT88 11380000
         DC    X'E200',AL2(ISPSRL7G-ISPSORT),H'0'  VOL+RDA ASC SS OCT88 11390000
         DC    X'6201',AL2(ISPSRL7H-ISPSORT),H'0'  VOL+RDA DES SS OCT88 11400000
         DC    X'2100',AL2(ISPSRL7I-ISPSORT),H'0'  VOL+SIZE    SS OCT88 11410000
         DC    X'A100',AL2(ISPSRL7I-ISPSORT),H'0'  VOL+SIZE AS SS OCT88 11420000
         DC    X'2101',AL2(ISPSRL7J-ISPSORT),H'0'  VOL+SIZ DES SS OCT88 11430000
         DC    X'6100',AL2(ISPSRL7I-ISPSORT),H'0'  VOL+SIZE    SS OCT88 11440000
         DC    X'E100',AL2(ISPSRL7I-ISPSORT),H'0'  VOL+SIZE AS SS OCT88 11450000
         DC    X'6101',AL2(ISPSRL7J-ISPSORT),H'0'  VOL+SIZ DES SS OCT88 11460000
         DC    X'0400',AL2(ISPSRL79-ISPSORT),H'0'  CDAT        SS OCT88 11470000
         DC    X'0401',AL2(ISPSRL79-ISPSORT),H'0'  CDAT        SS OCT88 11480000
         DC    X'8400',AL2(ISPSRL80-ISPSORT),H'0'  CDAT ASC    SS OCT88 11490000
         DC    X'4400',AL2(ISPSRL79-ISPSORT),H'0'  CDAT+DSN    SS OCT88 11500000
         DC    X'4401',AL2(ISPSRL79-ISPSORT),H'0'  CDAT+DSN    SS OCT88 11510000
         DC    X'C400',AL2(ISPSRL80-ISPSORT),H'0'  CDAT ASC    SS OCT88 11520000
         DC    X'0200',AL2(ISPSRL81-ISPSORT),H'0'  RDAT        SS OCT88 11530000
         DC    X'0201',AL2(ISPSRL81-ISPSORT),H'0'  RDAT        SS OCT88 11540000
         DC    X'8200',AL2(ISPSRL82-ISPSORT),H'0'  RDAT ASC    SS OCT88 11550000
         DC    X'4200',AL2(ISPSRL81-ISPSORT),H'0'  RDAT+DSN    SS OCT88 11560000
         DC    X'4201',AL2(ISPSRL81-ISPSORT),H'0'  RDAT+DSN    SS OCT88 11570000
         DC    X'C200',AL2(ISPSRL82-ISPSORT),H'0'  RDAT ASC    SS OCT88 11580000
         DC    X'0100',AL2(ISPSRL84-ISPSORT),H'0'  SIZE        SS OCT88 11590000
         DC    X'0101',AL2(ISPSRL84-ISPSORT),H'0'  SIZE        SS OCT88 11600000
         DC    X'8100',AL2(ISPSRL83-ISPSORT),H'0'  SIZE ASC    SS OCT88 11610000
         DC    X'4100',AL2(ISPSRL84-ISPSORT),H'0'  SIZE+DSN    SS OCT88 11620000
         DC    X'4101',AL2(ISPSRL84-ISPSORT),H'0'  SIZE+DSN    SS OCT88 11630000
         DC    X'C100',AL2(ISPSRL83-ISPSORT),H'0'  SIZE ASC    SS OCT88 11640000
         DC    X'FFFF'              END OF TABLE               SS OCT88 11650000
ISPSRL70 DC    C'(PDSCDSN,C,A,PDSCVOL,C,A)'                    SS OCT88 11660000
ISPSRL71 DC    C'(PDSCDSN,C,D,PDSCVOL,C,A)'                    SS OCT88 11670000
ISPSRL72 DC    C'(PDSCVOL,C,A,PDSCDSN,C,A)'                    SS OCT88 11680000
ISPSRL73 DC    C'(PDSCVOL,C,D,PDSCDSN,C,A)'                    SS OCT88 11690000
ISPSRL74 DC    C'(PDSCVOL,C,D,PDSCDSN,C,D)'                    SS OCT88 11700000
ISPSRL7A DC    C'(PDSCVOL,C,A,PDSCDSN2,C,A,PDSCDSN,C,A)'       SS OCT88 11710000
ISPSRL7B DC    C'(PDSCVOL,C,D,PDSCDSN2,C,A,PDSCDSN,C,A)'       SS OCT88 11720000
ISPSRL7C DC    C'(PDSCVOL,C,A,PDSCDSNL,C,A,PDSCDSN,C,A)'       SS OCT88 11730000
ISPSRL7D DC    C'(PDSCVOL,C,D,PDSCDSNS,C,A,PDSCDSN,C,A)'       SS OCT88 11740000
ISPSRL7E DC    C'(PDSCVOL,C,A,PDSCCCEN,C,D,PDSCCDAT,C,D,'     Y2K AUG97 11750002
         DC    C'PDSCDSN,C,A)'                                Y2K AUG97 11751002
ISPSRL7F DC    C'(PDSCVOL,C,D,PDSCCCEN,C,D,PDSCCDAT,C,D,'     Y2K AUG97 11760002
         DC    C'PDSCDSN,C,A)'                                Y2K AUG97 11761002
ISPSRL7G DC    C'(PDSCVOL,C,A,PDSCRCEN,C,D,PDSCRDAT,C,D,'     Y2K AUG97 11770002
         DC    C'PDSCDSN,C,A)'                                Y2K AUG97 11771002
ISPSRL7H DC    C'(PDSCVOL,C,D,PDSCRCEN,C,D,PDSCRDAT,C,D,'     Y2K AUG97 11780002
         DC    C'PDSCDSN,C,A)'                                Y2K AUG97 11781002
ISPSRL7I DC    C'(PDSCVOL,C,A,PDSCTRKS,C,D,PDSCDSN,C,A)'       SS OCT88 11790000
ISPSRL7J DC    C'(PDSCVOL,C,D,PDSCTRKS,C,D,PDSCDSN,C,A)'       SS OCT88 11800000
ISPSRL75 DC    C'(PDSCDSN2,C,A,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11810000
ISPSRL76 DC    C'(PDSCDSN2,C,D,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11820000
ISPSRL77 DC    C'(PDSCDSNL,C,A,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11830000
ISPSRL78 DC    C'(PDSCDSNL,C,D,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11840000
ISPSRL79 DC    C'(PDSCCCEN,C,D,PDSCCDAT,C,D,PDSCDSN,C,A,'     Y2K AUG97 11850002
         DC    C'PDSCVOL,C,A)'                                Y2K AUG97 11851002
ISPSRL80 DC    C'(PDSCCCEN,C,A,PDSCCDAT,C,A,PDSCDSN,C,A,'     Y2K AUG97 11860002
         DC    C'PDSCVOL,C,A)'                                Y2K AUG97 11861002
ISPSRL81 DC    C'(PDSCRCEN,C,D,PDSCRDAT,C,D,PDSCDSN,C,A,'     Y2K AUG97 11870002
         DC    C'PDSCVOL,C,A)'                                Y2K AUG97 11871002
ISPSRL82 DC    C'(PDSCRCEN,C,A,PDSCRDAT,C,A,PDSCDSN,C,A,'     Y2K AUG97 11880002
         DC    C'PDSCVOL,C,A)'                                Y2K AUG97 11881002
ISPSRL83 DC    C'(PDSCTRKS,C,A,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11890000
ISPSRL84 DC    C'(PDSCTRKS,C,D,PDSCDSN,C,A,PDSCVOL,C,A)'       SS OCT88 11900000
*SPSRL88 DC                                                             11910000
         DS    0F                                    MATCHES   SS MAR85 11920000
***   CAX                                            ========= SS OCT88 11930000
ISPPARS7 DC    X'31',X'00',X'80',X'00',CL8'ASCEND'   A/AS     DRK DEC06 11940034
*SPPARS7 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS OCT88 11941034
         DC    X'31',X'00',X'00',X'01',CL8'DESCEND'  D/DE     DRK DEC06 11950034
*        DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS OCT88 11951034
         DC    X'21',X'00',X'40',X'00',CL8'NUMBER'   NU        SS OCT88 11960000
         DC    X'21',X'00',X'20',X'00',CL8'DSNAME'   DS       DRK DEC06 11970034
*        DC    X'31',X'00',X'20',X'00',CL8'DSNAME'   D/DS      SS OCT88 11971034
         DC    X'31',X'00',X'10',X'00',CL8'VOLUME'   V/VO      SS OCT88 11980000
         DC    X'FF'                                           SS OCT88 11990000
         DS    0H                                              SS OCT88 12000000
ISPSRCK7 DC    X'0000',AL2(ISPSRL90-ISPSORT),H'1'  NUMBER      SS OCT88 12010000
         DC    X'4000',AL2(ISPSRL90-ISPSORT),H'1'  NUMBER      SS OCT88 12020000
         DC    X'C000',AL2(ISPSRL90-ISPSORT),H'1'  NUMBER      SS OCT88 12030000
         DC    X'0001',AL2(ISPSRL91-ISPSORT),H'0'  NUMBER DE   SS OCT88 12040000
         DC    X'4001',AL2(ISPSRL91-ISPSORT),H'0'  NUMBER      SS OCT88 12050000
         DC    X'2000',AL2(ISPSRL92-ISPSORT),H'0'  DSN         SS OCT88 12060000
         DC    X'A000',AL2(ISPSRL92-ISPSORT),H'0'  DSN ASC    DRK OCT98 12061009
         DC    X'2001',AL2(ISPSRL93-ISPSORT),H'0'  DSN DES     SS OCT88 12070000
         DC    X'1000',AL2(ISPSRL94-ISPSORT),H'0'  VOL         SS OCT88 12080000
         DC    X'9000',AL2(ISPSRL94-ISPSORT),H'0'  VOL ASC    DRK OCT98 12081009
         DC    X'3000',AL2(ISPSRL94-ISPSORT),H'0'  VOL DSN     SS OCT88 12090000
         DC    X'B000',AL2(ISPSRL94-ISPSORT),H'0'  VOL DSN ASCDRK OCT98 12091009
         DC    X'1001',AL2(ISPSRL95-ISPSORT),H'0'  VOL DES     SS OCT88 12100000
         DC    X'3001',AL2(ISPSRL89-ISPSORT),H'0'  VOL DSN DES SS OCT88 12110000
         DC    X'FFFF'              END OF TABLE               SS OCT88 12120000
ISPSRL90 DC    C'(PDSXNUM,C,A)'                                SS OCT88 12130000
ISPSRL91 DC    C'(PDSXNUM,C,D)'                                SS OCT88 12140000
ISPSRL92 DC    C'(PDSXDSN,C,A,PDSXVOL,C,A)'                    SS OCT88 12150000
ISPSRL93 DC    C'(PDSXDSN,C,D,PDSXVOL,C,A)'                    SS OCT88 12160000
ISPSRL94 DC    C'(PDSXVOL,C,A,PDSXDSN,C,A)'                    SS OCT88 12170000
ISPSRL95 DC    C'(PDSXVOL,C,D,PDSXDSN,C,A)'                    SS OCT88 12180000
ISPSRL89 DC    C'(PDSXVOL,C,D,PDSXDSN,C,D)'                    SS OCT88 12190000
         DS    0F                                    MATCHES   SS MAR85 12200000
***   CSECTS                                         ========= SS OCT88 12210007
ISPPARS8 DC    X'21',X'00',X'80',X'00',CL8'ASCEND'   AS        SS OCT88 12220000
         DC    X'21',X'00',X'00',X'01',CL8'DESCEND'  DE        SS OCT88 12230000
         DC    X'21',X'00',X'40',X'00',CL8'ADDRESS'  AD        SS OCT88 12240000
         DC    X'31',X'00',X'20',X'00',CL8'NAME'     N/NA      SS OCT88 12250000
         DC    X'FF'                                           SS OCT88 12260000
         DS    0H                                              SS OCT88 12270000
ISPSRCK8 DC    X'0000',AL2(ISPSRL96-ISPSORT),H'1'  ADDRESS     SS OCT88 12280000
         DC    X'4000',AL2(ISPSRL96-ISPSORT),H'1'  ADDRESS     SS OCT88 12290000
         DC    X'C000',AL2(ISPSRL96-ISPSORT),H'1'  ADDRESS     SS OCT88 12300000
         DC    X'0001',AL2(ISPSRL97-ISPSORT),H'0'  ADDR DES    SS OCT88 12310000
         DC    X'4001',AL2(ISPSRL97-ISPSORT),H'0'  ADDR DES    SS OCT88 12320000
         DC    X'2000',AL2(ISPSRL98-ISPSORT),H'0'  NAME        SS OCT88 12330000
         DC    X'2001',AL2(ISPSRL99-ISPSORT),H'0'  NAME DES    SS OCT88 12340000
         DC    X'FFFF'              END OF TABLE               SS OCT88 12350000
ISPSRL96 DC    C'(PDSSADDR,C,A)'                               SS OCT88 12360000
ISPSRL97 DC    C'(PDSSADDR,C,D)'                               SS OCT88 12370000
ISPSRL98 DC    C'(PDSSNAME,C,A)'                               SS OCT88 12380000
ISPSRL99 DC    C'(PDSSNAME,C,D)'                               SS OCT88 12390000
