*PROCESS SUPRWARN(33)                                         DRK AUG09 00010079
DIALOG   TITLE 'P D S  --  ISPF DIALOG DISPLAY CODE'         09/28/88'  00020099
*  PDS DIALOG SERVICES                                         SS NOV85 00030000
*      LOGICAL LEVELS                                          SS NOV85 00040000
*        SERVICES  - REQUESTS FROM PDS                         SS NOV85 00050000
*        FUNCTIONS - SECTIONS OF CODE TO PERFORM SERVICES      SS NOV85 00060000
*                    EACH FUNCTIONS ROUTES TO NEXT FUNCTION    SS NOV85 00070000
*                    VIA ISPROUT                               SS NOV85 00080000
*        HI LEVEL  SUBROUTINES - PROVIDE HIGH LEVEL ACTIONS    SS OCT88 00090000
*        MED LEVEL SUBROUTINES - PROVIDE MOST COMMON SERVICE   SS OCT88 00100000
*        LOW LEVEL SUBROUTINES - ONLY CALL BASE LV SERVICES    SS OCT88 00110000
*        BASE LV   SUBROUTINES - PROVIDE PRIMITIVE ACTIONS     SS OCT88 00120000
*                               I.E. SPF SERVICE INTERFACE     SS NOV85 00130000
*                                                              SS NOV85 00140000
*                                                              SS NOV85 00150000
         TITLE 'P D S  --  ISPF DIALOG MACROS'                          00160000
         MACRO                                                          00170000
&L       $TL   &TB,&F,&F2,&P,&P2,&F3,&P3                       SS MAY89 00180000
         LCLC  &TC                                             SS JUL85 00190000
&TC      SETC  '&TB'.' '                                       SS JUL85 00200000
&L       DC    CL8'&TC'                        *** TABLE OFFSET         00210000
         DC    AL1(&F),AL1(&F2)                *** FLAGS 1 AND 2        00220000
         DC    AL1(&P),AL1(&P2)                *** PROC1,PROC2 SS NOV84 00230000
         DC    AL1(&F2),AL1(&P3)               *** FLAG2,PROC3 SS MAY89 00240000
         MEND                                                           00250000
         SPACE 2                                                        00260000
         MACRO                                                          00270000
&L       $TX   &TB,&F,&F2,&P,&P2,&F3,&P3                       SS MAY89 00280000
&L       DC    XL2'&TB',XL6'00'                                SS JUL85 00290000
         DC    AL1(&F+#X),AL1(&F2)             *** FLAGS 1 AND 2        00300000
         DC    AL1(&P),AL1(&P2)                *** PROC1,PROC2 SS NOV84 00310000
         DC    AL1(&F2),AL1(&P3)               *** FLAG2,PROC3 SS MAY89 00320000
         MEND                                                           00330000
         MACRO                                                          00340000
&L       $TD   ,                                               SS AUG85 00350000
*  ISPF COMMAND TABLE FLAGS                                    SS NOV84 00360000
*  FLAG1                                                       SS NOV84 00370000
#X       EQU   X'80'   NOT USED                                SS SEP84 00380000
#V       EQU   X'40'   VIEW MODE REQUIRED FOR LINE MODE        SS SEP84 00390000
#L       EQU   X'20'   LINE MESSAGE INDEX IN $TLEX2            SS NOV88 00400000
#K       EQU   X'10'   DISABLE MEMLIST WITH THIS COMMAND       SS SEP84 00410000
#E       EQU   X'08'   END OF TABLE                            SS SEP84 00420000
#O       EQU   X'04'   ADD T( FOR REPRO                       ABL JAN87 00430000
#S       EQU   X'02'   VALID FOR SOURCE ONLY                   SS SEP84 00440000
#U       EQU   X'01'   VALID FOR LOADMOD ONLY                  SS SEP84 00450000
*  FLAG2                                                       SS NOV84 00460000
#C       EQU   X'80'   $TLEX HAS COMMAND TABLE INDEX           SS NOV85 00470000
#P       EQU   X'40'   $TLEX HAS POST PROCESS FUNC CODE        SS NOV84 00480000
#R       EQU   X'20'   $TLEX HAS OFFSET TO OFFSET OF REAL CMD  SS NOV84 00490000
*                      ALSO USE FIRST CHAR FOR BLOCK REPEAT    SS JUL87 00500000
#T       EQU   X'10'   COMMAND LINE FUNC CALL PROVIDED         SS MAR85 00510000
*                      LINE COMMAND IS INTERNAL (O RESCAN)     SS NOV85 00520000
#D       EQU   X'08'   DO NOT USE FOR REPEATS                  SS NOV84 00530000
#M       EQU   X'04'   PERFORM MEMLIST ON MEMBER TO REFR STATS SS NOV84 00540000
#2       EQU   X'02'   SUBCOMMAND TURNS OFF VIEW MODE         ABL OCT84 00550000
#H       EQU   X'01'   COMMAND ALLOWED FROM O LINE COMMAND    ABL DEC84 00560000
* FOLLOWING CODES USED BY SELECT PANEL MODE                    SS NOV84 00570000
#A       EQU   X'10'   ACTIVATE RESCAN IN PANEL MODE           SS AUG86 00580000
*  NOTE #A AND #T ARE SAME, USE ONLY ONE                       SS AUG86 00590000
#Z       EQU   X'08'   USE CONTROL NONDISPL: NO INPUT REQUIRED SS AUG86 00600000
         SPACE 1                                               SS SEP84 00610000
$TLCM    EQU   0       CMD (VALUE, TABLE OFFSET, EXTENDED OFF) SS NOV84 00620000
$TLF1    EQU   8       FLAG1                                   SS MAR85 00630000
$TLF2    EQU   9       FLAG2                                   SS NOV84 00640000
$TLFU    EQU   10      FUNCTION CODE                           SS NOV84 00650000
$TLEX    EQU   11      EXTENDED USE CODE                       SS NOV84 00660000
$TLF3    EQU   12      FLAG3                                   SS MAY89 00670000
$TLMG    EQU   13      MESSAGE OFFSET (1 BYTES)                SS MAY89 00680000
$TLEX2   EQU   13      EXTENDED USE CODE                       SS NOV84 00690000
         SPACE 2                                               SS NOV84 00700000
         MEND                                                           00710000
         SPACE 2                                                        00720000
*************************************************************  SS JUL84 00730000
*                                                              SS JUL84 00740000
*        ADDED SUPPORT OF DIALOG DISPLAY MODE USING            SS JUL84 00750000
*        A DIALOG TABLE TO DISPLAY PDS OUTPUT                  SS JUL84 00760000
*                                                              SS JUL84 00770000
*************************************************************  SS JUL84 00780000
         SPACE 2                                               SS JUL84 00790000
         COPY  #PDSGEN                                         SS AUG86 00800000
         TITLE 'P D S  --  ISPF DIALOG DISPLAY CODE'         09/28/88'  00810060
ISPDSPY  CSECT                                                          00820099
R0       EQU   0                                               SS JUL85 00830000
R1       EQU   1                                               SS JUL85 00840000
R2       EQU   2                                               SS JUL85 00850000
R3       EQU   3                                               SS JUL85 00860000
R4       EQU   4                                               SS JUL85 00870000
R5       EQU   5                                               SS JUL85 00880000
R6       EQU   6                                               SS JUL85 00890000
R7       EQU   7                                               SS JUL85 00900000
R8       EQU   8                                               SS JUL85 00910000
R9       EQU   9                                               SS JUL85 00920000
R10      EQU   10                                              SS JUL85 00930000
R11      EQU   11                                              SS JUL85 00940000
R12      EQU   12                                              SS JUL85 00950000
R13      EQU   13                                              SS JUL85 00960000
R14      EQU   14                                              SS JUL85 00970000
R15      EQU   15                                              SS JUL85 00980000
FF       EQU   255                                            ABL OCT85 00990000
         USING *,R8                                            SS JUL84 01000000
         USING WORKAREA,R7                                     SS JUL85 01010000
         ST    R14,SPFSAV14        SAVE 14                     SS JUL84 01020000
         STM   R1,R8,SPFSAV1       SAVE REGS 1-8               SS JUL84 01030000
         LR    R8,R15              ENTRY AND BASE IN R8        SS JUL84 01040000
         LA    R5,2048(,R8)                                    SS AUG86 01050000
         LA    R5,2048(,R5)        SECOND BASE                 SS AUG86 01060000
         USING ISPDSPY+4096,R5                                 SS AUG86 01070000
         ICM   R6,15,SPFXWRK                                   SS NOV85 01080000
         BNZ   ISPXOK                                          SS NOV85 01090000
         CLI   SPFLAG1,SPFCLEAN    OPT CLEANUP                 SS AUG86 01100000
         BE    ISPEXIT2            YES, NOTHING TO CLEANUP     SS AUG86 01110000
         LH    R0,ISPWKLN          GETMAIN LENGTH              SS AUG86 01120000
         GETMAIN R,LV=(0)                                      SS AUG86 01130000
         LR    R6,R1                                           SS NOV85 01140000
         ST    R6,SPFXWRK                                      SS NOV85 01150000
         LR    R0,R7                    ANY ADDRESS            SS AUG86 01160000
         SR    R1,R1                    ZERO LENGTH            SS AUG86 01170000
         LR    R14,R6                   WORK AREA ADDRESS      SS AUG86 01180037
         LH    R15,ISPWKLN              WORK AREA LENGTH, PAD  SS AUG86 01190000
         MVCL  R14,R0                   CLEAR WORK AREA        SS AUG86 01200000
         LA    R1,2048(,R6)             *                      SS MAY88 01210000
         LA    R1,2048(,R1)             SECOND 4K              SS MAY88 01220000
         ST    R1,SPFSEC4A-SPWRKC(,R6)  SET HANDY POINTER      SS MAY88 01230000
         B     ISPXOK                   CONTINUE               SS AUG86 01240000
ISPWKLN  DC    AL2(SPWRKCL)        GETMAIN LENGTH              SS AUG86 01250000
ISPXOK   DS    0H                                              SS NOV85 01260000
         USING SPWRKC,R6                                       SS NOV85 01270000
         TM    SPFLAG0,SPFTABLE    FIRST TIME IN               SS JUL84 01280000
         BO    ISPOPT              NO, ALL SET                 SS JUL84 01290000
         SPACE 3                                                        01300000
* INITIALIZE THE DIALOG VARIABLES                              SS JUL84 01310000
         L     R4,ISPVINIA         ADDR OF INIT ROUTINE        SS MAR85 01320000
         BASR  R3,R4                                           SS MAR85 01330000
         SPACE 3                                               SS SEP84 01340000
ISPOPT   DS    0H                                              SS NOV84 01350000
         TM    SPFLAG4,SPFRST2          FLAG RESTART2          SS AUG86 01360000
         BO    ISPREST3                 CONT WHERE LEFT OFF    SS AUG86 01370000
*        OI    SPFLAG3,SPFREFR        MAKE SURE OF REFRESH     SS AUG86 01380000
*   CONTROL DISPLAY SM DONE BEFORE GOING TO PDSMAIN            SS AUG86 01390000
         SR    R15,R15                                         SS NOV84 01400000
         IC    R15,SPFLAG1            FUNCTION CODE            SS JUL84 01410000
         B     *+4(R15)               FUNCTION BRANCH TABLE    SS JUL84 01420000
         B     ISPEXIT                NOP                      SS JUL84 01430000
         B     ISPCLN                 CLEAN UP                 SS JUL84 01440000
         B     ISPPTGET               PUTGET                   SS JUL84 01450000
         B     ISPPUTL                PUTLINE                  SS JUL84 01460000
         B     ISPMEML                ADD LINE TO MEMLIST      SS SEP84 01470000
         B     ISPPNSUP               PANEL SUPPORT            SS NOV84 01480000
         B     ISPICMD                SET UP ISPF CMD          SS MAY88 01490000
         B     ISPPN1I                SINGLE PAN DISP INTERFAC SS APR89 01500000
         B     ISPSUBTR               SUBLIST = MEMLIST        SS MAY89 01510000
         B     ISPEXIT                PAD                      SS MAY89 01520000
         SPACE 3                                                        01530000
ISPERR   DS    0H                                              SS JUL84 01540000
         STM   R0,R15,SPFSVERR    SAVE ERROR REGS              SS OCT88 01550000
         LR    R4,R2              SAVE R2 FOR DEBUGGING        SS NOV85 01560000
         BAS   R2,ISPUSTKM        UNSTACK                      SS NOV85 01570000
         NI    SPFLAG0,255-SPFDON-SPFDSUSP-SPFVIEW            ABL JUN85 01580000
         NI    SPFLAG2,0             CLEAR MEMLIST MODE       ABL NOV84 01590000
         NI    SPFLAG3,SPFSELV       CLEAR MEMLIST MODE       ABL NOV84 01600000
         NI    SPFLAG4,0             CLEAR MEMLIST MODE       ABL JUN85 01610000
         DC    X'00'          FORCE 0C1                        SS JUL84 01620000
         SPACE 3                                                        01630000
ISPCLN   DS    0H                                              SS JUL84 01640000
         L     R4,ISPCLNUA              SUBR ADDR              SS OCT88 01650000
         BASR  R3,R4                    CALL                   SS OCT88 01660000
         L     R0,SPWRKCLV                                     SS DEC87 01670000
         LR    R1,R6                                           SS NOV85 01680000
         FREEMAIN R,A=(1),LV=(0)                               SS NOV85 01690000
         SR    R6,R6                                          ABL FEB86 01700000
         ST    R6,SPFXWRK         CLEAR THE WORK AREA POINTER ABL FEB86 01710000
         B     ISPEXIT2                                        SS JUL84 01720000
SPWRKCLV DC    A(SPWRKCL)               *                      SS DEC87 01730000
ISPCLNUA DC    A(ISPCLNUP)        CLEANUP SUBROUTINE           SS OCT88 01740000
         TITLE 'P D S  --  ISPF DIALOG ADD LINE TO LOG'                 01750000
*                                                              SS JUL84 01760000
*  ADD ANOTHER DISPLAY LINE                                    SS JUL84 01770000
*                                                              SS JUL84 01780000
ISPPUTL  DS    0H                                              SS JUL84 01790000
         BAS   R2,ISPADDLN                                     SS AUG84 01800000
         TM    SPFLAG0,SPFCKER                                 SS SEP84 01810000
         BZ    ISPPUTL2                                        SS SEP84 01820000
         L     R1,SPFSAV1        RELOAD REGISTER 1            ABL JUN85 01830000
         CLI   4+6(R1),C'E'      ERROR TYPE MESSAGE           ABL JUN85 01840000
         BNE   ISPPUTL2                                        SS SEP84 01850000
         CLC   4+0(3,R1),ISPPDS  "PDS" PREFIX?                ABL JUN84 01860000
         BNE   ISPPUTL2          NO, BRANCH                   ABL OCT84 01870000
         TM    4+5(R1),X'F0'     NUMERIC?                     ABL JUN84 01880000
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84 01890000
         TM    4+4(R1),X'F0'     NUMERIC?                     ABL JUN84 01900000
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84 01910000
         TM    4+3(R1),X'F0'     NUMERIC?                     ABL JUN84 01920000
         BNO   ISPPUTL2          NO, BRANCH                   ABL OCT84 01930000
         OI    SPFLAG0,SPFMSGER  FLAG ERROR FOUND              SS SEP84 01940000
         MVC   SPFMLIN1(8),4(R1)     SAVE THE ERROR HEADER    ABL JUN85 01950000
         MVC   SPFMLIN2(79),SPFLINE  SAVE THE ERROR MESSAGE   ABL JUN85 01960000
ISPPUTL2 DS    0H                                              SS SEP84 01970000
         L     R14,SPFCKPT       COUNT FROM LAST CKPT         DRK JAN12 01980084
*        LH    R14,SPFCKPT       COUNT FROM LAST CKPT          SS JUL84 01990084
         LA    R14,1(R14)        ONE MORE ENTRY                SS JUL84 02000000
         ST    R14,SPFCKPT       SAVE COUNT                   DRK JAN12 02010084
*        STH   R14,SPFCKPT       SAVE COUNT                    SS JUL84 02020084
* END COMMMAND IN CHECKPOINT LEAVES SYSPRINT OPEN             DRK JUL20 02030099
         CLC   ##SUBCOM(3),=CL3'AMB'     AMBLIST?             DRK JUL20 02040099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02050099
         CLC   ##SUBCOM(3),=CL3'COB'     COBANAL?             DRK JUL20 02060099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02070099
         CLC   ##SUBCOM(3),=CL3'CPK'     CPKMAP?              DRK JUL20 02080099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02090099
         CLC   ##SUBCOM(4),=CL4'DISA'    DISASM?              DRK JUL20 02100099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02110099
         CLC   ##SUBCOM(3),=CL3'DLI'     DLINK?               DRK JUL20 02120099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02130099
         CLC   ##SUBCOM(3),=CL3'LMA'     LMA?                 DRK JUL20 02140099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02150099
         CLC   ##SUBCOM(3),=CL3'LOA'     LOAD?                DRK JUL20 02160099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02170099
         CLC   ##SUBCOM(3),=CL3'MAT'     MATCH?               DRK JUL20 02180099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02190099
         CLC   ##SUBCOM(3),=CL3'MXI'     MXIBATCH?            DRK JUL20 02200099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02210099
         CLC   ##SUBCOM(3),=CL3'OFF'     OFFLOAD?             DRK JUL20 02220099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02230099
         CLC   ##SUBCOM(3),=CL3'PTS'     PTSEXP?              DRK JUL20 02240099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02250099
         CLC   ##SUBCOM(3),=CL3'SEA'     SEARCH?              DRK FEB22 02251099
         BE    ISPEXIT                   YES, NO CKPT         DRK FEB22 02252099
         CLC   ##SUBCOM(3),=CL3'SRC'     SRCHFOR?             DRK FEB22 02253099
         BE    ISPEXIT                   YES, NO CKPT         DRK FEB22 02254099
         CLC   ##SUBCOM(3),=CL3'TRK'     TRKMAP?              DRK FEB22 02255099
         BE    ISPEXIT                   YES, NO CKPT         DRK FEB22 02256099
         CLC   ##SUBCOM(3),=CL3'VPD'     VPDSE?               DRK JUL20 02260099
         BE    ISPEXIT                   YES, NO CKPT         DRK JUL20 02270099
         C     R14,SPFCCKPT      TIME FOR NEW CKPT             SS OCT88 02280000
         BL    ISPEXIT           DONE WITH PUTLINE            ABL OCT84 02290000
ISPATCK  DS    0H                CHECK POINT TIME              SS JUL84 02300000
         L     R1,SPFSTART        REPOSITION TO HERE           SS JUL84 02310000
         S     R1,SPFLAST         CALCULATE RELATIVE POSITION  SS JUL84 02320000
         BZ    ISPATCK2           IF ZERO SKIP REPOSITION      SS JUL84 02330044
         ST    R1,SPFFIXED        SAVE VALUE                   SS JUL84 02340000
         LA    R14,TBSKIP         CONTROLTABLE                 SS JUL84 02350000
         LA    R15,SPFTBL                                      SS JUL84 02360000
         LA    R0,SPFFIXED                                     SS JUL84 02370000
         STM   R14,R0,PARMLIST                                 SS JUL84 02380000
         OI    PARMLIST+08,X'80'                               SS JUL84 02390000
         LA    R1,PARMLIST                                     SS JUL84 02400000
         L     R15,ISPLINK                                     SS JUL84 02410000
         BASR  R14,R15                                         SS JUL84 02420000
         C     R15,ISPL8                                       SS JUL84 02430000
         BH    ISPERR                                          SS JUL84 02440000
ISPATCK2 DS    0H                CHECK POINT TIME              SS JUL84 02450000
         LA    R1,3              PANEL 3                       SS JUL87 02460000
         CH    R1,SPFTBPI        SAME PANEL                    SS JUL87 02470000
         BE    ISPATCK3          YES, CONTINUE                 SS JUL87 02480000
         BAS   R2,ISPSTKI        NO, STACK IT                  SS JUL87 02490000
ISPATCK3 DS    0H                       *                      SS JUL87 02500000
         OI    ##ADRPA#,$A+$D     IGNORE ATTENTION NOW         SS JUL84 02510000
         LA    R15,100            TBDISPL SUPPORT              SS NOV85 02520000
         B     ISPROUT                                         SS NOV85 02530000
ISPATCK5 DS    0H                                              SS NOV85 02540000
         MVC   SPFMSGID,ISPPDSM       SET UP INVALID MESSAGE  ABL DEC84 02550000
         MVI   SPFMSGID+6,C'3'        ADD PANELID             ABL DEC84 02560000
         B     ISPATCK2                                        SS NOV85 02570000
ISPATCK4 DS    0H                                             ABL DEC84 02580000
         BAS   R2,ISPBOTM             REPOSITION FOR NEXT ADD  SS AUG84 02590000
         MVC   SPFSTART,SPFTDTOP      NEXT DISPLAY SAME PLACE  SS AUG84 02600000
         LA    R14,0                                           SS JUL84 02610000
         ST    R14,SPFCKPT        RESET CKPT VALUE            DRK JAN12 02620084
*        STH   R14,SPFCKPT        RESET CKPT VALUE             SS JUL84 02630084
         L     R14,SPFLAST                                     SS JUL84 02640000
         C     R14,SPFCMAX        OVER MAX                     SS OCT88 02650099
         BL    ISPEXIT                                         SS JUL84 02660000
*            CODE TO DELETE OLD OUTPUT IF OVER TABLE MAX       SS JUL84 02670000
         L     R14,SPFCMAX        MAX                          SS OCT88 02680000
         LNR   R14,R14            NEGATIVE .. BACKUP VALUE     SS JUL84 02690000
         ST    R14,SPFFIXE2       SAVE                         SS JUL84 02700000
         A     R14,SPFLAST        CALC DEL AMOUNT              SS JUL84 02710000
         ST    R14,SPFFIXED       SAVE                         SS JUL84 02720000
         L     R1,SPFSTART                                     SS JUL84 02730000
         SR    R1,R14             ADJUST SPFSTART              SS JUL84 02740000
         BP    ISPSTOK            NEGATIVE IS THAT LINE DELETE SS JUL84 02750000
         LA    R1,1               DISPLAY AT LINE 1            SS JUL84 02760000
ISPSTOK  ST    R1,SPFSTART        NEW START LINE VALUE         SS JUL84 02770000
         BAS   R2,ISPDEL          POSITION AND DELETE          SS JUL84 02780000
         BAS   R2,ISPQUERY        NEW TABLE SIZE               SS JUL84 02790000
         B     ISPEXIT                                         SS JUL84 02800000
ISPNWCMD DS    0H                                              SS JUL84 02810000
         BAS   R2,ISPBOTM             REPOSITION FOR NEXT ADD  SS AUG84 02820000
         MVC   SPFSTART,SPFTDTOP      NEXT DISPLAY SAME PLACE  SS AUG84 02830000
         MVC   PMEMCURR(4),PMEMMAX   TERMINATE MEMBER LIST    ABL APR85 02840000
         NI    FLAGSAA,255-FMEM#MEM  TURN OFF MEMBER RANGE     SS JUL84 02850000
         LA    R14,0                                                    02860000
         ST    R14,SPFCKPT        RESET CKPT VALUE            DRK JAN12 02870084
*        STH   R14,SPFCKPT        RESET CKPT VALUE             SS JUL84 02880084
         LM    R1,R8,SPFSAV1                                   SS JUL84 02890000
         L     R14,SPFSAV14                                    SS JUL84 02900000
         BR    R14                ATT RETURN                   SS JUL84 02910000
         TITLE 'P D S  --  ISPF DIALOG PUT GET'                         02920000
*                                                              SS JUL84 02930000
*  DISPLAY OUTPUT FROM LAST CMD .. ASK FOR NEW CMD             SS JUL84 02940000
*                                                              SS JUL84 02950000
ISPPTGET DS    0H                                              SS JUL84 02960000
         LA    R15,172              PUTGET PROCESSOR           SS MAY88 02970000
         B     ISPROUT                  *                      SS MAY88 02980000
         SPACE 2                        *                      SS MAY88 02990000
         TITLE 'P D S  --  ISPF DIALOG SIMPLE FUNCTIONS'                03000000
         SPACE 2                                               SS NOV84 03010000
*ISPOPTT MOVE TO OWN AREA               *                      SS MAY88 03020000
*                                                              SS NOV84 03030000
* PANEL MESSAGE SETUP                                          SS NOV84 03040000
*                                                              SS NOV84 03050000
ISPOPTIV DS    0H                                              SS NOV84 03060000
         MVC   SPFMSGID,ISPPDSM   SET UP INVALID MSG           SS NOV84 03070000
* THE FOLLOWING INST SHOULD USE A VALUE FROM PANEL TABLE ENTRY SS NOV85 03080000
         MVI   SPFMSGID+6,C'1'                                 SS NOV85 03090000
ISPOPTI2 DS    0H                                             ABL JAN87 03100000
         XC    SPFTCCRP,SPFTCCRP    NOT ON A LINE COMMAND     ABL APR86 03110000
         TM    SPFLAG4,SPFFFUN          FROM FUNCTION PROC     SS AUG86 03120000
         BZ    ISPOPTI3                 NO, GOTO ERROR PANEL   SS DEC87 03130000
         L     R14,ISP$FUNA             POINT TO FUNCTION      SS AUG86 03140000
         ST    R14,SPFVTPT              *                      SS AUG86 03150000
         LA    R15,16                   FUNCTION PROCESS       SS AUG86 03160000
         BR    R3                       *                      SS AUG86 03170000
ISPOPTI3 DS    0H                                              SS DEC87 03180000
         LA    R0,0                     DEFAULT PANEL          SS OCT88 03190000
         LA    R15,168                  ERROR PROMPT           SS DEC87 03200000
         B     ISPROUT                  *                      SS DEC87 03210000
         SPACE 3                        *                      SS MAY88 03220000
*  END IS INVALID REQUEST, REPLY REQUIRED                      SS MAY88 03230000
ISPENDIV DS    0H                                             ABL MAR86 03240000
         LA    R15,0                ASSUME END IS VALID       ABL FEB87 03250000
         CLC   SPFMLIN2(6),ISP381A  PROMPT FOR DATA SET NAME? ABL FEB87 03260000
         BER   R3                   YES, BRANCH                SS MAY88 03270000
         MVC   SPFMSGID,ISPPDSM   SET UP INVALID MSG          ABL MAR86 03280000
         MVI   SPFMSGID+6,C'1'                                ABL MAR86 03290000
         MVI   SPFMSGID+7,C'E'    END IS NOT ALLOWED          ABL MAR86 03300000
         MVC   SPFTTOP2,SPFTTOP   NO FREEZE/POSITIONING        SS JUL87 03310000
         XC    SPFTCCRP,SPFTCCRP  NOT ON A LINE COMMAND       ABL APR86 03320000
         LA    R15,100                  *                      SS MAY88 03330000
         BR    R3                                              SS MAY88 03340000
         SPACE 3                                               SS MAY88 03350000
ISPMSGEN DS    0H                                              SS NOV84 03360000
         MVC   SPFMSGID,ISPPDSM   SET UP ENTER OPTION MSG      SS NOV84 03370000
         MVI   SPFMSGID+6,C'9'                                 SS NOV84 03380000
         MVI   SPFMSGID+7,C'E'                                 SS NOV84 03390000
         LA    R15,100                  *                      SS MAY88 03400000
         BR    R3                       *                      SS MAY88 03410000
*        B     ISPDISP4                                        SS MAY88 03420000
         SPACE 2                                               SS NOV84 03430000
ISPROUT  DS    0H                                              SS SEP85 03440000
         LA    R3,*                                            SS SEP85 03450000
         L     R4,ISPRTB(R15)                                  SS NOV84 03460000
         BR    R4                                              SS SEP85 03470000
ISPRTB   DS    0F                                              SS SEP85 03480000
* COMMON FUNCTIONS                                             SS NOV84 03490000
         DC    A(ISPEND)       0    . END COMMAND              SS NOV84 03500000
         DC    A(ISPSUSP)      4    . SUSPEND ISPMODE          SS NOV84 03510000
         DC    A(ISPMISC)      8    . MISC FUNCTIONS (KLEAR)   SS AUG86 03520000
ISPSORTA DC    A(ISPSORT)     12    . SORT TABLE               SS OCT88 03530000
         DC    A(ISPFUNSW)    16    . FUNCTION SWITCH PROCESS  SS AUG86 03540000
         DC    A(ISPCMDCC)    20    . CHECK COMMAND CONTINUE   SS AUG86 03550000
         DC    A(ISPCMDCK)    24    . CHECK COMMAND            SS NOV84 03560000
         DC    A(ISPOPTIV)    28    . OPTION INVALID           SS NOV84 03570000
         DC    A(ISPMSGEN)    32    . PROVIDE ENTER OPTIONS    SS NOV84 03580000
         DC    A(ISPPEND)     36    . PENDING ACT PROCESSOR    SS AUG86 03590000
         DC    A(ISPDISP6)    40    . ISPMODE DISPLAY          SS NOV84 03600000
ISPRCALA DC    A(ISPRCAL)     44    . RECALL                   SS NOV84 03610000
         DC    A(ISPSETP)     48    . PROCESS O COMMAND        SS NOV84 03620000
*                                                              SS NOV84 03630000
* MEMLIST ONLY FUNCTIONS                                       SS NOV84 03640000
*                                                              SS NOV84 03650000
         DC    A(ISPMML)      52    . MEMLIST COMMAND PROC     SS NOV84 03660000
         DC    A(ISPOPTI2)    56    . OPTION INVALID PART 2   ABL JAN87 03670000
         DC    A(0)           60    . RESERVED                 SS NOV85 03680000
         DC    A(ISPLNC2)     64    . MEMLIST LINE CMD PROC    SS NOV84 03690000
*                                                              SS AUG86 03700000
* PROCESS SPECIAL PDS COMMANDS THAT AFFECT THE MEMLIST TABLE   SS AUG86 03710000
*                                                              SS AUG86 03720000
         DC    A(ISPCCF)      68    . CHANGE/COMPRESS/FIXPDS   SS AUG86 03730000
         DC    A(0)           72    . RESERVED                 SS AUG86 03740000
*                                                              SS AUG86 03750000
* MEMLIST ONLY FUNCTIONS                                       SS AUG86 03760000
*                                                              SS AUG86 03770000
         DC    A(0)           76    . RESERVED                 SS AUG86 03780000
         DC    A(ISPCKALI)    80    . ALIAS CHECK              SS AUG86 03790000
         DC    A(ISPCKAL2)    84    . ALIAS CHECK ADD PROCS    SS AUG86 03800000
ISPSUBA  DC    A(ISPSUB)      88    . SUBLIST =MEMLIST        ABL APR86 03810000
*                                                              SS NOV84 03820000
* MORE COMMON FUNCTIONS                                        SS NOV84 03830000
*                                                              SS NOV84 03840000
         DC    A(ISPUTL11)    92    . UT1 COMMAND              SS NOV84 03850000
         DC    A(ISPFIND)     96    . FIND                     SS NOV84 03860000
         DC    A(ISPTBDSP)   100    . COMMON TABLE DISPLAY     SS NOV84 03870000
         DC    A(ISPOPTT)    104    . PROCESS OPTION           SS SEP85 03880000
         DC    A(ISPREPLY)   108    . RETURN PDS REPLY         SS NOV85 03890000
         DC    A(ISPCMDC)    112    . COMMON COMMAND EXIT      SS NOV85 03900000
*                                                              SS NOV85 03910000
* CHECK POINT PROCESSING                                       SS NOV85 03920000
*                                                              SS NOV85 03930000
         DC    A(ISPNWCMD)   116    . TERMINATE COMMAND        SS NOV85 03940000
         DC    A(ISPATCK4)   120    . CONTINUE COMMAND         SS NOV85 03950000
         DC    A(ISPATCK5)   124    . INVALID                  SS NOV85 03960000
*                                                              SS NOV84 03970000
* MORE COMMON FUNCTIONS                                        SS NOV84 03980000
*                                                              SS NOV84 03990000
         DC    A(ISPCCF)     128    . CHANGE/COMPRESS/FIXPDS   SS NOV85 04000000
         DC    A(ISPUNSTK)   132    . UNSTACK PANEL            SS NOV84 04010000
         DC    A(ISPMEMG)    136    . MEMLIST GROUP            SS NOV85 04020000
         DC    A(ISPDISPT)   140    . OUTPUT TABLE             SS NOV85 04030000
*                                                              SS NOV84 04040000
* LISTA/LISTV FUNCTIONS                                        SS NOV84 04050000
*                                                              SS NOV84 04060000
         DC    A(ISPLISTA)   144    . LISTA NEW/REPEAT         SS NOV84 04070000
         DC    A(ISPLISTV)   148    . LISTV NEW/UPDATE         SS NOV85 04080000
         DC    A(ISPLAVL)    152    . LISTA/V LINE CMDS        SS NOV85 04090000
*                                                              SS NOV84 04100000
* MORE COMMON FUNCTIONS                                        SS NOV84 04110000
*                                                              SS NOV84 04120000
         DC    A(ISPCLXL)    156    . COMMON LINE CMD EXT      SS JUL87 04130045
         DC    A(ISPENDIV)   160    . INVALID END MESSAGE      SS AUG86 04140000
         DC    A(ISPOPTIV)   164    . UNUSED                   SS MAY88 04150000
         DC    A(ISPVERR)    168    . PROMPT FOR INVALID CMD   SS DEC87 04160000
         DC    A(ISPPTGT0)   172    . PUTGET PROCESSOR         SS MAY88 04170000
         DC    A(ISPLISTC)   176    . LISTC/LISTF FUNCTION     SS OCT88 04180000
         DC    A(ISPTCT)     180    . TCT FUNCTION             SS NOV88 04190000
         DC    A(ISPTCTAD)   184    . TCT ADD/INSERT LINES     SS NOV88 04200000
         DC    A(ISPCAX)     188    . CAX FUNCTION             SS NOV88 04210000
ISPVIEWA DC    A(ISPVIEW)    192    . VIEW LOG FUNCTION        SS NOV88 04220000
         DC    A(ISPOPTIV)   196    . UNUSED                   SS AUG89 04230000
         DC    A(ISPOPTIV)   200    . UNUSED                   SS AUG89 04240000
         DC    A(ISPOPTIV)   204    . UNUSED                   SS AUG89 04250000
         DC    A(ISPCLZL)    208    . UNUSED                   SS AUG89 04260000
         SPACE 2                                               SS NOV84 04270000
*   REPLY PROCESSING                                           SS NOV85 04280000
ISPREPLY DS    0H                                              SS NOV85 04290000
         LA    R1,0                 POP PANEL                  SS NOV85 04300000
         BAS   R2,ISPSTKI           UNSTACK                    SS NOV85 04310000
         OI    SPFLAG3,SPFLOGM      LOG THE COMMAND            SS NOV85 04320000
         LA    R15,112              ROUTE TO ISPCMDC           SS NOV85 04330000
         CLC   SPFMLIN2(6),ISP381A  PROMPT FOR DATA SET NAME  ABL APR86 04340000
         BE    ISPREP4              YES, BRANCH               ABL APR86 04350000
         CLC   SPFMLIN2(5),ISP390A  PROMPT FOR YES/NO ?       ABL JUN86 04360000
         BNER  R3                   NO, BRANCH                ABL APR86 04370000
         CLI   SPFNAMEH,C'Y'        VALID REPLY?              ABL APR86 04380000
         BE    ISPREP4              YES, DO NOT FREEZE        ABL JUN86 04390000
         CLI   SPFNAMEH,C'N'        VALID REPLY?              ABL APR86 04400000
         BNER  R3                   NO, BRANCH                ABL APR86 04410000
ISPREP4  OI    SPFLAG2,SPFNPOS      YES, NO FREEZE/POSITION   ABL APR86 04420000
         BR    R3                                              SS NOV85 04430000
         SPACE  2                                              SS NOV85 04440000
ISPENDTB DS    0H                                              SS NOV85 04450000
ISPUNSTK DS    0H                                              SS NOV85 04460000
* FUNCTION MOVE TO FUNCTION CMD ROUTINE                        SS NOV85 04470000
         SPACE 2                        *                      SS AUG86 04480000
*  PROCESS SELECTION FOR PENDING FUNCTIONS                     SS AUG86 04490000
ISPPEND  DS    0H                       *                      SS AUG86 04500000
         TM    SPFTBPF1,SPFTRET    THIS HAVE RETURN PROCESSING SS NOV85 04510000
         BO    ISPPEND2            NO, DISPLAY THIS PANEL      SS AUG86 04520000
         TM    SPFTBPF1,SPFTLIN    THIS HAVE LINE CMDS         SS NOV85 04530000
         BZ    ISPPEND3            NO, DISPLAY THIS PANEL      SS MAY88 04540000
         TM    SPFTFLG1,SPFTLCD    LINE CMD ACTIVE             SS NOV85 04550000
         BZ    ISPPEND3            NO, DISPLAY THIS PANEL      SS MAY88 04560000
         LH    R15,SPFTBPLF        GET LINE PROC FUNC CODE     SS NOV85 04570000
         BR    R3                  RETURN TO ROUTER            SS NOV85 04580000
ISPPEND2 DS    0H                                              SS AUG86 04590000
         NI    SPFTBPF1,255-SPFTRET  ONLY ONCE                 SS NOV85 04600000
         SR    R15,R15                                         SS NOV85 04610000
         IC    R15,SPFTPOSI        GET POST PROC INDEX         SS NOV85 04620000
         BR    R3                  RETURN TO ROUTER            SS NOV85 04630000
ISPPEND3 DS    0H                       *                      SS MAY88 04640000
         LA    R15,100             DISPLAY PANELS              SS MAY88 04650000
         BR    R3                       *                      SS MAY88 04660000
         SPACE 2                                               SS NOV85 04670000
*   SET UP END COMMAND AND SAY BYBY     *                      SS AUG86 04680000
ISPEND   MVC   PUTGETBF(13),ISPENDIT END COMMAND INTO BUFFER   SS JUL84 04690000
         MVC   PMEMCURR(4),PMEMMAX   TERMINATE MEMBER LIST    ABL APR85 04700000
         NI    FLAGSAA,255-FMEM#MEM  TURN OFF MEMBER RANGE     SS JUL84 04710000
         B     ISPCLN                                          SS JUL84 04720000
         SPACE 2                                               SS NOV85 04730000
*   SET UP DSN COMMAND AND SET SUSPEND  *                      SS AUG86 04740000
ISPSUSP  MVC   PUTGETBF(13),ISPDSNMG DSN COMMAND INTO BUFFER   SS JUL84 04750000
         NI    SPFLAG0,255-SPFDON    TURN DIALOG DISPLAY OFF   SS JUL84 04760000
         OI    SPFLAG0,SPFDSUSP      SUSPEND BIT ON            SS JUL84 04770000
         TM    SPFTBPF2,SPFTREP      REPLY PANEL?             ABL APR86 04780000
         BNO   ISPSUSP2              NO, BRANCH               ABL APR86 04790000
         LA    R1,0                  POP PANEL                ABL APR86 04800000
         BAS   R2,ISPSTKI            UNSTACK                  ABL APR86 04810000
ISPSUSP2 DS    0H                                             ABL APR86 04820000
         BAS   R2,ISPUSTKM        UNSTACK                      SS NOV85 04830000
         LH    R1,SPFFUNLP              SWAP TO LOG            SS AUG86 04840000
         LNR   R1,R1                    SWAP INDICATION        SS AUG86 04850036
         BAS   R2,ISPSTKI               DO IT                  SS AUG86 04860000
         BAS   R2,ISPCTLSM                                     SS MAR85 04870000
         B     ISPEXIT                                         SS JUL84 04880000
         SPACE 3                                               SS NOV84 04890000
*                                                              SS MAR85 04900000
*   FORMAT UT1 COMMAND                                         SS MAR85 04910000
*                                                              SS MAR85 04920000
ISPUTL11 DS    0H                                              SS MAR85 04930000
         MVC   PUTGETBF(4),ISPCMD21                            SS MAR85 04940000
         MVC   SPFINPUT(8),$UT1   COPY CMD NAME                SS MAR85 04950000
*        MVC   SPFINPUT+08(5),ISPUTDOT INSERT LITERAL UT.     ABL FEB86 04960000
         TM    $TLF2(R14),#R       IS REAL COMMAND HERE        SS MAR85 04970000
         BO    ISPUTL41            YES, USE AFTER UT.          SS MAR85 04980000
         LA    R15,$TLCM(R14)      COMMAND NAME                SS JUL85 04990000
         B     ISPUTL51            USE IT                      SS MAR85 05000000
ISPUTL41 DS    0H                                              SS MAR85 05010000
         SR    R15,R15             CLEAR FOR INSERT            SS MAR85 05020000
         IC    R15,$TLEX(R14)      GET OFFSET OF REAL CMD      SS MAR85 05030000
         LA    R15,ISPREAL(R15)    GET ADDRESS                 SS MAR85 05040000
ISPUTL51 DS    0H                                              SS MAR85 05050000
         MVC   SPFINPUT+08(4),0(R15) INSERT 4 CHAR OF CMD     ABL FEB86 05060000
ISPUTL71 DS    0H                                              SS MAR85 05070000
         LA    R15,24              TO CMDCK                    SS NOV85 05080000
         B     ISPROUT             USE ROUTER                  SS NOV85 05090000
         SPACE 3                                               SS NOV84 05100000
*                                                              SS NOV84 05110000
*  MEMLIST ADD LINE FUNCTION                                   SS JUL84 05120000
*                                                              SS JUL84 05130000
ISPMEML  DS    0H                                              SS SEP84 05140000
         L     R4,MEMLFUNA        GET MEMLIST SUB              SS NOV85 05150000
         BASR  R3,R4                                           SS NOV85 05160000
         TM    FLAGSII,FMEMLIST   IF/FIND .. THEN(MEMLIST)?   ABL APR86 05170000
         BNO   ISPEXIT            NO, BRANCH                  ABL APR86 05180000
         MVI   SPFLAG1,0          TURN OFF FUNCTION           ABL APR86 05190000
         L     R8,=V(SUBLIST)     INVOKE                      ABL APR86 05200000
         BR    R8                       SUBLIST               ABL APR86 05210000
         SPACE 2                                               SS SEP84 05220000
*                                                              SS NOV84 05230000
*  SUPPORT REQUEST  SELECT PANEL DISPLAY (SUBCOMMANDS UT1,UT2) SS NOV84 05240000
*                                                              SS NOV84 05250000
ISPPNSUP DS    0H                                              SS NOV84 05260000
         MVI   SPFVZCMD,C' '                                   SS NOV84 05270000
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS NOV84 05280000
         LH    R15,SPFZLEN        GET LENG                     SS NOV84 05290000
         LTR   R15,R15            ZERO                         SS NOV84 05300000
         BZ    ISPPNSU3                                        SS NOV84 05310000
         BCTR  R15,0              LESS 1 MVC                   SS NOV84 05320000
         L     R14,SPFZDATA       PASSED ZCMD DATA             SS NOV84 05330000
ISPPNSU4 MVC   SPFVZCMD(0),0(R14)                              SS NOV84 05340000
         EX    R15,ISPPNSU4       COPY TO CMD FROM INPUT       SS NOV84 05350000
         BAS   R2,ISPFIRST        CHECK FOR ANY REAL DATA      SS NOV84 05360000
         LTR   R15,R15            CHECK RETURN ADDRESS/RC      SS MAR85 05370000
         BZ    ISPPNSU3           ALL BLANK                    SS MAR85 05380000
ISPPNSU2 DS    0H                                              SS NOV84 05390000
         OI    SPFLAG4,SPFNOND       INVOKE PANEL NON-DISPLAY  SS AUG85 05400000
ISPPNSU3 DS    0H                                              SS NOV84 05410000
         BAS   R2,ISPSETVI                                     SS NOV85 05420000
         MVC   SPFPANT2(12),SPFPANT  SAVE ISPMODE PAN SUPPORT  SS NOV84 05430000
         MVC   SPFPSTK2(8),SPFSAVP2  GET PASSED PANEL NAME     SS AUG85 05440000
         MVC   SPFMEMB,SPFSAVM2   GET PASSED MEMBER NAME       SS AUG85 05450000
         LA    R1,SPFPSTK2                                     SS NOV84 05460000
         ST    R1,SPFPANT                                      SS NOV84 05470000
         ST    R1,SPFPANC                                      SS NOV84 05480000
         LA    R1,SPFPSTKE                                     SS NOV84 05490000
         ST    R1,SPFPANB2                                     SS NOV84 05500000
         BAS   R2,ISPPANDI                                     SS NOV85 05510000
         MVC   SPFPANT(12),SPFPANT2  RESTORE ISPMODE PAN SUPPO SS NOV84 05520040
         LA    R1,SPFZSEL                                      SS NOV84 05530000
         ST    R1,SPFSAV1         RETURN DATA                  SS SEP84 05540000
         B     ISPEXIT                                         SS SEP84 05550000
*                                                              SS APR89 05560000
*  SUPPORT REQUEST  SINGLE PANEL DISPLAY                       SS APR89 05570000
*                                                              SS APR89 05580000
*        SPFSAVP2  = PANEL NAME         *                      SS APR89 05590099
*        SPFZLEN   = LENGTH OF DISPLAY DATA                    SS APR89 05600000
*        SPFZDATA  = ADDRESS OF DISPLAY DATA                   SS APR89 05610000
*        R1 ON RETURN = ADDRESS OF RETURNED DATA               SS APR89 05620000
*        SPFZRC = DISPLAY RETURN CODE   *                      SS APR89 05630000
*                                       *                      SS APR89 05640000
ISPPN1I  DS    0H                                              SS APR89 05650000
         MVI   SPFVZCMD,C' '                                   SS APR89 05660000
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS APR89 05670000
         MVI   SPFZSEL,C' '                                    SS APR89 05680000
         MVC   SPFZSEL+1(249),SPFZSEL                          SS APR89 05690000
         LH    R15,SPFZLEN        GET LENG                     SS APR89 05700000
         LTR   R15,R15            ZERO                         SS APR89 05710000
         BZ    ISPPN1I3                                        SS APR89 05720000
         BCTR  R15,0              LESS 1 MVC                   SS APR89 05730000
         L     R14,SPFZDATA       PASSED ZCMD DATA             SS APR89 05740000
ISPPN1I4 MVC   SPFZSEL(0),0(R14)                               SS APR89 05750000
         EX    R15,ISPPN1I4       COPY TO CMD FROM INPUT       SS APR89 05760000
ISPPN1I3 DS    0H                                              SS APR89 05770000
         BAS   R2,ISPSETVI                                     SS APR89 05780000
         L     R1,SPFZCURO        GET PASSED OFFSET            SS APR89 05790000
         ST    R1,SPFCURSO              *                      SS APR89 05800000
         MVC   SPFCURNM,ISPPN1I8  SET TO PDSZSEL               SS APR89 05810000
         LA    R1,ISPBLK8         NO MESSAGE                   SS APR89 05820000
         LA    R15,SPFSAVP2       PANEL NAME                   SS APR89 05830000
         BAS   R2,ISPSINGI                                     SS APR89 05840000
         ST    R15,SPFZRC               *                      SS APR89 05850000
         SR    R1,R1                    *                      SS APR89 05860000
         ST    R1,SPFZCURO        RESET CURSOR OFFSET          SS APR89 05870000
         LA    R1,SPFZSEL                                      SS APR89 05880000
         ST    R1,SPFSAV1         RETURN DATA                  SS APR89 05890000
         B     ISPEXIT                                         SS APR89 05900000
ISPPN1I8 DC    CL8'PDSZSEL'             *                      SS APR89 05910000
*                                                              SS MAY89 05920000
*  SUPPORT REQUEST  SUBLIST = MEMBLIST                         SS MAY89 05930000
*                                                              SS MAY89 05940000
ISPSUBTR DS    0H                       *                      SS MAY89 05950000
         L     R0,ISPSUBA               *                      SS MAY89 05960000
         BAS   R2,ISPSUBI               *                      SS MAY89 05970000
         B     ISPEXIT                  *                      SS MAY89 05980000
*                                                              SS NOV84 05990000
*  SUPPORT REQUEST  SETUP ISPF CMD TO EXECUTE NEXT FROM PUTGET SS NOV84 06000000
*                                                              SS NOV84 06010000
ISPICMD  DS    0H                                              SS JUL87 06020000
         L     R1,SPFSEC4A         GET  BASE                   SS MAY88 06030000
         LA    R1,SPFICMDS-SPFSEC4K(,R1)  POINT TO SPFICMDS    SS MAY88 06040000
         MVI   0(R1),C' '         BLANK FIRST                  SS MAY88 06050000
         MVC   1(249,R1),0(R1)          RIPPLE                 SS JUL87 06060000
         LH    R14,SPFZLEN        GET LENG                     SS JUL87 06070000
         LTR   R14,R14            ZERO                         SS JUL87 06080000
         BZ    ISPICMD3                                        SS JUL87 06090000
         BCTR  R14,0              LESS 1 MVC                   SS JUL87 06100000
         L     R15,SPFZDATA       PASSED ZCMD DATA             SS JUL87 06110000
ISPICMD4 MVC   0(0,R1),0(R15)     EXECUTED MOVE                SS MAY88 06120046
         EX    R14,ISPICMD4       COPY TO CMD FROM INPUT       SS JUL87 06130000
         BAS   R2,ISPCKBLK        CHECK FOR ANY REAL DATA      SS JUL87 06140000
         LTR   R15,R15            CHECK RETURN ADDRESS/RC      SS JUL87 06150000
         BZ    ISPICMD3           ALL BLANK                    SS JUL87 06160000
         OI    SPFLAG5,SPFICMD    FLAG FOR ACTION              SS JUL87 06170000
ISPICMD3 DS    0H                       *                      SS JUL87 06180000
         B     ISPEXIT                  *                      SS JUL87 06190000
         TITLE 'P D S  --  ISPF DIALOG LV2 SUBROUTINES'                 06200000
         COPY  @DIAORG                  *                      SS OCT88 06210000
*                                                              SS JUL84 06220000
*    INTERFACE TO RESTART2                                     SS AUG86 06230000
*                                                              SS JUL84 06240000
ISPREST2 DS    0H                       *                      SS AUG86 06250000
         STM   R2,R4,SPFRS2SV           SAVE REGISTER FOR RTN  SS AUG86 06260000
         OI    SPFLAG4,SPFRST2          FLAG RESTART2          SS AUG86 06270000
         B     RESTART2                 UPDATE DSN             SS AUG86 06280000
*  AT RETURN AT ISPOPT, FLAG WILL CAUSE BRANCH TO HERE         SS AUG86 06290000
ISPREST3 DS    0H                                              SS AUG86 06300000
         LM    R2,R4,SPFRS2SV           SAVE REGISTER FOR RTN  SS AUG86 06310000
         NI    SPFLAG4,255-SPFRST2      RESET FLAG             SS AUG86 06320000
         BR    R2                       GO BACK TO CALLER      SS AUG86 06330000
* ISPLINK INTERFACE SUBROUTINES                                SS AUG86 06340000
ISPSXEQ  DS    0H                                              SS JUL87 06350000
         LA    R1,PARMLIST                                     SS JUL87 06360000
         L     R15,ISPLINK                                     SS JUL87 06370000
         BR    R15                                             SS JUL87 06380000
ISPSXEQ0 DS    0H                                              SS MAR85 06390000
         LA    R1,PARMLIST                                     SS JUL84 06400000
         L     R15,ISPLINK                                     SS JUL84 06410000
         BASR  R14,R15                                         SS JUL84 06420000
         LTR   R15,R15                                         SS JUL84 06430000
         BNZ   ISPERR                                          SS JUL84 06440000
         BR    R2                                              SS SEP84 06450000
ISPSXEQ8 DS    0H                                              SS MAR85 06460000
         LA    R1,PARMLIST                                     SS JUL84 06470000
         L     R15,ISPLINK                                     SS JUL84 06480000
         BASR  R14,R15                                         SS JUL84 06490000
         C     R15,ISPL8                                       SS JUL84 06500000
         BH    ISPERR                                          SS JUL84 06510000
         BR    R2                 RETURN                       SS JUL84 06520000
         SPACE 1                                              ABL SEP84 06530000
*                                                              SS JUL84 06540000
*  VDEFINE SUPPORT SUBROUTINE: BEFORE ENTRY SET:               SS JUL84 06550000
*  R14=ADDR OF VARIABLE NAME                                   SS JUL84 06560000
*  R15=ADDR OF VARIABLE                                        SS JUL84 06570000
*  R1 =ADDR OF VARIABLE LENGTH                                 SS JUL84 06580000
*                                                              SS JUL84 06590000
ISPVDEF  DS    0H                                              SS SEP84 06600000
         LA    R0,ISPCHAR                                      SS SEP84 06610000
         STM   R14,R1,PARMLIST+4                               SS JUL84 06620000
         OI    PARMLIST+16,X'80'                               SS JUL84 06630000
         LA    R14,VDEFINE         START VDEFINES              SS JUL84 06640000
         ST    R14,PARMLIST                                    SS JUL84 06650000
         B     ISPSXEQ0                                        SS MAR85 06660000
         SPACE 2                                               SS SEP84 06670000
*  VDEFINE EXTENDED SUPPORT                                             06680000
*  R1 ADDR OF A DEFINE  CNTL AND LIST AS FOLLOWS               SS NOV85 06690000
*  CNTL BYTE OFFSET, HALF WORD                                 SS NOV85 06700000
*  CNTL BIT  (BIT WITHIN BYTE)                                 SS NOV85 06710000
*  OPTION BYTE                                                 SS AUG86 06720000
*       X'80'    NUMERIC VARIABLE       *                      SS AUG86 06730000
*       X'01'    VARIABLE IN #MDSECT (WORKAREA)                SS AUG86 06740000
*  REPEATED ENTRIES AS FOLLOWS:                                SS NOV85 06750000
* ADDR OF VARIABLE NAME OR NAME LIST , FULL WORD               SS NOV85 06760000
* OFFSET TO STORAGE FOR VARIABLE(S)  , HALF WORD               SS NOV85 06770000
* LENGTH OF THE VARIABLE             , HALF WORD               SS NOV85 06780000
* X'FF' TO END LIST                                            SS NOV85 06790000
*                                                              SS AUG86 06800000
*   CURRENT CONTROL BIT ASSIGNMENTS                            SS AUG86 06810000
*   OFFSET,HEX   ASSIGNMENT                                    SS AUG86 06820000
*        0,80    DIALOG INITIALIZATION                         SS AUG86 06830000
*        0,40    DISPLAY PANEL SUPPORT INIT                    SS AUG86 06840000
*        0,20    MEMLIST SUPPORT                               SS AUG86 06850000
*        0,10    LISTA SUPPORT                                 SS AUG86 06860000
*        0,08    LISTV SUPPORT                                 SS AUG86 06870000
*        0,04    SECONDARY DIALOG INIT (#MDSECT AREA)          SS AUG86 06880000
*        0,02    LISTC/LISTF SUPPORT                           SS OCT88 06890000
*        0,01    TCT SUPPORT                                   SS OCT88 06900000
*        1,80    CAX SUPPORT                                   SS OCT88 06910000
*        1,40    FILTER SUPPORT                                SS OCT88 06920000
*        1,20    CSECT  SUPPORT                                SS OCT88 06930000
*        1,10    TRAP   SUPPORT                                SS NOV88 06940000
*                                       *                      SS AUG86 06950000
ISPVDEFX DS    0H                                              SS NOV85 06960000
         LH    R14,0(R1)           GET CNTL BYTE OFFSET        SS NOV85 06970000
         LA    R14,SPFVFLGS(R14)   CALC ADDR OF CNTL BYTE      SS NOV85 06980000
         IC    R15,2(R1)           GET CNTL BIT                SS NOV85 06990000
         EX    R15,ISPVTM          IS BIT ALREADY SET          SS NOV85 07000000
         BOR   R2                  YES SKIP IT                 SS NOV85 07010000
         EX    R15,ISPVOI          SET THE BIT                 SS NOV85 07020000
         MVC   SPFTSVX(1),3(R1)    SAVE OPTION BYTE            SS AUG86 07030000
         LA    R14,VDEFINE         START VDEFINES              SS NOV85 07040000
         ST    R14,PARMLIST                                    SS NOV85 07050000
         TM    SPFTSVX,X'80'       NUMERIC                     SS AUG86 07060000
         BZ    ISPVDEFC            NO                          SS AUG86 07070000
         LA    R15,ISPFIX               *                      SS AUG86 07080000
         B     ISPVDEF2                 *                      SS AUG86 07090000
ISPVDEFC DS    0H                       *                      SS AUG86 07100000
         LA    R15,ISPCHAR         THIS ROUTINE ONLY FOR CHAR  SS NOV85 07110000
ISPVDEF2 DS    0H                       *                      SS AUG86 07120000
         LA    R0,PARMLIST+20      WHERE LENGTH IS STORED      SS NOV85 07130000
         STM   R15,R0,PARMLIST+12                              SS NOV85 07140000
         LA    R1,4(R1)            FIRST ENTRY IN LIST         SS NOV85 07150000
ISPVLOOP DS    0H                                              SS NOV85 07160000
         CLI   0(R1),X'FF'         END OF LIST                 SS NOV85 07170000
         BER   R2                  ALL DONE                    SS NOV85 07180000
         MVC   PARMLIST+4(4),0(R1) COPY VAR NAME ADDR          SS NOV85 07190000
         LH    R14,4(R1)           GET OFFSET                  SS NOV85 07200000
         TM    SPFTSVX,X'01'       IN WORKAREA                 SS AUG86 07210000
         BZ    ISPVDEF3                 *                      SS AUG86 07220000
         LA    R14,WORKAREA(R14)   CALC ADDR                   SS AUG86 07230000
         B     ISPVDEF4                 *                      SS AUG86 07240000
ISPVDEF3 DS    0H                       *                      SS AUG86 07250000
         LA    R14,SPWRKC(R14)     CALC ADDR                   SS NOV85 07260000
ISPVDEF4 DS    0H                       *                      SS AUG86 07270000
         ST    R14,PARMLIST+8                                  SS NOV85 07280000
         LH    R0,6(R1)            GET LENGTH                  SS NOV85 07290000
         TM    SPFTSVX,X'80'       NUMERIC                     SS AUG86 07300000
         BZ    *+8                 NO                          SS AUG86 07310000
         LA    R0,4                SET TO 4                    SS AUG86 07320000
         ST    R0,PARMLIST+20      PUT LENGTH HERE             SS NOV85 07330000
         OI    PARMLIST+16,X'80'                               SS NOV85 07340000
         ST    R1,PARMLIST+24      SAVE R1                     SS NOV85 07350000
         LA    R1,PARMLIST                                     SS JUL84 07360000
         L     R15,ISPLINK                                     SS JUL84 07370000
         BASR  R14,R15                                         SS JUL84 07380000
         LTR   R15,R15                                         SS JUL84 07390000
         BNZ   ISPERR                                          SS JUL84 07400000
         L     R1,PARMLIST+24      RESTORE R1                  SS NOV85 07410000
         LA    R1,8(,R1)           NEXT ENTRY                  SS NOV85 07420000
         B     ISPVLOOP                                        SS NOV85 07430000
ISPVTM   TM    0(R14),0            <<EXECUTED>>                SS NOV85 07440000
ISPVOI   OI    0(R14),0            <<EXECUTED>>                SS NOV85 07450000
         SPACE 2                                               SS SEP84 07460000
*            CODE TO POSITION TO FIRST NON BLANK IN INPUT      SS JUL84 07470000
ISPFIRST DS    0H                                              SS SEP84 07480000
         LA    R15,SPFVZCMD           START OF ZCMD            SS NOV84 07490000
         LA    R14,48                 INPUT SIZE               SS JUL84 07500000
ISPCKBLK CLI   0(R15),C' '            BLANK                    SS JUL84 07510000
         BNE   ISPNONBL                                        SS JUL84 07520000
         LA    R15,1(,R15)            NEXT CHAR                SS JUL84 07530000
         BCT   R14,ISPCKBLK                                    SS JUL84 07540000
         SR    R15,R15                ERROR                    SS JUL84 07550000
         BR    R2                                             DRK JAN13 07560099
ISPNONBL DS    0H                                              SS JUL84 07570000
         CLI   0(R15),0               NULL CHAR                SS AUG86 07580000
         BNER  R2                     NO, REAL FIRST NONBLK    SS AUG86 07590000
         SR    R15,R15                END OF DATA              SS AUG86 07600000
         BR    R2                                              SS SEP84 07610000
         SPACE 2                                               SS SEP84 07620000
*            CODE TO POSITION DATA AFTER PERIOD                SS NOV84 07630000
ISPSHCMD DS    0H                                              SS NOV84 07640000
         LA    R15,SPFVZCMD           START OF ZCMD            SS NOV84 07650000
         LA    R14,240                INPUT SIZE               SS OCT88 07660000
ISPSHBLK CLI   0(R15),C' '            BLANK                    SS NOV84 07670000
         BNE   ISPSHBL2                                        SS NOV84 07680000
         LA    R15,1(,R15)            NEXT CHAR                SS NOV84 07690000
         BCT   R14,ISPSHBLK                                    SS NOV84 07700000
         SR    R15,R15                ERROR                    SS NOV84 07710000
         BR    R2                                             ABL JAN87 07720000
ISPSHBL2 CLI   0(R15),C' '            BLANK                    SS NOV84 07730000
         BE    ISPSHBL3                                        SS NOV84 07740000
         CLI   0(R15),C'.'            PERIOD                   SS NOV84 07750000
         BE    ISPSHPRD                                        SS NOV84 07760000
         LA    R15,1(,R15)            NEXT CHAR                SS NOV84 07770000
         BCT   R14,ISPSHBL2                                    SS NOV84 07780000
ISPSHBL3 DS    0H                                              SS NOV84 07790000
         MVI   SPFVZCMD,C' '          BLANK                    SS NOV84 07800000
         MVC   SPFVZCMD+1(249),SPFVZCMD  RIPPLE                SS NOV84 07810000
         BR    R2                                              SS NOV84 07820000
ISPSHPRD DS    0H                                              SS NOV84 07830000
         LA    R15,1(,R15)                                     SS NOV84 07840000
         LA    R1,SPFVZCMD+250                                 SS NOV84 07850000
         SR    R1,R15                                          SS NOV84 07860000
ISPSHR2  MVC   SPFVZCMD(0),0(R15)     SHIFT BACK               SS NOV84 07870000
         EX    R1,ISPSHR2                                      SS NOV84 07880000
         LA    R15,SPFVZCMD(R1)                                SS NOV84 07890000
         LA    R1,SPFVZCMD+250                                 SS NOV84 07900000
         SR    R1,R15                                          SS NOV84 07910000
         MVI   0(R15),C' '                                     SS NOV84 07920000
         BCTR  R1,0                                            SS NOV84 07930000
         BCTR  R1,0                                            SS NOV84 07940000
ISPSHR3  MVC   1(0,R15),0(R15)                                 SS NOV84 07950000
         EX    R1,ISPSHR3                                      SS NOV84 07960000
         BR    R2                                              SS SEP84 07970000
         SPACE 2                                               SS SEP84 07980000
*  CODE TO FIND CHAR MATCH                                     SS MAR85 07990000
ISPCLI   DS    0H                                              SS MAR85 08000000
ISPCLILP EX    R1,ISPCLI0         USE CHAR IN R1 FOR COMPARE   SS MAR85 08010000
         BER   R2                 DONE IF EQU .. RETURN        SS MAR85 08020000
         LA    R15,1(,R15)        NEXT CHAR                    SS MAR85 08030000
         BCT   R14,ISPCLILP       CHARS LEFT COUNT DOWN        SS MAR85 08040000
         SR    R15,R15            RETURN 0 IF NONE FOUND       SS MAR85 08050000
         BR    R2                                              SS MAR85 08060000
ISPCLI0  CLI   0(R15),0           <<EXECUTED>>                 SS MAR85 08070000
         SPACE 2                                               SS MAR85 08080000
*  CODE TO FIND CHAR MATCH WORKING BACKWARD                    SS MAR85 08090000
ISPCLIB  DS    0H                                              SS MAR85 08100000
ISPCLIL2 EX    R1,ISPCLI0         USE CHAR IN R1 FOR COMPARE   SS MAR85 08110000
         BER   R2                 DONE IF EQU .. RETURN        SS MAR85 08120000
         BCTR  R15,0              NEXT CHAR BACK               SS MAR85 08130000
         BCT   R14,ISPCLIL2       CHARS LEFT COUNT DOWN        SS MAR85 08140000
         SR    R15,R15            RETURN 0 IF NONE FOUND       SS MAR85 08150000
         BR    R2                                              SS MAR85 08160000
         SPACE 2                                               SS MAR85 08170000
*                                       *                      SS AUG86 08180000
*  SET CURRENT FUNCTION STATUS          *                      SS AUG86 08190000
*       REGISTERS ON RETURN             *                      SS AUG86 08200000
*         R1  FUNCTION INDEX            *                      SS AUG86 08210000
*         R14 ADDRESS OF LAST PANEL     *                      SS AUG86 08220000
*         R15 ADDRESS OF STATUS FLAG  (I.E. I, A, P)           SS AUG86 08230000
*                                       *                      SS AUG86 08240000
ISPSETST DS    0H                       *                      SS AUG86 08250000
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88 08260000
         LH    R1,SPFTBPFI              FUNCTION INDEX         SS AUG86 08270000
         LA    R15,SPFFUNST(R1)         ADDRESS OF FLAG        SS AUG86 08280000
         MVI   0(R15),C'I'              ASSUME INACTIVE        SS AUG86 08290000
         TM    SPFTFLG1,SPFTACT         ACTIVE TABLE           SS AUG86 08300000
         BZR   R2                       NO, DONE               SS AUG86 08310000
         LA    R14,0(R1,R1)             INDEX TIMES TWO        SS AUG86 08320000
         LA    R14,SPFFUNLP(R14)        LAST PANEL ENTRY       SS AUG86 08330000
         MVC   0(2,R14),SPFTBPI         COPY PANEL INDEX       SS AUG86 08340000
         MVC   SPFTPANL(2),SPFTBPI      ALSO SAVE HERE         SS OCT88 08350000
         MVI   0(R15),C'A'              ASSUME ACTIVE          SS AUG86 08360000
         TM    SPFTFLG1,SPFTLCD         LINE CMDS ACTIVE       SS AUG86 08370000
         BZR   R2                       NO, DONE               SS AUG86 08380000
         MVI   0(R15),C'P'              SET PENDING            SS AUG86 08390000
         BR    R2                       DONE                   SS AUG86 08400000
         SPACE 2                        *                      SS AUG86 08410000
ISPCREF  DS    0H                                              SS NOV84 08420000
* CONTROL DISPLAY SESSION MGR  (REFRESH)                       SS MAR85 08430000
ISPCTLSM DS    0H                                              SS AUG85 08440000
*        BR    R2                         ***TEST             ABL JAN87 08450000
         LA    R14,ISPCNTL                FIRST PARAMETER      SS AUG86 08460000
         LA    R15,ISPDSP                 SECOND PARAMETER     SS AUG86 08470000
         LA    R0,ISPSM                   THIRD PARAMETER      SS AUG86 08480000
         LA    R1,=F'1'                   FOURTH PARAMETER     SS AUG86 08490000
         TM    SPFDEFT1,SPFDSM1         DEFAULT  SM LINE 1     SS AUG86 08500000
         BO    *+8                      YES, SKIP              SS AUG86 08510000
         LA    R1,=F'0'                 ISPF DEFAULT (BOT -3) DRK JAN13 08520099
         STM   R14,R1,PARMLIST            SAVE ADDRESSES       SS AUG86 08530000
         OI    PARMLIST+12,X'80'          LAST                ABL SEP84 08540000
         LA    R1,PARMLIST                    PARAMETER       ABL SEP84 08550000
         L     R15,ISPLINK                                    ABL SEP84 08560000
         BASR  R14,R15                    LET SPF KNOW        ABL SEP84 08570000
         LTR   R15,R15                                         SS JUL84 08580000
         BNZ   ISPERR                                          SS JUL84 08590000
         NI    SPFLAG3,255-SPFREFR                             SS NOV84 08600000
         BR    R2                                              SS NOV84 08610000
         SPACE 2                                               SS SEP84 08620000
* RECORD TCTLIN AND TCTLOUT COUNTS                            ABL JAN87 08630000
REFSAVE  L     R1,CVTPTR(,R0)                                 ABL JAN87 08640071
         L     R1,0(,R1)                                      ABL JAN87 08650000
         L     R1,0(,R1)                                      ABL JAN87 08660000
         L     R1,X'A4'(,R1)        TCT ON EXIT TO PDS        ABL JAN87 08670000
         ICM   R0,B'1111',48(R1)    TCTLIN  -- LINES IN       ABL JAN87 08680000
         ST    R0,LSTTCTI                                     ABL JAN87 08690000
         ICM   R1,B'1111',52(R1)    TCTLOUT -- LINES OUT      ABL JAN87 08700000
         ST    R1,LSTTCTO                                     ABL JAN87 08710000
         BR    R2                                             ABL JAN87 08720000
         SPACE 2                                              ABL JAN87 08730000
* RECORD TCTLIN AND TCTLOUT COUNTS                            ABL JAN87 08740000
*        AND PERFORM A CONDITIONAL REFRESH                    ABL JAN87 08750000
REFCHECK L     R1,CVTPTR(,R0)                                 ABL JAN87 08760071
         L     R1,0(,R1)                                      ABL JAN87 08770000
         L     R1,0(,R1)                                      ABL JAN87 08780000
         L     R1,X'A4'(,R1)        CURRENT TCT               ABL JAN87 08790000
         ICM   R0,B'1111',48(R1)    TCTLIN  -- LINES IN       ABL JAN87 08800000
**NOSAVE ST    R0,CURTCTI                                     ABL JAN87 08810000
         ICM   R1,B'1111',52(R1)    TCTLOUT -- LINES OUT      ABL JAN87 08820000
**NOSAVE ST    R1,CURTCTO                                     ABL JAN87 08830000
         C     R0,LSTTCTI           ANY PROMPTING?            ABL JAN87 08840000
         BNE   ISPCREF2             YES, CONTROL REFRESH      ABL JAN87 08850000
         C     R1,LSTTCTO           ANY TPUTS?                ABL JAN87 08860000
         BER   R2                   NO, RETURN                ABL JAN87 08870000
         SPACE 2                                              DRK JUN98 08880012
*                                                             DRK JUN98 08890012
*  DEVICE NUMBER LIST SEARCH SUBROUTINE:  BEFORE ENTRY SET:   DRK JUN98 08900012
*  R15=ADDRESS OF UCBNAME FROM UCBDEVN (4DIGIT EBCDIC)        DRK JUN98 08910015
*                                                             DRK JUN98 08920012
DEVNLIST DS    0H                                             DRK JUN98 08930012
         L     R1,DEVLISTP              DEVICE NUMBER LIST    DRK JUN98 08940012
         L     R14,4(,R1)               COUNT OF ENTRIES      DRK JUN98 08950056
         C     R14,=F'0'                EMPTY LIST?           DRK JUN98 08960012
         BE    DEVNEND                  YES                   DRK JUN98 08970012
         LA    R1,8(,R1)                NO, PT AFTER HEADER   DRK JUN98 08980057
DEVNLOOP DS    0H                                             DRK JUN98 08990012
         CLI   0(R1),C' '               3DIGIT UCB NAME?      DRK JUN98 09000012
         BNE   *+8                      NO                    DRK JUN98 09010012
         MVI   0(R1),C'0'               YES, THEN ZERO FILL   DRK JUN98 09020012
         CLC   0(4,R15),0(R1)           DEVNO MATCH IN ARRAY? DRK JUN98 09030014
         BE    DEVNOK                   YES                   DRK JUN98 09040012
         LA    R1,4(,R1)                NO, LOOK AT NEXT      DRK JUN98 09050057
         BCT   R14,DEVNLOOP             LOOP                  DRK JUN98 09060012
         LA    R15,4                    NO HIT, SET RC=4      DRK JUN98 09070012
         BR    R2                                             DRK JUN98 09080012
DEVNEND  DS    0H                                             DRK JUN98 09090012
         LA    R15,8                    EMPTY LIST, SET RC=8  DRK JUN98 09100012
         BR    R2                                             DRK JUN98 09110012
DEVNOK   DS    0H                                             DRK JUN98 09120012
         LA    R15,0                    FOUND, SET RC=0       DRK JUN98 09130012
         BR    R2                                             DRK JUN98 09140012
         SPACE 1                                              DRK JUN98 09150012
ISPCREF2 DS    0H                                             ABL JAN87 09160000
         LA    R14,ISPCNTL          'CONTROL '                ABL JAN87 09170000
         LA    R15,ISPDSP           'DISPLAY '                ABL JAN87 09180000
         LA    R0,ISPREF            'REFRESH '                ABL JAN87 09190000
         STM   R14,R0,PARMLIST                                ABL JAN87 09200000
         OI    PARMLIST+08,X'80'                              ABL JAN87 09210000
         LA    R1,PARMLIST                                    ABL JAN87 09220000
         L     R15,ISPLINK                                    ABL JAN87 09230000
         BASR  R14,R15                                        ABL JAN87 09240000
         LTR   R15,R15                                        ABL JAN87 09250000
         BNZ   ISPERR                                         ABL JAN87 09260000
*        NI    SPFLAG3,255-SPFREFR                            ABL JAN87 09270000
         BR    R2                                             ABL JAN87 09280000
ISPREF   DC    C'REFRESH '                                    ABL JAN87 09290000
*                                                             ABL JAN87 09300000
* VGET ZVERB                            *                      SS AUG86 09310000
ISPDVGET DS    0H                                              SS NOV84 09320000
         LA    R14,VGET               VGET                    ABL OCT84 09330000
         LA    R15,VZVERB             ZVERB                   ABL OCT84 09340000
         LA    R0,ISPSHARE            SHARED                  ABL OCT84 09350000
         STM   R14,R0,PARMLIST                                ABL OCT84 09360000
         OI    PARMLIST+8,X'80'                               ABL OCT84 09370000
         B     ISPSXEQ0                                        SS MAR85 09380000
         SPACE 2                                               SS SEP84 09390000
*                                       *                      SS AUG86 09400000
*  VGET PROFILE                         *                      SS AUG86 09410000
*  R15=ADDRESS OF VARIABLE LIST         *                      SS AUG86 09420000
*                                       *                      SS AUG86 09430000
ISPVGETP DS    0H                                              SS AUG86 09440000
         LA    R14,VGET               VGET                     SS AUG86 09450000
         LA    R0,ISPPROFL            PROFILE                  SS AUG86 09460000
         STM   R14,R0,PARMLIST                                 SS AUG86 09470000
         OI    PARMLIST+8,X'80'                                SS AUG86 09480000
         B     ISPSXEQ8                                        SS AUG86 09490000
         SPACE 2                                               SS AUG86 09500000
*                                       *                      SS AUG86 09510000
*  VGET SHARED                          *                      SS OCT88 09520000
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88 09530000
*                                       *                      SS OCT88 09540000
ISPVGETS DS    0H                                              SS OCT88 09550000
         LA    R14,VGET               VGET                     SS OCT88 09560000
         LA    R0,ISPSHARE            SHARED                   SS OCT88 09570000
         STM   R14,R0,PARMLIST                                 SS OCT88 09580000
         OI    PARMLIST+8,X'80'                                SS OCT88 09590000
         B     ISPSXEQ8                                        SS OCT88 09600000
         SPACE 2                                               SS OCT88 09610000
*                                       *                      SS OCT88 09620000
*  VPUT PROFILE                         *                      SS OCT88 09630000
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88 09640000
*                                       *                      SS OCT88 09650000
ISPVPUTP DS    0H                                              SS OCT88 09660000
         LA    R14,VPUT               VGET                     SS OCT88 09670000
         LA    R0,ISPPROFL            PROFILE                  SS OCT88 09680000
         STM   R14,R0,PARMLIST                                 SS OCT88 09690000
         OI    PARMLIST+8,X'80'                                SS OCT88 09700000
         B     ISPSXEQ8                                        SS OCT88 09710000
         SPACE 2                                               SS OCT88 09720000
*                                       *                      SS OCT88 09730000
*  VPUT SHARED                          *                      SS OCT88 09740000
*  R15=ADDRESS OF VARIABLE LIST         *                      SS OCT88 09750000
*                                       *                      SS OCT88 09760000
ISPVPUTS DS    0H                                              SS OCT88 09770000
         LA    R14,VPUT               VGET                     SS OCT88 09780000
         LA    R0,ISPSHARE            SHARED                   SS OCT88 09790000
         STM   R14,R0,PARMLIST                                 SS OCT88 09800000
         OI    PARMLIST+8,X'80'                                SS OCT88 09810000
         B     ISPSXEQ8                                        SS OCT88 09820000
         SPACE 2                                               SS OCT88 09830000
* CREATE OR RECREATE TABLE FROM SAVED INFO                     SS AUG86 09840000
ISPTBCRE DS    0H                                              SS AUG86 09850000
         L     R0,SPFTVARA            ADDRESS OF VARS          SS AUG86 09860000
         L     R15,SPFTKEYA           ADDRESS OF KEY           SS AUG86 09870000
         B     ISPTBOP2                 *                      SS AUG86 09880000
         SPACE 2                                               SS AUG86 09890000
*   TB OPEN (CREATE)                                           SS NOV85 09900000
*   R0=ADDR OF VAR NAMES                                       SS NOV85 09910000
*   R15=ADDRESS OF KEY VAR NAME (OR 0)                         SS NOV85 09920038
ISPTBOPN DS    0H                                              SS AUG86 09930000
         ST    R0,SPFTVARA            ADDRESS OF VARS          SS AUG86 09940000
         ST    R15,SPFTKEYA           ADDRESS OF KEY           SS AUG86 09950000
ISPTBOP2 DS    0H                                              SS AUG86 09960000
         MVI   SPFTFLG1,0                                      SS AUG86 09970000
         XC    SPFTFF(2),SPFTFF                                SS NOV85 09980000
         OI    SPFTFLG1,SPFTACT                                SS NOV85 09990000
         LA    R1,ISPNOWRT       NO WRITE                      SS NOV85 10000000
         LA    R14,SPFTBL                                      SS NOV85 10010000
         STM   R14,R1,PARMLIST+4                               SS NOV85 10020000
         LA    R14,TBCREATE                                    SS NOV85 10030000
         ST    R14,PARMLIST                                    SS NOV85 10040000
         OI    PARMLIST+16,X'80'                               SS NOV85 10050000
         BAS   R14,ISPSXEQ                                     SS JUL87 10060000
         LTR   R15,R15                                         SS AUG86 10070000
         BNZ   ISPERR                                          SS AUG86 10080000
         TM    SPFTFLG3,SPFTSORT        SORTED                 SS AUG86 10090000
         BO    ISPTSORT                 YES INIT WITH SORT     SS AUG86 10100000
         BR    R2                       RETURN                 SS AUG86 10110000
         SPACE 2                                               SS AUG86 10120000
* SORT TABLE USING SORT LIST IN SPFTSORA                       SS AUG86 10130000
ISPTSORT DS    0H                                              SS AUG86 10140000
         LA    R14,TBSORT               SORT REQUEST           SS AUG86 10150000
         LA    R15,SPFTBL               TABLE NAME             SS AUG86 10160000
         L     R0,SPFTSORA              SORT LIST ADDRESS      SS AUG86 10170000
         STM   R14,R0,PARMLIST                                 SS AUG86 10180000
         OI    PARMLIST+08,X'80'                               SS AUG86 10190000
         B     ISPSXEQ0                                        SS AUG86 10200000
         SPACE 2                                               SS SEP84 10210000
ISPTBT#S MVI   SPFTBL+2,C'S'         TERMINATE ISPMODE TABLE  ABL OCT84 10220000
         B     ISPTBEND                                       ABL OCT84 10230000
         SPACE 1                                                        10240000
*SPTBT#M TM    SPFLAG2,SPFMEMA       TERMINATE MEMLIST TABLE  ABL OCT84 10250000
ISPTBT#M TM    SPFTFLG1,SPFTACT      TERMINATE MEMLIST TABLE   SS AUG86 10260000
         BZR   R2                    DOES NOT EXIST, RETURN   ABL OCT84 10270000
         NI    SPFLAG0,255-SPFCLNM   CLEAR MEMLIST MODE       ABL OCT84 10280000
         NI    SPFLAG2,0             CLEAR MEMLIST MODE       ABL OCT84 10290000
         NI    SPFLAG3,255-SPFCONV   CLEAR MEMLIST MODE       ABL OCT84 10300000
         NI    SPFLAG3,SPFSELV+SPF300A                        ABL NOV84 10310000
         B     ISPTBEND                                        SS NOV85 10320000
         SPACE 1                                                        10330000
ISPTBEND DS    0H                                              SS SEP84 10340000
         NI    SPFTFLG1,255-SPFTACT                            SS NOV85 10350000
         LA    R14,TBEND          END TABLE                    SS JUL84 10360000
         LA    R15,SPFTBL         TABLE NAME                   SS JUL84 10370000
         STM   R14,R15,PARMLIST                                SS JUL84 10380000
         OI    PARMLIST+04,X'80'                               SS JUL84 10390000
         BAS   R14,ISPSXEQ                                     SS OCT88 10400000
         LTR   R15,R15                                         SS AUG86 10410000
         BNZ   ISPERR                                          SS AUG86 10420000
         TM    SPFTFLG1,SPFTLCD   IN LINE CMD MODE             SS AUG86 10430000
         BZR   R2                 NO    *                      SS AUG86 10440000
         NI    SPFTFLG1,255-SPFTLCD-SPFTMUT                    SS AUG86 10450000
         BR    R2                 MISSING IN PDS81 AND PDS82   SS OCT88 10460000
         SPACE 2                                               SS JUL84 10470000
ISPCTLND DS    0H                                              SS JUL87 10480000
         LA    R0,ISPENTER      ENTER                          SS JUL87 10490000
         B     *+8              SKIP END OPERAND               SS JUL87 10500000
ISPCTNDE DS    0H                       *                      SS JUL87 10510000
         LA    R0,ISPCEND       END                            SS JUL87 10520000
         LA    R14,ISPCNTL      CONTROL                        SS JUL87 10530000
         LA    R15,ISPNOND      NONDISPL                       SS JUL87 10540000
         STM   R14,R0,PARMLIST                                 SS JUL87 10550000
         OI    PARMLIST+8,X'80'                                SS JUL87 10560000
         B     ISPSXEQ0                                        SS JUL87 10570000
ISPDSPSV DS    0H                                              SS SEP84 10580000
         LA    R14,ISPCNTL      CONTROL                        SS SEP84 10590000
         LA    R15,ISPDSP       DISPLAY                        SS SEP84 10600000
         LA    R0,ISPSAVE       SAVE                           SS SEP84 10610000
         STM   R14,R0,PARMLIST                                 SS SEP84 10620000
         OI    PARMLIST+8,X'80'                                SS SEP84 10630000
         B     ISPSXEQ0                                        SS MAR85 10640000
         SPACE 2                                               SS JUL84 10650000
ISPDSPRS DS    0H                                              SS SEP84 10660000
         LA    R14,ISPCNTL      CONTROL                        SS SEP84 10670000
         LA    R15,ISPDSP       DISPLAY                        SS SEP84 10680000
         LA    R0,ISPRSTR       RESTORE                        SS SEP84 10690000
         STM   R14,R0,PARMLIST                                 SS SEP84 10700000
         OI    PARMLIST+8,X'80'                                SS SEP84 10710000
         B     ISPSXEQ0                                        SS MAR85 10720000
         SPACE 2                                               SS JUL84 10730000
ISPCERT  DS    0H                                              SS SEP84 10740000
         LA    R14,ISPCNTL      CONTROL                        SS SEP84 10750000
         LA    R15,ISPERRS      ERRORS                         SS SEP84 10760000
         LA    R0,ISPRETN       RETURN                         SS SEP84 10770000
         STM   R14,R0,PARMLIST                                 SS SEP84 10780000
         OI    PARMLIST+8,X'80'                                SS SEP84 10790000
         B     ISPSXEQ0                                        SS MAR85 10800000
ISPCERC  DS    0H                                              SS SEP84 10810000
         LA    R14,ISPCNTL      CONTROL                        SS SEP84 10820000
         LA    R15,ISPERRS      ERRORS                         SS SEP84 10830000
         LA    R0,ISPCANCL      CANCEL                         SS SEP84 10840000
         STM   R14,R0,PARMLIST                                 SS SEP84 10850000
         OI    PARMLIST+8,X'80'                                SS SEP84 10860000
         B     ISPSXEQ0                                        SS MAR85 10870000
ISPPTON  DS    0H                                             DRK JUN19 10880099
         LA    R14,ISPCNTL      CONTROL                       DRK JUN19 10890099
         LA    R15,ISPPASST     PASSTHRU                      DRK JUN19 10900099
         LA    R0,ISPLRSCR      LRSCROLL                      DRK JUN19 10910099
         LA    R1,ISPBLK8       BLANK                         DRK JUN19 10920099
         STM   R14,R1,PARMLIST                                DRK JUN19 10930099
         LA    R1,ISPPASON      PASON                         DRK JUN19 10940099
         ST    R1,PARMLIST+16                                 DRK JUN19 10950099
         OI    PARMLIST+16,X'80'                              DRK JUN19 10960099
         LA    R1,PARMLIST                                    DRK JUN19 10970099
         L     R15,ISPLINK                                    DRK JUN19 10980099
         BASR  R14,R15                                        DRK JUN19 10990099
         BR    R2                                             DRK JUN19 11000099
         SPACE 2                                               SS JUL84 11010000
ISPADD1  DS    0H                                              SS JUL84 11020000
         LA    R14,1              SET COUNTS TO ONE            SS JUL84 11030000
         ST    R14,SPFSTART           START OF LAST CMD        SS JUL84 11040000
         ST    R14,SPFCRP             CPR                      SS JUL84 11050000
         ST    R14,SPFTDTOP           DISPLAY TOP              SS JUL84 11060000
         LA    R14,0              SET COUNTS TO ZERO           SS JUL84 11070000
         ST    R14,SPFCKPT            COUNT FROM LAST CKPT     SS JUL84 11080000
         ST    R14,SPFLAST            ZERO SIZE TABLE          SS JUL84 11090000
         LA    R1,FIRST4K                                      SS NOV85 11100000
         LA    R1,MSGENTDS-FIRST4K(R1) ADD LINE AND RETURN     SS NOV85 11110000
         ST    R1,SPFSAV1                                      SS SEP84 11120000
         B     ISPADDLN                                        SS SEP84 11130000
         SPACE 2                                               SS SEP84 11140000
*                                                              SS NOV86 11150000
*    POSITION TO BOTTOM OF LOG                                 SS NOV86 11160000
*                                                              SS NOV86 11170000
ISPLOGBT DS    0H                                              SS NOV86 11180000
         LA    R14,TBBOTTOM      ADD TO TABLE                  SS NOV86 11190000
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88 11200000
         STM   R14,R15,PARMLIST                                SS NOV86 11210000
         OI    PARMLIST+4,X'80'                                SS NOV86 11220000
         LA    R1,PARMLIST                                     SS NOV86 11230000
         L     R15,ISPLINK                                     SS NOV86 11240000
         BASR  R14,R15                                         SS NOV86 11250000
         C     R15,ISPL8                                       SS NOV86 11260000
         BH    ISPERR                                          SS NOV86 11270000
         BR    R2                                              SS NOV86 11280000
*                                                              SS NOV86 11290000
*    ADD LINE TO LOG                                           SS NOV86 11300000
* ISPADDLN  PRIMARY.. ADD FROM BUFFER                          SS NOV86 11310000
* ISPADD79  ALT       ADD FROM R1, LN=R14                      SS NOV86 11320000
* ISPADDCO  ALT       ADD WHATS IN SPFLINE                     SS NOV86 11330000
*    NOTE.. TO USE ALT, A ISPLOGBT MUST BE DONE                SS NOV86 11340000
*                       BEFORE THE SERIES OF ADDS              SS NOV86 11350000
*                                                              SS NOV86 11360000
ISPADDLN DS    0H                                              SS JUL84 11370000
* ALWAYS ADD TO TBBOTTOM                                       SS NOV85 11380000
         LA    R14,TBBOTTOM      ADD TO TABLE                  SS NOV85 11390000
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88 11400000
         STM   R14,R15,PARMLIST                                SS NOV85 11410000
         OI    PARMLIST+4,X'80'                                SS NOV85 11420000
         LA    R1,PARMLIST                                     SS NOV85 11430000
         L     R15,ISPLINK                                     SS NOV85 11440000
         BASR  R14,R15                                         SS NOV85 11450000
         C     R15,ISPL8                                       SS NOV85 11460000
         BH    ISPERR                                          SS NOV85 11470000
         MVI   SPFLINE,C' '      PRE CLEAR OUTPUT LINE         SS JUL84 11480000
         MVC   SPFLINE+1(159),SPFLINE                          SS OCT88 11490000
         L     R1,SPFSAV1        OUTPUT BUFFER                 SS JUL84 11500000
         LH    R14,0(R1)         LENGTH                        SS JUL84 11510000
         SH    R14,ISPH5         -4 FOR HEADER -1 FOR MVC      SS JUL84 11520000
         L     R15,ADDRUPT              ADDRESS OF THE UPT    ABL APR85 11530000
         TM    UPTSWS-UPT(R15),UPTMID   MESSAGE ID DESIRED?   ABL APR85 11540000
         BO    ISPADD79                 YES, BRANCH           ABL APR85 11550000
         CLC   4(3,R1),ISPPDS    PDS PREFIX?                  ABL APR85 11560000
         BNE   ISPADD79          NO, BRANCH                   ABL APR85 11570000
         TM    9(R1),X'F0'       NUMERIC?                     ABL APR85 11580000
         BNO   ISPADD79          NO, BRANCH                   ABL APR85 11590000
         TM    8(R1),X'F0'       NUMERIC?                     ABL APR85 11600000
         BNO   ISPADD79          NO, BRANCH                   ABL APR85 11610000
         TM    7(R1),X'F0'       NUMERIC?                     ABL APR85 11620000
         BNO   ISPADD79          NO, BRANCH                   ABL APR85 11630000
         CLI   11(R1),X'40'      A FOLLOWING BLANK?           ABL APR85 11640000
         BNE   ISPADD79          NO, BRANCH                   ABL APR85 11650000
         CLI   10(R1),C'I'       INFORMATIONAL MESSAGE?       ABL APR85 11660000
         BE    ISPADDLS          YES, BRANCH                  ABL APR85 11670000
         CLI   10(R1),C'A'       ACTION MESSAGE?              ABL APR85 11680000
         BE    ISPADDLS          YES, BRANCH                  ABL APR85 11690000
         CLI   10(R1),C'W'       WARNING MESSAGE?             ABL APR85 11700000
         BE    ISPADDLS          YES, BRANCH                  ABL APR85 11710000
         CLI   10(R1),C'E'       ERROR MESSAGE?               ABL APR85 11720000
         BNE   ISPADD79          NO, BRANCH                   ABL APR85 11730000
ISPADDLS DS    0H                                             ABL APR85 11740000
         LA    R0,8              LITERAL 8                    ABL APR85 11750000
         SR    R14,R0            -8 FOR THE MESSAGE ID        ABL APR85 11760000
         AR    R1,R0                                          ABL APR85 11770000
ISPADD79 DS    0H                                             ABL APR85 11780000
         CH    R14,ISPH159       MAX LENGTH                    SS OCT88 11790000
         BNH   ISPMVLIN          OK                            SS OCT88 11800000
         LH    R14,ISPH159       TRUNCATE                      SS OCT88 11810000
ISPMVLIN MVC   SPFLINE(0),4(R1)  MOVE TO DIALOG VARIABLE       SS JUL84 11820000
         EX    R14,*-6                                         SS JUL84 11830000
ISPADDCO DS    0H                                              SS MAY85 11840000
         CLI   SPFLINE,X'40'     BLANK IN CHARACTER 1         ABL SEP84 11850000
         BNE   *+8               NO, BRANCH                   ABL SEP84 11860000
         MVI   SPFLINE,0         YES, CONVERT TO NULL         ABL SEP84 11870000
         LA    R14,TBADD         ADD TO TABLE                  SS JUL84 11880000
         LA    R15,SPFLOGNM      TABLE NAME FOR LOG            SS OCT88 11890000
         STM   R14,R15,PARMLIST                                SS JUL84 11900000
         OI    PARMLIST+4,X'80'                                SS JUL84 11910000
         LA    R1,PARMLIST                                     SS JUL84 11920000
         L     R15,ISPLINK                                     SS JUL84 11930000
         BASR  R14,R15                                         SS JUL84 11940000
         LTR   R15,R15                                         SS JUL84 11950000
         BNZ   ISPERR                                          SS JUL84 11960000
         L     R14,SPFLAST       TRACK TABLE POSITION          SS JUL84 11970000
         LA    R14,1(R14)        ONE MORE ENTRY                SS JUL84 11980000
         ST    R14,SPFLAST       SAVE NEW COUNT                SS JUL84 11990000
         BR    R2                RETURN                        SS AUG84 12000000
         SPACE 2                                               SS JUL84 12010000
* SIMPLE SCAN EQU                       *                      SS AUG86 12020000
ISPMEMSC DS    0H                                              SS JUL84 12030000
         LA    R14,TBSCAN                                      SS SEP84 12040000
         LA    R15,SPFTBL                                      SS SEP84 12050000
* R0 PASSED POINTING TO VAR NAME                               SS SEP84 12060000
         STM   R14,R0,PARMLIST                                 SS SEP84 12070000
         OI    PARMLIST+8,X'80'                                SS SEP84 12080000
         B     ISPSXEQ8                                        SS MAR85 12090000
         SPACE 2                                               SS AUG86 12100000
* SCAN LINE COMMAND FOR NON BLANK       *                      SS JUL87 12110000
ISPNXLN  DS    0H                FIND NEXT NON BLANK LINE      SS JUL87 12120000
         LH    R1,SPFTBPOT              COMMAND OFFSET         SS JUL87 12130000
         LA    R1,SPWRKC(R1)                    ADDRESS        SS JUL87 12140000
         MVC   0(4,R1),ISPBLK8          SET BLANK              SS JUL87 12150000
         LA    R14,TBSCAN                                      SS JUL87 12160000
         LA    R15,SPFTBL                                      SS JUL87 12170000
         L     R0,SPFTBPOA              OPT VAR NAME ADDRESS   SS JUL87 12180000
         STM   R14,R0,PARMLIST                                 SS JUL87 12190000
         LA    R14,ISPBLK8              NO EXTENT VARS         SS JUL87 12200000
         LA    R15,ISPBLK8              NO ROWID               SS JUL87 12210000
         LA    R0,ISPNEXT               NEXT LINE              SS JUL87 12220000
         LA    R1,ISPBLK8               NO NOREAD              SS JUL87 12230000
         STM   R14,R1,PARMLIST+12                              SS JAN89 12240000
         LA    R14,ISPBLK8              NO  CRP                SS JUL87 12250000
         LA    R15,ISPGT                NOT EQUAL              SS JUL87 12260000
         STM   R14,R15,PARMLIST+28                             SS JUL87 12270000
         OI    PARMLIST+32,X'80'                               SS JUL87 12280000
         B     ISPSXEQ8                                        SS JUL87 12290000
         SPACE 2                                               SS AUG86 12300000
* MEML INFORMATION MOVE ROUTINES                               SS AUG86 12310000
* MADE COMMON SO THEY ONLY HAVE TO BE CHANGE IN ONE SPOT       SS AUG86 12320000
MEMLSAVE DS    0H                                              SS AUG86 12330000
         MVC   MEMLMV1(MEMLLN1),MEM2MV1    SAVE STATS          SS AUG86 12340000
         MVC   MEMLMV2(MEMLLN2),MEM2MV2    SAVE STATS          SS AUG86 12350000
         BR    R2         RETURN                               SS AUG86 12360000
         SPACE 2                                               SS AUG86 12370000
MEMLSET  DS    0H                                              SS AUG86 12380000
         MVC   MEM2MV1(MEMLLN1),MEMLMV1    SAVE STATS          SS AUG86 12390000
         MVC   MEM2MV2(MEMLLN2),MEMLMV2    SAVE STATS          SS AUG86 12400000
         BR    R2         RETURN                               SS AUG86 12410000
         SPACE 2                                               SS JUL84 12420000
* COMMON BLDL  FIRST ENTRY SETS DCB TO INDCB                   SS AUG86 12430000
*              SECOND ENTRY (ISPBLDL1) CALLER SET R1 = DCB ADR SS AUG86 12440000
*              CALLER MUST MOVE MEMBER NAME TO DIRNAME(8)      SS AUG86 12450000
*                                                              SS AUG86 12460000
ISPBLDL  DS    0H           BLDL SUBROUTINE                    SS AUG86 12470000
         LA    R1,INDCB                 *                      SS AUG86 12480000
ISPBLDL1 DS    0H                       *                      SS AUG86 12490000
         BLDL  (1),BLDLLIST             INSURE IT IS THERE     SS AUG86 12500000
         B     *+4(R15)                 PROCESS RETURN CODE   ABL FEB86 12510000
         B     ISPLSTT4                   00 - MEMBER FOUND   ABL FEB86 12520000
         B     ISPLSTT8                   04 - NOT FOUND      ABL FEB86 12530000
         B     ISPLSTT8                   08 - DIRECTORY I/O  ABL FEB86 12540000
         SPACE 1                                              ABL FEB86 12550000
ISPLSTT4 MVC   SPFDIRFG(2),DIRFLAG      SAVE BLDL FLAGS        SS AUG86 12560000
         MVC   DIRFLAG(DIREND-DIRFLAG),DIRFLAG+2 BLDL ADDS     SS AUG86 12570000
         BR    R2                                              SS AUG86 12580000
ISPLSTT8 XC    DIRFLAG(DIREND-DIRFLAG),DIRFLAG  CLEAR ENTRY   ABL FEB86 12590000
         BR    R2                       *                      SS AUG86 12600000
         SPACE 2                                               SS JUL84 12610000
*  TB ADD                                                      SS NOV85 12620000
ISPTBADD DS    0H                                              SS NOV85 12630000
         LA    R15,SPFTBL                                      SS NOV85 12640000
ISPTBAD2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87 12650000
         LA    R14,TBADD         ADD TO TABLE                  SS NOV85 12660000
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86 12670000
         LA    R1,ISPORDER       IN ORDER                      SS AUG86 12680000
         STM   R14,R1,PARMLIST                                 SS AUG86 12690000
         OI    PARMLIST+12,X'80'                               SS AUG86 12700000
         B     ISPSXEQ8                                        SS NOV85 12710000
         SPACE 2                                               SS JUL84 12720000
ISPTOP   DS    0H                                              SS MAY89 12730000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 12740000
ISPTOP2  LA    R14,TBTOP          PRE POSITION TO BOTTOM       SS MAY89 12750000
         STM   R14,R15,PARMLIST                                SS MAY89 12760000
         OI    PARMLIST+04,X'80'                               SS MAY89 12770000
         B     ISPSXEQ8                                        SS MAY89 12780000
         SPACE 2                                               SS MAY89 12790000
ISPBOTM  DS    0H                                              SS MAY89 12800000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 12810000
ISPBOT2  LA    R14,TBBOTTOM       PRE POSITION TO BOTTOM       SS MAY89 12820000
         STM   R14,R15,PARMLIST                                SS MAY89 12830000
         OI    PARMLIST+04,X'80'                               SS MAY89 12840000
         B     ISPSXEQ8                                        SS MAY89 12850000
         SPACE 2                                               SS MAY89 12860000
ISPGET   DS    0H                                              SS MAY89 12870000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 12880000
ISPGET2  LA    R14,TBGET          GET IT IF IT IS THERE        SS MAY89 12890000
         STM   R14,R15,PARMLIST                                SS MAY89 12900000
         OI    PARMLIST+04,X'80'                               SS MAY89 12910000
         B     ISPSXEQ8                                        SS MAY89 12920000
         SPACE 2                                               SS MAY89 12930000
ISPDEL1  DS    0H                                              SS MAY89 12940000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 12950000
ISPDEL2  LA    R14,TBDELETE       DELETE HIS LINE              SS MAY89 12960000
         STM   R14,R15,PARMLIST                                SS MAY89 12970000
         OI    PARMLIST+04,X'80'                               SS MAY89 12980000
         B     ISPSXEQ8                                        SS MAY89 12990000
         SPACE 2                                               SS MAY89 13000000
ISPSKIP1 DS    0H                                              SS MAY89 13010000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 13020000
ISPSKIP2 LA    R14,TBSKIP         DELETE HIS LINE              SS MAY89 13030000
         STM   R14,R15,PARMLIST                                SS MAY89 13040000
         OI    PARMLIST+04,X'80'                               SS MAY89 13050000
         B     ISPSXEQ8                                        SS MAY89 13060000
         SPACE 2                                               SS JUL84 13070000
*                                       *                      SS MAY89 13080000
* TABLE ABSOLUTE POSITIONING SERVICES   *                      SS MAY89 13090000
* BASED OF ISPF ROW ID  (A 4 BYTE TAG)  *                      SS MAY89 13100000
*                                       *                      SS MAY89 13110000
*  TABLE ROW ID NOTE                    *                      SS MAY89 13120000
*  ROW ID RETURNED IN SPFFIXED          *                      SS MAY89 13130000
*                                       *                      SS MAY89 13140000
ISPTBNT  DS    0H                       *                      SS MAY89 13150000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 13160000
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89 13170000
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89 13180000
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89 13190000
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89 13200000
         LA    R14,VSPFFIX        NAME WERE TO PLACE           SS MAY89 13210000
         LA    R15,ISPBLK8        NO POSITIONING               SS MAY89 13220000
         LA    R0,ISPNORAD        NO READ                      SS MAY89 13230000
         STM   R14,R0,PARMLIST+16       *                      SS MAY89 13240000
         OI    PARMLIST+24,X'80'        *                      SS MAY89 13250000
         B     ISPSXEQ8                 *                      SS MAY89 13260000
*                                       *                      SS MAY89 13270000
*  TABLE ROW ID POINT (NO READ)         *                      SS MAY89 13280000
*  R15 = ROW ID VALUE                   *                      SS MAY89 13290000
*                                       *                      SS MAY89 13300000
ISPTBPT  DS    0H                       *                      SS MAY89 13310000
         ST    R15,SPFFIXED       SET ROW ID                   SS MAY89 13320000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 13330000
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89 13340000
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89 13350000
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89 13360000
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89 13370000
         LA    R14,ISPBLK8        NO RETURN                    SS MAY89 13380000
         LA    R15,SPFFIXED       POSITION ROW ID              SS MAY89 13390000
         LA    R0,ISPNORAD        NO READ                      SS MAY89 13400000
         STM   R14,R0,PARMLIST+16       *                      SS MAY89 13410000
         OI    PARMLIST+24,X'80'        *                      SS MAY89 13420000
         B     ISPSXEQ8                 *                      SS MAY89 13430000
*                                       *                      SS MAY89 13440000
*  TABLE ROW ID READ                    *                      SS MAY89 13450000
*  R15 = ROW ID VALUE                   *                      SS MAY89 13460000
*                                       *                      SS MAY89 13470000
ISPTBRD  DS    0H                       *                      SS MAY89 13480000
         ST    R15,SPFFIXED       SET ROW ID                   SS MAY89 13490000
         LA    R15,SPFTBL         TABLE NAME                   SS MAY89 13500000
         LA    R14,TBSKIP         SKIP COMMAND                 SS MAY89 13510000
         LA    R0,ISPL0           ZERO SKIP                    SS MAY89 13520000
         LA    R1,ISPBLK8         NO EXT VARS                  SS MAY89 13530000
         STM   R14,R1,PARMLIST    SAVE 4                       SS MAY89 13540000
         LA    R14,ISPBLK8        NO RETURN                    SS MAY89 13550000
         LA    R15,SPFFIXED       POSITION ROW ID              SS MAY89 13560000
         STM   R14,R15,PARMLIST+16      *                      SS MAY89 13570000
         OI    PARMLIST+20,X'80'        *                      SS MAY89 13580000
         B     ISPSXEQ8                 *                      SS MAY89 13590000
*                                       *                      SS MAY89 13600000
*  TB MOD                                                      SS NOV85 13610000
ISPTBMOD DS    0H                                              SS NOV85 13620000
         LA    R15,SPFTBL                                      SS NOV85 13630000
ISPTBMD2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87 13640000
         LA    R14,TBMOD         MOD TO TABLE                  SS NOV85 13650000
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86 13660000
         LA    R1,ISPORDER       IN ORDER                      SS AUG86 13670000
         STM   R14,R1,PARMLIST                                 SS AUG86 13680000
         OI    PARMLIST+12,X'80'                               SS AUG86 13690000
         B     ISPSXEQ8                                        SS NOV85 13700000
         SPACE 2                                               SS JUL84 13710000
*  TB PUT                                                      SS NOV85 13720000
ISPTBPUT DS    0H                                              SS NOV85 13730000
         LA    R15,SPFTBL                                      SS NOV85 13740000
ISPTBPT2 DS    0H                ENTRY WITH R15=TABLE NAME     SS JUL87 13750000
         LA    R14,TBPUT         ADD TO TABLE                  SS NOV85 13760000
         LA    R0,ISPBLK8        NO EXTENT VARS                SS NOV86 13770000
         LA    R1,ISPORDER       IN ORDER                      SS AUG86 13780000
         STM   R14,R1,PARMLIST                                 SS AUG86 13790000
         OI    PARMLIST+12,X'80'                               SS AUG86 13800000
         B     ISPSXEQ8                                        SS NOV85 13810000
         SPACE 2                                               SS JUL84 13820000
ISPQUERY DS    0H                                              SS JUL84 13830000
         LA    R14,TBQUERY        GET CPR                      SS JUL84 13840000
         ST    R14,PARMLIST                                    SS JUL84 13850000
         LA    R14,SPFTBL         TABLE NAME                   SS JUL84 13860000
         LA    R15,ISPBLK8       NO KEYS                       SS NOV86 13870000
         LA    R0,ISPBLK8        NO NAMES                      SS NOV86 13880000
         LA    R1,VSPFFIX2        TABLE SIZE GOES HERE         SS JUL84 13890000
         STM   R14,R1,PARMLIST+4                               SS JUL84 13900000
         STM   R15,R0,PARMLIST+20                              SS JUL84 13910000
         LA    R14,VSPFFIX        CPR GOES HERE                SS JUL84 13920000
         ST    R14,PARMLIST+28                                 SS JUL84 13930000
         OI    PARMLIST+28,X'80'                               SS JUL84 13940000
         BAS   R14,ISPSXEQ                                     SS MAY89 13950000
         LTR   R15,R15                                         SS JUL84 13960000
         BNZ   ISPERR                                          SS JUL84 13970000
         TM    SPFTBPF1,SPFTLOG   LIST TABLE                   SS NOV85 13980000
         BZ    ISPQUER2           YES                          SS NOV85 13990000
         L     R15,SPFFIXE2       SAVE INFO                    SS JUL84 14000000
         LTR   R15,R15                                         SS JUL84 14010000
         BZ    ISPADD1            NOW EMPTY, PAD WITH ONE LINE SS JUL84 14020000
         ST    R15,SPFLAST                                     SS JUL84 14030000
         L     R14,SPFFIXED                                    SS JUL84 14040000
         ST    R14,SPFCRP                                      SS JUL84 14050000
         BR    R2                                              SS NOV85 14060000
ISPQUER2 DS    0H                                              SS SEP84 14070000
         SR    R15,R15           NORMAL RETURN                 SS SEP84 14080000
         L     R14,SPFFIXE2                                    SS SEP84 14090000
         ST    R14,SPFTSIZE                                    SS NOV85 14100000
         L     R14,SPFFIXED                                    SS SEP84 14110000
         ST    R14,SPFTCRP                                     SS NOV85 14120000
         TM    SPFTBPF1,SPFTMLX     MEMLIST                    SS NOV85 14130000
         BR    R2                                              SS SEP84 14140000
         SPACE 2                                               SS SEP84 14150000
*                                                              SS JUL84 14160000
*  SPFTTOP  CONTAIN TABLE   NEW POSITION                       SS NOV85 14170000
*  SPFTCRP  CONTAIN TABLE   CURRENT POSITION (QUERY FIRST)     SS NOV85 14180000
*                                                              SS JUL84 14190000
ISPOSTN  DS    0H                                              SS JUL84 14200000
         L     R15,SPFTTOP        CALCULATE                    SS NOV85 14210000
         LR    R14,R15                                         SS SEP84 14220000
         S     R15,SPFTCRP           SKIP AMOUNT + OR -        SS NOV85 14230000
         ST    R14,SPFTCRP        SET NEW CRP                  SS NOV85 14240000
ISPSKIP  DS    0H                 R15 IS SKIP VALUE            SS SEP84 14250000
         LTR   R15,R15            CHECK POSITION               SS JUL84 14260000
         BZR   R2                 NO SKIP REQUIRED             SS JUL84 14270000
         ST    R15,SPFFIXE2                                    SS SEP84 14280000
         LA    R14,TBSKIP         SKIP FUNCTION                SS JUL84 14290000
         LA    R15,SPFTBL                                      SS JUL84 14300000
         LA    R0,SPFFIXE2                                     SS JUL84 14310000
         STM   R14,R0,PARMLIST                                 SS JUL84 14320000
         OI    PARMLIST+08,X'80'                               SS JUL84 14330000
         B     ISPSXEQ8                                        SS MAR85 14340000
         SPACE 2                                               SS NOV84 14350000
*                                                              SS JUL84 14360000
*  SPFFIXED CONTAIN DELETE COUNT                               SS JUL84 14370000
*  SPFFIXE2 CONTAIN SKIP AMOUNT                                SS JUL84 14380000
*                                                              SS JUL84 14390000
ISPDEL   DS    0H                                              SS JUL84 14400000
*  FORCE SKIP 0 TO READ KEYED TABLE RECORD                     SS AUG86 14410000
         LA    R14,TBSKIP         SKIP FUNCTION                SS JUL84 14420000
         LA    R15,SPFTBL                                      SS JUL84 14430000
         LA    R0,SPFFIXE2                                     SS JUL84 14440000
         STM   R14,R0,PARMLIST                                 SS JUL84 14450000
         OI    PARMLIST+08,X'80'                               SS JUL84 14460000
         BAS   R14,ISPSXEQ                                     SS MAY89 14470000
         C     R15,ISPL8                                       SS JUL84 14480000
         BH    ISPERR                                          SS JUL84 14490000
ISPNOSK  L     R14,SPFFIXED       INIT R14                     SS JUL84 14500000
         LTR   R14,R14            DEL AMOUNT                   SS JUL84 14510000
         BZR   R2                 NO DEL REQUIRED OR DONE      SS JUL87 14520000
         SR    R15,R15            MAKE ZERO                    SS AUG86 14530000
         ST    R15,SPFFIXE2       SET FOR SKIP 0               SS AUG86 14540000
         LA    R14,TBDELETE       DELETE HIS LINE              SS AUG86 14550000
         LA    R15,SPFTBL         TABLE NAME                   SS JUL84 14560000
         STM   R14,R15,PARMLIST                                SS JUL84 14570000
         OI    PARMLIST+04,X'80'                               SS JUL84 14580000
ISPDLUP1 BAS   R14,ISPSXEQ                                     SS MAY89 14590000
         C     R15,ISPL8                                       SS JUL84 14600000
         BH    ISPERR                                          SS JUL84 14610000
         BER   R2                                              SS JUL84 14620000
         L     R14,SPFFIXED      DEL COUNT                     SS JUL84 14630000
         BCT   R14,ISPDLUP2      DECREMENT AND LOOP            SS JUL84 14640041
         ST    R14,SPFFIXED      ZERO COUNT                    SS JUL87 14650000
         B     ISPDEL            FORCE SKIP 0 TO READ ENTRY    SS JUL87 14660000
ISPDLUP2 ST    R14,SPFFIXED       SAVE COUNT LIFT              SS AUG86 14670000
         ICM   R15,15,SPFTKEYA    IS IT A KEYED TABLE          SS AUG86 14680000
         BZ    ISPDLUP1           NO CONTINUE DELETE           SS AUG86 14690000
         B     ISPDEL             FORCE SKIP 0 TO READ         SS AUG86 14700000
         SPACE 2                                               SS JUL84 14710000
*  MESSAGE INSERT ROUTINE                                      SS NOV85 14720000
ISPLMSGS DS    0H                                              SS NOV85 14730000
         LH    R1,SPFTBPDA            OFFSET TO DATA FIELD     SS NOV85 14740000
         LA    R1,SPWRKC(R1)          CALC REAL ADDRESS        SS NOV85 14750000
         L     R14,SPFTTPT            MAKE SURE WE HAVE PTR    SS NOV85 14760000
         SR    R15,R15                ZERO                     SS NOV88 14770000
         IC    R15,$TLMG(R14)         MSG OFFSET               SS MAY89 14780000
         TM    $TLF1(R14),#L          MSG OFFSET REQ           SS NOV88 14790000
         BZ    ISPLMSG2                 *                      SS NOV88 14800000
ISPLMSG0 DS    0H                       *                      SS NOV88 14810000
         AL    R15,ISP$TMGA           CALC MSG ADDR            SS NOV85 14820000
         MVC   0(8,R1),0(R15)         MOVE MESSAGE             SS NOV85 14830000
         BR    R2                     RETURN                   SS NOV85 14840000
ISPM9000 DC    H'9000'                MSG NUM 9000 AND UP      SS NOV85 14850000
ISPLMSG2 DS    0H                                              SS NOV85 14860000
         MVI   0(R1),C'*'             SET TO *                 SS NOV85 14870000
         MVC   1(7,R1),$TLCM(R14)     COPY CMD NAME            SS NOV85 14880000
         LA    R15,6                                           SS NOV85 14890000
         LA    R1,2(R1)               SKIP OVER *+1 CHAR       SS NOV85 14900000
ISPLMSG3 DS    0H                                              SS NOV85 14910000
         CLI   0(R1),C' '             BLANK                    SS NOV85 14920000
         BE    ISPLMSG4               YES,  SET TO *           SS NOV85 14930000
         LA    R1,1(,R1)              NEXT CHAR                SS NOV85 14940000
         BCT   R15,ISPLMSG3           FIND END OF CMD          SS NOV85 14950000
         BR    R2                     NO END, SKIP IT          SS NOV85 14960000
ISPLMSG4 DS    0H                                              SS NOV85 14970000
         MVI   0(R1),C'*'             MAKE *                   SS NOV85 14980000
         BR    R2                                              SS NOV85 14990000
         SPACE 3                                               SS NOV85 15000000
*                                                              SS NOV85 15010000
* CONVERT DEC TO PRINTABLE                                     SS NOV85 15020000
*  R1=DEC VALUE                                                SS NOV85 15030000
*                                                              SS NOV85 15040000
ISPDECCV DS    0H                                              SS NOV85 15050000
         CVD   R1,DOUBLE                                       SS NOV85 15060000
         MVC   SPFDCONV,ISPDCNV1                               SS NOV85 15070000
         ED    SPFDCONV,DOUBLE+2                               SS NOV85 15080000
         BR    R2                                              SS NOV85 15090000
ISPDCNV1 DC    X'402020202020202020202120'                     SS NOV85 15100000
         SPACE 3                                               SS NOV85 15110000
*                                                              SS NOV85 15120000
* CONVERT PRINTABLE HEX                                        SS NOV85 15130000
*  R1=ONE WORD OF DATA                                         SS NOV85 15140000
*                                                              SS NOV85 15150000
ISPHEXCV DS    0H                                              SS NOV85 15160000
         ST    R1,DOUBLE                                       SS NOV85 15170000
         MVI   DOUBLE+4,X'0C'      FAKE SIGN                   SS NOV85 15180000
         UNPK  SPFHEXCV(9),DOUBLE(5)                           SS NOV85 15190000
         TR    SPFHEXCV(8),ISPHEXTR                            SS NOV85 15200000
         BR    R2                                              SS NOV85 15210000
         DC    C'0123456789ABCDEF'                             SS NOV85 15220000
ISPHEXTR EQU   *-256                                           SS NOV85 15230000
         SPACE 3                                               SS NOV85 15240000
*                                                              SS NOV85 15250000
* CONVERT HEX INPUT TO BINARY                                  SS NOV85 15260000
*  R1=BINARY OUT  DATA, INPUT SPFHEXCV                         SS NOV85 15270000
*                                                              SS NOV85 15280000
ISPBINCV DS    0H                                              SS NOV85 15290000
         NC    SPFHEXCV(8),ISPBINC2                            SS NOV85 15300000
         TR    SPFHEXCV(8),ISPHEXT2                            SS NOV85 15310000
         MVI   SPFHEXCV+8,X'C0'      FAKE SIGN                 SS NOV85 15320000
         PACK  DOUBLE(5),SPFHEXCV(9)                           SS NOV85 15330000
         L     R1,DOUBLE                                       SS NOV85 15340000
         BR    R2                                              SS NOV85 15350000
ISPBINC2 DC    X'1F1F1F1F1F1F1F1F'                             SS NOV85 15360000
ISPHEXT2 DC    X'00FAFBFCFDFEFF',XL9'00'   00-0F               SS NOV85 15370000
         DC    C'0123456789',XL6'00'       10-1F               SS NOV85 15380000
         SPACE 3                                               SS NOV85 15390000
*                                       *                      SS AUG86 15400000
*   FIND ENTRY IN MOVE TABLE            *                      SS AUG86 15410000
*   R0=0 USE CURRENT PANEL TABLE        *                      SS AUG86 15420000
*        VIA SPFTBPPI                   *                      SS AUG86 15430000
*                                       *                      SS AUG86 15440000
ISPMVTBL DS    0H                       *                      SS AUG86 15450000
         LH    R0,SPFTBPPI              INDEX                  SS AUG89 15460000
         BCTR  R0,0                     INDEX FROM ZERO        SS AUG86 15470000
         LR    R1,R0                    INDEX                  SS AUG86 15480000
         AR    R1,R0                    INDEX X 2              SS AUG86 15490000
         AR    R1,R0                    INDEX X 3              SS AUG86 15500000
         SLL   R1,2                     INDEX X 12             SS AUG86 15510000
         AL    R1,ISPMOVEA              ADDED ADDRESS          SS AUG86 15520000
         L     R15,0(,R1)               GET ROUTINE ADDRESS    SS AUG86 15530000
         L     R14,4(,R1)               GET TITLE ADDRESS      SS AUG86 15540000
         BR    R2                       DONE                   SS AUG86 15550000
         SPACE 3                        *                      SS AUG86 15560000
*                                                              SS NOV85 15570000
*   FIND DSAB TO MATCH DDNAME                                  SS NOV85 15580000
*   R14=ADDR OF DDNAME                                         SS NOV85 15590000
*   R1=RETURNED DSAB ADDRESS OR 0 IF NOT FOUND                 SS NOV85 15600000
ISPFDSAB DS    0H                                              SS NOV85 15610000
         L     R1,CVTPTR(,R0)     CVT                          SS NOV85 15620070
         L     R1,0(,R1)          ACT TCB PT                   SS NOV85 15630000
         L     R1,4(,R1)          ACT TCB                      SS NOV85 15640000
         L     R1,TCBJSCB-TCBRBP(R1)     JSCB                  SS NOV85 15650000
         L     R1,JSCDSABQ-IEZJSCB(R1)   DSAB QUE              SS NOV85 15660000
         L     R1,12(,R1)                FIRST DSAB            SS NOV85 15670000
ISPFDSB1 LTR   R1,R1         END OF DSAB CHAIN                 SS NOV85 15680000
         BZR   R2            RETURN WITH R1=0                  SS NOV85 15690000
         L     R15,DSABTIOT-DSAB(R1)                           SS NOV85 15700000
         CLC   0(8,R14),TIOEDDNM-TIOENTRY(R15)                 SS NOV85 15710000
         BER   R2            GOT A MATCH                       SS NOV85 15720000
         L     R1,DSABFCHN-DSAB(R1)     NEXT DSAB              SS NOV85 15730000
         B     ISPFDSB1                                        SS NOV85 15740000
*                                                              SS NOV85 15750000
*   DSORG CONVERT TO PRINTABLE                                 SS NOV85 15760000
*   R1=ADDRESS OF DSORG INFORMATION                            SS NOV85 15770000
*   R0=WILL BE SET TO 4 CHAR DSORG MNEMONIC (IE PO PS VSAM)    SS NOV85 15780043
*                                                              SS NOV85 15790000
ISPDSORG DS    0H            DSORG LEV 2 ROUTINE               SS NOV85 15800000
         TM    0(R1),JFCORGIS                                  SS NOV85 15810000
         BZ    *+14                                            SS NOV85 15820000
         ICM   R0,15,*+6                                       SS NOV85 15830000
         BR    R2                                              SS NOV85 15840000
         DC    C'ISAM'                                         SS NOV85 15850000
         TM    0(R1),JFCORGPO                                  SS NOV85 15860000
         BZ    *+14                                            SS NOV85 15870000
         ICM   R0,15,*+6                                       SS NOV85 15880000
         BR    R2                                              SS NOV85 15890000
         DC    C'PO  '                                         SS NOV85 15900000
         TM    0(R1),JFCORGPS                                  SS NOV85 15910000
         BZ    *+14                                            SS NOV85 15920000
         ICM   R0,15,*+6                                       SS NOV85 15930000
         BR    R2                                              SS NOV85 15940000
         DC    C'PS  '                                         SS NOV85 15950000
         TM    0(R1),JFCORGDA                                  SS NOV85 15960000
         BZ    *+14                                            SS NOV85 15970000
         ICM   R0,15,*+6                                       SS NOV85 15980000
         BR    R2                                              SS NOV85 15990000
         DC    C'DA  '                                         SS NOV85 16000000
         TM    1(R1),JFCORGAM                                  SS NOV85 16010000
         BZ    *+14                                            SS NOV85 16020000
         ICM   R0,15,*+6                                       SS NOV85 16030000
         BR    R2                                              SS NOV85 16040000
         DC    C'VSAM'                                         SS NOV85 16050000
         ICM   R0,15,*+6                                       SS NOV85 16060000
         BR    R2                                              SS NOV85 16070000
         DC    C'    '                                         SS NOV85 16080000
         AIF   ('&MVSLEV' GE 'MVS710').MVS710                 DRK MAR16 16090099
*                                                              SS NOV85 16100000
*  LSPACE SUBROUTINE  (USES SVC 78, UPDATES SPFV VARS)         SS NOV85 16110000
*   STANDARD MESSAGE FORMAT FOR DASD                          DRK MAY98 16120008
*   ----+----1----+----2----+----3                            DRK MAY98 16130008
*   SPACE=CCCC,TTTT,XXXX/CCCC,TTTT                            DRK MAY98 16140008
*  R0=UCB ADDRESS                                              SS NOV85 16150000
*  R15=RC FROM LSPACE                                          SS NOV85 16160000
*                                                              SS NOV85 16170008
ISPLSPAC DS    0H                                              SS NOV85 16180000
         LA    R1,SPFVLSPC     WORK AREA                       SS NOV85 16190000
         SVC   78                                              SS NOV85 16200000
         LTR   R15,R15                                         SS NOV85 16210000
*        BZ    ISPLSPC2                                        SS APR87 16220000
*        MVC   SPFVDATA,ISPLSPCE                               SS APR87 16230000
         BNZR  R2                                              SS APR87 16240000
*SPLSPC2 DS    0H                                              SS APR87 16250000
         MVC   SPFVTCYL+1(4),SPFVLSPC+6  TOTAL FREE CYLS      DRK MAY98 16260008
         MVC   SPFVTTRK+1(4),SPFVLSPC+11 TOTAL ADDL FREE TRKS DRK MAY98 16270008
         MVC   SPFVXNUM,SPFVLSPC+16      NUMBER FREE EXTENTS  DRK MAY98 16280008
         MVC   SPFVLCYL+1(4),SPFVLSPC+21 CYLS IN LARGEST FREE DRK MAY98 16290008
         MVC   SPFVLTRK+1(4),SPFVLSPC+26 ADDL TRKS IN LARGEST DRK MAY98 16300008
         AGO   .MVS710X                                       DRK MAR16 16310099
.MVS710  ANOP                                                 DRK MAR16 16320099
*                                                             DRK MAY98 16330001
*  LSPACE SUBROUTINE  (USES SVC 78, UPDATES SPFV VARS)        DRK MAY98 16340001
*   DATA RETURN AREA FORMAT FOR FAT DASD (3390-9 AND ABOVE)   DRK DEC98 16350031
*  R0=UCB ADDRESS                                             DRK MAY98 16360001
*  R15=RC FROM LSPACE                                         DRK MAY98 16370001
*                                                             DRK MAY98 16380008
LSPACE   LSPACE EXPDATA=0,MF=L,PLISTVER=MAX                   DRK SEP12 16390092
LSPACEL  EQU   *-LSPACE                                       DRK MAY98 16400003
ISPLSPAC DS    0H                                             DRK MAY98 16410089
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K1                 DRK SEP12 16420098
*        ST    R0,FULLWORD               *** TEST ***         DRK SEP12 16430099
.S2K1    ANOP                                                 DRK SEP12 16440098
         MVC   PARMLIST(LSPACEL),LSPACE                       DRK MAY98 16450089
         LSPACE UCB=(R0),EXPDATA=SPFVLSPC,                    DRK SEP12X16460091
               MF=(E,PARMLIST)                                DRK MAY98 16470089
         LTR   R15,R15                                        DRK MAY98 16480089
         BNZR  R2                                             DRK MAY98 16490089
         SPACE 1                                                        16500089
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K2                 DRK SEP12 16510098
*        L     R14,FULLWORD              *** TEST ***         DRK SEP12 16520099
*        USING UCBOB,R14                 *** TEST ***         DRK SEP12 16530099
.S2K2    ANOP                                                 DRK SEP12 16540098
         L     R1,LSPDTCYL               TOTAL FREE CYLS      DRK DEC98 16550089
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K3                 DRK SEP12 16560098
*        CLC   UCBVOLI(6),=C'S2K001'     *** TEST ***         DRK SEP12 16570099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16580099
*        A     R1,=F'050000'             *** TEST ***         DRK SEP12 16590099
*        CLC   UCBVOLI(6),=C'S2K002'     *** TEST ***         DRK SEP12 16600099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16610099
*        A     R1,=F'075000'             *** TEST ***         DRK SEP12 16620099
*        CLC   UCBVOLI(6),=C'S2K003'     *** TEST ***         DRK SEP12 16630099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16640099
*        A     R1,=F'100000'             *** TEST ***         DRK SEP12 16650099
*        CLC   UCBVOLI(6),=C'S2K004'     *** TEST ***         DRK SEP12 16660099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16670099
*        A     R1,=F'125000'             *** TEST ***         DRK SEP12 16680099
*        CLC   UCBVOLI(6),=C'S2K005'     *** TEST ***         DRK SEP12 16690099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16700099
*        A     R1,=F'150000'             *** TEST ***         DRK SEP12 16710099
*        CLC   UCBVOLI(6),=C'S2K006'     *** TEST ***         DRK SEP12 16720099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16730099
*        A     R1,=F'1175000'            *** TEST ***         DRK SEP12 16740099
.S2K3    ANOP                                                 DRK SEP12 16750098
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 16760093
         UNPK  SPFVTCYL(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 16770093
         OI    SPFVTCYL+6,C'0'           MAKE PRINTABLE       DRK SEP12 16780093
         L     R1,LSPDTTRK               TOTAL ADDL FREE TRKS DRK DEC98 16790093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 16800093
         UNPK  SPFVTTRK(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 16810093
         OI    SPFVTTRK+6,C'0'           MAKE PRINTABLE       DRK SEP12 16820093
         L     R1,LSPDLCYL               CYLS IN LARGEST FREE DRK DEC98 16830093
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K4                 DRK SEP12 16840098
*        CLC   UCBVOLI(6),=C'S2K001'     *** TEST ***         DRK SEP12 16850099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16860099
*        A     R1,=F'050000'             *** TEST ***         DRK SEP12 16870099
*        CLC   UCBVOLI(6),=C'S2K002'     *** TEST ***         DRK SEP12 16880099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16890099
*        A     R1,=F'075000'             *** TEST ***         DRK SEP12 16900099
*        CLC   UCBVOLI(6),=C'S2K003'     *** TEST ***         DRK SEP12 16910099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16920099
*        A     R1,=F'100000'             *** TEST ***         DRK SEP12 16930099
*        CLC   UCBVOLI(6),=C'S2K004'     *** TEST ***         DRK SEP12 16940099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16950099
*        A     R1,=F'125000'             *** TEST ***         DRK SEP12 16960099
*        CLC   UCBVOLI(6),=C'S2K005'     *** TEST ***         DRK SEP12 16970099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 16980099
*        A     R1,=F'150000'             *** TEST ***         DRK SEP12 16990099
*        CLC   UCBVOLI(6),=C'S2K006'     *** TEST ***         DRK SEP12 17000099
*        BNE   *+4+4                     *** TEST ***         DRK SEP12 17010099
*        A     R1,=F'1175000'            *** TEST ***         DRK SEP12 17020099
.S2K4    ANOP                                                 DRK SEP12 17030098
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17040093
         UNPK  SPFVLCYL(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 17050093
         OI    SPFVLCYL+6,C'0'           MAKE PRINTABLE       DRK SEP12 17060093
         L     R1,LSPDLTRK               ADDL TRKS IN LARGEST DRK DEC98 17070093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17080093
         UNPK  SPFVLTRK(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 17090093
         OI    SPFVLTRK+6,C'0'           MAKE PRINTABLE       DRK SEP12 17100093
         L     R1,LSPDF0S                FORMAT 0 COUNT       DRK DEC98 17110093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17120093
         UNPK  SPFVFMT0(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 17130093
         OI    SPFVFMT0+6,C'0'           MAKE PRINTABLE       DRK SEP12 17140093
         L     R1,LSPDVIRS               FREE VIR COUNT       DRK DEC98 17150093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17160093
         UNPK  SPFVVIRS(7),DOUBLE+4(4)   DISPLAY              DRK SEP12 17170093
         OI    SPFVVIRS+6,C'0'           MAKE PRINTABLE       DRK SEP12 17180093
         L     R1,LSPDNEXT               NUMBER FREE EXTENTS  DRK DEC98 17190093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17200093
         UNPK  DOUBLE(5),DOUBLE+5(3)     DISPLAY              DRK DEC98 17210093
         OI    DOUBLE+4,X'F0'            MAKE PRINTABLE       DRK DEC98 17220093
         MVC   SPFVXNUM(4),DOUBLE+1      MOVE 4 BYTES         DRK DEC98 17230093
         L     R1,LSPDFRAG               FRAGMENTATION INDEX  DRK DEC98 17240093
         CVD   R1,DOUBLE                 PACKED               DRK DEC98 17250093
         UNPK  DOUBLE(5),DOUBLE+5(3)     DISPLAY              DRK DEC98 17260093
         OI    DOUBLE+4,X'F0'            MAKE PRINTABLE       DRK DEC98 17270093
         MVC   SPFVFRAG(4),DOUBLE+1      MOVE 4 BYTES         DRK DEC98 17280093
         MVI   SPFVCMS,C' '              INITIALIZE           DRK MAR22 17281099
         TM    LSPDRETN,LSPDCYLM         CYL-MANAGED SPACE?   DRK MAR22 17284099
         BNO   *+4+4                     NO                   DRK MAR22 17285099
         MVI   SPFVCMS,C'E'              YES, MARK EAV        DRK MAR22 17286099
.MVS710X ANOP                                                 DRK MAR16 17290099
         AIF   ('&SYSPARM' NE 'CSC-STL').S2K5                 DRK SEP12 17300098
*        DROP  R14                       *** TEST ***         DRK SEP12 17310099
.S2K5    ANOP                                                 DRK SEP12 17320098
         LA    R15,SPFVTCYL                                    SS NOV85 17330093
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85 17340093
         LA    R15,SPFVTTRK                                    SS NOV85 17350093
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85 17360093
         LA    R15,SPFVLCYL                                    SS NOV85 17370093
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85 17380093
         LA    R15,SPFVLTRK                                    SS NOV85 17390093
         BAS   R1,ISPLSPCS             LITTLE SUB              SS NOV85 17400093
         LA    R15,SPFVFMT0                                   DRK DEC98 17410093
         BAS   R1,ISPLSPCS             LITTLE SUB             DRK DEC98 17420093
         LA    R15,SPFVVIRS                                   DRK DEC98 17430093
         BAS   R1,ISPLSPCS             LITTLE SUB             DRK DEC98 17440093
         LA    R14,3                   FIRST 3 NUMBERS        DRK MAY98 17450093
         LA    R15,SPFVXNUM                                    SS NOV85 17460093
         BAS   R1,ISPLSPCL             LITTLE SUB LOOP        DRK MAY98 17470093
         LA    R14,3                   FIRST 3 NUMBERS        DRK DEC98 17480093
         LA    R15,SPFVFRAG                                   DRK DEC98 17490093
         BAS   R1,ISPLSPCL             LITTLE SUB LOOP        DRK DEC98 17500093
         SR    R15,R15                 SET 0 RC                SS APR87 17510093
         BR    R2                                              SS NOV85 17520093
ISPLSPCE DC    CL8'*VTOCERR'                                   SS NOV85 17530093
ISPLSPCS DS    0H                                              SS NOV85 17540093
         LA    R14,6                   FIRST 6 NUMBERS        DRK SEP12 17550093
ISPLSPCL CLI   0(R15),C'0'             STILL ZEROS             SS NOV85 17560093
         BHR   R1                      NO, END OF LEADING 0    SS NOV85 17570093
         MVI   0(R15),C' '             CONVERT TO BLANK        SS NOV85 17580093
         LA    R15,1(,R15)             NEXT NUMBER             SS NOV85 17590093
         BCT   R14,ISPLSPCL            LOOP FOR 6             DRK SEP12 17600093
         BR    R1                      ALL DONE                SS NOV85 17610089
*  DEVTYPE CHARACTERISTICS FOR DASD                            SS NOV85 17620053
*  R1=ADDRESS OF 4 BYTE DEVTYPE DATA (IE UCBTYP OR FROM CATLG) SS NOV85 17630000
*  R14=RETURNED ADDRESS OF TABLE ENTRY (SEE DVCT MACRO)        SS NOV85 17640000
*  R15=TRKS PER CYLINDER                                       SS NOV85 17650042
*                                                              SS NOV85 17660000
ISPDEVTC DS    0H                                              SS NOV85 17670000
         L     R14,CVTPTR(,R0)                                 SS NOV85 17680072
         L     R14,CVTZDTAB-CVT(R14)                           SS NOV85 17690000
         LA    R15,DVCTYPMK     MASK                           SS NOV85 17700000
         N     R15,0(R1)        TYPE DATA AND WITH MASK        SS NOV85 17710000
         IC    R15,0(R15,R14)   INDEX TO ENTRY                 SS NOV85 17720000
         LA    R14,0(R15,R14)   CALC ADDRESS                   SS NOV85 17730000
         LH    R15,DVCTRK-DVCT(R14)  TRACKS PER CYL            SS NOV85 17740000
         BR    R2                                              SS NOV85 17750000
*                                                              SS NOV85 17760000
*    GET FORMAT 4 DSCB   R1=ADDR OF VOLUME ID                  SS NOV85 17770000
*                                                              SS NOV85 17780000
ISPFMT4  DS    0H                                              SS NOV85 17790000
         LA    R14,WORKTBL     PUT FMT4 KEY HERE               SS AUG86 17800000
         MVI   0(R14),X'04'    KEY 04                          SS AUG86 17810000
         MVC   1(43,R14),0(R14)   RIPPLE                       SS AUG86 17820000
         B     ISPDSCB                                         SS NOV85 17830000
         SPACE 2                                               SS NOV85 17840000
*                                                              SS NOV85 17850000
*    GET FORMAT 1 DSCB                                         SS NOV85 17860000
*                        R1=ADDR OF VOLUME ID                  SS NOV85 17870000
*                       R14=ADDR OF DSN                        SS NOV85 17880000
ISPDSCB  DS    0H                                              SS NOV85 17890000
         MVC   SPFCAMLS(4),ISPDSCBS    SEARCH CAMLST           SS NOV85 17900000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV1                 DRK JAN13 17910099
         OI    SPFCAMLS+2,X'08'        SET EADSCB=OK BIT       JH JAN13 17920099
.NOEAV1  ANOP                                                 DRK JAN13 17930099
         B     ISPDSCB2                                        SS NOV85 17940000
*                                                              SS NOV85 17950000
*    GET DSCB BY CCHHR                                         SS NOV85 17960000
*                        R1=ADDR OF VOLUME ID                  SS NOV85 17970000
*                       R14=ADDR OF CCHHR                      SS NOV85 17980000
ISPDSCBC DS    0H                                              SS NOV85 17990000
         MVC   SPFCAMLS(4),ISPDSCBK    SEEK   CAMLST           SS NOV85 18000000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV2                 DRK JAN13 18010099
         OI    SPFCAMLS+2,X'08'        SET EADSCB=OK BIT       JH JAN13 18020099
.NOEAV2  ANOP                                                 DRK JAN13 18030099
ISPDSCB2 DS    0H                                              SS NOV85 18040000
         ST    R14,SPFCAMLS+4    DSN OR CCHHR                  SS NOV85 18050000
         ST    R1,SPFCAMLS+8     VOLUME                        SS NOV85 18060000
         LA    R15,SPFDSCB                                     SS NOV85 18070000
         ST    R15,SPFCAMLS+12   DSCB RETURN AREA              SS NOV85 18080000
         OBTAIN SPFCAMLS                                       SS NOV85 18090000
* CALLER CAN CHECK RETURN CODE                                 SS NOV85 18100000
         BR    R2                                              SS NOV85 18110000
ISPDSCBS CAMLST SEARCH,0,4,8                                   SS NOV85 18120000
         ORG    ISPDSCBS+4       OVERLAP CAMLST                SS AUG86 18130000
ISPDSCBK CAMLST SEEK,0,4,8                                     SS NOV85 18140000
         SPACE 2                                               SS NOV85 18150000
*                                                              SS MAY89 18160000
*    GET CATALOG ENTRY USING LOCATE                            SS MAY89 18170000
*                        R1=ADDR OF DSN                        SS MAY89 18180000
*                                                              SS MAY89 18190000
ISPCATL  DS    0H                                              SS MAY89 18200000
         MVC   SPFCAMLS(12),ISPCATLS   LOCATE CAMLST           SS MAY89 18210000
         ST    R1,SPFCAMLS+4    DSN                            SS MAY89 18220000
         LA    R15,WORKTBL                                     SS MAY89 18230000
         ST    R15,SPFCAMLS+12   VOL  RETURN AREA              SS MAY89 18240000
         LOCATE SPFCAMLS                                       SS MAY89 18250000
* CALLER CAN CHECK RETURN CODE                                 SS MAY89 18260000
         BR    R2                                              SS MAY89 18270000
ISPCATLS CAMLST NAME,0,,8                                      SS NOV85 18280000
         SPACE 2                                               SS NOV85 18290000
*                                                              SS NOV85 18300000
*                                                              SS NOV85 18310000
*  GET DEVICE GROUP NAME USING DEVICE TYPE (IE UCBTYP)         SS NOV85 18320000
*  R1=ADDRESS OF 4 BYTE DEVT DATA                              SS NOV85 18330000
*  R15=ADDRESS OF NAME  (ZERO IF NOT FOUND)                    SS NOV85 18340000
*  R0=RETURNED DEVTYPE WITH UNNESSARY BITS REMOVED             SS NOV85 18350000
ISPDEVNM DS    0H                                              SS NOV85 18360000
         L     R15,SPFSEC4A             BASE                   SS JUL88 18370000
         LA    R15,SPFDEVTT-SPFSEC4K(,R15) DEVTYPE TABLE       SS JUL88 18380000
         MVI   SPFDEVTL(R15),0          REUSE LAST ENTRY       SS JUL88 18390000
ISPDEVN6 DS    0H                       *                      SS JUL88 18400000
         CLI   0(R15),0                 LAST ENTRY             SS JUL88 18410000
         BE    ISPDEVN8                 NO MATCH               SS JUL88 18420000
         CLC   2(2,R15),2(R1)           MATCH ON DEV CLASS+TYP SS JUL88 18430000
         BE    ISPDEVN7                 YES                    SS JUL88 18440000
         LA    R15,12(,R15)             NEXT ENTRY             SS JUL88 18450000
         B     ISPDEVN6                 KEEP LOOKING           SS JUL88 18460000
ISPDEVN7 DS    0H                       *                      SS JUL88 18470000
         L     R0,0(R15)                LOAD GOOD ONE          SS JUL88 18480000
         LA    R15,4(,R15)              ADDR OF NAME           SS JUL88 18490000
         BR    R2                                              SS JUL88 18500000
ISPDEVN8 DS    0H                       *                      SS JUL88 18510000
         ST    R15,PARMLIST+28          SAVE POINTER           SS JUL88 18520000
         TM    SPFLAG5,SPFXA           XA SYSTEM               SS JUL88 18530000
         BO    ISPDEVN3                USE IEFEB4UV            SS NOV85 18540000
         L     R15,CVTPTR(,R0)         LOAD CVT ADDRESS        SS AUG88 18550070
         L     R15,CVTJESCT-CVT(R15)   JESCT                   SS NOV85 18560000
         L     R15,JESEDT-JESCT(R15)   EDT                     SS NOV85 18570000
* NO MACRO FOR EDT                                             SS NOV85 18580000
         L     R15,0(R15)              LOOK UP SECTION         SS NOV85 18590000
         L     R0,4(R15)               SIZE OF EACH ENTRY      SS NOV85 18600000
         L     R14,0(R14)              NUMBER OF ENTRIES       SS NOV85 18610000
         LA    R15,8(R15)              OVER HEADER             SS NOV85 18620000
ISPDEVN1 DS    0H                      LOOP BACK HERE          SS NOV85 18630000
         CLC   2(2,R1),10(R15)         COMPARE LAST 2 BYTES    SS NOV85 18640000
         BE    ISPDEVN2                GOT IT                  SS NOV85 18650000
         ALR   R15,R0                  NEXT ENTRY              SS NOV85 18660000
         BCT   R14,ISPDEVN1            KEEP LOOKING            SS NOV85 18670000
         SR    R15,R15                 NONE FOUND              SS NOV85 18680000
         SR    R0,R0                                           SS NOV85 18690000
         BR    R2                                              SS NOV85 18700000
ISPDEVN2 DS    0H                      GOT IT                  SS NOV85 18710000
         L     R0,8(R15)               LOAD GOOD DEVT          SS NOV85 18720000
         L     R14,PARMLIST+28         GET POINTER             SS JUL88 18730000
         ST    R0,0(R14)               GOOD DEVTYPE            SS JUL88 18740000
         MVC   4(8,R14),0(R15)         GOOD DEV NAME           SS JUL88 18750000
         BR    R2                                              SS NOV85 18760000
*   USE IEFEB4UV  (XA EDT SERVICE ROUTINE)                     SS NOV85 18770000
ISPDEVNF DC    X'2100'                 CONVERT DEVT TO NAME    SS NOV85 18780000
ISPDEVN3 DS    0H                                              SS NOV85 18790000
         LA    R15,PARMLIST+8          UNIT TABLE              SS NOV85 18800000
         ST    R15,PARMLIST                                    SS NOV85 18810000
         LA    R15,ISPDEVNF            FLAGS                   SS NOV85 18820000
         ST    R15,PARMLIST+4                                  SS NOV85 18830000
         OI    PARMLIST+4,X'80'                                SS NOV85 18840000
         MVC   PARMLIST+8+8(4),0(R1)   COPY DEVT               SS NOV85 18850000
         NI    PARMLIST+8+8+1,255-X'20' TURN OFF SHARE BIT     SS NOV85 18860000
         SR    R14,R14                                         SS NOV85 18870000
         ST    R14,PARMLIST+8+12       ZERO ATTRIBUTE AREA PT  SS NOV85 18880000
         LA    R1,PARMLIST                                     SS NOV85 18890000
         LINK  EP=IEFEB4UV                                     SS NOV85 18900000
         LTR   R15,R15                                         SS NOV85 18910000
         BZ    ISPDEVN4                                        SS NOV85 18920000
         SR    R15,R15                 NONE FOUND              SS NOV85 18930000
         SR    R0,R0                                           SS NOV85 18940000
         BR    R2                                              SS NOV85 18950000
ISPDEVN4 DS    0H                      GOT IT                  SS NOV85 18960000
         L     R0,PARMLIST+8+8         LOAD GOOD DEVT          SS NOV85 18970000
         LA    R15,PARMLIST+8          PT TO RETURNED NAME     SS NOV85 18980000
         L     R14,PARMLIST+28         GET POINTER             SS JUL88 18990000
         ST    R0,0(R14)               GOOD DEVTYPE            SS JUL88 19000000
         MVC   4(8,R14),0(R15)         GOOD DEV NAME           SS JUL88 19010000
         BR    R2                                              SS NOV85 19020000
*                                       *                      SS AUG89 19030000
*  GET DEVICE TYPE FOR A VOLUME         *                      SS AUG89 19040000
*  R15 = ADDRESS OF VOLUME              *                      SS AUG89 19050000
*  R1 IS THE RETURNED DEVICE TYPE       *                      SS AUG89 19060000
*  R15 = RC, 0 FOUND,  8  VOLUME NOT FOUND                     SS AUG89 19070000
ISPDEVTY DS    0H                       *                      SS AUG89 19080000
         CLC   SPFCLVOL,0(R15)          LAST VOL HERE          SS AUG89 19090000
         BNE   ISPDEVT1                 NO                     SS AUG89 19100000
         ICM   R1,B'1111',SPFCLDEV      GET DEVT FOR THIS VOL  SS AUG89 19110000
         SR    R15,R15                  RC0                    SS AUG89 19120000
         BR    R2                       ALL DONE               SS AUG89 19130000
ISPDEVT1 DS    0H                       *                      SS AUG89 19140000
         MVC   PARMLIST+16(6),0(R15)    SAVE VOL               SS AUG89 19150000
         L     R1,SPFSEC4A         GET  BASE                   SS AUG89 19160000
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN     SS AUG89 19170000
         XC    0(100,R1),0(R1)     ZERO FOR FRESH START        SS AUG89 19180000
*        XC    SRVUCBIC,SRVUCBIC   ZERO UCBSCAN IOC TOKEN     DRK JUN98 19190026
         L     R1,CVTPTR(,R0)      CVT                         SS AUG89 19200070
         L     R1,CVTUCBSC-CVT(R1) IOSSVSUCB  UCB SCAN         SS AUG89 19210000
         ST    R1,PARMLIST+12      SAVE ADDRESS                SS AUG89 19220000
ISPDEVTL DS    0H                       *                      SS AUG89 19230000
         AIF   ('&MVSLEV' GE 'MVS410').MVS410                 DRK JUN98 19240010
         L     R1,SPFSEC4A         GET  BASE                   SS AUG89 19250000
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN     SS AUG89 19260000
         ST    R1,PARMLIST                                     SS AUG89 19270000
         LA    R1,ISPDEVTZ                                     SS AUG89 19280000
         ST    R1,PARMLIST+4                                   SS AUG89 19290000
         LA    R1,SPFUCBA                                      SS AUG89 19300000
         ST    R1,PARMLIST+8                                   SS AUG89 19310000
         OI    PARMLIST+8,X'80'                                SS AUG89 19320000
         LA    R1,PARMLIST                                     SS AUG89 19330000
         L     R15,PARMLIST+12     ROUTINE ADDRESS             SS AUG89 19340000
         BASR  R14,R15                                         SS AUG89 19350000
         LTR   R15,R15                                         SS AUG89 19360000
         BNZ   ISPDEVTE            DONE                        SS AUG89 19370000
         L     R1,SPFUCBA                                      SS AUG89 19380000
         AGO   .MVS410X                                       DRK JUN98 19390010
.MVS410  ANOP                                                 DRK JUN98 19400010
         L     R1,SPFSEC4A         GET  BASE                  DRK JUN98 19410009
         LA    R1,SPFUCBSN-SPFSEC4K(,R1) POINT TO SPFUCBSN    DRK JUN98 19420009
         LR    R0,R1               UCBSCAN WORKAREA           DRK JUN98 19430009
         L     R15,CVTPTR(,R0)     CVT                        DRK JUN98 19440070
         TM    CVTOSLV1-CVT(R15),HBB5510  4-DIGIT UCBS?       DRK JUN98 19450016
         BO    ISPDEVT4                                       DRK JUN98 19460009
         UCBSCAN COPY,                                        DRK JUN98X19470011
               WORKAREA=(R0),                                 DRK JUN98X19480011
               UCBAREA=SRVUCBUC,                              DRK JUN98X19490011
               DYNAMIC=YES,                                   DRK JUN98X19500009
               DEVCLASS=DASD,                                 DRK JUN98X19510009
               MF=(E,SRVUCBPL)                                DRK JUN98 19520009
         LTR   R15,R15                                        DRK JUN98 19530009
         BNZ   ISPDEVTE            DONE                       DRK JUN98 19540009
         LA    R1,SRVUCBUC         UCB ADDRESS                DRK JUN98 19550009
         B     ISPDEVTP            PROCESS UCB                DRK JUN98 19560009
ISPDEVT4 DS    0H                                             DRK JUN98 19570009
         UCBSCAN COPY,                                        DRK JUN98X19580011
               WORKAREA=(R0),                                 DRK JUN98X19590011
               UCBAREA=SRVUCBUC,                              DRK JUN98X19600011
               RANGE=ALL,                                     DRK JUN98X19610009
               DYNAMIC=YES,                                   DRK JUN98X19620009
               DEVCLASS=DASD,                                 DRK JUN98X19630009
               MF=(E,SRVUCBPL)                                DRK JUN98 19640009
         LTR   R15,R15                                        DRK JUN98 19650009
         BNZ   ISPDEVTE            DONE                       DRK JUN98 19660009
         LA    R1,SRVUCBUC         UCB ADDRESS                DRK JUN98 19670009
.MVS410X ANOP                                                 DRK JUN98 19680010
ISPDEVTP DS    0H                                                       19690009
         USING UCBOB,R1                                        SS AUG89 19700000
         CLI   UCBTBYT3,X'20'      REALLY A DASD DEVICE        SS AUG89 19710000
         BNE   ISPDEVTL            NO, SKIP IT                 SS AUG89 19720000
         TM    UCBSTAT,UCBONLI     IS IT ONLINE                SS AUG89 19730000
         BZ    ISPDEVTL            NO, SKIP IT                 SS AUG89 19740000
         CLI   UCBVOLI,C' '        ANY VOLUME                  SS AUG89 19750000
         BNH   ISPDEVTL            NO VOLUME, SKIP IT          SS AUG89 19760000
         TM    UCBSTAT,UCBCHGS+UCBUNLD GOING OFFLINE           SS AUG89 19770000
         BNZ   ISPDEVTL            YES, SKIP IT                SS AUG89 19780000
         CLC   UCBVOLI(6),PARMLIST+16    THIS THE VOLUME       SS AUG89 19790000
         BNE   ISPDEVTL            NO, SKIP IT                 SS AUG89 19800000
         MVC   SPFCLVOL,UCBVOLI         SET NEW VOL            SS AUG89 19810000
         MVC   SPFCLDEV,UCBTYP          AND DEVTYP             SS AUG89 19820000
         NI    SPFCLDEV+1,255-UCBRR     OFF SHARE BIT          SS AUG89 19830000
         L     R1,SPFCLDEV              SET DEVTYP             SS AUG89 19840000
         SR    R15,R15                  RC0                    SS AUG89 19850000
         DROP  R1                                              SS AUG89 19860000
ISPDEVTE DS    0H                       *                      SS AUG89 19870000
         BR    R2                       *                      SS AUG89 19880000
ISPDEVTZ DC    X'2000'                  *                      SS AUG89 19890000
         SPACE 2                                               SS AUG89 19900000
*                                                              SS NOV85 19910000
*  DYNAMIC UNALLOCATE/DECONCATENATE                            SS NOV85 19920000
*  R0=02/04 S99VRBAL/S99VRBDC                                  SS NOV85 19930000
*  R1=ADDR OF DDNAME                                           SS NOV85 19940000
ISPUNALC DS    0H                                              SS NOV85 19950000
         XC    M99RBPTR(40),M99RBPTR    CLEAR THE WORK AREA             19960000
         LA    R14,M99RB                                                19970000
         USING S99RB,R14                                                19980000
         ST    R14,M99RBPTR                                             19990000
         OI    M99RBPTR,S99RBPND        MARK END OF LIST                20000000
         SPACE 1                                                        20010000
         MVI   S99RBLN,20               LENGTH 20                       20020000
         STC   R0,S99VERB               UNALLOC/DECONCAT                20030000
         LA    R15,M99TUPL                                              20040000
         ST    R15,S99TXTPP             POINT TO TEXT POINTERS          20050000
         MVC   WORKTBL+6(8),0(R1)       DDNAME                 SS NOV85 20060000
         LA    R1,WORKTBL                        START OF TEXT          20070000
         ST    R1,0(R15)                FIRST TEXT UNIT        SS NOV85 20080000
         MVC   0(6,R1),ISPUNAL2         DD TEXT UNIT           SS NOV85 20090000
         CLI   S99VERB-S99RB+M99RB,S99VRBDC  DECONCAT          SS NOV85 20100000
         BE    ISPUNAL1                                        SS NOV85 20110000
         LA    R1,WORKTBL+14            NEXT TEXT UNIT         SS NOV85 20120000
         LA    R15,4(,R15)              NEXT POINTER           SS NOV85 20130000
         ST    R1,0(R15)                SET  POINTER           SS NOV85 20140000
         MVC   0(4,R1),ISPUNAL3         UNALLOC PERM           SS NOV85 20150000
ISPUNAL1 OI    0(R15),X'80'             END OF LIST            SS NOV85 20160000
         B     ISPDYNA                  DO DYNAM               SS NOV85 20170000
ISPUNAL2 DC    X'000100010008'         BY DDNAME               SS NOV85 20180000
ISPUNAL3 DC    X'00070000'             UNALLOC EVEN PERM       SS NOV85 20190000
*                                                              SS NOV85 20200000
*  DYNAMIC ALLOCATION INTERFACE                                SS NOV85 20210000
*    M99RBPTR MUST BE SET BY USER                              SS NOV85 20220000
*    R15= RETURN CODE,  ANY ERROR MESSAGE WILL BE PRESET       SS NOV85 20230000
*                                                              SS NOV85 20240000
ISPDYNA  DS    0H                                              SS NOV85 20250000
         LA    R1,M99RBPTR                                     SS NOV85 20260000
         DYNALLOC                                              SS NOV85 20270000
         DROP  R14                                            DRK NOV98 20280020
         LTR   R15,R15                                         SS NOV85 20290000
         BZR   R2                                              SS NOV85 20300000
         ST    R15,DOUBLE            TEMP SAVE                 SS NOV85 20310000
         LA    R14,M99RB                POINTER TO SVC 99 BLOCK         20320000
         ST    R15,DAIRRC               RETURN CODE                     20330000
         LA    R15,DAIRRC               POINTER TO RETURN CODE          20340000
         LA    R0,ADDRFF02              POINTER TO A(IKJEFF02)          20350000
         LA    R1,ISPDYN5               POINTER TO INVOCATION TYPE      20360000
         CLI   S99VERB-S99RB+M99RB,S99VRBAL                    SS NOV85 20370000
         BE    ISPDYN2                                         SS NOV85 20380000
         CLI   S99VERB-S99RB+M99RB,S99VRBCC                    SS NOV85 20390000
         BE    ISPDYN2                                         SS NOV85 20400000
         LA    R1,ISPDYN6               POINTER TO INVOCATION TYPE      20410000
         CLI   S99VERB-S99RB+M99RB,S99VRBUN                    SS NOV85 20420000
         BE    ISPDYN2                                         SS NOV85 20430000
         CLI   S99VERB-S99RB+M99RB,S99VRBDC                    SS NOV85 20440000
         BE    ISPDYN2                                         SS NOV85 20450000
         B     ISPDYN3                                         SS NOV85 20460000
ISPDYN2  DS    0H                                              SS NOV85 20470000
         STM   R14,R1,DFDAPLP           INITIALIZE DFDAPLP, DFDRCP,     20480000
*                                         DFJEFF02, DFIDP      SS NOV85 20490000
         L     R1,ADDRCPPL              POINTER TO THE CPPL    SS NOV85 20500000
         ST    R1,DFDAPLP+16               AND DFCPPLP         SS NOV85 20510000
         SPACE 1                                                        20520000
         LINK  EP=IKJEFF18,MF=(E,DFPARMS)                               20530000
ISPDYN3  DS    0H                                              SS NOV85 20540000
         MVC   SPFMLIN2,ISPDYN7                                SS NOV85 20550000
         SR    R1,R1                                           SS NOV85 20560000
         ICM   R1,3,S99ERROR-S99RB+M99RB  ERROR CODE           SS NOV85 20570000
         LR    R0,R2                                           SS NOV85 20580000
         BAS   R2,ISPHEXCV                                     SS NOV85 20590000
         LR    R2,R0                                           SS NOV85 20600000
         MVC   SPFMLIN2+29(4),SPFHEXCV+4                       SS NOV85 20610000
         MVC   SPFMSGID,ISPPDSM    BASE MESSAGE                SS NOV85 20620047
         MVI   SPFMSGID+6,C'1'                                 SS NOV85 20630000
         MVI   SPFMSGID+7,C'A'                                 SS NOV85 20640000
         L     R15,DOUBLE          RELOAD RETURN CODE          SS NOV85 20650000
         BR    R2                                              SS NOV85 20660000
ISPDYN5  DC    AL2(DFSVC99)                                    SS NOV85 20670000
ISPDYN6  DC    AL2(DFFREE)                                     SS NOV85 20680000
ISPDYN7  DC    CL79'DYNALLOC - ERROR REASON CODE=0000, SEE AUTHORIZED A*20690099
               SSEMBLER SERVICES GUIDE'                       DRK APR13 20700099
         AGO   .SKIPN7                                                  20710099
ISPDYN7  DC    CL79'DYNAMIC ALOC/UNAL ERROR CODE=0000, SEE TUTORIAL APP*20720035
               ENDIX A'                                        SS NOV85 20730035
.SKIPN7  ANOP                                                           20740099
         TITLE 'P D S  --  ISPF DIALOG SUB INTERFACES'                  20750055
*                                                              SS AUG86 20760000
*  LOW LV  SUBROUTINES                                         SS AUG86 20770000
*                                                              SS AUG86 20780000
*                                                              SS NOV85 20790000
*       INTERFACE FOR ISPPARSE                                 SS NOV85 20800000
*                                                              SS NOV85 20810000
ISPPARSI DS    0H                                              SS NOV85 20820000
         L     R0,ISPPARSA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 20830000
         B     ISPSUBL0                                        SS AUG86 20840000
         SPACE 1                                               SS MAR85 20850000
ISPSORTI DS    0H                       *                      SS OCT88 20860000
         L     R15,ISPSORTA ADDRESS FOR SORT                   SS OCT88 20870000
         B     ISPSUBIL  INTERFACE      *                      SS OCT88 20880000
         SPACE 1                                               SS OCT88 20890000
*                                                              SS OCT88 20900000
*  LOW LV  SUBROUTINE INTERFACE CODE (ADDRESS IN R15)          SS OCT88 20910000
*                                                              SS OCT88 20920000
ISPSUBIL DS    0H                                              SS OCT88 20930000
         STM   R2,R4,SPFSVLR2                                  SS OCT88 20940000
         LR    R4,R15        LOAD ADDRESS OF SUBROUTINE        SS OCT88 20950000
         BASR  R3,R4                                           SS OCT88 20960000
         LM    R2,R4,SPFSVLR2                                  SS OCT88 20970000
         BR    R2                                              SS OCT88 20980000
         SPACE 2                                               SS OCT88 20990000
*                                                              SS OCT88 21000000
*  LOW LV  SUBROUTINE INTERFACE CODE (ADDRESS IN R0)           SS OCT88 21010000
*                                                              SS OCT88 21020000
ISPSUBL0 DS    0H                                              SS OCT88 21030000
         STM   R2,R4,SPFSVLR2                                  SS OCT88 21040000
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS OCT88 21050000
         BASR  R3,R4                                           SS OCT88 21060000
         LM    R2,R4,SPFSVLR2                                  SS OCT88 21070000
         BR    R2                                              SS OCT88 21080000
         SPACE 5                                               SS OCT88 21090000
*                                                              SS NOV85 21100000
*  MED LEV SUBROUTINES                                         SS NOV85 21110000
*                                                              SS NOV85 21120000
*  THESE SAVE R2-R4 AND USE A BASR R3,R4 FOR LINKAGE           SS NOV85 21130000
*  RETURN IS BY R2                                             SS NOV85 21140000
         SPACE 1                                               SS NOV85 21150000
*                                                              SS SEP84 21160000
*  SUBROUTINE TO LOCATE COMMAND IN BUFFER AND MATCH WITH TABLE SS SEP84 21170000
*  OF COMMANDS                                                 SS SEP84 21180000
*  ENTRY ISPVER FOR ZCMD  BUFFER                               SS SEP84 21190000
*                                                              SS SEP84 21200000
ISPVERG  DS    0H            FIND VERB WITH GIVEN PARMS        SS NOV84 21210000
         LA    R15,30         LIMIT OF SCAN                    SS SEP84 21220000
         B     ISPVER1                                         SS SEP84 21230000
ISPVER1  DS    0H                                              SS MAR85 21240000
         STM   R2,R4,SPFSAVR2                                  SS NOV85 21250000
         L     R4,ISPVERAD   LOAD ADDRESS OF VERB SUBROUTINE   SS MAR85 21260000
         BASR  R3,R4                                           SS NOV85 21270000
         LM    R2,R4,SPFSAVR2                                  SS NOV85 21280000
         BR    R2                                              SS NOV85 21290000
         SPACE 1                                               SS NOV85 21300000
*                                                              SS NOV85 21310000
*       INTERFACE FOR ISPPAND                                  SS NOV85 21320000
*                                                              SS NOV85 21330000
ISPPANDI DS    0H                                              SS NOV85 21340000
         STM   R2,R4,SPFSAVR2                                  SS NOV85 21350000
         L     R4,ISPPANDA   LOAD ADDRESS OF SUBROUTINE        SS MAR85 21360000
         BASR  R3,R4                                           SS NOV85 21370000
         LM    R2,R4,SPFSAVR2                                  SS NOV85 21380000
         BR    R2                                              SS NOV85 21390000
         SPACE 1                                               SS MAR85 21400000
*                                                              SS NOV85 21410000
*       INTERFACE FOR ISPSETVS                                 SS NOV85 21420000
*                                                              SS NOV85 21430000
ISPSETVI DS    0H                                              SS NOV85 21440000
         L     R0,ISPSETVA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21450000
         B     ISPSUBI                                         SS AUG86 21460000
         SPACE 1                                               SS MAR85 21470000
*                                                              SS NOV85 21480000
*       INTERFACE FOR MEMLIST                                  SS NOV85 21490000
*                                                              SS NOV85 21500000
MEMLISTI DS    0H                                              SS NOV85 21510000
         L     R0,AMEMLIST   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21520000
         B     ISPSUBI                                         SS AUG86 21530000
         SPACE 1                                               SS MAR85 21540000
*                                                              SS NOV85 21550000
*       INTERFACE FOR FIND COMMAND                             SS NOV85 21560000
*                                                              SS NOV85 21570000
ISPFNDI  DS    0H                                              SS NOV85 21580000
         L     R0,ISPFNDA    LOAD ADDRESS OF SUBROUTINE        SS AUG86 21590000
         B     ISPSUBI                                         SS AUG86 21600000
*                                                              SS NOV85 21610000
*       INTERFACE FOR ISPVSTAT                                 SS NOV85 21620000
*                                                              SS NOV85 21630000
ISPVSTAI DS    0H                                              SS NOV85 21640000
         L     R0,ISPVSTAA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21650000
         B     ISPSUBI                                         SS AUG86 21660000
         SPACE 1                                               SS MAR85 21670000
*                                                              SS NOV85 21680000
*       INTERFACE FOR ISPVSPAC                                 SS NOV85 21690000
*                                                              SS NOV85 21700000
ISPVSPAI DS    0H                                              SS NOV85 21710000
         L     R0,ISPVSPAA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21720000
         B     ISPSUBI                                         SS AUG86 21730000
         SPACE 1                                               SS MAR85 21740000
*                                                              SS NOV85 21750000
*       INTERFACE FOR SINGLE PANEL DISPLAY                     SS AUG86 21760000
*                                                              SS AUG86 21770000
ISPSINGI DS    0H                                              SS AUG86 21780000
         L     R0,ISPSINGA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21790000
         B     ISPSUBI                                         SS AUG86 21800000
         SPACE 1                                               SS MAR85 21810000
*                                                              SS NOV85 21820000
*       INTERFACE FOR ISPEXEC SELECT                           SS AUG86 21830000
*                                                              SS AUG86 21840000
ISPSLCTI DS    0H                                              SS AUG86 21850000
         L     R0,ISPSLCTA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21860000
         B     ISPSUBI                                         SS AUG86 21870000
         SPACE 3                                               SS AUG86 21880000
*                                                              SS NOV85 21890000
*       INTERFACE FOR OPEN LISTC/LISTF TABLE                   SS AUG86 21900000
*                                                              SS AUG86 21910000
ISPLSCOI DS    0H                                              SS AUG86 21920000
         L     R0,ISPLSCOA   LOAD ADDRESS OF SUBROUTINE        SS AUG86 21930000
         B     ISPSUBI                                         SS AUG86 21940000
         SPACE 3                                               SS AUG86 21950000
*                                                              SS NOV88 21960000
*       INTERFACE TO CHANGE VIEW LOG                           SS NOV88 21970000
*                                                              SS NOV88 21980000
ISPVIEWI DS    0H                                              SS NOV88 21990000
         L     R15,ISPVIEWA  LOAD ADDRESS OF SUBROUTINE        SS NOV88 22000000
         B     ISPSUBM                                         SS NOV88 22010000
         SPACE 3                                               SS NOV88 22020000
*                                                              SS AUG86 22030000
*  MED LV  SUBROUTINE INTERFACE CODE, R0=ADDR                  SS NOV88 22040000
*                                                              SS AUG86 22050000
ISPSUBI  DS    0H                                              SS AUG86 22060000
         STM   R2,R4,SPFSAVR2                                  SS NOV85 22070000
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS AUG86 22080000
         BASR  R3,R4                                           SS NOV85 22090000
         LM    R2,R4,SPFSAVR2                                  SS NOV85 22100000
         BR    R2                                              SS NOV85 22110000
         SPACE 5                                               SS MAR85 22120000
*                                                              SS NOV88 22130000
*  MED LV  SUBROUTINE INTERFACE CODE, R15=ADDR                 SS NOV88 22140000
*                                                              SS NOV88 22150000
ISPSUBM  DS    0H                                              SS NOV88 22160000
         STM   R2,R4,SPFSAVR2                                  SS NOV85 22170000
         LR    R4,R15        LOAD ADDRESS OF SUBROUTINE        SS NOV88 22180000
         BASR  R3,R4                                           SS NOV88 22190000
         LM    R2,R4,SPFSAVR2                                  SS NOV88 22200000
         BR    R2                                              SS NOV88 22210000
         SPACE 5                                               SS NOV88 22220000
*                                                              SS NOV85 22230000
*    LOG COMMAND IN SESSION LOG                                SS NOV85 22240000
*                                                              SS NOV85 22250000
ISPLOGCD DS    0H                                              SS NOV85 22260000
         STM   R2,R4,SPFSVLR2                                  SS NOV85 22270000
         LA    R15,1(,R15)                                    ABL OCT84 22280000
         ST    R15,SPFSTART                                   ABL OCT84 22290000
         LH    R3,0(,R1)          GET BUFFER LENGTH            SS MAY85 22300000
         LA    R4,4(,R1)                                       SS MAY85 22310000
         S     R3,ISPL4           LESS -4 FOR HEADER           SS MAY85 22320000
         MVI   SPFLINE,C'>'       FLAG CMD LINE                SS MAY85 22330000
ISPCOLP  MVI   SPFLINE+1,C' '     BLANK                        SS MAY85 22340000
         MVC   SPFLINE+2(158),SPFLINE+1 RIPPLE                 SS OCT88 22350000
         CH    R3,ISPH78          LENGTH 78                    SS MAY85 22360000
         BNH   ISPCOLPL           LESS , LAST                  SS MAY85 22370000
         CLC   SPFLINE+1(78),0(R4) IS IT A BLANK LINE          SS MAY85 22380000
         BE    ISPCOLPN           YES SKIP TO NEXT             SS MAY85 22390000
         MVC   SPFLINE+1(78),0(R4) COPY GOOD LINE              SS MAY85 22400000
         BAS   R2,ISPADDCO        PUT IT INTO THE TABLE        SS MAY85 22410000
         MVI   SPFLINE,C'-'       FLAG ADDITIONAL LINES        SS MAY85 22420000
ISPCOLPN LA    R4,78(,R4)         NEXT PART OF LINE            SS MAY85 22430000
         SH    R3,ISPH78          REDUCE BY LENGTH             SS MAY85 22440000
         B     ISPCOLP                                         SS MAY85 22450000
ISPCOLPL BCTR  R3,0               ONE LESS FOR MVC             SS MAY85 22460000
         CLC   SPFLINE+1(0),0(R4) IS IT A BLANK LINE           SS MAY85 22470000
         EX    R3,*-6             EXECUTE IT                   SS MAY85 22480000
         BE    ISPCOLPS                                        SS MAY85 22490000
         MVC   SPFLINE+1(0),0(R4) COPY TO OUTPUT LINE          SS MAY85 22500000
         EX    R3,*-6             EXECUTE IT                   SS MAY85 22510000
         BAS   R2,ISPADDCO                                     SS MAY85 22520000
ISPCOLPS DS    0H                                              SS MAY85 22530000
         NI    SPFLAG3,FF-SPFLOGM LOGGED NOW                  ABL OCT84 22540000
         LM    R2,R4,SPFSVLR2                                  SS NOV85 22550000
         BR    R2                                              SS NOV85 22560000
         SPACE 5                                               SS MAR85 22570000
*                                                              SS NOV85 22580000
*       INTERFACE FOR ISPSTACK                                 SS NOV85 22590000
*                                                              SS NOV85 22600000
*  SWAP TO LOG                                                 SS NOV85 22610000
ISPSTKLG DS    0H                                              SS NOV85 22620000
         LH    R1,SPFFUNLP+0       GET LOG LAST PANEL          SS NOV88 22630000
         LNR   R1,R1               SET FOR SWAP                SS NOV88 22640000
*  STACK PANEL INDEX IN R1                                     SS NOV85 22650000
ISPSTKI  DS    0H                                              SS NOV85 22660000
         STM   R2,R4,SPFSVLR2                                  SS OCT88 22670000
         L     R4,ISPSTKA    LOAD ADDRESS OF SUBROUTINE        SS MAR85 22680000
         BASR  R3,R4                                           SS NOV85 22690000
         LM    R2,R4,SPFSVLR2                                  SS OCT88 22700000
         C     R15,ISPL8                                       SS NOV85 22710000
         BNL   ISPERR                                          SS NOV85 22720000
         BR    R2                                              SS NOV85 22730000
         SPACE 5                                               SS MAR85 22740000
*                                                              SS NOV85 22750000
*       MEMLIST UNSTACK (HAS INTERFACE TO ISPSTACK)            SS NOV85 22760000
*       (TERMINATE MEMLIST)                                    SS OCT88 22770054
*                                                              SS NOV85 22780000
ISPTERMM DS    0H                                              SS NOV85 22790000
ISPUSTKM DS    0H                                              SS NOV85 22800000
         STM   R2,R4,SPFSVLR2                                  SS OCT88 22810000
         L     R4,ISPSTKA    LOAD ADDRESS OF SUBROUTINE        SS MAR85 22820000
         CLI   SPFFUNST+1,C'I'   INACTIVE MEMLIST              SS AUG86 22830000
         BE    ISPUSTK8          OK     *                      SS AUG86 22840000
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88 22850000
ISPUSTK4 DS    0H                       *                      SS AUG86 22860000
         BAS   R2,ISPSETST              SAVE STATS ORG TABLE   SS AUG86 22870000
         CLI   SPFTBPFI+1,1             MEMLIST FUNCTION       SS AUG86 22880000
         BE    ISPUSTK6                 YES, KILL TABLE        SS AUG86 22890000
         STH   R14,SPFTSVH              SAVE PANEL ID          SS AUG86 22900000
         LH    R1,SPFFUNLP+2            GET MEMLIST PANEL ID   SS AUG86 22910000
         LNR   R1,R1                    SET FOR SWAP           SS AUG86 22920000
         BASR  R3,R4                                           SS NOV85 22930000
ISPUSTK6 DS    0H                       *                      SS AUG86 22940000
         NI    SPFTFLG1,255-SPFTZSV-SPFTRET  CANCEL THEM       SS AUG86 22950000
         TM    SPFTFLG1,SPFTLCD         PENDING LINE CMDS?    ABL FEB87 22960000
         BZ    ISPUSTK7                 NO, BRANCH            ABL FEB87 22970000
         NI    SPFTFLG1,255-SPFTLCD-SPFTMUT RESET CANCEL      ABL FEB87 22980000
ISPUSTK7 DS    0H                                             ABL FEB87 22990000
         BAS   R2,ISPTBT#M       DELETE MEMLIST TABLE          SS AUG86 23000000
         BAS   R2,ISPSETST       UPDATE STATUS                 SS AUG86 23010000
         LH    R1,SPFFUNLP              GET LOG PANEL ID       SS AUG86 23020000
         LNR   R1,R1                    SET FOR SWAP           SS AUG86 23030000
         BASR  R3,R4                                           SS NOV85 23040000
ISPUSTK8 DS    0H                       *                      SS AUG86 23050000
         LM    R2,R4,SPFSVLR2                                  SS OCT88 23060000
         BR    R2                                              SS NOV85 23070000
         SPACE 5                                               SS MAR85 23080000
ISPEXIT  DS    0H                                              SS JUL84 23090000
         TM    SPFLAG3,SPFREFR          NEED REFRESH           SS AUG86 23100000
         BZ    ISPEXIT2                 NO                     SS AUG86 23110000
*        BAS   R2,ISPCTLSM        FORCE DISPLAY REFRESH        SS AUG88 23120000
         L     R1,SPFSAV1         RELOAD R1                    SS AUG86 23130000
ISPEXIT2 MVI   SPFLAG1,0      TURN OFF FUNCTION                SS AUG86 23140000
         LM    R2,R8,SPFSAV2                                   SS AUG86 23150000
         L     R14,SPFSAV14                                    SS JUL84 23160000
         B     4(R14)                                          SS JUL84 23170000
         SPACE 5                                               SS MAR85 23180000
*                                                              SS AUG86 23190000
*  HIGH LEVEL SUBROUTINE INTERFACES                            SS NOV88 23200000
*                                                              SS AUG86 23210000
         SPACE 5                                               SS MAR85 23220000
*                                                              SS AUG86 23230000
*  TRAP COMMAND OUTPUT  INTERFACES                             SS NOV88 23240000
*                                                              SS AUG86 23250000
ISPTRAPI DS    0H                       *                      SS NOV88 23260000
         L     R0,ISPTRAPA              *                      SS NOV88 23270000
         B     ISPSUBIH                 *                      SS NOV88 23280000
         SPACE 5                                               SS MAR85 23290000
*                                                              SS AUG86 23300000
*  HIGH LEVEL SUBROUTINE INTERFACE CODE, R0=ADDR               SS NOV88 23310000
*                                                              SS AUG86 23320000
ISPSUBIH DS    0H                                              SS AUG86 23330000
         STM   R2,R4,SPFSVHR2                                  SS NOV85 23340000
         LR    R4,R0         LOAD ADDRESS OF SUBROUTINE        SS AUG86 23350000
         BASR  R3,R4                                           SS NOV85 23360000
         LM    R2,R4,SPFSVHR2                                  SS NOV85 23370000
         BR    R2                                              SS NOV85 23380000
         SPACE 5                                               SS MAR85 23390000
         TITLE 'P D S  --  ISPF DIALOG CONSTANTS'                       23400000
*                                                              SS JUL84 23410000
*  CONSTANTS                                                   SS JUL84 23420000
*                                                              SS JUL84 23430000
*  ISPF FUNCTIONS                                              SS JUL84 23440000
ISPCNTL  DC    C'CONTROL'                                      SS JUL84 23450000
ISPDISP  DC    C'DISPLAY'                                      SS NOV84 23460000
ISPLOG   DC    C'LOG '                                        ABL FEB87 23470000
TBADD    DC    C'TBADD'                                        SS JUL84 23480000
TBBOTTOM DC    C'TBBOTTOM'                                     SS JUL84 23490000
TBCREATE DC    C'TBCREATE'                                     SS JUL84 23500000
TBDELETE DC    C'TBDELETE'                                     SS JUL84 23510000
TBDISPL  DC    C'TBDISPL'                                      SS JUL84 23520000
TBEND    DC    C'TBEND'                                        SS JUL84 23530000
TBGET    DC    C'TBGET'                                        SS JUL84 23540000
TBMOD    DC    C'TBMOD'                                        SS JUL84 23550000
TBPUT    DC    C'TBPUT'                                        SS JUL84 23560000
TBQUERY  DC    C'TBQUERY'                                      SS JUL84 23570000
TBSCAN   DC    C'TBSCAN'                                       SS JUL84 23580000
TBSKIP   DC    C'TBSKIP'                                       SS JUL84 23590000
TBTOP    DC    C'TBTOP'                                        SS JUL84 23600000
TBVCLEAR DC    C'TBVCLEAR'                                     SS JUL84 23610000
TBSORT   DC    C'TBSORT'                                       SS AUG86 23620000
VCOPY    DC    C'VCOPY'                                        SS JUL84 23630000
VDEFINE  DC    C'VDEFINE'                                      SS JUL84 23640000
VDELETE  DC    C'VDELETE'                                      SS JUL84 23650000
VGET     DC    C'VGET'                                         SS JUL84 23660000
VPUT     DC    C'VPUT'                                         SS OCT88 23670000
VRESET   DC    C'VRESET'                                       SS JUL84 23680000
VREPLACE DC    C'VREPLACE'                                     SS DEC87 23690000
*  ISPF OPERANDS                                               SS JUL84 23700000
ISPLRSCR DC    C'LRSCROLL'                                    DRK JUN19 23710099
ISPPASON DC    C'PASON'                                       DRK JUN19 23720099
ISPPASOF DC    C'PASOFF'                                      DRK JUN19 23730099
ISPDSP   DC    C'DISPLAY'                                      SS JUL84 23740099
ISPNOND  DC    C'NONDISPL'                                     SS NOV84 23750000
ISPENTER DC    C'ENTER'                                        SS JUL87 23760000
ISPERRS  DC    C'ERRORS'                                       SS AUG86 23770000
ISPRETN  DC    C'RETURN'                                       SS AUG86 23780000
ISPCANCL DC    C'CANCEL'                                       SS AUG86 23790000
ISPORDER DC    C'ORDER'                                        SS AUG86 23800000
ISPSAVE  DC    C'SAVE'                                         SS JUL84 23810000
ISPRSTR  DC    C'RESTORE'                                      SS JUL84 23820000
ISPCHAR  DC    C'CHAR'                                         SS JUL84 23830000
ISPFIX   DC    C'FIXED'                                        SS JUL84 23840000
ISPMOVE  DC    C'MOVE'                                         SS JUL84 23850000
ISPNOWRT DC    C'NOWRITE'                                      SS JUL84 23860000
ISPNORAD DC    C'NOREAD '                                      SS MAY89 23870000
ISPNEXT  DC    C'NEXT'                                         SS JUL87 23880000
*SPPANAL DC    C'P..PN   '                                     SS NOV85 23890000
ISPPDSM  DC    C'PDS&M..N'                                    ABL OCT84 23900000
ISPL1A   DC    C'PDS&M.1A'                                    DRK AUG98 23910017
ISPL1C   DC    C'PDS&M.1C'                                    DRK AUG08 23920073
ISPSM    DC    C'SM '                                         ABL OCT84 23930000
ISPSHARE DC    C'SHARED '                                     ABL SEP84 23940000
ISPPROFL DC    C'PROFILE '              *                      SS AUG86 23950000
ISPYES   DC    C'YES'          GENERAL PURPOSE YES AND NO      SS DEC87 23960000
ISPNO    DC    C'NO '          TBDSPLY AUTOSEL=NO              SS MAR85 23970000
ISPCCMD  DC    C'CMD'          SELECT CMD                      SS AUG86 23980000
ISPPGM   DC    C'PGM'          SELECT PGM                      SS AUG86 23990000
ISPTRAP  DC    C'TRP'          SYSOUT TRAP OPTION              SS NOV88 24000000
ISPGT    DC     C'(GT)'            CONDLIST(NE)                SS JUL87 24010000
*  ISPF VARIABLE NAMES AND NAME LISTS                          SS JUL84 24020000
VSPFVFIX DC    C'('        START OF FIX DIALOG VERBS           SS SEP84 24030000
VSPFFIX  DC    C'PDSFIX '                                      SS JUL84 24040000
VSPFFIX2 DC    C'PDSFIX2 '                                     SS JUL84 24050000
VSPFCRP  DC    C'PDSCRP '                                      SS JUL84 24060000
VZTDTOP  DC    C'ZTDTOP '                                      SS JUL84 24070000
VZTDSELS DC    C'ZTDSELS '              *                      SS AUG86 24080000
         DC    C'PDSCSIZE '             *                      SS AUG86 24090000
         DC    C'PDSCMAX '              *                      SS AUG86 24100000
         DC    C'PDSCCKPT '             *                      SS AUG86 24110000
         DC    C'PDSTTSIZ '             *                      SS OCT88 24120000
         DC    C'ZSCROLLN '             *                      SS OCT88 24130000
         DC    C')'        END OF FIX DIALOG VERBS             SS SEP84 24140000
VSPFMSG  DC    C'PDSMSG '                                      SS JUL84 24150000
VSPFMSG1 DC    C'PDSMSG1 '                                    ABL JUN85 24160000
VSPFMSG2 DC    C'PDSMSG2 '                                    ABL JUN85 24170000
VZCMD    DC    C'ZCMD '                                        SS JUL84 24180000
VZTIME   DC    C'ZTIME '                                       SS JUL84 24190000
VZSCREEN DC    C'ZSCREEN '                                    DRK MAR03 24200034
VZENVIR  DC    C'ZENVIR '  ISPF V2 INDICATOR                   SS MAR85 24210000
VZVERB   DC    C'ZVERB '                                      ABL SEP84 24220000
VZSCRLL  DC    C'('                     *                      SS OCT88 24230000
VZSCRLA  DC    C'ZSCROLLA '             *                      SS OCT88 24240000
VZSCRLN  DC    C'ZSCROLLN '             *                      SS OCT88 24250000
         DC    C')'                     *                      SS OCT88 24260000
VPDSLN1  DC    C'PDSLN1 '               *                      SS OCT88 24270000
VPDSLN2  DC    C'PDSLN2 '               *                      SS OCT88 24280000
VPDSLN1W DC    C'PDSLN1W '                                    DRK JUL04 24290050
VPDSLIN  DC    C'(PDSLN1 PDSLN2 PDSLN1W)' TABLE VARIABLES     DRK JUL04 24300050
* THE FOLLOWING CONSTANTS DEFINE THE TABLE VARIABLES, BOTH KEY AND      24310000
*   NAMES                                                               24320000
         SPACE                                                          24330000
MEMLTKEY DC    C'(MEMLNAME)'       TABLE KEY                            24340000
         SPACE 3                                                        24350000
MEMLTDAT DC    C'MEMLDATA '        USER ENTERED DATA                    24360000
MMLOPT   DC    C'MEMLOPT '                                              24370000
MMLALIS  DC    C'MEMLALIS '                                             24380000
MMLTTR   DC    C'MEMLTTR '         MEM TBL ALIAS SCAN ARG LIST          24390000
         SPACE                                                          24400000
         EJECT                                                          24410000
*  ISPF VARIABLE LENGTHS                                                24420000
ISPL0    DC    F'0'                     *                      SS MAY89 24430000
ISPL1    DC    F'1'                     LENGTH OF TYPE  VAR    SS SEP84 24440000
ISPL2    DC    F'2'                     LENGTH OF DSORG VAR    SS SEP84 24450000
ISPL4    DC    F'4'                     LENGTH OF FIXED VAR    SS JUL84 24460000
ISPL6    DC    F'6'                     LENGTH OF VOLUME VAR   SS SEP84 24470000
ISPL8    DC    F'8'                     LENGTH OF 8            SS JUL84 24480000
ISPL32   DC    F'32'                    LENGTH OF ZENVIR       SS MAR85 24490000
ISPL44   DC    F'44'                    LENGTH OF DSN          SS SEP84 24500000
ISPLMSG  DC    F'79'                    LENGTH OF SPFMSG      ABL NOV84 24510000
ISPL80   DC    F'80'                    LENGTH OF TABLE VAR   ABL APR86 24520000
ISPL250  DC    F'250'                   LENGTH OF ZSEL/ZCMD    SS SEP84 24530000
ISPX80   DC    X'80000000'              HI ORDER BIT           SS JUL88 24540000
ISPH78   DC    H'78'                    LENGTH OF MSG VAR-1    SS JUL84 24550000
ISPH79   DC    H'79'                    LENGTH OF TABLE VAR-1 ABL APR86 24560000
ISPH159  DC    H'159'                   LENGTH OF LINE         SS OCT88 24570000
ISPH5    DC    H'5'                     LEN PUTL BUF LESS HEAD SS JUL84 24580000
ISPH12   DC    H'12'                    RC 16                  SS NOV84 24590000
ISPH16   DC    H'16'                    RC 16                  SS NOV84 24600000
ISPH9999 DC    H'9999'                  *                      SS AUG86 24610000
ISPLEN   DC    H'52',H'0'               LENGTH (ZCMD+4,0)     ABL OCT84 24620000
ISPLEN2  DC    H'254',H'0'              LENGTH (ZCMD+4,0)      SS NOV84 24630000
*  ISPF SUBROUTINE ACONS                                                24640000
ISPVERAD DC    A(ISPVER11)                                     SS MAR85 24650000
ISPALICA DC    A(ISPALICK)                                     SS MAR85 24660000
ISPTBDSA DC    A(ISPTBDSP)                                     SS MAR85 24670000
ISPPANDA DC    A(ISPPAND)                                      SS MAR85 24680000
ISPSETVA DC    A(ISPSETVS)                                     SS MAR85 24690000
ISPPARSA DC    A(ISPPARSE)                                     SS MAR85 24700000
ISPVINIA DC    A(ISPVINIT)                                     SS MAR85 24710000
ISPSTKA  DC    A(ISPSTACK)                                     SS NOV85 24720000
ISPESTAE DC    V(STAEEXIT)                                    ABL JUN85 24730000
VLOGDATA DC    V(LOGDATA)                                      SS JUL85 24740000
ISPRLOGA DC    A(ISPRLOG)                                      SS MAY85 24750000
ISPFNDA  DC    A(ISPFND)                                       SS NOV85 24760000
AMEMLIST DC    A(MEMLIST)                                      SS JUL85 24770000
MEMLFUNA DC    A(MEMLFUNC)                                     SS NOV85 24780000
ISPLNCA  DC    A(ISPLNC2)                                     ABL FEB86 24790000
ISPMOVEA DC    A(ISPMOVES)              MOVE TABLE             SS AUG86 24800000
ISPVSTAA DC    A(ISPVSTAT)                                     SS AUG86 24810000
ISPVSPAA DC    A(ISPVSPAC)                                     SS AUG86 24820000
ISPSINGA DC    A(ISPSINGL)              MOVE TABLE             SS AUG86 24830000
ISPGET3A DC    A(GET370GN)              GET GENERIC            SS AUG86 24840000
ISPSLCTA DC    A(ISPSLCT)               ISPEXEC SELECT         SS AUG86 24850000
ISPTRAPA DC    A(ISPTRAPX)              TRAP TSO CMD OUTPUT    SS NOV88 24860000
ISPLSCOA DC    A(ISPLSCOP)              OPEN LISTC/LISTF TBL   SS OCT88 24870000
*  ISPF OTHER CONSTANTS                                                 24880000
$ATT     DC    CL8'&NATT '                                     SS JUL85 24890000
$HIS     DC    CL8'&NHIS '                                     SS JUL85 24900000
$MAP     DC    CL8'&NMAP '                                     SS JUL85 24910000
$MML     DC    CL8'&NMML '                                     SS JUL85 24920000
$SUL     DC    CL8'&NSUL '                                    ABL APR86 24930000
$UT1     DC    CL8'&NUT1 '                                     SS JUL85 24940000
$UT2     DC    CL8'&NUT2 '                                     SS JUL85 24950000
ISPBLK44 DC    CL44' '                                        DRK AUG98 24960018
         ORG   ISPBLK44                                       DRK AUG98 24970018
ISPBLK8  DC    CL8' '                                          SS SEP84 24980000
         ORG   ,                                              DRK AUG98 24990018
ISPPDS   DC    C'PDS'                                          SS JUL84 25000000
ISPCEND  DC    C'END '                                         SS NOV84 25010000
ISPCPAN  DC    C'PANEL('                                       SS NOV84 25020000
ISP300A  DC    C'PDS300A'               MSG TO SKIP            SS AUG84 25030000
ISP381A  DC    C'PDS381A'               DSNAME PROMPT         ABL APR86 25040000
ISP390A  DC    C'PDS390A'               RESTORE PROMPT        ABL APR86 25050000
ISPALIS  DC    CL8'*AL*  '                                     SS SEP84 25060000
ISPUNKN  DC    CL8'*UNKNOWN'                                   SS SEP84 25070000
ISPORP   DC    CL8'*ORPHAN'                                    SS SEP84 25080000
ISPNEWNM DC    CL8'*NEWNAME'                                  ABL OCT84 25090018
ISPERMSG DC    CL8'**ERROR*'                                  ABL OCT84 25100018
ISPATTN  DC    CL8'**ATTN**'                                  ABL APR85 25110018
ISPINVLD DC    CL8'*INVALID'                                  ABL OCT84 25120018
ISPEDIT  DC    CL8'*EDIT'               *                      SS JUL87 25130000
ISPBUSY  DC    CL8'*BUSY'               *                      SS FEB89 25140000
ISPPO    DC    C'PO'                                           SS SEP84 25150000
ISPPS    DC    C'PS'                                           SS SEP84 25160000
**PUTDOT DC    C'  UT.'                                       ABL FEB86 25170000
ISPENDIT DC    X'000D0000',CL9'&NEND'                          SS JUL84 25180000
ISPDSNMG DC    X'000D0000',CL9'&NDSN'                          SS JUL84 25190000
ISPMALL  DC    X'00100000',CL9'&NMML ',CL3':  '              ABL NOV84  25200000
ISPSUBL  DC    X'00150000',CL9'&NSUL ',CL8'*  ALIAS '          SS AUG86 25210000
ISPCMD21 DC    X'00150000'                                     SS SEP84 25220000
ISPCMD30 DC    X'001E0000'                                    ABL DEC84 25230000
ISPCMD34 DC    X'00220000'                                    ABL JAN87 25240000
ISPPASST DC    C'PASSTHRU'    USED TO CONTROL USRXXXX VARS     SS AUG86 25250000
ISPBLKC  EQU   X'&IBLK'       BLANK OUT LINE CMD               SS JUL87 25260000
STAELIST ESTAE *-*,PARAM=*-*,MF=L                              SS JUL85 25270000
         SPACE 2                                               SS MAR85 25280000
* PARSE PARM LIST OPTIONS                                      SS MAR85 25290000
*        DC    X'XX'   OPTION FLAG                             SS MAR85 25300000
*              X'80'   STRING   (MUST BE FIRST IF USED)        SS MAR85 25310000
*              X'40'   NUMERIC PARM (MUST BE FIRST AFTER STR)  SS MAR85 25320000
*              X'20'   KEYWORD (NO SUB VALUES)                 SS MAR85 25330000
*              X'10'   ALLOW KEYWORD SINGLE CHAR MATCH         SS MAR85 25340000
*              X'10'   CHECK STRING FOR IMBED CHAR (FUTURE)    SS MAR85 25350000
*              X'10'   NUMERIC RANGE CHECK REQUESTED           SS MAR85 25360000
*              X'00-07' LENGTH OF COMPARE                      SS MAR85 25370039
*              X'FF'   END OF TABLE                            SS MAR85 25380000
*        DC    X'XX'   BITS ORED IF MATCH                      SS MAR85 25390000
*        DC    CL8''/F'',F''                                   SS MAR85 25400000
*                      KEYWORD                                 SS MAR85 25410000
*                      RANGE VALUES                            SS MAR85 25420000
         SPACE 2                                               SS MAR85 25430000
* PARSE PARM LIST FOR STRING ONLY                              SS MAR85 25440000
ISPPARST DC    X'80',X'80',X'00',X'00',CL8' ',X'FF'            SS MAR85 25450000
         SPACE 1                                               SS MAY85 25460000
* PARSE PARM LIST FOR RECALL                                   SS MAR85 25470000
         SPACE 3                                               SS MAR85 25480000
L7FFF    EQU   32767                                           SS MAR85 25490000
H7FFF    DC    H'32767'                                        SS MAR85 25500000
         SPACE 1                                               SS JUL85 25510000
         LTORG                                                          25520000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV3                 DRK JAN13 25530099
C_DCBE   DCBE  EADSCB=OK                                       JH DEC12 25540099
C_DCBEL  EQU   *-C_DCBE                                        JH DEC12 25550099
.NOEAV3  ANOP                                                 DRK JAN13 25560099
         SPACE 1                                               SS SEP84 25570000
* ADDCONS TO COMMAND TABLES AND TABLE ENTRIES                  SS NOV84 25580000
ISPEXECA DC    A(ISPEXECT)                                    ABL DEC84 25590000
ISP$PNA  DC    A(ISP$PAN)                                      SS MAR85 25600000
ISP$TMGA DC    A(ISP$TMG)                                      SS MAR85 25610000
ISP$ENDA DC    A(ISP$END)                                      SS AUG86 25620000
ISP$FUNA DC    A(ISP$FUN)                                      SS AUG86 25630000
ISP$RCHA DC    A(ISP$RCH)                                      SS AUG86 25640000
ISP$LOGA DC    A(ISP$LOG)                                      SS AUG86 25650000
         SPACE 2                                               SS NOV84 25660000
         COPY  @DIATBL                                         SS FEB89 25670000
         COPY  @DIAPANL                 *                      SS FEB89 25680000
         COPY  @DIAPART                 *                      SS FEB89 25690000
         COPY  @DIACLN                  *                      SS OCT88 25700000
         COPY  @DIAFUN                  *                      SS OCT88 25710000
         COPY  @DIAINIT                 *                      SS NOV88 25720000
         COPY  @DIASEL                  *                      SS NOV88 25730000
         COPY  @DIAFIND                 *                      SS OCT88 25740000
         COPY  @DIAOUT                  *                      SS OCT88 25750000
         COPY  @DIASTAK                 *                      SS FEB89 25760000
         COPY  @DIAMEML                 *                      SS NOV88 25770000
         COPY  @DIALALV                 *                      SS FEB89 25780000
         COPY  @DIALSTC                 *                      SS OCT88 25790000
         COPY  @DIATCT                  *                      SS NOV88 25800000
         COPY  @DIACAX                  *                      SS NOV88 25810000
         COPY  @DIALINE                 *                      SS NOV88 25820000
         COPY  @DIALINZ                 *                      SS AUG89 25830000
         SPACE 5                                               SS JUL87 25840000
         TITLE  'MODEL SUBROUTINE'                             SS JUL87 25850000
*************************************************************  SS NOV85 25860000
*      MODEL SUBROUTINE                                        SS NOV85 25870000
*      MODEL SUBROUTINE                                        SS NOV85 25880000
*      MODEL SUBROUTINE                                        SS NOV85 25890000
*************************************************************  SS NOV85 25900000
         SPACE 2                                                        25910000
ISPXXXX  DS    0H                                              SS NOV85 25920000
         USING *,R4                                            SS NOV85 25930000
         SPACE 1                                                        25940000
         BR    R3                                              SS NOV85 25950000
         DROP  R4                                             DRK FEB98 25960000
         SPACE 5                                               SS NOV85 25970000
         TITLE  'GET 370 EDT UCB ADDRESS BY GENERIC'           SS AUG86 25980000
GET370GN DS    0H                       *                      SS AUG86 25990000
         USING GET370GN,R15             *                      SS AUG86 26000000
         SAVE  (14,12),T,GET370GN       *                      SS AUG86 26010000
         LM    R2,R4,0(R1)              GET PARMS              SS AUG86 26020000
         ST    R13,4(,R2)               BACK SAVE POINTER      SS AUG86 26030000
         ST    R2,8(,R13)               FORWARD POINTER        SS AUG86 26040000
         LR    R13,R2                   NEW SAVE AREA          SS NOV85 26050000
         USING GET3WORK,R13             *                      SS AUG86 26060000
         CLC   GET3SAVE(4),GET3TAG      MY TAG                 SS AUG86 26070000
         BE    GET3NXTU                 GET NEXT UNIT          SS AUG86 26080000
         OC    GET3SAVE(4),GET3SAVE     CHECK FOR ZEROS        SS AUG86 26090000
         BNE   GET3RC4                  WHAT CAN I DO          SS AUG86 26100000
         MVC   GET3SAVE(4),GET3TAG      MY TAG                 SS AUG86 26110000
         L     R5,CVTPTR(,R0)           *                      SS AUG86 26120000
         L     R6,X'28'(R5)             *                     ABL FEB87 26130000
         ST    R6,GET3LK2               *                      SS AUG86 26140000
         L     R5,CVTJESCT-CVT(R5)      JESCT TO GET EDT       SS AUG86 26150000
         L     R5,JESEDT-JESCT(R5)      EDT ADDRESS            SS AUG86 26160000
         L     R5,EDTLKUP-EDT(R5)       LOOK UP SECTION        SS AUG86 26170000
         L     R6,0(R5)                 COUNT OF LKUP ENT      SS AUG86 26180000
         LA    R5,8(,R5)                FIRST ENTRY            SS AUG86 26190000
GET3IGN  DS    0H                       *                      SS AUG86 26200000
         CLC   LKPNAME-LKPSECT(8,R5),0(R3) COMPARE NAME        SS AUG86 26210000
         BE    GET3GOT                  *                      SS AUG86 26220000
         LA    R5,LKPLNG(,R5)           NEXT ENT               SS AUG86 26230000
         BCT   R6,GET3IGN               *                      SS AUG86 26240000
         B     GET3RC4                  GENERIC NOT FOUND      SS AUG86 26250000
GET3GOT  DS    0H                       *                      SS AUG86 26260000
         L     R6,LKPGNRC#-LKPSECT(R5)  GET COUNT OF GENERICS  SS AUG86 26270000
         L     R5,LKPGNRC1-LKPSECT(R5)  FIRST GENERIC          SS AUG86 26280000
GET3IGP  DS    0H                       *                      SS AUG86 26290000
         ST    R6,GET3GENC              *                      SS AUG86 26300000
         ST    R5,GET3GENP                                     SS AUG86 26310000
         L     R6,GNRCGRP#-GNRCSECT(R5) COUNT OF GROUPS        SS AUG86 26320000
         L     R5,GNRCGRP1-GNRCSECT(R5) FIRST ENTRY            SS AUG86 26330000
GET3IUC  DS    0H                       *                      SS AUG86 26340000
         ST    R6,GET3GRPC              *                      SS AUG86 26350000
         ST    R5,GET3GRPP              *                      SS AUG86 26360000
         L     R5,0(,R5)                ADDRESS IN FIRST PTR   SS AUG86 26370000
         L     R6,GRPUCB#-GRPSECT(R5)   COUNT OF UCBS          SS AUG86 26380000
         L     R5,GRPUCB1-GRPSECT(R5)   FIRST UCB              SS AUG86 26390000
GET3GUC  DS    0H                       *                      SS AUG86 26400000
         ST    R6,GET3UCBC              *                      SS AUG86 26410000
         ST    R5,GET3UCBP              *                      SS AUG86 26420000
         LH    R6,0(R5)                 GET NUMBER             SS AUG86 26430000
         SLL   R6,1                     TIMES 2 FOR OFFSET     SS AUG86 26440000
         AL    R6,GET3LK2               ADD ADDRESS OF LK2     SS AUG86 26450000
         XC    0(4,R4),0(R4)            CLEAR UCB ADDRESS      SS AUG86 26460000
         MVC   2(2,R4),0(R6)            MOVE UCB ADDRESS       SS AUG86 26470000
         B     GET3RC0                  GOT ONE                SS AUG86 26480000
GET3NXTU DS    0H                       *                      SS AUG86 26490000
         L     R6,GET3UCBC              *                      SS AUG86 26500000
         L     R5,GET3UCBP              *                      SS AUG86 26510000
         LA    R5,UCBLNG(,R5)           NEXT ENT               SS AUG86 26520000
         BCT   R6,GET3GUC               *                      SS AUG86 26530000
         L     R6,GET3GRPC              *                      SS AUG86 26540000
         L     R5,GET3GRPP              *                      SS AUG86 26550000
         LA    R5,GRPPLNG(,R5)          NEXT ENT               SS AUG86 26560000
         BCT   R6,GET3IUC               *                      SS AUG86 26570000
         L     R6,GET3GENC              *                      SS AUG86 26580000
         L     R5,GET3GENP              *                      SS AUG86 26590000
         LA    R5,GNRCLNG(,R5)          NEXT ENT               SS AUG86 26600000
         BCT   R6,GET3IGP               *                      SS AUG86 26610000
* DONE                                  *                      SS AUG86 26620000
         MVI   GET3SAVE,255             TERMINATE TAG          SS AUG86 26630000
         LA    R1,4                     END OF LIST            SS AUG86 26640000
         B     GET3RTN                  *                      SS AUG86 26650000
GET3RC4  DS    0H                       *                      SS AUG86 26660000
         LA    R1,4                     *                      SS AUG86 26670000
         B     GET3RTN                  *                      SS AUG86 26680000
GET3RC0  DS    0H                       *                      SS AUG86 26690000
         SR    R1,R1                    *                      SS AUG86 26700000
GET3RTN  DS    0H                       *                      SS AUG86 26710000
         L     R13,4(,R13)              BACK UP SAVE AREAS     SS AUG86 26720000
         LR    R15,R1                   SET RC                 SS AUG86 26730000
         RETURN (14,12),T,RC=(15)       *                      SS AUG86 26740000
         DROP  R13,R15                  *                      SS AUG86 26750000
GET3TAG  DC   C'GET3'                   *                      SS AUG86 26760000
         SPACE 5                        *                      SS AUG86 26770000
*                                                              SS NOV85 26780061
*    END OF EXECUTABLE CODE                                    SS NOV85 26790000
*                                                              SS NOV85 26800000
         DROP  R5,R6,R7,R8                                    DRK NOV98 26810020
         TITLE 'P D S  --  ISPF WORK AREA 2                          '  26820065
         COPY  @DIAWRK                                         SS FEB89 26830000
         SPACE 5                                                        26840064
SYMDEL   DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09 26850080
         SPACE 1                                                        26860081
         TITLE 'P D S  --  PDS DYNAMIC AREA                          '  26870066
         COPY  #MDSECT                                         SS JUL85 26880000
         SPACE 5                                                        26890064
         TITLE 'P D S  --  DATA CONTROL BLOCK                        '  26900063
         DCBD  DSORG=PO                                        SS JUL85 26910000
         SPACE 5                                                        26920064
         TITLE 'P D S  --  THE USER PROFILE TABLE                    '  26930063
         IKJUPT                                                SS JUL85 26940000
         SPACE 5                                                        26950064
         TITLE 'P D S  --  TSO/E PROTECTED STEP CONTROL BLOCK        '  26960099
         IKJPSCB                                                        26970099
         SPACE 5                                                        26980099
         TITLE 'P D S  --  SVC 99 PARAMETER LIST             09/28/88'  26990063
         IEFZB4D0                                              SS JUL85 27000000
         SPACE 5                                                        27010064
         TITLE 'P D S  --  COMMUNICATIONS VECTOR TABLE               '  27020063
         CVT   DSECT=YES                                       SS JUL85 27030000
         SPACE 5                                                        27040064
         TITLE 'P D S  --  DATA SET ASSOCIATION BLOCK                '  27050063
         IHADSAB                                               SS NOV85 27060000
         SPACE 5                                                        27070064
         TITLE 'P D S  --  TASK CONTROL BLOCK                        '  27080063
         IKJTCB ,                                              SS NOV85 27090000
         SPACE 5                                                        27100064
         TITLE 'P D S  --  ENVIRONMENT CONTROL TABLE                 '  27110063
         IKJECT                                               GLA JUN88 27120000
         SPACE 5                                                        27130064
         TITLE 'P D S  --  TASK INPUT/OUTPUT TABLE                   '  27140063
TIOT     DSECT                                                 SS NOV85 27150000
         IEFTIOT1                                              SS NOV85 27160000
         SPACE 5                                                        27170064
         TITLE 'P D S  --  UNIT CONTROL BLOCK                        '  27180065
         IEFUCBOB ,                                            SS NOV85 27190000
         SPACE 5                                                        27200064
         TITLE 'P D S  --  UCB DASD CLASS EXTENSION                  '  27210065
         IECDDCE                                              DRK AUG98 27220019
         SPACE 5                                                        27230064
         TITLE 'P D S  --  JOB/STEP CONTROL BLOCK                    '  27240063
         IEZJSCB                                               SS NOV85 27250000
         SPACE 5                                                        27260064
         TITLE 'P D S  --  JOB FILE CONTROL BLOCK                    '  27270063
JFCB     DSECT                                                 SS NOV85 27280000
         IEFJFCBN                                              SS NOV85 27290000
         SPACE 5                                                        27300064
         TITLE 'P D S  --  STEP INPUT/OUTPUT TABLE                   '  27310063
SIOT     DSECT                                                 SS NOV85 27320000
         IEFASIOT                                              SS NOV85 27330000
         SPACE 5                                                        27340065
         TITLE 'P D S  --  DEVICE CHARACTERISTICS TABLE              '  27350065
         IHADVCT                                               SS NOV85 27360000
         SPACE 5                                                        27370065
         TITLE 'P D S  --  JOB ENTRY SUBSYSTEM COMMUNICATION TABLE   '  27380065
         IEFJESCT                                              SS NOV85 27390000
         SPACE 5                                                        27400064
         TITLE 'P D S  --  DATA SET CONTROL BLOCK                    '  27410065
         IECSDSL1  (2,3,4,5)                                   SS NOV85 27420000
         SPACE 5                                                        27430064
         AIF   ('&MVSLEV' LT 'MVS510').NODEAR                 DRK JAN08 27440068
         TITLE 'P D S  --  SYSTEM MANAGED DIRECTORY ENTRY            '  27450067
         IGWSMDE                                               GP JAN08 27460067
         SPACE 5                                                        27470067
         TITLE 'P D S  --  PROGRAM MANAGEMENT ATTRIBUTE RECORD       '  27480067
         IEWPMAR                                               GP JAN08 27490067
         SPACE 5                                                        27500067
.NODEAR  ANOP  ,                                              DRK JAN08 27510068
         SPACE 1                                                        27520081
SYMNODEL DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09 27530080
* FROM SHOWZOS                                                          27540062
IGGCAXWA DSECT                         CATALOG WORK AREA                27550061
CAXID    DS    C'CAX'                  CAX ID                           27560061
CAXFLG4  DS    X                       FLAGS (4)                        27570061
CAXLOCK  EQU   X'01'                   CATALOG LOCKED            RS0301 27580061
CAXCHN   DS    A(IGGCAXWA)             NEXT CAXWA IN CHAIN              27590061
CAXFLGS  DS    X                       FLAGS (1)                        27600061
CAXCLS   EQU   X'20'                   CLOSE IN CONTROL                 27610061
CAXMCT   EQU   X'04'                   MASTER CATALOG                   27620061
CAXCMR   EQU   X'02'                   CATALOG MANAGEMENT INVOKED       27630061
CAXSCR   EQU   X'01'                   SCHEDULER INVOKED                27640061
CAXFLG2  DS    X                       FLAGS (2)                        27650061
CAXF2DT  EQU   X'80'                   CATALOG DELETED                  27660061
CAXF2REC EQU   X'02'                   RECOVERABLE CATALOG              27670061
CAXFLG3  DS    X                       FLAGS (3)                        27680061
CAXF3ICF EQU   X'20'                   ICF TYPE CATALOG          RS1199 27690061
CAXF3SO4 EQU   X'02'                   ICF SHARE OPTION          RS1199 27700061
CAXF3SHD EQU   X'01'                   ICF CAT ON SHARED DASD    RS1199 27710061
CAXFLG5  DS    X                       FLAGS (5)                 RS1199 27720061
CAXF5CAS EQU   X'80'                   ALLOCATED TO CAS       DRK DEC21 27721099
CAXLCDB  EQU   X'10'                   VLF CACHE ACTIVE          RS1199 27730061
         DS    3F                                                RS1199 27740061
CAXACB   DS    V(IFGACB)               CATALOG'S ACB                    27750061
CAXUCB   DS    V(UCBOB)                CATALOG'S UCB ADDRESS (24-BIT)   27760061
         DS    FL3,FL3,FL3,FL3,H,H,A                                    27770061
CAXCNAM  DS    CL44                    CATALOG'S DSNAME                 27780061
         ORG   IGGCAXWA+147                                      RS1199 27790061
CAXFLG6  DS    X                       FLAGS (6)                 RS1199 27800061
CAXCDSCA EQU   X'20'                   VLF CACHE ACTIVE          RS1199 27810061
CAXISC   DS    F                       ISC TABLE POINTER         RS1199 27820061
         ORG   IGGCAXWA+188                                             27830061
CAXREUCB DS    V(UCBOB)                CATALOG'S UCB ADDRESS (31-BIT)   27840061
         DS    CL4,F                                             RS1199 27850061
CAXDSABP DS    F                       DSAB POINTER              RS1199 27860061
         DS    CL24                                              RS0701 27870061
CAXRECO  DS    F                       RECORDS                   RS0701 27880061
CAXSEAR  DS    F                       SEARCH                    RS0701 27890061
CAXFOUND DS    F                       FOUND                     RS0701 27900061
CAXDELET DS    F                       DELETES                   RS0701 27910061
CAXUPD   DS    F                       UPD                       RS0701 27920061
CAXPURGE DS    F                       PURGE                     RS0701 27930061
         DS    CL4                                               RS0701 27940061
CAXECS   DS    F                       ECS INDICATOR             RS0301 27950061
         END                                                            27960000
