         TITLE 'MEMLIST COMMAND   '                            SS AUG86 00010000
*                                       *                      SS AUG86 00020000
*       PROCESS MEMLIST TO UPDATE STATS *                      SS AUG86 00030000
*                                       *                      SS AUG86 00040000
         SPACE 1                                                        00050000
ISPMEMG  DS    0H                                             ABL JUN85 00060000
         USING ISPMEMG,R4               *                      SS AUG86 00070000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS MAR85 00080000
         MVI   PUTGETBF+1,13         MODIFY LENGTH FOR INSERT ABL APR85 00090000
         CLC   ##SUBCOM+1(7),$ATT+1  ATTRIBUTE SUBCOMMAND?    ABL APR85 00100000
         BNE   ISPMEMG2              NO, BRANCH               ABL APR85 00110000
         TM    #OPTOPT,X'F0'         ANY CHANGES IN ATTRS?    ABL APR85 00120000
         BNO   ISPMEMG4              NO, BRANCH                SS MAY88 00130000
         B     ISPMEMG3              DO MEMLIST ON MEMBER(S)   SS JAN86 00140000
ISPMEMG2 DS    0H                                             ABL APR85 00150000
* MEMLIST FOR EDIT                                             SS JAN86 00160000
* FUTURE OPTION .. DO MEMLIST ALL TODAY WITH TIME              SS JUL87 00170000
         CLI   SPFEDUP,C'Y'          FULL UPDATE REQUESTED     SS JUL87 00180000
         BE    ISPMGRTY              YES                       SS JUL87 00190000
         ICM   R14,15,SPFZDATA       GET RC FROM ISPLINK CALL  SS JAN86 00200000
         BNZ   ISPMEMG4              NO ZERO, NO SAVE DONE     SS MAY88 00210000
ISPMEMG3 DS    0H                                              SS JAN86 00220000
         LH    R14,SPFZSAV           GET LENGTH                SS MAR85 00230000
         SL    R14,ISPL4             LESS 4 FOR PREFIX         SS MAR85 00240000
         LA    R15,SPFZSAV+4         ADDR OF OPERATED          SS MAR85 00250000
         BAS   R2,ISPCKBLK           FIND FIRST COMMAND        SS MAR85 00260000
         LTR   R15,R15               WE OK                     SS MAR85 00270000
         BZ    ISPMEMG4              NO                        SS MAY88 00280000
         LA    R1,C' '               SCAN FOR BLANK            SS MAR85 00290000
         BAS   R2,ISPCLI                                       SS MAR85 00300000
         LTR   R15,R15               SHORT BUFFER              SS MAR85 00310000
         BZ    ISPMEMG4                                        SS MAY88 00320000
         LA    R1,ISPPARST           GET STRING PARSE          SS MAR85 00330000
         BAS   R2,ISPPARSI           PARSE ROUTINE             SS NOV85 00340000
         MVC   SPFMSGID(8),ISPBLK8   CLEAR ANY MESSAGE        ABL JUN85 00350000
         LTR   R15,R15               GOOD                      SS MAR85 00360000
         BNZ   ISPMGRP               NO, TRY LAST MEMBER GRP  ABL JUN85 00370000
         LH    R1,SPFPRLN            GET STRING LENGTH         SS MAR85 00380000
         L     R15,SPFPRSR           GET STRING ADDR           SS MAR85 00390000
         EX    R1,ISPMEMG0           COPY IT                   SS MAR85 00400000
         AH    R1,PUTGETBF           CALCULATE LENGTH OF DATA  SS MAR85 00410053
         STH   R1,PUTGETBF           STORE NEW LENGTH          SS MAR85 00420000
         OI    SPFLAG2,SPFUPDA       MUST BE REFRESHED         SS MAR84 00430000
         B     ISPEXIT                                         SS MAR85 00440000
ISPMEMG4 DS    0H                       *                      SS MAY88 00450000
         LA    R15,40                BACK THROUGH ISPDISP6     SS MAY88 00460000
         BR    R3                       *                      SS MAY88 00470000
ISPMEMG0 MVC   PUTGETBF+12(0),0(R15) COPY MEMBER OR  GROUP     SS MAR85 00480000
         SPACE 2                                                        00490000
ISPMGRP  DS    0H                                             ABL JUN85 00500000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS MAR85 00510000
         MVI   PUTGETBF+13,C'*'      CONVERT TO LAST GROUP     SS MAR85 00520000
         B     ISPEXIT                                         SS MAR85 00530000
* MEMLIST ALL TODAY WITH TIME           *                      SS JUL87 00540000
ISPMGRTY DS    0H                       *                      SS JUL87 00550000
         OI    MEMFLAG2,MEMLTMCK+MEMLTMED SET TIME CHECK       SS JUL87 00560000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS JUL87 00570000
         MVC   PUTGETBF+23(8),ISPBLK8   *                      SS JUL87 00580000
         MVC   PUTGETBF+15(8),ISPMGRTD                         SS JUL87 00590000
         MVC   PUTGETBF(2),ISPCMD30     *                      SS JUL87 00600000
         B     ISPEXIT                                         SS JUL87 00610000
ISPMGRTD DC    CL8'TODAY'               *                      SS JUL87 00620000
         DROP  R4                                             DRK NOV98 00630023
         TITLE 'MEMLIST COMMAND   '                            SS NOV85 00640000
*                                       *                      SS AUG86 00650000
*       PROCESS MEMLIST COMMAND         *                      SS AUG86 00660000
*                                       *                      SS AUG86 00670000
ISPMML   DS    0H                       *                      SS AUG86 00680000
         USING ISPMML,R4                *                      SS AUG86 00690000
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88 00700000
         CLI   SPFFUNST+1,C'P'          MEMLIST PENDING PROC   SS AUG86 00710000
         BE    ISPMMLC4                 YES, LET TBDSP REPROC  SS AUG86 00720000
         OI    SPFLAG3,SPFCONV          CONVERT ERROR--> VIEW ABL JAN87 00730000
         OI    SPFLAG0,SPFCKER          LOOK FOR PDS ERROR MSGABL JAN87 00740000
         NI    SPFLAG0,255-SPFMSGER     NO ERROR YET          ABL JAN87 00750000
         IC    R15,$TLEX(R14)      SUB FUNCTION CODE           SS AUG86 00760000
         L     R15,ISPMMLTB(R15)   GET SUB FUC ADDR            SS AUG86 00770000
         BR    R15                      *                      SS AUG86 00780000
ISPMMLTB DS    0F                       *                      SS AUG86 00790000
         DC    A(ISPMMLP)     0    MEMLIST PROMPT (AFTER CHG)  SS AUG86 00800000
         DC    A(ISPMMLC)     4    MEMLIST COMMAND             SS AUG86 00810000
         DC    A(ISPMMLA)     8    MEMLIST ALL                 SS AUG86 00820000
         DC    A(ISPMMLG)    12    MEMLIST GROUP               SS AUG86 00830000
         DC    A(ISPMMLT)    16    MEMLIST TODAY               SS AUG86 00840000
         DC    A(ISPMMLK)    20    MEMLIST ALL WITH CHECK      SS AUG86 00850000
         DC    A(ISPMMLT)    24    MEMLIST CURRENT             SS NOV86 00860000
         DC    A(ISPMMLT)    28    MEMLIST OLD                 SS NOV86 00870000
         DC    A(ISPMMLT)    32    MEMLIST YEAR                SS NOV86 00880000
ISPMMLP  DS    0H                       *                      SS AUG86 00890000
         MVI   SPFVZCMD,C' '            BLANK                  SS AUG86 00900000
         MVC   SPFVZCMD+1(249),SPFVZCMD      RIPPLE            SS AUG86 00910000
         TM    DSORG,DS1DSGPO     PARTITIONED?                ABL JAN87 00920000
         BNO   ISPMMLP2           NO, NO PROMPTING            ABL JAN87 00930000
         LA    R15,96             MEML  PROMPT PANEL (SOURCE)  SS AUG86 00940000
         TM    FLAGSCC,RECFMU     LOAD MODULE?                ABL JAN87 00950000
         BNO   *+8                NO, BRANCH                  ABL JAN87 00960000
         LA    R15,160            MEML  PROMPT PANEL (LOAD)   ABL JAN87 00970000
ISPMMLP3 DS    0H                                              SS FEB87 00980000
         AL    R15,ISP$PNA        ADDRESS OF PANEL TABLE       SS AUG86 00990000
         LA    R1,ISPBLK8         NO MESSAGE                  ABL JAN87 01000000
         BAS   R2,ISPSINGI        DISPLAY PANEL                SS AUG86 01010000
         C     R15,ISPL8          END KEY                      SS AUG86 01020000
         BE    ISPMMLP2           RETURN TO ORIGINAL PANEL     SS AUG86 01030000
         CLI   SPFZSEL,C'?'       OPERAND PROMPT?              SS FEB87 01040000
         BNE   ISPMMLP4           NO, BRANCH                   SS FEB87 01050000
         LA    R0,0               DEFAULT PANEL                SS OCT88 01060000
         LA    R15,168            OPERAND PROMPT PANEL         SS FEB87 01070000
         TM    FLAGSCC,RECFMU     LOAD MODULE?                ABL FEB87 01080000
         BNO   ISPMMLP3           NO, BRANCH                  ABL FEB87 01090000
         LA    R15,176            LOAD MODULE                 ABL FEB87 01100000
         B     ISPMMLP3           PROCESS IT                   SS FEB87 01110000
ISPMMLP4 DS    0H                                              SS FEB87 01120000
         MVC   SPFINPUT(250),SPFZSEL    COPY                   SS AUG86 01130000
         MVC   PUTGETBF(4),ISPLEN2      SET LENGTH 254         SS AUG86 01140000
         LA    R15,104                  CMD OPT PROCESSOR      SS AUG86 01150000
         BR    R3                       RETURN TO ROUTER       SS AUG86 01160000
ISPMMLP2 DS    0H                       *                      SS AUG86 01170000
         TM    SPFLAG4,SPFFFUN          FROM FUNCTION PROC     SS AUG86 01180000
         BZ    ISPMMLE                  NO, RTN TO ORG PANEL   SS AUG86 01190000
         L     R14,ISP$FUNA             POINT TO FUNCTION      SS AUG86 01200000
         ST    R14,SPFVTPT              *                      SS AUG86 01210000
         LA    R15,16                   FUNCTION PROCESS       SS AUG86 01220000
         TM    DSORG,DS1DSGPO           PARTITIONED?          ABL JAN87 01230000
         BOR   R3                       YES, BRANCH           ABL JAN87 01240000
         MVC   SPFMSGID,ISPPDSM         GENERIC MESSAGE       ABL JAN87 01250000
         MVI   SPFMSGID+6,C'1'          PDSM..1P MESSAGE      ABL JAN87 01260000
         MVI   SPFMSGID+7,C'P'          NOT PARTITIONED MSG   ABL JAN87 01270000
         LA    R15,56                   ERROR ROUTINE, PART 2 ABL JAN87 01280000
         BR    R3                       *                      SS AUG86 01290000
ISPMMLC  DS    0H                       MEML CHECK             SS AUG86 01300000
         CLC   0(8,R14),ISPMMLCX        ABBREVIATION           SS AUG86 01310000
         BNE   ISPMMLC1                 MAY NEED PROMPT        SS AUG86 01320000
         L     R15,SPFOPER              *                      SS AUG86 01330000
         MVC   SPFZSEL(242),0(R15)      SAVE DATA              SS AUG86 01340000
         MVC   SPFINPUT(8),$MML         MEMLIST CMD            SS AUG86 01350000
         MVC   SPFINPUT+8(242),SPFZSEL  PUT IT BACK TOGETHER   SS AUG86 01360000
         LA    R15,SPFINPUT+8           *                      SS AUG86 01370000
         ST    R15,SPFOPER              SET IT                 SS AUG86 01380000
ISPMMLC1 DS    0H                       *                      SS AUG86 01390000
         L     R15,SPFOPER              BLANK AFTER CMD        SS AUG86 01400000
         LA    R14,30                   SCAN FOR OPERAND       SS AUG86 01410000
         BAS   R2,ISPCKBLK                                     SS AUG86 01420000
         LTR   R15,R15                  ANY                    SS AUG86 01430000
         BZ    ISPMMLC2                 NO , MAY NEED PROMPT   SS AUG86 01440000
         CLC   0(2,R15),ISPMMLCC        SINGLE COLON?          SS AUG86 01450000
         BNE   ISPMMLCD                 NO, SET UP COMMAND    ABL JAN87 01460000
         LA    R15,2(,R15)              GO TO AFTER COLON     ABL JAN87 01470000
         LA    R14,20                   SCAN FOR OPERAND      ABL JAN87 01480000
         BAS   R2,ISPCKBLK                                    ABL JAN87 01490000
         LTR   R15,R15                  ANY OPERAND?          ABL JAN87 01500000
         BZ    ISPMMLA2                 NO, DO MEMLIST ALL    ABL JAN87 01510000
         B     ISPMMLCD                 YES, SET UP COMMAND   ABL JAN87 01520000
ISPMMLCC DC    C': '                    ALL MEMBERS            SS AUG86 01530000
ISPMMLCX DC    CL8'&IMLX'               MEMLIST ABBREVIATION   SS AUG86 01540000
ISPMMLC2 DS    0H                       *                      SS AUG86 01550000
         TM    DSORG,DS1DSGPO           PARTITIONED?          ABL JAN87 01560000
         BO    ISPMMLCP                 YES, BRANCH           ABL JAN87 01570000
         MVC   SPFMSGID,ISPPDSM         GENERIC MESSAGE       ABL JAN87 01580000
         MVI   SPFMSGID+6,C'1'          PDSM..1P MESSAGE      ABL JAN87 01590000
         MVI   SPFMSGID+7,C'P'          NOT PARTITIONED MSG   ABL JAN87 01600000
ISPMMLCP DS    0H                                             ABL JAN87 01610000
         CLI   SPFTBPFI+1,1             THIS MEMLIST           SS AUG86 01620000
         BNE   ISPMMLC3                 NO, CHECK ACTIVE       SS AUG86 01630000
         TM    SPFLAG4,SPFFFUN          FROM FUNCTION          SS AUG86 01640000
         BZ    ISPMMLP                  NO,  NEED PROMPT       SS AUG86 01650000
ISPMMLC3 DS    0H                       *                      SS AUG86 01660000
         CLI   SPFFUNST+1,C'I'          IN MEMLIST INACTIVE    SS AUG86 01670000
         BE    ISPMMLP                  YES, NEED PROMPT       SS AUG86 01680000
         BAS   R2,ISPSETST              SAVE CURRENT TBL STAT  SS FEB89 01690000
         LH    R1,SPFFUNLP+2            GET MEMLIST PANEL ID   SS FEB89 01700000
         LNR   R1,R1                    SET FOR SWAP           SS FEB89 01710000
         BAS   R2,ISPSTKI               DO SWAP                SS FEB89 01720000
         B     ISPMMLE                  DISPLAY                SS FEB89 01730000
ISPMMLC4 DS    0H                       *                      SS FEB89 01740000
         CLI   $TLEX(R14),4             WHICH COMMAND          SS FEB89 01750000
         BH    ISPMML1B                 CANNOT PROCESS, BUSY   SS FEB89 01760000
         L     R15,SPFOPER              BLANK AFTER CMD        SS FEB89 01770000
         LA    R14,30                   SCAN FOR OPERAND       SS FEB89 01780000
         BAS   R2,ISPCKBLK                                     SS FEB89 01790000
         LTR   R15,R15                  ANY                    SS FEB89 01800000
         BNZ   ISPMML1B                 YES, CANNOT PROCESS    SS FEB89 01810000
         BAS   R2,ISPSETST              SAVE CURRENT TBL STAT  SS FEB89 01820000
         LH    R1,SPFFUNLP+2            GET MEMLIST PANEL ID   SS FEB89 01830000
         LNR   R1,R1                    SET FOR SWAP           SS FEB89 01840000
         BAS   R2,ISPSTKI               DO SWAP                SS FEB89 01850000
         LA    R15,36                   PENDING ACTION PROC    SS FEB89 01860000
         BR    R3                       RETURN TO ROUTER       SS FEB89 01870000
ISPMML1B DS    0H                       *                      SS AUG86 01880000
         MVC   SPFMSGID,ISPPDSM         GENERIC MESSAGE        SS FEB89 01890000
         MVI   SPFMSGID+6,C'1'          PDSM..1B MESSAGE       SS FEB89 01900000
         MVI   SPFMSGID+7,C'B'          BUSY MSG               SS FEB89 01910000
         B     ISPMMLE                  DISPLAY                SS FEB89 01920000
ISPMMLE  DS    0H                                              SS AUG86 01930000
         LA    R15,100                  TO DISPLAY             SS AUG86 01940000
         BR    R3                       RETURN TO ROUTER       SS AUG86 01950000
ISPMMLK  DS    0H                       *                      SS AUG86 01960000
         OI    MEMFLAG2,MEMLNALL        NEW MEMLIST ALL        SS AUG86 01970000
         OI    SPFLAG4,SPFCPOST         POST PROCESSING        SS AUG86 01980000
         MVI   SPFPOST1,80              ALIAS CHECK ROUTINE    SS AUG86 01990000
         B     ISPMMLA                  GO MEMLIST ALL         SS AUG86 02000000
ISPMMLA  MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS AUG86 02010000
ISPMMLA2 DS    0H                       *                      SS AUG86 02020000
         CLI   SPFFUNST+1,C'I'          IN MEMLIST INACTIVE    SS AUG86 02030000
         BE    ISPMMLCD                 NO, JUST DO IT         SS JUL87 02040000
         BAS   R2,ISPUSTKM              CLEAR TABLE            SS AUG86 02050000
         OI    MEMFLAG2,MEMLNALL        NEW MEMLIST ALL        SS AUG86 02060000
         B     ISPMMLCD                 NOW DO IT              SS AUG86 02070000
* MEMLIST GROUP                         *                      SS AUG86 02080000
ISPMMLG  DS    0H                       *                      SS AUG86 02090000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS AUG86 02100000
         MVI   PUTGETBF+13,C'*'      CONVERT TO LAST GROUP     SS AUG86 02110000
         B     ISPMMLCD                                        SS AUG86 02120000
* MEMLIST ALL WITH OPTION (IE TODAY)    *                      SS JUL87 02130055
ISPMMLT  DS    0H                       *                      SS JUL87 02140000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS JUL87 02150000
         MVC   PUTGETBF+23(8),ISPBLK8   *                      SS JUL87 02160000
         L     R14,SPFVTPT              RELOAD CMD TBL ENTRY   SS JUL87 02170000
         MVC   PUTGETBF+15(8),$TLCM(R14) TYPE                  SS JUL87 02180000
         MVC   PUTGETBF(2),ISPCMD30     *                      SS JUL87 02190000
         B     ISPMMLCD                 *                      SS JUL87 02200000
* INVALID MESSAGE                       *                      SS AUG86 02210000
ISPMMLIV DS    0H                       *                      SS AUG86 02220000
         LA    R15,28                   *                      SS AUG86 02230000
         BR    R3                       RETURN TO ROUTER       SS AUG86 02240000
* COMMON COMMAND SETUP                  *                      SS AUG86 02250000
ISPMMLCD DS    0H                       *                      SS AUG86 02260000
         LH    R15,PUTGETBF       GET LENG                     SS AUG86 02270000
         BCTR  R15,0              LESS 1 MVC                   SS AUG86 02280000
ISPMMLCM MVC   SPFZSAV(0),PUTGETBF                             SS AUG86 02290000
         EX    R15,ISPMMLCM       SAVE CMD FOR RECALL          SS AUG86 02300000
         OI    SPFLAG3,SPFLOGM    LOG THE COMMAND              SS AUG86 02310000
         LA    R15,112              ROUTE TO ISPCMDC           SS AUG86 02320000
         BR    R3                                              SS AUG86 02330000
         SPACE 2                        *                      SS AUG86 02340000
         DROP  R4                                              SS MAR85 02350000
         TITLE 'ISPF - MEMLIST  FUNCTION'                      SS NOV85 02360000
*****************************************************          SS NOV85 02370000
*                                                              SS NOV85 02380000
*        MEMLLIST SUPPORT FUNCTION                             SS NOV85 02390000
*                                                              SS NOV85 02400000
*****************************************************          SS NOV85 02410000
         SPACE 1                                                        02420000
MEMLFUNC DS    0H                                              SS NOV85 02430000
         USING *,R4                                            SS NOV85 02440000
* AT THIS POINT ALTERNATE MEMBER PROCESSING CAN BE INSERTED    SS NOV85 02450000
         LA    R1,MEMLVINI        VDEFINE ALL VARS             SS AUG86 02460000
         BAS   R2,ISPVDEFX        SERVICE ROUTINE              SS AUG86 02470000
ISPMEMOK DS    0H                                              SS SEP84 02480000
         LA    R1,0               POP PANEL 3 CKT              SS NOV85 02490000
         LA    R2,3               IS THIS                      SS AUG86 02500000
         CH    R2,SPFTBPI               CKT PANEL 3            SS AUG86 02510000
         BNE   *+8                NO, NO UNSTACK               SS AUG86 02520000
         BAS   R2,ISPSTKI         USTACK ROUTINE               SS NOV85 02530000
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88 02540000
         TM    SPFLAG3,SPFCHN     HAS CHANGE DSN BEEN DONE    ABL OCT84 02550000
         BZ    ISPMEMK1           NO, SKIP                    ABL OCT84 02560000
         NI    SPFLAG3,255-SPFCHN-SPF300A CLEAR               ABL OCT84 02570000
         BAS   R2,ISPUSTKM        UNSTACK AND KILL OLD TABLE   SS NOV85 02580000
         B     ISPMEMK3           SET UP NEW TABLE             SS AUG86 02590000
ISPMEMK1 DS    0H                                             ABL OCT84 02600000
         CLI   SPFTBPFI+1,1       MEMLIST FUNCTION             SS AUG86 02610000
         BE    ISPMEMK5           YES                          SS AUG86 02620000
         BAS   R2,ISPSETST        FIRST SAVE STATUS            SS AUG86 02630000
         CLI   SPFFUNST+1,C'I'    IS MEMLIST INACTIVE          SS AUG86 02640000
         BE    ISPMEMK3           YES, SETUP NEW TABLE         SS AUG86 02650000
         LH    R1,SPFFUNLP+2      LAST PANEL                   SS AUG86 02660000
         LNR   R1,R1              SET FOR SWAP                 SS AUG86 02670000
         BAS   R2,ISPSTKI         DO SWAP                      SS AUG86 02680000
         B     ISPMEMK5                 *                      SS AUG86 02690000
ISPMEMK3 DS    0H                       *                      SS AUG86 02700000
         LA    R1,5               ASSUME SOURCE PANEL          SS NOV85 02710000
         TM    FLAGSCC,RECFMU     LOAD LIB                     SS NOV85 02720000
         BZ    ISPMEMK4           NO                           SS NOV85 02730000
         LA    R1,7               LOAD LIB PANEL INDEX         SS NOV85 02740000
ISPMEMK4 CH    R1,SPFTBPI         SAME PANEL                   SS NOV85 02750000
         BE    ISPMEMK5           YES, SKIP STACK              SS NOV85 02760000
         LNR   R1,R1              SET FOR SWAP                 SS AUG86 02770000
         BAS   R2,ISPSTKI         STACK NEW PANEL              SS NOV85 02780000
ISPMEMK5 DS    0H                                              SS NOV85 02790000
         TM    SPFTFLG1,SPFTACT   TABLE CREATED?               SS AUG86 02800000
         BO    ISPMEMK2           YES, BRANCH                  SS SEP84 02810000
         LA    R15,ISPMEMSO       SORT KEYS                    SS AUG86 02820000
         ST    R15,SPFTSORA       SAVE FOR TABLE               SS AUG86 02830000
         MVC   SPFTBL,SPFCSUF     GET BASE NAME                SS AUG86 02840000
         MVI   SPFTBL+2,C'M'      MAKE NAME "PDM"              SS AUG86 02850000
         LA    R0,MEMTNAMS              *                      SS AUG86 02860000
         TM    FLAGSCC,RECFMU     LOAD LIB                     SS AUG86 02870000
         BZ    ISPMEMS2                 *                      SS AUG86 02880000
         MVI   SPFTBL+2,C'U'      MAKE NAME "PDU"              SS AUG86 02890000
         LA    R0,MEMTNAMU              *                      SS AUG86 02900000
ISPMEMS2 DS    0H                       *                      SS AUG86 02910000
         XC    SPFTFLG1(4),SPFTFLG1                            SS NOV85 02920000
         XC    SPFTFF(2),SPFTFF                                SS NOV85 02930000
         LA    R15,MEMLTKEY        TABLE KEY                   SS AUG86 02940000
         BAS   R2,ISPTBOPN         DO OPEN AND SORT            SS AUG86 02950000
         LH    R0,SPFTBPSR         GET SORT INDEX              SS OCT88 02960000
         BAS   R2,ISPSORTI         GO TO SORT                  SS OCT88 02970000
         OI    MEMFLAG2,MEMLNTBL   FLAG NEW TABLE             ABL JAN87 02980000
         LA    R2,1                SET DISPLAY                 SS AUG86 02990000
         ST    R2,SPFTTOP                     TO FIRST LINE    SS AUG86 03000000
         ST    R2,SPFTTOP2                    TO FIRST LINE    SS JUL87 03010000
         BAS   R2,ISPSETST         ALSO INIT STATUS FLAG       SS AUG86 03020000
         L     R1,SPFTHOME         GET TABLE ADDRESS PTR       SS MAY89 03030000
         ST    R1,SPFMEMTA         SET MEML TBL PTR            SS MAY89 03040000
         MVC   0(8,R1),SPFTBL      SET NAME                    SS MAY89 03050000
         SPACE 2                                               SS JUL84 03060000
ISPMEMK2 DS    0H                                              SS SEP84 03070000
         NI    MEMFLAG0,255-MEMLLKDM-MEMLNKDM RESET            SS AUG86 03080000
         NI    MEMFLAG0,255-MEMLLKD1-MEMLNKD1 RESET            SS AUG86 03090000
         TM    FLAGSHH,FLKEDYES+FLKEDNO  ANY SETTING?         ABL JAN87 03100000
         BZ    ISPMEML9                  NO, BRANCH           ABL JAN87 03110000
         TM    FLAGSHH,FLKEDNO       NOLKEDDATE?              ABL JAN87 03120000
         BNO   ISPMEML5              NO, TRY LKEDDATE         ABL JAN87 03130000
         OI    MEMFLAG0,MEMLNKDM+MEMLNKD1   SET FOR NO LKED    SS AUG86 03140000
         B     ISPMEML9                 *                      SS AUG86 03150000
ISPMEML5 DS    0H                       *                      SS AUG86 03160000
         TM    FLAGSHH,FLKEDYES      LKEDDATE?                ABL JAN87 03170000
         BNO   ISPMEML9              NO, BRANCH               ABL JAN87 03180000
         OI    MEMFLAG0,MEMLLKDM+MEMLLKD1   SET FOR LKED       SS AUG86 03190000
ISPMEML9 DS    0H                       *                      SS AUG86 03200000
         TM    MEMFLAG2,MEMLALED        ALIAS EDIT CHECK       SS NOV88 03210099
         BZ    ISPMEML6                 NO, SKIP               SS NOV88 03220000
         CLC   SPFEDTTR,DIRTTR          SAME TTR               SS NOV88 03230000
         BNE   ISPMEML6                 NO, SKIP               SS NOV88 03240000
         MVC   DIRTTR,SPFE2TTR          SET NEW TTR            SS NOV88 03250000
         ST    R6,SPFSAV6               SAVE R6                SS NOV88 03260000
         BAS   R2,OPENSTOW              *                      SS NOV88 03270000
         B     ISPMEMLD                 OPEN ERROR             SS NOV88 03280000
         L     R6,SPFSAV6               GET  R6                SS NOV88 03290000
         MVC   DCBRELAD-IHADCB+STOWDCB(3),DIRTTR               SS NOV88 03300000
         STOW  STOWDCB,DIRNAME,R        REPLACE                SS NOV88 03310000
         B     ISPMEML7                 PROCESS IT             SS NOV88 03320000
ISPMEMLD DS    0H                       *                      SS NOV88 03330000
         L     R6,SPFSAV6               GET  R6                SS NOV88 03340000
ISPMEML6 DS    0H                       *                      SS NOV88 03350000
         TM    MEMFLAG2,MEMLTMCK        TIME CHECK             SS AUG86 03360000
         BZ    ISPMEML7                 NO, SKIP               SS NOV88 03370000
         TM    FLAGSCC,RECFMU           LOAD                   SS AUG86 03380000
         BO    ISPMEML7                 YES, SKIP              SS AUG86 03390000
         TM    MEMFLAG2,MEMLTMPR        PREVIOUS DATE          SS AUG86 03400000
         BO    ISPMEML8                 YES                    SS AUG86 03410000
         CLC   DIRSPFCD(6),SPFDAY       COMPARE DATE AND TIME  SS AUG86 03420000
         BLR   R3                       LOW, DO NOT ADD        SS AUG86 03430000
         B     ISPMEML7                 OK, CONTINUE           SS AUG86 03440000
ISPMEML8 DS    0H                       *                      SS AUG86 03450000
         CLC   DIRSPFCD(6),SPFDAY       COMPARE DATE AND TIME  SS AUG86 03460000
         BNLR  R3                       NOT LOW, DO NOT ADD    SS AUG86 03470000
ISPMEML7 DS    0H                       *                      SS AUG86 03480000
         NI    MEMFLAG2,255-MEMLTMNO    RESET BEFORE CALL      SS NOV86 03490000
         BAS   R2,MEMLISTI        GET MEMLIST SUB              SS NOV85 03500000
         TM    MEMFLAG2,MEMLTMNO        REQUEST BYPASS THIS 1  SS NOV86 03510000
         BZ    ISPMEMLA                 NO                     SS NOV86 03520000
         NI    MEMFLAG2,255-MEMLTMNO    RESET                  SS NOV86 03530000
         BR    R3                       RETURN, DO NOT PROCESS SS NOV86 03540000
ISPMEMLA DS    0H                       *                      SS NOV86 03550000
*  USING SORTED FILES WITH ORDER, NOLONGER NEED SEQ LOAD       SS AUG86 03560000
         BAS   R2,ISPGET          FIND ENTRY TO REPLACE        SS SEP84 03570000
         LTR   R15,R15            WE FIND IT                   SS SEP84 03580000
         BZ    ISPMEML2           YES                          SS SEP84 03590000
ISPMEML4 DS    0H                 ADD NEW ENTRY HERE           SS SEP84 03600000
         MVC   MEMLDATA,ISPBLK8                                SS SEP84 03610099
         TM    MEMFLAG2,MEMLTMED  EDIT UPDATE                  SS JUL87 03620000
         BZ    *+10                     *                      SS JUL87 03630000
         NOPR  R0                                             DRK SEP17 03640099
         NOPR  R0                                             DRK SEP17 03650099
         NOPR  R0                                             DRK SEP17 03660099
*        MVC   MEMLDATA,ISPEDIT         *                      SS JUL87 03670099
         BAS   R2,MEMLSET         SET VARS                     SS AUG86 03680000
         BAS   R2,ISPTBADD        ADD IN ORDER                 SS AUG86 03690000
         BR    R3                 RETURN                       SS SEP84 03700000
ISPMEML2 DS    0H                                              SS SEP84 03710000
         TM    MEMFLAG2,MEMLTMED  EDIT UPDATE                  SS JUL87 03720000
         BZ    ISPMEMLB                 *                      SS JUL87 03730000
*        MVC   MEMLDATA,ISPEDIT         *                      SS JUL87 03740099
         MVC   MEMLOPT,MEM2OPT          SAVE OPT CODE IF ANY   SS JUL87 03750000
         B     ISPMEML3                 *                      SS JUL87 03760000
ISPMEMLB DS    0H                       *                      SS JUL87 03770000
         TM    SPFLAG2,SPFUPDA    REFRESH ENTRIES              SS SEP84 03780000
         BO    ISPMEML3           YES                          SS SEP84 03790000
         MVC   MEMLDATA,ISPBLK8   NO, CLEAR MSGS               SS SEP84 03800099
ISPMEML3 DS    0H                                              SS SEP84 03810000
         BAS   R2,MEMLSET         SET VARS                     SS AUG86 03820000
         BAS   R2,ISPTBMOD         MOD IN ORDER                SS AUG86 03830000
         BR    R3                  RETURN                      SS SEP84 03840000
         DROP  R4                                              SS NOV85 03850000
         SPACE 3                        *                      SS AUG86 03860000
ISPMEMSO DC    C'(MEMLNAME,C,A)'   SORT LIST                   SS AUG86 03870000
* MEMLIST SOURCE                                                        03880099
MEMTNAMS DC    C'( '               MEM TBL                     SS AUG86 03890000
MEMLVR2  DC    C'MEMLDATA '        USER ENTERED DATA           SS AUG86 03900000
MEMLVR1  DC    C'MEMLOPT '                                     SS AUG86 03910000
MEMLVR5  DC    C'MEMLALIS '                                    SS AUG86 03920000
MEMLVR3  DC    C'MEMLTTR '         MEM TBL ALIAS SCAN ARG LIST SS AUG86 03930000
MEMLVR4  DC    C'MEMLXTTR '        HEX TTR                     SS AUG86 03940000
MEMLVR6  DC    C'MEMLSTAT '        DELETE/RENAME STATUS        SS AUG86 03950000
         DC    C'MEMLVMOD MEMLCDAT MEMLMDAT '                           03960006
         DC    C'MEMLMTIM MEMLMID MEMLISIZ MEMLCSIZ '          SS NOV84 03970000
         DC    C'MEMLCCEN MEMLMCEN '                          Y2K AUG97 03980091
         DC    C'MEMLCDAX MEMLMDAX '                          Y2K SEP98 03990091
         DC    C'MEMLCSIS '        EXTENDED STATS SCALE (0-2) DRK AUG09 04000091
         DC    C'MEMLXSTA '        EXTENDED STATS INDIC       DRK SEP09 04010099
         DC    C')'                                            SS AUG86 04020000
* MEMLIST LOAD                                                          04030099
MEMTNAMU DC    C'( '               MEM TBL                     SS AUG86 04040000
         DC    C'MEMLDATA '        USER ENTERED DATA           SS AUG86 04050000
         DC    C'MEMLOPT '                                     SS AUG86 04060000
         DC    C'MEMLALIS '                                    SS AUG86 04070000
         DC    C'MEMLTTR '         MEM TBL ALIAS SCAN ARG LIST SS AUG86 04080000
         DC    C'MEMLXTTR '        HEX TTR                     SS AUG86 04090000
         DC    C'MEMLSTAT '        DELETE/RENAME STATUS        SS AUG86 04100000
         DC    C'MEMLMNAM MEMLMTTR '                           SS NOV84 04110000
         DC    C'MEMLLENG MEMLENTY MEMLATT1 MEMLATT2 MEMLDC MEMLTEST '  04120000
         DC    C'MEMLAPF MEMLMODE MEMLSSI MEMLLDAT '           SS MAR85 04130000
         DC    C'MEMLLCEN '                                   Y2K AUG97 04140010
         DC    C'MEMLXLEN '        HEX LENGTH                 DRK OCT99 04150027
         DC    C'MEMLLDAX MEMLAPFX '                          DRK MAR00 04160030
         DC    C')'                                            SS AUG86 04170000
*        SPLIT SOURCE AND LOAD TABLE VARS                      SS AUG86 04180000
         SPACE 2                        *                      SS AUG86 04190000
*        VARIABLES TO BE DEFINED        *                      SS AUG86 04200008
         DS    0F                       *                      SS AUG86 04210000
MEMLVINI DC    H'0',X'20',X'00'         *                      SS AUG86 04220000
         DC    A(MEMLTKEY),AL2(MEMLNAME-SPWRKC),H'8'           SS AUG86 04230000
         DC    A(MEMLVR1),AL2(MEM2OPT-SPWRKC),H'4'             SS AUG86 04240000
         DC    A(MEMLVR2),AL2(MEMLDATA-SPWRKC),H'8'            SS AUG86 04250000
         DC    A(MEMLVR3),AL2(MEM2TTR-SPWRKC),H'8'             SS AUG86 04260000
         DC    A(MEMLVR4),AL2(MEM2XTTR-SPWRKC),H'3'            SS AUG86 04270000
         DC    A(MEMLVR5),AL2(MEM2ALIS-SPWRKC),H'8'            SS AUG86 04280000
         DC    A(MEMLVR6),AL2(MEM2STAT-SPWRKC),H'2'            SS AUG86 04290000
         DC    A(MEMLVR7),AL2(MEM2VMOD-SPWRKC),H'8'            SS AUG86 04300000
         DC    A(MEMLVR8),AL2(MEM2MNAM-SPWRKC),H'8'            SS AUG86 04310000
         DC    A(MEMLVR9),AL2(MEM2ATT1-SPWRKC),H'5'            SS AUG86 04320000
         DC    A(MEMLVR0),AL2(MEM2SSI-SPWRKC),H'8'             SS AUG86 04330000
         DC    A(MEMLVRA),AL2(MEM2CCEN-SPWRKC),H'1'           Y2K AUG97 04340010
         DC    A(MEMLVRB),AL2(MEM2LCEN-SPWRKC),H'1'           Y2K AUG97 04350010
         DC    A(MEMLVRC),AL2(MEM2CDAX-SPWRKC),H'10'          Y2K SEP98 04360022
         DC    A(MEMLVRD),AL2(MEM2XLEN-SPWRKC),H'3'           DRK OCT99 04370027
         DC    A(MEMLVRE),AL2(MEM2LDAX-SPWRKC),H'10'          DRK MAR00 04380028
         DC    A(MEMLVRF),AL2(MEM2APFX-SPWRKC),H'1'           DRK MAR00 04390030
         DC    A(MEMLVRG),AL2(MEM2CSIS-SPWRKC),H'1'           DRK AUG09 04400089
         DC    A(MEMLVRH),AL2(MEM2XSTA-SPWRKC),H'1'           DRK SEP09 04410094
         DC    X'FF'                    *                      SS AUG86 04420000
MEMLVR7  DC    C'('                     *                      SS AUG86 04430000
         DC    C'MEMLVMOD MEMLCDAT MEMLMDAT '                           04440006
         DC    C'MEMLMTIM MEMLMID MEMLISIZ MEMLCSIZ '          SS NOV84 04450000
         DC    C')'                                            SS AUG86 04460000
MEMLVR8  DC    C'('                     *                      SS AUG86 04470000
         DC    C'MEMLMNAM MEMLMTTR '                           SS NOV84 04480000
         DC    C'MEMLLENG MEMLENTY'                            SS AUG86 04490000
         DC    C')'                                            SS AUG86 04500000
MEMLVR9  DC    C'('                     *                      SS AUG86 04510000
         DC    C'MEMLATT1 MEMLATT2 MEMLDC MEMLTEST '           SS AUG86 04520000
         DC    C'MEMLAPF MEMLMODE'                             SS AUG86 04530000
         DC    C')'                                            SS AUG86 04540000
MEMLVR0  DC    C'('                     *                      SS AUG86 04550000
         DC    C'MEMLSSI MEMLLDAT '                            SS AUG86 04560006
         DC    C')'                                            SS AUG86 04570000
MEMLVRA  DC    C'('                     *                     Y2K AUG97 04580010
         DC    C'MEMLCCEN MEMLMCEN '                          Y2K AUG97 04590010
         DC    C')'                                           Y2K AUG97 04600010
MEMLVRB  DC    C'('                     *                     Y2K AUG97 04610010
         DC    C'MEMLLCEN '                                   Y2K AUG97 04620010
         DC    C')'                                           Y2K AUG97 04630010
MEMLVRC  DC    C'('                     *                     Y2K SEP98 04640022
         DC    C'MEMLCDAX MEMLMDAX '                          Y2K SEP98 04650022
         DC    C')'                                           Y2K SEP98 04660022
MEMLVRD  DC    C'('                     *                     DRK OCT99 04670027
         DC    C'MEMLXLEN '                                   DRK OCT99 04680027
         DC    C')'                                           DRK OCT99 04690027
MEMLVRE  DC    C'('                     *                     DRK MAR00 04700028
         DC    C'MEMLLDAX '                                   DRK MAR00 04710028
         DC    C')'                                           DRK MAR00 04720028
MEMLVRF  DC    C'('                     *                     DRK MAR00 04730030
         DC    C'MEMLAPFX '                                   DRK MAR00 04740030
         DC    C')'                                           DRK MAR00 04750030
MEMLVRG  DC    C'('                     *                     DRK AUG09 04760089
         DC    C'MEMLCSIS '                                   DRK AUG09 04770089
         DC    C')'                                           DRK AUG09 04780089
MEMLVRH  DC    C'('                     *                     DRK SEP09 04790094
         DC    C'MEMLXSTA '                                   DRK SEP09 04800094
         DC    C')'                                           DRK SEP09 04810094
         SPACE 5                                               SS NOV85 04820000
         TITLE 'ISPF - MEMLIST LV 1 SUBROUTINE'                SS NOV85 04830000
*                                                              SS NOV85 04840000
*                                                              SS NOV85 04850000
*                                                              SS NOV85 04860000
       SPACE 3                                                          04870000
*************************************************************  SS SEP84 04880000
*                                                              SS SEP84 04890000
*        ADDED SUPPORT OF DIALOG MEMLIST MODE USING            SS SEP84 04900000
*        A DIALOG TABLE TO DISPLAY PDS MEMBER LIST             SS SEP84 04910000
*                                                              SS SEP84 04920000
*************************************************************  SS SEP84 04930000
*                                                                       04940000
*      MEMLNAME     MEMBER NAME (*MUST* BE ONLY 'KEY' VARIABLE IN TBL)  04950000
*      MEMLACT      USER'S ACTION REQUEST                               04960000
*      MEMLALIS     MAIN NAME IF ALIAS                                  04970000
*      MEMLTTR      MEMBER TTR (REQUIRED TO DETERMINE ALIAS MAIN NAME)  04980000
*   THE FOLLOWING ARE UPDATED FOR SPF FILES                    SS MAY84 04990000
*      MEMLVMOD     SPF STATS VERSION MOD                               05000000
*      MEMLCDAT     SPF STATS CREATION DATE                             05010006
*      MEMLMDAT     SPF STATS LAST MOD DATE                             05020006
*      MEMLMTIM     SPF STATS LAST MOD TIME                             05030000
*      MEMLMID      SPF STATS LAST MOD ID                               05040000
*      MEMLISIZ     SPF STATS INITIAL SIZE                     SS NOV84 05050000
*      MEMLCSIZ     SPF STATS CURRENT SIZE                              05060000
*      MEMLCSIS     SPF STATS CURRENT SIZE SORT SCALE         DRK AUG09 05070089
*      MEMLXSTA     SPF STATS EXTENDED INDICATOR              DRK SEP09 05080094
*      MEMLCCEN     SPF STATS CREATION DATE CENTURY           Y2K AUG97 05090008
*      MEMLMCEN     SPF STATS LAST MOD DATE CENTURY           Y2K AUG97 05100008
*      MEMLCDAX     SPF STATS CREATION DATE YYYYMMDD EXTENDED Y2K SEP98 05110022
*      MEMLMDAX     SPF STATS LAST MOD DATE YYYYMMDD EXTENDED Y2K SEP98 05120022
*                                                              SS NOV84 05130000
*   THE FOLLOWING ARE UPDATED FOR LOAD LIBRARIES                        05140000
*      MEMLMNAM     ALIAS MAIN NAME                                     05150000
*      MEMLXTTR     LOAD TTR IN HEX                                     05160000
*      MEMLLENG     LOAD PROGRAM LENGTH      (PRINTABLE)                05170000
*      MEMLXLEN     LOAD PROGRAM LENGTH IN HEX                DRK OCT99 05180027
*      MEMLENTY     LOAD PROGRAM ENTRY POINT (PRINTABLE)                05190000
*      MEMLATT1     LOAD ATTRIBUTE - FIRST                              05200000
*      MEMLATT2     LOAD ATTRIBUTE - SECONDARY                          05210000
*      MEMLDC       LOAD ATTRIBUTE OF DC                                05220000
*      MEMLTEST     LOAD ATTRIBUTE OF TEST                              05230000
*      MEMLAPF      LOAD APF ATTRIBUTE                                  05240000
*      MEMLMODE     LOAD AMODE/RMODE ATTRIBUTE                          05250000
*      MEMLSSI      SSI INFORMATION                            SS NOV84 05260000
*      MEMLLDAT     LINKAGE EDIT DATE IN YY/MM/DD FORMAT      ABL OCT85 05270006
*      MEMLLCEN     LINKAGE EDIT DATE CENTURY                 Y2K AUG97 05280008
*      MEMLLDAX     LINKAGE EDIT DATE YYYYMMDD EXTENDED       DRK MAR00 05290029
*      MEMLAPFX     LOAD APF ATTRIBUTE 1=APF AUTHORIZED       DRK MAR00 05300030
*                                                                       05310000
*********************************************************************** 05320000
         SPACE 2                                                        05330000
MEMLIST  DS    0H                                              SS SEP84 05340000
         USING *,R4                                            SS JUL84 05350039
         TM    MEMFLAG0,MEMLRIDR        READ IDR ONLY          SS AUG86 05360000
         BO    READIDR                  YES, SKIP ALL ELSE     SS AUG86 05370000
         MVI   MEMLMV1,C' '        BLANK                       SS AUG86 05380000
         MVC   MEMLMV1+1(MEMLLN1),MEMLMV1   RIPPLE             SS AUG86 05390000
         MVI   MEMLMV2,C' '        BLANK                       SS AUG86 05400000
         MVC   MEMLMV2+1(MEMLLN2),MEMLMV2   RIPPLE             SS AUG86 05410000
         SPACE 1                                                        05420000
*        CLEAR VARS HERE                                                05430000
         MVC   MEMLNAME,DIRNAME    MEMBER NAME FROM DIR TO VAR          05440000
         UNPK  MEMLWK(7),DIRTTR(4) UNPACK HEX                           05450000
         TR    MEMLWK(6),TRHEX     TRANSLATE TO HEX                     05460000
         MVC   MEMLTTR(6),MEMLWK                                        05470000
         MVI   MEMLSTAT,C'S'       ASSUME SOURCE               SS AUG86 05480000
         MVC   MEMLXTTR(3),DIRTTR   SAVE TTR                   SS AUG86 05490000
         TM    DIRFLAG,DIRALIAS    IS THIS AN ALIAS NAME       SS AUG86 05500000
         BNO   MMLSTATS            NO: ALIAS LOGIC                      05510000
         MVC   MEMLALIS,MMLALI          NAME AS AN ALIAS                05520000
* DETERMINE IF WE HAVE SPF STATISTICS                                   05530000
MMLSTATS DS    0H                                              SS NOV84 05540000
         LA    R0,DIRCUDHW         CLEAR IC REG                         05550000
         LA    R15,0               CLEAR IC REG                         05560000
         IC    R15,DIRFLAG         FETCH COUNT FIELD MASK               05570000
         NR    R15,R0              ZERO OUT NON-COUNT BITS              05580000
         SLL   R15,1               TIMES 2                     SS SEP84 05590000
         TM    FLAGSCC,RECFMU      LOAD MODULE LIBRARY?        SS NOV84 05600000
         BO    MEMLLOAD            YES, BRANCH                 SS NOV84 05610000
         STC   R15,MEMLMNAM        SAVE LENGTH                 SS SEP84 05620000
*        MVC   MEMLMNAM+1(0),DIRUSER  SAVE DIR                 SS NOV85 05630000
*        EX    R15,*-6                                         SS NOV85 05640000
         CLC   MEMLALIS,MMLALI     ALIAS                                05650000
         BE    MMLSALI             YES, NO STATS                        05660000
         SPACE 1                                                        05670084
         TM    DIRFLAG,X'14'       ISPF EXTENDED STATS?       DRK OCT09 05680099
         BO    SKIPCK              YES                        DRK OCT09 05690099
         TM    DIRFLAG,X'11'       STOW DATE ZAP 1980+?       DRK MAR19 05691099
         BO    SKIPCK              YES                        DRK MAR19 05692099
         TM    DIRFLAG,DIRSPFOF    CK FOR BITS THAT SHOULD BE OFF       05700000
         BNZ   MEMLADD             THEY'RE NOT: NO SPF STATS            05710000
         TM    DIRFLAG,DIRSPFON    CK FOR BITS THAT SHOULD BE ON        05720000
         BNO   MEMLADD             THEY'RE NOT: NO SPF STATS            05730000
SKIPCK   DS    0H                                                       05740085
         TM    DIRSPFCR,X'FE'      0C OF 0CYYDDDF ZEROS?      Y2K AUG97 05750018
         BNZ   MEMLADD             NO, BRANCH                 Y2K AUG97 05760018
         TM    DIRSPFCD,X'FE'      0C OF OTHER 0CYYDDDF ZERO? Y2K AUG97 05770018
         BNZ   MEMLADD             NO, BRANCH                 Y2K AUG97 05780018
         SPACE 1                                                        05790000
* ALL TESTS PASSED: ASSUME WE HAVE SPF STATS                            05800000
         SPACE                                                          05810000
         TM    DIRSPFFL,DIRSPFXS     EXTENDED STATS?          DRK SEP17 05820099
         BNO   *+4+4+4               NO                       DRK SEP17 05830099
         TM    DIRSPFFL,255-DIRSPFXS-DIRSPFSC  MUST BE ZEROS  DRK OCT16 05840099
         BNZ   MEMLADD                         NO, SKIP       DRK OCT16 05850099
         SR    R1,R1                                                    05860000
         IC    R1,DIRSPFR          REVISION NUMBER FIRST                05870000
         CVD   R1,DOUBLE                                                05880000
         MVC   MEMLVMOD+1(4),=X'40212020'                     ABL OCT85 05890000
         ED    MEMLVMOD+1(4),DOUBLE+6                         ABL OCT85 05900000
         MVI   MEMLVMOD+2,C'.'                                ABL OCT85 05910000
         IC    R1,DIRSPFV          VERSION NUMBER                       05920000
         CVD   R1,DOUBLE                                                05930000
         MVC   DOUBLE(4),=X'40212020'                         ABL OCT85 05940000
         ED    DOUBLE(4),DOUBLE+6                             ABL OCT85 05950000
         MVC   MEMLVMOD(2),DOUBLE+2                           ABL OCT85 05960000
         LA    R1,DIRSPFCR+1           POINT TO YYDDDF                  05970000
         LA    R15,FULLWORD+1                                           05980000
         L     R2,MEMLCVTD                                     SS JUL85 05990000
         BASR  R14,R2                                          SS JUL85 06000000
         MVC   FULLWORD(1),FULLWORD+3  CONVERT TO YYMMDD                06010000
         MVC   MEMLCDAT(L'DATEMASK),DATEMASK                            06020000
         ED    MEMLCDAT(L'DATEMASK),FULLWORD                            06030000
         OI    MEMLCDAT+1,X'F0'        SHOW YY                Y2K AUG97 06040006
         MVC   MEMLCDAT(8),MEMLCDAT+1                          SS SEP84 06050004
         MVC   MEMLCCEN(1),DIRSPFCR    CENTURY BYTE           Y2K AUG97 06060006
         OI    MEMLCCEN,X'F0'          FOR CHARACTER SORT     Y2K AUG97 06070012
         SPACE 1                                              Y2K SEP98 06080022
         CLI   MEMLCCEN,X'F0'          19XX?                  Y2K SEP98 06090022
         BNE   *+4+6+4                 NO, THEN 20XX          Y2K SEP98 06100022
         MVC   MEMLCDAX(2),=C'19'      YES                    Y2K SEP98 06110022
         B     *+4+6                                          Y2K SEP98 06120022
         MVC   MEMLCDAX(2),=C'20'                             Y2K SEP98 06130022
         MVC   MEMLCDAX+2(8),MEMLCDAT  YYYY/MM/DD             Y2K SEP98 06140022
         SPACE 1                                              Y2K SEP98 06150022
         LA    R1,DIRSPFCD+1           POINT TO YYDDDF                  06160000
         LA    R15,FULLWORD+1                                           06170000
         L     R2,MEMLCVTD                                     SS JUL85 06180000
         BASR  R14,R2                                          SS JUL85 06190000
         MVC   FULLWORD(1),FULLWORD+3  CONVERT TO YYMMDD                06200000
         MVC   MEMLMDAT(L'DATEMASK),DATEMASK                            06210000
         ED    MEMLMDAT(L'DATEMASK),FULLWORD                            06220000
         OI    MEMLMDAT+1,X'F0'        SHOW YY                Y2K AUG97 06230006
         MVC   MEMLMDAT(8),MEMLMDAT+1                          SS SEP84 06240000
         MVC   MEMLMCEN(1),DIRSPFCD    CENTURY BYTE           Y2K AUG97 06250006
         OI    MEMLMCEN,X'F0'          FOR CHARACTER SORT     Y2K AUG97 06260012
         SPACE 1                                              Y2K SEP98 06270022
         CLI   MEMLMCEN,X'F0'          19XX?                  Y2K SEP98 06280022
         BNE   *+4+6+4                 NO, THEN 20XX          Y2K SEP98 06290022
         MVC   MEMLMDAX(2),=C'19'      YES                    Y2K SEP98 06300022
         B     *+4+6                                          Y2K SEP98 06310022
         MVC   MEMLMDAX(2),=C'20'                             Y2K SEP98 06320022
         MVC   MEMLMDAX+2(8),MEMLMDAT  YYYY/MM/DD             Y2K SEP98 06330022
         SPACE 1                                              Y2K SEP98 06340022
         MVC   MEMLMTIM(6),MEML0021                           ABL APR85 06350000
         ED    MEMLMTIM(6),DIRSPFCT    TIME OF LAST CHANGE              06360000
         MVC   MEMLMTIM(5),MEMLMTIM+1                          SS SEP84 06370000
*        MVI   MEMLMTIM+5,X'40'        FOLLOWING BLANK        ABL OCT84 06380034
         CLI   DIRSPFZ+1,X'60'         SS VALIDITY CHECK      DRK MAR01 06390037
         BL    *+4+6+4                 GOOD                   DRK MAR01 06400037
         MVC   MEMLMTIM+6(2),=C'00'    BAD, SET TO ZERO       DRK MAR01 06410037
         B     *+4+6+6                                        DRK MAR01 06420037
         MVC   MEMLMTIM+5(3),=X'F02020' PATTERN               DRK MAR01 06430037
         ED    MEMLMTIM+5(3),DIRSPFZ+1  SECONDS               DRK MAR01 06440037
         MVI   MEMLMTIM+5,C':'         INSERT COLON HERE      DRK MAR01 06450037
         SPACE 1                                                        06460083
SPFSTATS DS    0H                      Z/XDC PROBE                      06470096
         MVI   MEMLXSTA,C' '           ASSUME REG STATS       DRK SEP09 06480094
         TM    DIRSPFFL,DIRSPFXS       EXTENDED STATS?        DRK AUG09 06490083
         BNO   REGSTATS                NO                     DRK AUG09 06500083
         SGR   R1,R1                   CLEAR ALL 64 BITS      DRK MAY16 06510099
         L     R1,DIRSPXIN             CONVERT INITIAL SIZE   DRK AUG09 06520083
         BAS   R2,EXTSTATS                                    DRK AUG09 06530088
         MVC   MEMLISIZ(6),XSIZE                              DRK AUG09 06540083
         SGR   R1,R1                   CLEAR ALL 64 BITS      DRK MAY16 06550099
         L     R1,DIRSPXSI             CONVERT CURRENT SIZE   DRK AUG09 06560088
         BAS   R2,EXTSTATS                                    DRK AUG09 06570088
         MVC   MEMLCSIZ(6),XSIZE                              DRK AUG09 06580083
         MVC   MEMLCSIS(1),XSORTKEY                           DRK AUG09 06590088
         MVI   MEMLXSTA,C'Y'           MARK EXTENDED          DRK SEP09 06600099
         B     MMLSTATX                                       DRK AUG09 06610086
REGSTATS DS    0H                                                       06620083
         SPACE 1                                                        06630083
         SR    R1,R1                    *                      SS MAY89 06640000
         ICM   R1,B'0011',DIRSPFIN      *                      SS MAY89 06650000
         CVD   R1,DOUBLE                                                06660000
         MVC   MEMLISIZ(6),MEML0020                           ABL APR85 06670000
         ED    MEMLISIZ(6),DOUBLE+5                            SS NOV84 06680000
         MVC   MEMLISIZ(5),MEMLISIZ+1                          SS NOV84 06690000
         MVI   MEMLISIZ+5,X'40'        FOLLOWING BLANK         SS NOV84 06700000
         SR    R1,R1                    *                      SS MAY89 06710000
         ICM   R1,B'0011',DIRSPFSI      *                      SS MAY89 06720000
         CVD   R1,DOUBLE                                                06730000
         MVC   MEMLCSIZ(6),MEML0020                           ABL APR85 06740000
         ED    MEMLCSIZ(6),DOUBLE+5                                     06750000
         MVC   MEMLCSIZ(5),MEMLCSIZ+1                          SS SEP84 06760000
         MVI   MEMLCSIZ+5,X'40'        FOLLOWING BLANK        ABL OCT84 06770000
         MVI   MEMLCSIS,C'0'           EXT STATS SORT SCALE   DRK AUG09 06780089
         SPACE 1                                                        06790000
MMLSTATX DS    0H                                                       06800083
         MVC   MEMLMID,DIRSPFID                                         06810000
         B     MEMLADD                                                  06820000
*                                                                       06830084
* CONVERT EXTENDED SPF STATISTICS                                       06840084
*                                                                       06850084
EXTSTATS DS    0H                                             DRK AUG09 06860084
         CVDG  R1,DOUBLE-8             4294M MAX, X'FFFFFFFF' DRK AUG09 06870099
         SPACE 1                                                        06880099
         CP    DOUBLE,=PL4'0100000'    100K                   DRK AUG09 06890093
         BL    BYTES                                          DRK AUG09 06900093
         CP    DOUBLE,=PL4'1000000'    1M                     DRK AUG09 06910093
         BL    KBYTES                                         DRK AUG09 06920093
         B     MBYTES                                         DRK AUG09 06930093
BYTES    DS    0H                                             DRK AUG09 06940093
         MVC   XSIZE(6),MEML0020                              DRK AUG09 06950093
         ED    XSIZE(6),DOUBLE+5       0-99999                DRK AUG09 06960093
         MVC   XSIZE(5),XSIZE+1                               DRK AUG09 06970093
         MVI   XSIZE+5,X'40'                                  DRK AUG09 06980093
         MVI   XSORTKEY,C'0'           EXT STATS SORT SCALE   DRK AUG09 06990093
         BR    R2                                             DRK AUG09 07000093
KBYTES   DS    0H                                             DRK AUG09 07010093
         DP    DOUBLE,=PL4'0001000'    1K                     DRK AUG09 07020093
         MVC   XSIZE(6),MEML0020                              DRK AUG09 07030093
         ED    XSIZE(6),DOUBLE+1                              DRK AUG09 07040093
         MVC   XSIZE(4),XSIZE+2                               DRK AUG09 07050093
         MVI   XSIZE+4,C'K'            THOUSANDS              DRK AUG09 07060093
         MVI   XSIZE+5,X'40'                                  DRK AUG09 07070093
         MVI   XSORTKEY,C'1'           EXT STATS SORT SCALE   DRK AUG09 07080093
         BR    R2                                             DRK AUG09 07090093
MBYTES   DS    0H                                             DRK AUG09 07100093
         DP    DOUBLE,=PL4'1000000'    1M                     DRK AUG09 07110093
         MVC   XSIZE(6),MEML0020                              DRK AUG09 07120093
         ED    XSIZE(6),DOUBLE+1                              DRK AUG09 07130093
         MVC   XSIZE(4),XSIZE+2                               DRK AUG09 07140093
         MVI   XSIZE+4,C'M'            MILLIONS               DRK AUG09 07150093
         MVI   XSIZE+5,X'40'                                  DRK AUG09 07160093
         MVI   XSORTKEY,C'2'           EXT STATS SORT SCALE   DRK AUG09 07170093
         BR    R2                                             DRK AUG09 07180093
         SPACE 1                                                        07190084
* PROCESS SOURCE ALIAS                                         SS NOV84 07200000
MMLSALI  DS    0H                                              SS NOV84 07210000
         MVC   MEMLVMOD(5),MMLALI+1                            SS NOV84 07220000
         B     MEMLADD                                         SS NOV84 07230000
* PROCESS DIR AS LOAD MODULE                                            07240000
MEMLLOAD DS    0H                                                       07250000
* SAVE ATTR BYTES                                                       07260000
         MVI   MEMLSTAT,C'L'       MARK A LOAD                 SS AUG86 07270000
         STC   R15,MEMLVMOD        SAVE LENGTH                 SS SEP84 07280000
         MVC   MEMLVMOD+1(0),DIRUSER  SAVE DIR                 SS SEP84 07290000
         EX    R15,*-6                                         SS SEP84 07300000
         TM    DIRFLAG,X'60'       ANY TTR BITS ON?           ABL APR86 07310000
         BNZ   MMLLNSOR            YES, NOT SOURCE            ABL APR86 07320000
         CLI   MEMLVMOD,0          CHECK FOR SOURCE IN LOAD    SS NOV84 07330000
         BE    MMLNONL             SOURCE                      SS NOV84 07340000
         CLI   MEMLVMOD,30         COMPARE FOR SPF STATS       SS NOV84 07350000
         BE    MMLNONL             SOURCE                      SS NOV84 07360000
         CLI   MEMLVMOD,40         COMPARE FOR EXT SPF STATS  DRK OCT09 07370099
         BE    MMLNONL             SOURCE                     DRK OCT09 07380099
MMLLNSOR DS    0H                                             ABL APR86 07390000
         CLC   MEMLALIS,MMLALI     IS IT ALIAS                          07400000
         BNE   MMLALIAS                                                 07410000
***      CLI   MEMLVMOD,34         COMPARE FOR ALIAS AREA     ABL JAN87 07420000
***      BNE   MMLALIAS            GOOD                       ABL JAN87 07430000
         MVC   MEMLMNAM,DIRREAL    SAVE CLAIMED MAIN NAME               07440000
         TM    DIRATTR,ATTRSCTR    SCATTER LOADED?            ABL JAN87 07450000
         BNO   MMLALIAS            NO, BRANCH                 ABL JAN87 07460000
         MVC   MEMLMNAM,DIRREALS     ACTUAL MAIN NAME         ABL JAN87 07470000
MMLALIAS DS    0H                                                       07480000
* PROCESS PROGRAM LENGTH                                                07490000
         UNPK  MEMLWK(7),DIRSTORE(4)                                    07500000
         TR    MEMLWK(6),TRHEX                                          07510000
         MVC   MEMLLENG(6),MEMLWK                                       07520000
         MVC   MEMLXLEN(3),DIRSTORE  LENGTH IN HEX FOR SORT   DRK OCT99 07530027
* PROCESS PROGRAM ENTRY                                                 07540000
         UNPK  MEMLWK(7),DIREPA(4)                                      07550000
         TR    MEMLWK(6),TRHEX                                          07560000
         MVC   MEMLENTY(6),MEMLWK                                       07570000
* PROCESS LINKAGE EDIT DATE                                             07580000
         MVC   MEMLLDAT(8),MEMLLENG  INITIALIZE DATE/SIZE FLD ABL APR85 07590000
         MVC   MEMLLDAX(10),ISPBLK44 CLEAR FIELD              DRK MAR00 07600033
         MVC   MEMLLDAX(8),MEMLLENG  INITIALIZE DATE/SIZE FLD DRK MAR00 07610033
         MVI   LKEDDATE,X'FF'        INVALID DATE             ABL APR85 07620000
         TM    MEMFLAG2,MEMLTMLK     GET LKED FOR TIME CHECK   SS NOV86 07630000
         BO    READIDR               YES                       SS NOV86 07640000
         TM    MEMFLAG0,MEMLLKD1     THIS TIME GET LKED        SS AUG86 07650000
         BO    READIDR               YES                       SS AUG86 07660000
         TM    MEMFLAG0,MEMLNKD1     THIS TIME NOLKED          SS AUG86 07670000
         BO    MMLNOLKD              YES                       SS AUG86 07680000
         CLI   SPFLKDT,C'Y'          DEFAULT   GET LKED        SS AUG86 07690000
         BNE   MMLNOLKD              NO                        SS AUG86 07700000
*                                                                       07710000
*        IDR SCAN SUBROUTINE                                            07720000
*                                                                       07730000
         SPACE 3                                                        07740000
READIDR  DS    0H                                                       07750000
         AIF   ('&MVSLEV' LT 'MVS510').NOBAPI5                 GP SEP05 07760060
         TM    DS1SMSFG,DS1PDSE         PDSE DATASET?         DRK AUG05 07770060
         BNO   NOTAPDSE                 NO, MUST BE A PDS      GP SEP05 07780060
         L     R15,CVTPTR(,R0)                                 GP SEP05 07790060
         CLI   CVTDCB-CVT(R15),X'9B'                           GP SEP05 07800060
         BNE   LASTIDR                  OS IS TOO OLD FOR THIS GP SEP05 07810060
         LA    R15,PDSEBAPI             POINT TO ROUTINE       GP SEP05 07820060
         LA    R0,1                                            GP SEP05 07830060
         SLL   R0,31                                           GP SEP05 07840060
         OR    R15,R0                   SET AMODE=31 BIT       GP SEP05 07850060
         BASSM R14,R15                  INVOKE ROUTINE         GP SEP05 07860060
         LTR   R15,R15                  GOT A LKED DATE?       GP SEP85 07870060
         BNZ   LASTIDR                  NO, BAD LUCK           GP SEP05 07880060
         LA    R15,SPFSAVEK+5-15        YES, POINT TO YYDDDF   GP SEP05 07890060
         B     LKEDIDR                  GO PROCESS IT          GP SEP05 07900060
NOTAPDSE EQU   *                        LOOK FOR IDR BLOCKS    GP SEP05 07910060
.NOBAPI5 ANOP  ,                                               GP SEP05 07920060
         CLC   MEMLXTTR(3),DS1LSTAR     CHECK EXTENT           SS AUG86 07930000
         BL    READIDR2                 OK                     SS AUG86 07940000
*    FOLLOWING ARE FOR TEST             *                      SS AUG86 07950000
         BAS   R2,CLOSEIT               NEED ..                SS AUG86 07960000
         BAS   R2,ISPREST2                   REOPEN            SS AUG86 07970000
READIDR2 DS    0H                                                       07980000
         MVC   STARTTR(3),MEMLXTTR FIRST TTR                   SS AUG86 07990000
         SPACE 2                                                        08000000
IDREXCP  L     R15,VEXCP                                                08010000
**                                                            ABL JAN87 08020000
**       CALLER'S REGISTERS FOR ISPDSPY ARE SAVED AROUND      ABL JAN87 08030000
**       THE FOLLOWING CALL IN CASE AN ERROR MESSAGE IS       ABL JAN87 08040000
**       GENERATED IN EXCP; RESULT IS ENDLESS LOOP IN EXCP.   ABL JAN87 08050000
**                                                            ABL JAN87 08060000
         MVC   SPFSAVEK(9*4),SPFSAV14   SETUP FOR AN OUTPUT   ABL JAN87 08070000
         BASR  R14,R15                                                  08080000
         MVC   SPFSAV14(9*4),SPFSAVEK   RESTORE REGISTERS     ABL JAN87 08090000
         B     *+4(R15)            PROCESS RETURN CODE                  08100000
         B     IDREXCP1              00 - GOOD READ                     08110000
         B     LASTIDR               04 - END OF MEMBER                 08120000
         B     LASTIDR               08 - END OF DATA SET               08130000
         B     LASTIDR               12 - I/O ERROR                     08140000
VEXCP    DC    V(EXCP)                                         SS JUL85 08150000
         SPACE 1                                                        08160000
IDREXCP1 LR    R15,R0              START OF RECORD                      08170000
         TM    0(R15),X'50'        TEST SYM OR SCATTER RECORD?          08180000
         BM    IDREXCP             YES, SKIP IT                         08190000
         SPACE 1                                                        08200000
         CLI   0(R15),X'20'        CESD RECORD?                         08210000
         BE    IDREXCP             YES, SKIP                            08220000
         SPACE 1                                                        08230000
         CLI   0(R15),X'80'        IDR RECORD?                          08240000
         BNE   LASTIDR             NO, BRANCH                           08250000
         SPACE 1                                                        08260000
         TM    2(R15),X'02'        LINKAGE EDITOR IDR RECORD?           08270000
         BO    LKEDIDR             YES, BRANCH                          08280000
         B     IDREXCP             CONTINUED RECORD                     08290000
         SPACE 2                                                        08300000
LASTIDR  DS    0H                                                       08310000
         MVI   LKEDDATE,X'FF'      NO DATE                     SS JUL85 08320000
         B     MMLNOLKD                                       ABL NOV85 08330000
ATTRSCTR EQU   X'04'               SCATTER-LOADED MODULE      ABL JAN87 08340000
         EJECT                                                          08350000
         SPACE 3                                                        08360000
*  LINKAGE EDITOR IDR RECORDS:                                          08370000
* --  --  --  --  -- ---+ --  -- ---+ --  --  --  --  --  --  --  -- -* 08380000
*  0 - 9                |  10 - 11  |  12 - 14                        * 08390000
*  LINKAGE EDITOR NAME  |  VVMM     |  LINKAGE EDIT DATE              * 08400000
* --  --  --  --  -- ---+ --  -- ---+ --  --  --  --  --  --  --  -- -* 08410000
         SPACE 1                                                        08420000
LKEDIDR  OI    FLAGSCC,FIDR                                             08430000
         TM    MEMFLAG2,MEMLTMLK        CHECK DATE             SS NOV86 08440000
         BZ    MMLNOCK                  NO CHECK               SS NOV86 08450000
         TM    MEMFLAG2,MEMLTMPR        CHECK PREVIOUS         SS NOV86 08460000
         BO    MEMLCKPR                 YES                    SS NOV86 08470000
         CLC   SPFDAY+1(3),15(R15)      CHECK DATE             SS NOV86 08480000
         BNH   MMLNOCK                  OK, CONTINUE           SS NOV86 08490000
         OI    MEMFLAG2,MEMLTMNO        NO PROCESSING THIS ONE SS NOV86 08500000
         BR    R3                       RETURN                 SS NOV86 08510000
MEMLCKPR DS    0H                       *                      SS NOV86 08520000
         CLC   SPFDAY+1(3),15(R15)      CHECK DATE             SS NOV86 08530000
         BH    MMLNOCK                  OK, CONTINUE           SS NOV86 08540000
         OI    MEMFLAG2,MEMLTMNO        NO PROCESSING THIS ONE SS NOV86 08550000
         BR    R3                       RETURN                 SS NOV86 08560000
MMLNOCK  DS    0H                       *                      SS NOV86 08570000
         LA    R1,15(R15)          ADDRESS OF DATE                      08580000
         LA    R15,LKEDDATE                                             08590000
         L     R2,MEMLCVTD                                     SS JUL85 08600000
         BASR  R14,R2                                          SS JUL85 08610000
         SPACE 2                                                        08620000
         MVC   MEMLWK(9),DATEMASK    EDIT MASK                ABL APR85 08630000
         ED    MEMLWK(9),LKEDDATE    DATE AS " MM/DD/YY"      ABL APR85 08640000
         MVC   MEMLLDAT(2),MEMLWK+7  YY                       ABL APR85 08650000
         MVC   MEMLLDAT+3(5),MEMLWK+1 MM/DD                   ABL APR85 08660000
         MVI   MEMLLDAT+2,C'/'       NOW IN YY/MM/DD FORMAT   ABL APR85 08670000
         CLI   MEMLLDAT+3,C' '       SUPPRESSED LEADING BLANK?ABL APR85 08680000
         BNE   *+4+4                 NO, BRANCH               ABL APR85 08690032
         MVI   MEMLLDAT+3,C'0'       YES, REPLACE THE BLANK   ABL APR85 08700000
         MVI   MEMLLCEN,C'0'         ASSUME 19XX              Y2K AUG97 08710032
         CLC   MEMLLDAT(2),=C'&WIN19XX'  BELOW 19XX WINDOW?   Y2K AUG97 08720032
         BNL   *+8                       NO, THEN 19XX        Y2K AUG97 08730032
         MVI   MEMLLCEN,C'1'             YES, THEN 20XX       Y2K AUG97 08740032
         SPACE 1                                              DRK MAR00 08750032
         CLI   MEMLLCEN,X'F0'          19XX?                  DRK MAR00 08760032
         BNE   *+4+6+4                 NO, THEN 20XX          DRK MAR00 08770032
         MVC   MEMLLDAX(2),=C'19'      YES                    DRK MAR00 08780032
         B     *+4+6                                          DRK MAR00 08790032
         MVC   MEMLLDAX(2),=C'20'                             DRK MAR00 08800032
         MVC   MEMLLDAX+2(8),MEMLLDAT  YYYY/MM/DD             DRK MAR00 08810032
         SPACE 1                                              DRK MAR00 08820032
MMLNOLKD DS    0H                                             ABL APR85 08830032
         TM    MEMFLAG0,MEMLRIDR     WAS THIS READ IDR ONLY    SS AUG86 08840000
         BZ    MMLRCONT              NO, CONTINUE              SS AUG86 08850000
         NI    MEMFLAG0,255-MEMLRIDR RESET FLAGE               SS AUG86 08860000
         B     MEMLEMOD              DONE                      SS AUG86 08870000
MMLRCONT DS    0H                       *                      SS AUG86 08880000
         NI    MEMFLAG0,255-MEMLLKD1-MEMLNKD1 RESET 1 TIME FLG SS AUG86 08890000
* PROCESS APF CODE                                                      08900000
         TM    DIRATTR2,DIRVS      IS IT VS                             08910000
         BO    MMLAPF                                                   08920000
         MVC   MEMLAPF(4),MMLCNOVS                                      08930000
***      B     MMLDC                                          ABL JUL88 08940000
MMLAPF   TM    DIRATTR2,DIRAPFF    IS APF THERE                         08950000
***      BZ    MMLDC                                          ABL JUL88 08960000
         LA    R2,DIRAPF                                       SS NOV85 08970000
         TM    DIRATTR,DIRSCTR     SCATTER FORMAT              SS NOV85 08980000
         BNO   *+8                                             SS NOV85 08990000
         LA    R2,8(,R2)                                       SS NOV85 09000000
         TM    DIRFLAG,X'80'       ALIAS                       SS NOV85 09010000
         BO    MEMLAPF3            YES                         SS NOV85 09020000
         TM    5(R2),X'0F'         PDSMAN DATE?               ABL JAN87 09030000
         BO    MEMLAPF2            YES, BRANCH                ABL JAN87 09040000
         TM    6(R2),X'0F'         PDSMAN DATE?               ABL JAN87 09050000
         BO    MEMLAPF2            YES, BRANCH                ABL JAN87 09060000
         TM    4+5(R2),X'0F'       PDSMAN DATE AND SSI?       ABL JAN87 09070000
         BO    MEMLAPF2            YES, BRANCH                ABL JAN87 09080000
         TM    4+6(R2),X'0F'       PDSMAN DATE AND SSI?       ABL JAN87 09090000
         BO    MEMLAPF2            YES, BRANCH                ABL JAN87 09100000
         CLI   8(R2),0             CONVERTED ALIAS             SS NOV85 09110000
*        BE    *+8                 NO, SKIP                    SS NOV85 09120015
         B     *+8                 SKIP                       DRK JAN98 09130015
MEMLAPF3 LA    R2,11(,R2)                                      SS NOV85 09140000
MEMLAPF2 DS    0H                                             ABL JAN87 09150000
         TM    DIRATTR2,DIRVS      IS IT VS?                  ABL JUL88 09160000
         BO    MEMLAPF6            YES, BRANCH                ABL JUL88 09170000
         LA    R2,1(,R2)           ROUND                      ABL JUL88 09180000
         N     R2,=F'-2'           OFF LAST BIT (MAKE EVEN)   ABL JUL88 09190000
         CLC   =F'0',0(R2)         ZERO SSI                   ABL JUL88 09200000
         BE    MMLDC               NO SSI                     ABL JUL88 09210000
         CLC   =F'-1',0(R2)        ALL FFFFFFFF?              ABL JUL88 09220000
         BE    MMLDC               NO SSI                     ABL JUL88 09230000
         UNPK  MEMLWK(9),0(5,R2)   UNPACK HEX                 ABL JUL88 09240000
         TR    MEMLWK(8),TRHEX     TRANSLATE TO HEX           ABL JUL88 09250000
         MVC   MEMLSSI(8),MEMLWK                              ABL JUL88 09260000
         B     MMLDC               CONTINUE WITH DC CHECK     ABL JUL88 09270000
MEMLAPF6 DS    0H                                             ABL JUL88 09280000
         TM    DIRATTR2,DIR2SSI    SSI PRESENT                 SS NOV85 09290000
         BNO   MEMLAPF4            NO                          SS NOV85 09300000
         LA    R2,1(,R2)           ROUND                       SS NOV85 09310000
         N     R2,=F'-2'           OFF LAST BIT (MAKE EVEN)    SS NOV85 09320000
*        CLC   =F'0',0(R2)         ZERO SSI                   DRK JAN98 09330016
*        BE    MEMLAPF4            NO SSI                     DRK JAN98 09340016
*        CLC   =F'-1',0(R2)        ALL FFFFFFFF?              DRK JAN98 09350017
*        BE    MEMLAPF4                                       DRK JAN98 09360016
         LA    R2,4(,R2)           ADD FOR SSI                 SS NOV85 09370000
MEMLAPF4 DS    0H                                              SS NOV85 09380000
         LA    R15,1(,R2)          APF DATA                    SS NOV85 09390000
         CLI   0(R2),1             GOOD SSI                    SS NOV85 09400000
         BE    MMLAPF2             YES                         SS NOV85 09410000
         MVC    MEMLAPF(4),MMLCERR                             SS NOV85 09420000
         B     MMLDC                                           SS NOV85 09430000
MMLAPF2  CLI   0(R15),0            TEST AC(0)                           09440000
         BE    MMLDC                                                    09450000
         MVC   MEMLAPF+3(1),0(R15)                            ABL OCT85 09460000
         OI    MEMLAPF+3,X'F0'     MAKE PRINTABLE             ABL OCT85 09470000
         MVC   MEMLAPF(3),MMLCAC   FILL IN                    ABL OCT85 09480000
         MVC   MEMLAPFX(1),MEMLAPF+3 FOR USE W/ YYYYMMDD DATE DRK MAR00 09490030
MMLDC    TM    DIRATTR+1,DIRNODC   IS IT DC                             09500000
         BO    MMLSSI              NO                          SS NOV84 09510000
         MVC   MEMLDC(2),MMLCDC    SET DC                               09520000
MMLSSI   TM    DIRATTR2,DIRSSIF    DO WE HAVE SSI INFO         SS NOV84 09530000
         BZ    MMLTEST             NO                          SS NOV84 09540000
         SH    R15,MMLH5           BACK UP TO SSI INFO         SS NOV84 09550000
         UNPK  MEMLWK(9),0(5,R15)  UNPACK HEX                  SS NOV84 09560000
         TR    MEMLWK(8),TRHEX     TRANSLATE TO HEX            SS NOV84 09570000
         MVC   MEMLSSI(8),MEMLWK                               SS NOV84 09580000
MMLTEST  TM    DIRATTR,DIRTEST     IS IT TEST                           09590000
         BZ    MMLATTR1                                                 09600000
         TM    DIRATTR+1,DIRNOED   IS IT EDITABLE                       09610000
         BZ    MEMLOK              NO, INCOMPATIBLE WITH TEST           09620000
         MVC   MEMLATT1(4),MMLCNOED                                     09630000
         MVC   MEMLTEST(3),MMLCERR                                      09640000
         B     MMLLEV2                                                  09650000
MEMLOK   MVC   MEMLTEST(4),MMLCTEST                                     09660000
MMLATTR1 TM    DIRATTR+1,DIRNOED   IS IT EDITABLE                       09670000
         BZ    MMLEXEC             NO, INCOMPATIBLE WITH TEST           09680000
         MVC   MEMLATT1(4),MMLCNOED                                     09690000
         B     MMLLEV2                                                  09700000
MMLEXEC  TM    DIRATTR,DIREXEC     IS IT EXECUTABLE                     09710000
         BO    MMLLOAD             YES CONTINUE                         09720000
         MVC   MEMLATT1(4),MMLCNOEX                                     09730000
         B     MMLLEV2A                                                 09740000
MMLLOAD  TM    DIRATTR,DIRLOAD     IS IT LOAD ONLY                      09750000
         BZ    MMLOVLY             NO  CONTINUE                         09760000
         MVC   MEMLATT1(4),MMLCLOAD                                     09770000
***TEST  B     MMLREFR2                                       ABL JAN87 09780000
         B     MMLLEV2B   MMLREFR2 ***TEST                     SS JUN86 09790000
MMLOVLY  TM    DIRATTR,DIROVLY     IS IT OVERLAY                        09800000
         BZ    MMLSCTR             NO  CONTINUE                         09810000
         MVC   MEMLATT1(4),MMLCOVLY                                     09820000
         B     MMLLEV2C                                                 09830000
MMLSCTR  TM    DIRATTR,DIRSCTR     IS IT SCATTER LOAD                   09840000
         BZ    MMLREFR             NO  CONTINUE                         09850000
         MVC   MEMLATT1(4),MMLCSCTR                                     09860000
         B     MMLLEV2D                                                 09870000
MMLREFR  TM    DIRATTR+1,DIRREFR   IS IT REFRESHABLE                    09880000
         BZ    MMLRENT             NO  CONTINUE                         09890000
         MVC   MEMLATT1(4),MMLCREFR                                     09900000
         B     MMLLEV2E                                                 09910000
MMLRENT  TM    DIRATTR,DIRRENT     IS IT REENTRANT                      09920000
         BZ    MMLREUS             NO  CONTINUE                         09930000
         MVC   MEMLATT1(4),MMLCRENT                                     09940000
         TM    DIRATTR,DIRREUS     MUST ALSO BE REUS                    09950000
         BZ    REUSERR                                                  09960000
         MVC   MEMLATT2(4),MMLCREUS                                     09970000
         B     MMLMODE                                                  09980000
REUSERR  MVC   MEMLATT2(4),MMLCERR1                                     09990000
         B     MMLMODE                                                  10000000
MMLREUS  TM    DIRATTR,DIRREUS     IS IT REUSABLE                       10010028
         BZ    MMLMODE             NO  CONTINUE                         10020000
         MVC   MEMLATT1(4),MMLCREUS                                     10030000
         B     MMLMODE                                                  10040000
MMLLEV2  DS    0H                                                       10050000
         TM    DIRATTR,DIREXEC     IS IT EXECUTABLE                     10060000
         BO    MMLLOAD2            YES CONTINUE                         10070000
         MVC   MEMLATT2(4),MMLCNOEX                                     10080000
         B     MMLMODE                                                  10090000
MMLLEV2A DS    0H                                                       10100000
MMLLOAD2 TM    DIRATTR,DIRLOAD     IS IT LOAD ONLY                      10110000
         BZ    MMLOVLY2            NO  CONTINUE               ABL OCT85 10120000
         MVC   MEMLATT2(4),MMLCLOAD                                     10130000
         B     MMLLEV2B                                                 10140000
MMLOVLY2 TM    DIRATTR,DIROVLY     IS IT OVERLAY                        10150000
         BZ    MMLSCTR2            NO  CONTINUE                         10160000
         MVC   MEMLATT2(4),MMLCOVLY                                     10170000
         B     MMLLEV2C                                                 10180000
MMLSCTR2 TM    DIRATTR,DIRSCTR     IS IT SCATTER LOAD                   10190000
         BZ    MMLREFR2            NO  CONTINUE                         10200000
         MVC   MEMLATT2(4),MMLCSCTR                                     10210000
         B     MMLLEV2D                                                 10220000
MMLREFR2 TM    DIRATTR+1,DIRREFR   IS IT REFRESHABLE                    10230000
         BZ    MMLRENT2            NO  CONTINUE                         10240000
         MVC   MEMLATT2(4),MMLCREFR                                     10250000
         B     MMLMODE                                                  10260000
MMLLEV2E DS    0H                                                       10270000
MMLRENT2 TM    DIRATTR,DIRRENT     IS IT REENTRANT                      10280000
         BZ    MMLREUS2            NO  CONTINUE                         10290000
         MVC   MEMLATT2(4),MMLCRENT                                     10300000
         TM    DIRATTR,DIRREUS     MUST ALSO BE REUS                    10310000
         BO    MMLMODE                                                  10320000
         MVC   MEMLATT2(4),MMLCERR1                                     10330000
         B     MMLMODE                                                  10340000
MMLREUS2 TM    DIRATTR,DIRREUS     IS IT REUSABLE                       10350000
         BZ    MMLMODE             NO  CONTINUE                         10360000
         MVC   MEMLATT2(4),MMLCREUS                                     10370000
         B     MMLMODE                                                  10380000
MMLLEV2B TM    DIRATTR,DIRBADL                                          10390000
         BZ    MMLMODE                                        ABL OCT85 10400000
         MVC   MEMLATT2(4),MMLCERRL                                     10410000
         B     MMLMODE                                                  10420000
MMLLEV2C TM    DIRATTR,DIRBADO                                          10430000
         BZ    MMLMODE                                                  10440000
         MVC   MEMLATT2(4),MMLCERRO                                     10450000
         B     MMLMODE                                                  10460000
MMLLEV2D TM    DIRATTR,DIRBADS                                          10470000
         BZ    MMLREUS2                                                 10480000
         MVC   MEMLATT2(4),MMLCERRS                                     10490000
         B     MMLMODE                                                  10500000
MMLMODE  DS    0H                                                       10510000
         CLI   DIRATTR3,0                                               10520000
         BE    MEMLEMOD                                                 10530000
         CLC   MEMLALIS,MMLALI    IS IT ALIAS                           10540000
         BE    MMLMODEA                                                 10550000
         SPACE 1                                                        10550199
*RMODE64                                                                10550299
         TM    DIRATTR3,DIRRANY+X'20' RMODE 64?               DRK APR18 10550399
         BNO   MMLMODE1            NO                         DRK APR18 10550499
         TM    DIRATTR3,DIRAMOD2   YES                        DRK APR18 10550599
         BO    MMLERRR             RMODE64, AMODEANY (ERROR)  DRK APR18 10550699
         TM    DIRATTR3,DIRAERR2*2                            DRK APR18 10550799
         BO    MMLERRR             RMODE64, AMODE31  (ERROR)  DRK APR18 10550899
         TM    DIRATTR3,DIRAERR2                              DRK APR18 10550999
         BO    MMLR664             RMODE64, AMODE64  (VALID)  DRK APR18 10551099
         B     MMLERRR             RMODE64, AMODE24  (ERROR)  DRK APR18 10551199
         SPACE 1                                                        10551299
*RMODEANY                                                               10551399
MMLMODE1 DS    0H                                             DRK APR18 10551499
         TM    DIRATTR3,DIRRANY    RMODE ANY?                           10560040
         BZ    MMLMODE2            NO                                   10570040
         TM    DIRATTR3,DIRAMOD2   YES, CHECK AMODE ANY                 10580040
         BO    MMLERRR             RMODEANY, AMODEANY         ABL OCT85 10590040
         TM    DIRATTR3,DIRAERR2*2                            ABL OCT85 10600000
         BO    MMLRANY             RMODEANY, AMODE31 (VALID)  DRK NOV02 10610042
         TM    DIRATTR3,DIRAERR2                              DRK OCT02 10620040
         BO    MMLRA64             RMODEANY, AMODE64 (VALID)  DRK NOV02 10630042
         B     MMLERRR                                                  10640000
MMLMODE2 TM    DIRATTR3,DIRAMOD2                                        10650000
         BO    MMLAANY                                                  10660000
         TM    DIRATTR3,DIRAERR2*2                            ABL OCT85 10670000
         BO    MMLA31                                         DRK FEB02 10680038
         TM    DIRATTR3,DIRAERR2                              DRK FEB02 10690038
         BO    MMLA64                                         DRK FEB02 10700038
         B     MEMLEMOD                                       DRK FEB02 10710038
*RMODE64 CODE FOR ALIASES GOES HERE                                     10711099
MMLMODEA TM    DIRATTR3,DIRRANY    RMODE ANY?                           10720040
         BZ    MMLMODE3            NO                                   10730040
         TM    DIRATTR3,DIRAMOD1   YES, CHECK AMODE ANY                 10740040
         BO    MMLERRR             RMODEANY, AMODEANY         ABL OCT85 10750000
         TM    DIRATTR3,DIRAERR1*2                            ABL OCT85 10760000
         BO    MMLRANY             RMODEANY, AMODE31 (VALID)  DRK NOV02 10770042
         TM    DIRATTR3,DIRAERR1                              DRK OCT02 10780040
         BO    MMLRA64             RMODEANY, AMODE64 (VALID)  DRK NOV02 10790042
         B     MMLERRR                                                  10800000
MMLMODE3 TM    DIRATTR3,DIRAMOD1                                        10810000
         BO    MMLAANY                                                  10820000
         TM    DIRATTR3,DIRAERR1*2                            ABL OCT85 10830038
         BO    MMLA31                                         DRK FEB02 10840038
         TM    DIRATTR3,DIRAERR1                              DRK FEB02 10850038
         BO    MMLA64                                         DRK FEB02 10860038
         B     MEMLEMOD                                       DRK FEB02 10870038
MMLERRR  MVC   MEMLMODE(4),MMLCERRR                                     10880000
         B     MEMLEMOD                                                 10890000
MMLRANY  MVC   MEMLMODE(4),MMLCRANY                           ABL OCT85 10900000
         B     MEMLEMOD                                                 10910000
MMLRA64  MVC   MEMLMODE(4),MMLCRA64                           DRK NOV02 10920041
         B     MEMLEMOD                                       DRK NOV02 10930041
MMLR664  MVC   MEMLMODE(4),MMLCR664                           DRK APR18 10931099
         B     MEMLEMOD                                       DRK APR18 10932099
MMLAANY  MVC   MEMLMODE(4),MMLCAANY                                     10940000
         B     MEMLEMOD                                                 10950000
MMLA31   MVC   MEMLMODE(3),MMLCA31                                      10960000
         B     MEMLEMOD                                                 10970000
MMLA64   MVC   MEMLMODE(3),MMLCA64                            DRK FEB02 10980038
         B     MEMLEMOD                                       ABL OCT85 10990000
MMLNONL  DS    0H                                              SS NOV84 11000000
         MVC   MEMLATT1,MMLSORCE                               SS NOV84 11010000
         B     MEMLADD                                         SS NOV84 11020000
MEMLEMOD DS    0H                                                       11030000
MEMLADD  DS    0H                                                       11040000
         BR    R3            RETURN                            SS JUL85 11050000
         DROP  R4                                              SS JUL85 11060000
*                                                                       11070000
*  MEML CONSTANT AREA                                                   11080000
*                                                                       11090000
*                                                                       11100000
MEMLCVTD DC    V(CONVDATE)                                     SS JUL85 11110000
MMLH5    DC    H'5'                                            SS NOV84 11120000
MMLH34   DC    H'34'                                           SS NOV84 11130000
MMLALI   DC    CL8'*ALIAS'                                              11140000
MMLCNOVS DC    CL4'NOVS'                                                11150000
MMLCAC   DC    CL4'AC= '                                      ABL OCT85 11160000
MMLCDC   DC    CL4'DC  '                                                11170000
MMLCNOED DC    CL4'NOED'                                                11180000
MMLCERR  DC    CL4'ERR '                                                11190000
MMLCTEST DC    CL4'TEST'                                                11200000
MMLCNOEX DC    CL4'NOEX'                                                11210000
MMLCLOAD DC    CL4'LOAD'                                                11220000
MMLCOVLY DC    CL4'OVLY'                                                11230000
MMLCSCTR DC    CL4'SCTR'                                                11240000
MMLCREFR DC    CL4'REFR'                                                11250000
MMLCRENT DC    CL4'RENT'                                                11260000
MMLCREUS DC    CL4'REUS'                                                11270000
MMLCERR1 DC    CL4'ERR1'                                                11280000
MMLCERRL DC    CL4'ERRL'                                                11290000
MMLCERRO DC    CL4'ERRO'                                                11300000
MMLCERRS DC    CL4'ERRS'                                                11310000
MMLCERRR DC    CL4'ERRR'                                                11320000
MMLCRANY DC    CL4'RANY'                                      ABL OCT85 11330000
MMLCA64  DC    CL4'A64 '                                      DRK FEB02 11340038
MMLCA31  DC    CL4'A31 '                                                11350000
MMLCRA64 DC    CL4'A64+'  RMODEANY, AMODE64                   DRK NOV02 11360043
MMLCR664 DC    CL4'A64*'  RMODE64,  AMODE64                   DRK APR18 11361099
MMLCAANY DC    CL4'AANY'                                                11370000
MMLSORCE DC    CL4'SORC'                                       SS NOV84 11380000
         SPACE 2                                                        11390000
DATEMASK DC    X'402120612020612020'                           SS JUL85 11400004
TRHEX1   DC    C'0123456789ABCDEF'   TRANSLATE TO HEX                   11410000
TRHEX    EQU   *-256                                                    11420000
         LTORG ,                                               SS NOV85 11430000
         EJECT                                                          11440000
DIRCALIS EQU   B'10000000'         ALIAS FLAG                           11450000
DIRCTTRN EQU   B'01100000'         TTR COUNT                            11460000
DIRCUDHW EQU   B'00011111'         HALFWD COUNT                         11470000
DIRSPFOF EQU   B'01110000'         BITS ARE OFF IN SPF STATS            11480000
* SOME BITS ON FOR LOAD MODULES                                         11490000
DIRSPFON EQU   B'00001111'         BITS ARE ON IN SPF STATS             11500000
DIRRENT  EQU   B'10000000'           RENT                               11510000
DIRREUS  EQU   B'01000000'           REUS                               11520000
DIROVLY  EQU   B'00100000'           OVLY                               11530000
DIRBADO  EQU   B'11001100'           OVLY      CONFLICTS                11540000
DIRTEST  EQU   B'00010000'           TEST                               11550000
DIRLOAD  EQU   B'00001000'           LOAD ONLY                          11560000
DIRBADL  EQU   B'00000100'           LOAD ONLY CONFLICTS                11570000
DIRSCTR  EQU   B'00000100'           SCTR LOAD                          11580000
DIRBADS  EQU   B'10101000'           SCTR LOAD CONFLICTS                11590000
DIREXEC  EQU   B'00000010'           EXECUTABLE                         11600000
DIRF1    EQU   B'00000001'                                              11610000
* ATTR 1 BYTE 1                                                         11620000
DIRNODC  EQU   B'10000000'           NOT DC                             11630000
DIRF2    EQU   B'01000000'                                              11640000
DIRF3    EQU   B'00100000'                                              11650000
DIRF4    EQU   B'00010000'                                              11660000
DIRNOED  EQU   B'00001000'           NOT EDITABLE                       11670000
DIRF5    EQU   B'00000100'                                              11680000
DIRLKEDF EQU   B'00000010'           F LEVEL LINK EDITOR                11690075
DIRREFR  EQU   B'00000001'           REFR                               11700000
* ATTR 2                                                                11710000
DIRVS    EQU   B'10000000'           VS LEVEL LINK EDITOR               11720075
DIRRES1  EQU   B'01000000'                                              11730000
DIRPG    EQU   B'00100000'           PAGE ALIGNMENT                     11740057
DIRSSIF  EQU   B'00010000'           SSI PRESENT                        11750000
DIRAPFF  EQU   B'00001000'           APF PRESENT                        11760000
* AMODE/RMODE FLAGS                                                     11770000
DIRRANY  EQU   B'00010000'           RMODE ANY FLAG                     11780000
DIRAMOD1 EQU   B'00001100'           AMODE FOR ALIAS                    11790000
DIRAERR1 EQU   B'00000100'           AMODE INVALID BIT COMB    SS NOV84 11800000
DIRAMOD2 EQU   B'00000011'           AMODE FOR MAIN ENTRY               11810000
DIRAERR2 EQU   B'00000001'           AMODE INVALID BIT COMB    SS NOV84 11820000
MEML0021 DC    X'4021207A2020'                                DRK DEC98 11830024
MEML0020 DC    X'402020202120'                                DRK DEC98 11840024
         SPACE 2                                                        11850000
         AIF   ('&MVSLEV' LT 'MVS510').NOBAPI6                 GP SEP05 11860060
         USING PDSEBAPI,R4                                     GP SEP05 11870060
PDSEBAPI BAKR  R14,0                 SAVE STATUS               GP SEP05 11880060
         LR    R4,R15                SET BASE REGISTER         GP SEP05 11890060
         SPACE 1                                               GP JUL10 11900099
         STD   R4,DOUBLE             RETRIEVE DESERV STATUS    GP JUL10 11910099
PORETRY1 ICM   R2,15,DOUBLE          POINT TO THE FIRST DESB   GP JUL10 11920099
         BNP   POBJGETM              NO DESB IN CORE           GP JUL10 11930099
         USING DESB,R2                                         GP JUL10 11940099
MLDESBLP ICM   R5,15,DESB_COUNT      GET THE SMDE COUNT        GP JUL10 11950099
         BZ    MLDESBNX              NONE IN THIS DESB         GP JUL10 11960099
         LA    R3,DESB_DATA          POINT TO THE FIRST SMDE   GP JUL10 11970099
         USING SMDE,R3                                         GP JUL10 11980099
MLSMDELP SR    R1,R1                                           GP JUL10 11990099
         ICM   R1,3,SMDE_NAME_OFF    GET NAME SECTION OFFSET   GP JUL10 12000099
         AR    R1,R3                 POINT TO NAME SECTION     GP JUL10 12010099
         USING SMDE_NAME,R1                                    GP JUL10 12020099
         CLI   SMDE_NAME_LEN+1,8     LONG NAME?                GP JUL10 12030099
         BH    MLSMDENX              YES, CAN'T BE A MATCH     GP JUL10 12040099
         LA    R1,SMDE_NAME_VAL      POINT TO THE NAME         GP JUL10 12050099
         DROP  R1                    SMDE_NAME                 GP JUL10 12060099
         CLC   DIRNAME,0(R1)         FOUND THE MEMBER?         GP JUL10 12070099
         BNE   MLSMDENX              NO, TRY NEXT ONE          GP JUL10 12080099
         SR    R15,R15               CLEAR FOR INSERT          GP JUL10 12090099
         ICM   R15,3,SMDE_PMAR_OFF   GET OFFSET TO PMAR        GP JUL10 12100099
         ALR   R15,R3                POINT TO PMAR SECTION     GP JUL10 12110099
         USING PMAR,R15                                        GP JUL10 12120099
         CLI   PMAR_LVL,PMAR_PM2_VAL PROGRAM OBJECT LEVEL 1?   GP JUL10 12130099
         BL    POBJGETM              YES, DATE NOT AVAILABLE   GP JUL10 12140099
         USING PMARL,PMAR_END                                  GP JUL10 12150099
         XC    SPFSAVEK(5),SPFSAVEK  COPY BIND DATE            GP JUL10 12160099
         MVC   SPFSAVEK+5(3),PMARL_DATE+1                      GP JUL10 12170099
         DROP  R15                   PMAR, PMARL               GP JUL10 12180099
         SR    R15,R15               ZERO RETURN CODE          GP JUL10 12190099
         PR    ,                     RETURN TO CALLER          GP JUL10 12200099
MLSMDENX ICM   R0,15,SMDE_LEN        GET LENGTH OF WHOLE SMDE  GP JUL10 12210099
         ALR   R3,R0                 POINT TO NEXT SMDE        GP JUL10 12220099
         BCT   R5,MLSMDELP           GO LOOK AT IT             GP JUL10 12230099
         DROP  R3                    SMDE                      GP JUL10 12240099
MLDESBNX ICM   R2,15,DESB_NEXT       POINT TO THE NEXT DESB    GP JUL10 12250099
         BNZ   MLDESBLP              GO PROCESS IT             GP JUL10 12260099
         DROP  R2                    DESB                      GP JUL10 12270099
         SPACE 1                                               GP JUL10 12280099
POBJGETM DS    0H                    ACQUIRE WORKING STORAGE   GP JUL10 12290099
         LA    R0,IDRAPIWL                                     GP SEP05 12300060
         GETMAIN RU,LV=(0),LOC=(31,64),SP=21                   GP SEP05 12310060
         LR    R13,R1                                          GP SEP05 12320060
         LR    R0,R1                                           GP SEP05 12330060
         LA    R1,IDRAPIWL                                     GP SEP05 12340060
         SR    R15,R15                                         GP SEP05 12350060
         MVCL  R0,R14                ZERO NEW STORAGE          GP SEP05 12360060
         USING IDRAPIWK,R13                                    GP SEP05 12370060
         MVC   4(4,R13),=CL4'F1SA'   FLAG LINKAGE STACK USAGE  GP SEP05 12380060
         SPACE 1                                               GP SEP05 12390099
         MVI   BNDRETCD+3,8          NO IDR DATA YET           GP SEP05 12400099
         TM    FLAGSHH,FHPGMOBJ      ALREADY KNOW IT IS PGMS?  GP SEP05 12410099
         BO    POBJITIS              YES, SAVE A MACRO CALL    GP SEP05 12420099
         MVC   BNDDATA(ISITMGDL),ISITMGDS                      GP SEP05 12430099
         USING ISM,BNDDATA                                     GP SEP05 12440099
         ISITMGD DCB=INDCB,DATATYPE=YES,MF=(E,BNDDATA)         GP SEP05 12450099
         TM    ISMOFLG3,ISMDTPGM     PROGRAM OBJECT LIBRARY?   GP SEP05 12460099
         BNO   IDRBAPIX              NO, SKIP BINDER API CALL  GP SEP05 12470099
         OI    FLAGSHH,FHPGMOBJ      YES, FLAG IT FOR A WHILE  GP SEP05 12480099
POBJITIS DS    0H                                              GP SEP05 12490099
         SPACE 1                                               GP JUL10 12500099
         ICM   R15,15,DOUBLE         FIRST TIME?               GP JUL10 12510099
         BNZ   POBJGADN              NO, GET_ALL ALREADY TRIED GP JUL10 12520099
         MVI   DOUBLE,X'FF'          YES, PREPARE FOR FAILURE  GP JUL10 12530099
         LD    R4,DOUBLE             REMEMBER ACROSS CALLS     GP JUL10 12540099
         MVC   BNDDATA(DESRVGL),DESRVGS                        GP JUL10 12550099
         DESERV FUNC=GET_ALL,        GET ALL DIRECTORY ENTRIES GP JUL10+12560099
               AREAPTR=BNDCURSR,     RETURNED POINTER AREA     GP JUL10+12570099
               CONN_INTENT=NONE,     HOLD NO CONNECTIONS       GP JUL10+12580099
               DCB=INDCB,            SUPPLY OPEN BPAM DCB      GP JUL10+12590099
               RETCODE=BNDRETCD,     SUPPLY RETURN CODE AREA   GP JUL10+12600099
               RSNCODE=BNDRSNCD,     SUPPLY REASON CODE AREA   GP JUL10+12610099
               SUBPOOL=18,           SUPPLY SUBPOOL ID         GP JUL10+12620099
               MF=(E,BNDDATA,COMPLETE)                         GP JUL10 12630099
         ICM   R15,15,BNDRETCD       SUCCESS?                  GP JUL10 12640099
         BNZ   POBJGADN              NO, DO IT THE SLOW WAY    GP JUL10 12650099
         MVC   DOUBLE(4),BNDCURSR    YES, COPY 1ST DESB ADDR   GP JUL10 12660099
         LD    R4,DOUBLE             REMEMBER ACROSS CALLS     GP JUL10 12670099
         LR    R1,R13                POINT TO WORKING STORAGE  GP JUL10 12680099
         LA    R0,IDRAPIWL           GET ITS SIZE AND FREE IT  GP JUL10 12690099
         FREEMAIN RU,LV=(0),A=(1),SP=21                        GP JUL10 12700099
         B     PORETRY1              RETRY AFTER GET_ALL SETUP GP JUL10 12710099
POBJGADN DS    0H                                              GP JUL10 12720099
         SPACE 1                                               GP JUL10 12730099
         MVI   IDRBLDL+1,1           NEED BLDL FORMAT,         GP SEP05 12740060
         MVI   IDRBLDL+3,76           NOT STOW FORMAT FOR      GP SEP05 12750099
         MVC   IDRBLDL+4(8),DIRNAME   BINDER API AND DESERV    GP SEP05 12760099
         BLDL  INDCB,IDRBLDL                                   GP SEP05 12770060
         LTR   R15,R15               ALL AS IT SHOULD BE?      GP SEP05 12780060
         BNZ   IDRBAPIX              NO, THAT'S STRANGE        GP SEP05 12790060
         SPACE 1                                               GP SEP05 12800060
         MVC   BNDDATA(DESRVGL),DESRVGS                        GP SEP05 12810068
         DESERV FUNC=GET,            GET A DIRECTORY ENTRY     GP JAN08+12820068
               AREAPTR=BNDCURSR,     RETURNED POINTER AREA     GP JAN08+12830068
               BYPASS_LLA=YES,       GET LATEST FROM DISK      GP JAN08+12840068
               CONN_ID=MODDEPTR,     SAVE FOR RELEASE          GP JAN08+12850068
               CONN_INTENT=HOLD,     COMPULSORY                GP JAN08+12860068
               DCB=INDCB,            SUPPLY OPEN BPAM DCB      GP JAN08+12870068
               PDSDE=IDRBLDL+4,      POINT TO BLDL RESULTS     GP JAN08+12880068
               RETCODE=BNDRETCD,     SUPPLY RETURN CODE AREA   GP JAN08+12890068
               RSNCODE=BNDRSNCD,     SUPPLY REASON CODE AREA   GP JAN08+12900068
               SUBPOOL=21,           SUPPLY SUBPOOL ID         GP JAN08+12910068
               MF=(E,BNDDATA,COMPLETE)                         GP JAN08 12920068
         ICM   R15,15,BNDRETCD       SUCCESS?                  GP JAN08 12930068
         BNZ   IDRBAPIX              NO, NO DATA TO LOOK AT    GP JAN08 12940068
         DESERV FUNC=RELEASE,        RELEASE THE CONNECTION    GP JAN08+12950068
               CONN_ID=MODDEPTR,       THAT WAS JUST ACQUIRED  GP JAN08+12960068
               DCB=INDCB,            SUPPLY OPEN BPAM DCB      GP JAN08+12970068
               MF=(E,BNDDATA,COMPLETE)                         GP JAN08 12980068
         L     R2,BNDCURSR           YES, POINT TO DESB        GP JAN08 12990068
         USING DESB,R2                                         GP JAN08 13000068
         LA    R3,DESB_DATA          POINT TO THE ACTUAL ENTRY GP JAN08 13010068
         USING SMDE,R3                                         GP JAN08 13020068
         SR    R15,R15               CLEAR FOR INSERT          GP JAN08 13030068
         ICM   R15,3,SMDE_PMAR_OFF   GET OFFSET TO PMAR        GP JAN08 13040068
         ALR   R15,R3                POINT TO PMAR SECTION     GP JAN08 13050068
         USING PMAR,R15                                        GP JAN08 13060068
         MVI   BNDRETCD+3,8          FLAG NO IDR DATE FOUND    GP JAN08 13070068
         CLI   PMAR_LVL,PMAR_PM2_VAL PROGRAM OBJECT LEVEL 1?   GP JAN08 13080068
         BL    IDRDSRVX              YES, DATE NOT AVAILABLE   GP JAN08 13090068
         USING PMARL,PMAR_END                                  GP JAN08 13100068
         XC    SPFSAVEK(5),SPFSAVEK  COPY BIND DATE            GP JAN08 13110068
         MVC   SPFSAVEK+5(3),PMARL_DATE+1                      GP JAN08 13120068
         XC    BNDRETCD,BNDRETCD     IDR DATA EXISTS           GP JAN08 13130068
IDRDSRVX DS    0H                    CLEAN UP DESERV STORAGE   GP JAN08 13140068
         L     R0,DESB_LEN           RETURNED BUFFER LENGTH    GP JAN08 13150068
         LR    R1,R2                 RETURNED BUFFER ADDRESS   GP JAN08 13160068
         FREEMAIN RU,LV=(0),A=(1),SP=21                        GP JAN08 13170068
         TM    IDRBLDL+27,DIRNOED    NOT EDITABLE?             GP JUL10 13180099
         BO    IDRBAPIX              YES, SO DONE ALL WE CAN   GP JUL10 13190099
         CLI   BNDRETCD+3,0          NOT NE, BUT GOT DATE?     GP JUL10 13200099
         BE    IDRBAPIX              YES, SO SKIP BINDER API   GP JUL10 13210099
         DROP  R2,R3,R15             DESB, SMDE, PMAR+PMARL    GP JAN08 13220068
         SPACE 1                                               GP JAN08 13230068
IDRBAPIE DS    0H                    ENTRY TO BINDER API USAGE GP SEP05 13240068
         AGO   .NOFDA1               READ THESE COMMENTS:      GP APR18 13250099
*  SKIP BINDER FDA API CALL WHICH I THINK NEVER WORKED ANYWAY  GP APR18 13260099
*  - FOR A START VERSION=1 IS PROBABLY NEEDED (FOR PO1 WITH    GP APR18 13270099
*    THE FDA API) BUT A TEST OF THIS DID NOT WORK EITHER.      GP APR18 13280099
*  - THE FDA API INFRASTRUCTURE ELSEWHERE IN PDS USED BY       GP APR18 13290099
*    THIS CODE HAS BEEN REMOVED - BECAUSE THE OTHER ROUTINES   GP APR18 13300099
*    HAVE BEEN UPDATED TO USE THE FULL DIALOG API.             GP APR18 13310099
*  - IN THEORY CODE IN @MAP COULD BE COPIED HERE TO PROCURE    GP APR18 13320099
*    THE BIND DATE, BUT THERE ARE SO FEW PO1 PROGRAMS AROUND   GP APR18 13330099
*    THESE DAYS THAT I DON'T THINK THE BLOAT IS WORTH IT.      GP APR18 13340099
*                                                              GP APR18 13350099
         XC    BNDCURSR(256),BNDCURSR                          GP JUL10 13360099
         ICM   R0,15,IEWBFDAT        LOAD ISSUED?              GP JUN10 13370099
         BNZ   FDALOAD               YES                      DRK JAN09 13380099
         LOAD  EPLOC=IDRBFDAT        GET IEWBFDAT EPA          GP SEP05 13390060
         ST    R0,IEWBFDAT           SAVE IEWFDAT EPA         DRK JAN09 13400073
FDALOAD  DS    0H                                             DRK JAN09 13410073
         ST    R0,FDAENTPT           SAVE IT IN LOCAL PARM     GP SEP05 13420099
         LA    R0,FDAENTPT           INITIALIZE PLIST          GP SEP05 13430060
         ST    R0,FDAEPTAD                                     GP SEP05 13440060
         XC    MODTOKEN,MODTOKEN                               GP SEP05 13450060
         LA    R0,MODTOKEN                                     GP SEP05 13460060
         ST    R0,FDATKNAD                                     GP SEP05 13470060
         LA    R0,BNDRETCD                                     GP SEP05 13480060
         ST    R0,FDARETAD                                     GP SEP05 13490060
         LA    R0,BNDRSNCD                                     GP SEP05 13500060
         ST    R0,FDARSNAD                                     GP SEP05 13510060
         LA    R0,INDCB                                        GP SEP05 13520060
         ST    R0,MODDCBPT                                     GP SEP05 13530060
         LA    R0,MODDCBPT                                     GP SEP05 13540060
         ST    R0,FDADCBAD                                     GP SEP05 13550060
         LA    R0,IDRBLDL+4                                    GP SEP05 13560060
         ST    R0,MODDEPTR                                     GP SEP05 13570060
         LA    R0,MODDEPTR                                     GP SEP05 13580060
         ST    R0,FDADEADR                                     GP SEP05 13590060
         LA    R0,BNDDATA                                      GP SEP05 13600060
         ST    R0,FDABFRAD                                     GP SEP05 13610060
         LA    R0,BNDCURSR                                     GP SEP05 13620060
         ST    R0,FDACSRAD                                     GP SEP05 13630060
         LA    R0,BNDCOUNT                                     GP SEP05 13640060
         ST    R0,FDACNTAD                                     GP SEP05 13650060
         LA    R0,FDAHOLD                                      GP SEP05 13660060
         ST    R0,FDAHLDAD                                     GP SEP05 13670060
         OI    FDAHLDAD,X'80'      FLAG LAST PARAMETER         GP SEP05 13680060
         LA    R0,FDADEL                                       GP SEP05 13690060
         ST    R0,FDADELAD                                     GP SEP05 13700060
         MVI   FDADEL,C'N'                                     GP SEP05 13710060
         MVI   FDAHOLD,C'N'        ONLY DOING ONE CALL PER PGM GP SEP05 13720060
         USING IEWBIDB,BNDDATA                                 GP SEP05 13730060
         LA    R0,CLS_IDRB                                     GP SEP05 13740060
         ST    R0,FDACLSAD                                     GP SEP05 13750060
         MVC   IEWBIDB(IDBH_LENG),IDBI_INIT_VALUES             GP SEP05 13760060
         LA    R1,BNDPARMS         POINT TO PARAMETER LIST     GP SEP05 13770060
         L     R15,FDAENTPT                                    GP SEP05 13780060
         BASSM R14,R15             CALL BINDER API             GP SEP05 13790060
         CLC   BNDRETCD,=F'4'      ANY DATA RETURNED?          GP SEP05 13800060
         BH    IDRBDONE            NO                          GP SEP05 13810060
         USING IDB_ENTRY,IDBH_END                              GP SEP05 13820060
         ICM   R5,15,BNDCOUNT      GET RETURNED RECORD COUNT   GP SEP05 13830060
         BNP   IDRBDONE            NO ENTRIES WERE RETURNED    GP SEP05 13840060
         PACK  SPFSAVEK(8),IDB_DATE_BOUND                      GP SEP05 13850060
         XC    BNDRETCD,BNDRETCD   IDR DATA EXISTS             GP SEP05 13860060
IDRBDONE DS    0H                                              GP SEP05 13870060
*        DELETE EPLOC=IDRBFDAT     DISCARD IEWBFDAT            GP SEP05 13880072
.NOFDA1  ANOP  ,                                               GP APR18 13890099
         SPACE 1                                               GP SEP05 13900060
IDRBAPIX LR    R1,R13                                          GP SEP05 13910060
         LA    R0,IDRAPIWL                                     GP SEP05 13920060
         L     R3,BNDRETCD         GET RETURN CODE             GP SEP05 13930060
         FREEMAIN RU,LV=(0),A=(1),SP=21                        GP SEP05 13940060
         LR    R15,R3              SET RETURN CODE             GP SEP05 13950060
         PR    ,                   BACK TO THE 370 WORLD       GP SEP05 13960060
         SPACE 2                                               GP SEP05 13970060
         DROP  R13                 IDRAPIWK                    GP SEP05 13980060
         DROP  R4                  PDSEBAPI                    GP JAN08 13990068
         SPACE 2                                               GP SEP05 14000060
         AGO   .NOFDA2             SEE .NOFDA1 COMMENTS ABOVE  GP APR18 14010099
IDRBFDAT DC    CL8'IEWBFDAT'                                   GP SEP05 14020060
CLS_IDRB DC    H'6',CL6'B_IDRB'                                GP SEP05 14030060
.NOFDA2  ANOP  ,                                               GP APR18 14040099
         SPACE 1                                               GP SEP05 14050060
ISITMGDS ISITMGD DCB=0,DATATYPE=YES,MF=L                       GP SEP05 14060060
ISITMGDL EQU   *-ISITMGDS                                      GP SEP05 14070060
DESRVGS  DESERV FUNC=GET,MF=L                                  GP JAN08 14080068
DESRVGL  EQU   *-DESRVGS                                       GP JAN08 14090068
         SPACE 1                                               GP SEP05 14100060
         AGO   .NOFDA3             SEE .NOFDA1 COMMENTS ABOVE  GP APR18 14110099
         IEWBUFF FUNC=MAPBUF,BYTES=2048,TYPE=IDRB,VERSION=3    GP SEP05 14120060
.NOFDA3  ANOP  ,                                               GP APR18 14130099
         SPACE 2                                               GP SEP05 14140060
         LTORG ,                                               GP SEP05 14150060
         DC    0D'0'                                           GP SEP05 14160060
         SPACE 2                                               GP SEP05 14170060
IDRAPIWK DSECT ,                                               GP SEP05 14180060
         DS    0D                                              GP SEP05 14190060
         DS    18F                 REGISTER SAVE AREA          GP SEP05 14200060
IDRBLDL  DS    XL80                BLDL RESULTS AREA           GP SEP05 14210060
MODTOKEN DS    D                   MODULE TOKEN                GP SEP05 14220060
FDAENTPT DS    A                   IEWBFDAT EPA                GP SEP05 14230060
BNDRETCD DS    F                   RETURN CODE                 GP SEP05 14240060
BNDRSNCD DS    F                   REASON CODE                 GP SEP05 14250060
MODDCBPT DS    A                   POINTER TO THE OPEN DCB     GP SEP05 14260060
MODDEPTR DS    A                   POINTER TO BLDL DATA        GP SEP05 14270060
BNDCURSR DS    A                   CURSOR                      GP SEP05 14280060
BNDCOUNT DS    A                   ENTRY COUNT                 GP SEP05 14290060
         SPACE 1                                               GP SEP05 14300060
BNDPARMS DS    0F                  IEWBFDAT PARAMETER LIST     GP SEP05 14310060
FDAEPTAD DS    A                   POINTER TO MODULE EPA       GP SEP05 14320060
FDATKNAD DS    A                   POINTER TO MODULE TOKEN     GP SEP05 14330060
FDARETAD DS    A                   POINTER TO RETURN CODE      GP SEP05 14340060
FDARSNAD DS    A                   POINTER TO REASON CODE      GP SEP05 14350060
FDAETKAD DS    A                   POINTER TO EPTOKEN          GP SEP05 14360060
FDADDNAD DS    A                   POINTER TO DD NAME          GP SEP05 14370060
FDAMEMAD DS    A                   POINTER TO MEMBER NAME      GP SEP05 14380060
FDADCBAD DS    A                   POINTER TO DCB POINTER      GP SEP05 14390060
FDADEADR DS    A                   POINTER TO BLDL DATA PTR    GP SEP05 14400060
FDACLSAD DS    A                   POINTER TO CLASS NAME       GP SEP05 14410060
FDASECAD DS    A                   POINTER TO SECTION NAME     GP SEP05 14420060
FDABFRAD DS    A                   POINTER TO DATA BUFFER      GP SEP05 14430060
FDACSRAD DS    A                   POINTER TO STARTING POSITIONGP SEP05 14440060
FDACNTAD DS    A                   POINTER TO DATA COUNT       GP SEP05 14450060
FDAHLDAD DS    A                   POINTER TO HOLD FLAG        GP SEP05 14460060
FDADELAD DS    A                   POINTER TO DELETE FLAG      GP SEP05 14470060
         SPACE 1                                               GP SEP05 14480060
FDAHOLD  DS    C                   HOLD BINDER RESOURCES FLAG  GP SEP05 14490060
FDADEL   DS    C                   DELETE BINDER API MODULE FLAGP SEP05 14500060
         SPACE 1                                               GP SEP05 14510060
BNDDATA  DS    0D,XL2048           RETURNED API DATA AREA      GP SEP05 14520060
IDRAPIWL EQU   *-IDRAPIWK                                      GP SEP05 14530060
         SPACE 1                                               GP SEP05 14540060
         IGWCISM DSECT=YES         ISITMGD PLIST               GP SEP05 14550060
ISPDSPY  CSECT ,                   BACK TO FETCHABLE CODE      GP SEP05 14560099
.NOBAPI6 ANOP  ,                                               GP SEP05 14570060
         TITLE 'MEMLIST LINE CMD FUNCTION'                     SS NOV85 14580060
*                                                              SS SEP84 14590060
*  MEMLIST LINE CMD PROCESSOR                                  SS SEP84 14600060
*                                                              SS SEP84 14610000
ISPLNC2  DS    0H                                              SS SEP84 14620000
         USING *,R4                                            SS NOV85 14630000
         TM    SPFTFLG1,SPFTLPOS  POST PROCESSING REQUIRED     SS NOV85 14640000
         BO    ISPPOST              YES                        SS NOV85 14650000
         NI    SPFLAG0,255-SPFCKER-SPFMSGER   RESET            SS SEP84 14660000
         OC    MEMLDATA,ISPBLK8     MAKE UPPER CASE            SS SEP84 14670000
ISPLNC00 DS    0H                       *                      SS JUL87 14680000
         BAS   R2,ISPTBNT           NOTE LINE ROW ID           SS MAY89 14690000
         MVC   SPFTNOTE,SPFFIXED    SAVE ROW ID                SS MAY89 14700000
         OC    MEM2OPT,ISPBLK8 FORCE UPPER CASE                SS NOV85 14710000
         MVC   SPFTEMPD(8),ISPBLK8  SEARCH STRING (8 BYTES)   ABL JAN87 14720000
         MVC   SPFTEMPD(4),MEM2OPT  FIRST FOUR BYTES          ABL JAN87 14730000
         LA    R1,SPFTEMPD          START OF SEARCH           ABL JAN87 14740000
         LA    R15,4          LIMIT OF SCAN OF LINE ENTRY      SS NOV85 14750000
         L     R14,SPFTBPLC  TABLE FOR SEARCH                  SS NOV85 14760000
         BAS   R2,ISPVER1           CHECK CMD VERB             SS NOV85 14770000
         MVC   SPFTTPT,SPFVTPT      COPY POINTER               SS NOV85 14780000
         TM    $TLF2(R14),#H        FROM LINE O CMD ONLY       SS NOV85 14790000
         BO    ISPLNB3                                         SS NOV85 14800000
         TM    $TLF2(R14),#D        NOT FOR REPEAT CMDS        SS DEC87 14810000
         BO    ISPLNC4              YES, SKIP                  SS DEC87 14820000
         TM    $TLF1(R14),#E        POSSIBLE CLIST             SS DEC87 14830000
         BO    ISPLNC4              YES, PROCESSED LATER       SS DEC87 14840000
         MVC   SPFBLKCM,$TLCM(R14)  SAVE COMMAND FOR REPEAT    SS DEC87 14850000
ISPLNC4  DS    0H                                              SS SEP84 14860000
         MVI   SPFTPOSI,0           DEFAULT POST PROCESSOR     SS SEP84 14870000
         OI    SPFTFLG1,SPFTLPOS    POST PROCESSING TO GO      SS NOV85 14880000
ISPLNC5  DS    0H                                              SS SEP84 14890000
         SR    R15,R15                                         SS SEP84 14900000
         IC    R15,$TLFU(R14)       GET PROCESSOR INDEX        SS JUL85 14910000
         B     *+4(R15)             INDEX TO PROCESSOR         SS SEP84 14920000
         B     ISPLNBAD          0  INVALID                    SS SEP84 14930000
         B     ISPMMLNL          4  BLANK ENTRY                SS SEP84 14940000
         B     ISPDELL           8  DEL MEML ENTRY             SS NOV84 14950000
         B     ISPLALI          12  ALIAS                      SS SEP84 14960000
         B     ISPGEN           16  GENERAL PROCESSOR          SS SEP84 14970000
         B     ISPLDEL          20  DELETE                     SS SEP84 14980000
         B     ISPLREN          24  RENAME                     SS SEP84 14990000
         B     ISPLNBAD         28  UNDO                       SS SEP84 15000000
         B     ISPLPND          32  SELECT PANEL SUPPORT       SS NOV84 15010000
         B     ISPSTAT1         36  STATUS COMMAND             SS SEP84 15020000
         B     ISPUTL1          40  UTILITY COMMANDS           SS SEP84 15030000
         B     ISPLKED          44  UPDATE LINK DATE           SS AUG86 15040000
         B     ISPLMENU         48  NOT USED                   SS DEC87 15050000
         B     ISPMLOG          52  LOG MEMLIST LINE           SS NOV86 15060000
         B     ISPLNCSL         56  SELECT COMMAND             SS JUL87 15070000
         B     ISPLNCXX         60  EXTENDED XCTL              SS JUL87 15080000
         B     ISPLCOM          64  COMPARE                   ABL SEP88 15090000
         B     ISPLREP          68  REPRO                     ABL SEP88 15100000
         B     ISPMMTAG         72  TAG LINE                   SS NOV88 15110000
         B     ISPLNBAD         76  PAD                        SS NOV88 15120000
         SPACE 3                                               SS SEP84 15130000
ISPLERR  DS    0H                                              SS SEP84 15140000
         NI    SPFLAG0,255-SPFCKER-SPFMSGER   RESET            SS SEP84 15150000
         MVC   MEMLDATA,ISPERMSG                               SS SEP84 15160000
         MVC   SPFMSGID,ISPPDSM   INIT MESSAGE                ABL JUN85 15170000
         MVI   SPFMSGID+7,C'A'                                ABL JUN85 15180000
         MVI   SPFMSGID+6,C'1'    GENERAL ERROR MESSAGE       ABL JUN85 15190000
         B     ISPLNB2          CONTINUE                       SS SEP84 15200000
ISPLNBAD DS    0H                                              SS SEP84 15210000
ISPLNB3  DS    0H                                              SS SEP84 15220000
         MVC   MEMLDATA,ISPINVLD    INVALID MESSAGE            SS SEP84 15230000
ISPLNB2  DS    0H                                              SS NOV85 15240000
         OI    SPFLAG2,SPFNPOS      POSITIONING NOT ALLOWED   ABL APR86 15250000
         BAS   R2,ISPTBMOD          UPDATE TABLE LINE          SS SEP84 15260000
         BAS   R2,ISPQUERY                                     SS MAR85 15270000
         MVC   SPFTCCRP,SPFTCRP     SAVE CUR CPR FOR CURSOR    SS AUG86 15280000
         NI    SPFTFLG1,255-SPFTLPOS  RESET POST PROC FLAG     SS AUG86 15290000
         OI    SPFTFLG2,SPFLKILL   SET FOR ERROR               SS AUG86 15300000
         MVC   SPFBLKCM(4),ISPBLK8  BLANK INVALID CMD          SS DEC87 15310000
         CLC   SPFTCCRP,SPFTTOP2    CURSOR WITHIN RANGE        SS MAR89 15320000
         BNL   ISPLN100             YES                        SS MAR89 15330000
         MVC   SPFTTOP2,SPFTTOP     TRY IT WITH SCROLL         SS MAR89 15340000
         CLC   SPFTCCRP,SPFTTOP2    CURSOR WITHIN RANGE        SS MAR89 15350000
         BNL   ISPLN100             YES                        SS MAR89 15360000
         MVC   SPFTTOP2,SPFTCCRP    SET SCROLL TO CURSOR       SS MAR89 15370000
ISPLN100 LA    R15,100             TBDISPL SUPPORT             SS MAR89 15380000
         BR    R3                  RETURN TO ROUTER            SS NOV85 15390000
         SPACE 2                                               SS NOV85 15400000
ISPCMDL  DS    0H                                              SS NOV85 15410000
         OI    SPFLAG2,SPFLNCD    SET FOR RENAME/ALIAS         SS NOV85 15420000
         LA    R15,112            ISPCMDC                      SS NOV85 15430000
         MVC   SPFSAVM2,MEMLNAME  SAVE THE ACTUAL MEMBER NAME ABL JAN87 15440000
         BR    R3                 RETURN TO ROUTER             SS NOV85 15450000
         SPACE 2                                               SS SEP84 15460000
ISPLNCXX DS    0H                                              SS NOV85 15470000
         SR    R0,R0                    ZERO FOR IC            SS JUL87 15480000
         IC    R0,$TLEX(R14)            EX CODE                SS JUL87 15490000
         LA    R15,156                  EXTENSION FUNCTION     SS JUL87 15500000
         BR    R3                       RETURN TO ROUTER       SS JUL87 15510000
         SPACE 2                                               SS NOV85 15520000
ISPPOST  DS    0H                                              SS SEP84 15530000
         L     R15,SPFTNOTE        GET SAVED ROW ID            SS MAY89 15540000
         BAS   R2,ISPTBRD          PREPOSITION TO ROW          SS MAY89 15550000
         L     R14,SPFTTPT         GET MY TABLE ENTRY          SS NOV85 15560000
         NI    SPFLAG2,255-SPFLNCD    FOR RENAME/ALIAS         SS NOV85 15570000
         SR    R15,R15                                         SS SEP84 15580000
         IC    R15,SPFTPOSI         GET POST PROCESSOR INDEX   SS SEP84 15590000
         B     *+4(R15)             INDEX TO PROCESSOR         SS SEP84 15600000
         B     ISPLNX            0  CLEAN UP                   SS SEP84 15610000
         B     ISPLNV            4  RETURN AFTER STATS REFRESH SS SEP84 15620000
         B     ISPDELP           8  DEL MEML ENTRY             SS SEP84 15630000
         B     ISPLALIP         12  ALIAS                      SS SEP84 15640000
         B     ISPGENP          16  GENERAL PROCESSOR          SS SEP84 15650000
         B     ISPLDELP         20  DELETE                     SS NOV84 15660000
         B     ISPLRENP         24  RENAME                     SS SEP84 15670000
         B     ISPLNX           28  RESET                      SS SEP84 15680000
         B     ISPLPNDP         32  SELECT PANEL SUPPORT       SS NOV84 15690000
         B     ISPSTAP2         36  STATUS PART 2              SS SEP84 15700000
         B     ISPSTAP3         40  STATUS PART 3              SS SEP84 15710000
         B     ISPSTAP4         44  STATUS PART 4              SS SEP84 15720000
         B     ISPEDITP         48  EDIT POST PROCESSING       SS JUL87 15730000
         B     ISPLSTU8         52  RETURN STATUS ALL TODAY    SS JUL87 15740000
         B     ISPLNB2          56  RETURN WITH ERROR          SS NOV88 15750000
         SPACE 3                                               SS SEP84 15760000
ISPLNV   DS    0H                                              SS SEP84 15770000
         L     R14,SPFTTPT         GET MY TABLE ENTRY          SS NOV85 15780000
         TM    $TLF1(R14),#V       VIEW MODE TO FOLLOW         SS SEP84 15790000
         BZ    ISPLNX              NO                          SS NOV85 15800000
         MVI   SPFTPOSI,28         COME BACK TO ISPLNX         SS NOV85 15810000
* HIERARCHICAL SUPPORT REMOVED                                 SS OCT88 15820000
         BAS   R2,ISPSETST              SET AND RETRIEVE STAT  SS OCT88 15830045
         LA    R15,100                  DISPLAY PANEL          SS OCT88 15840000
         LTR   R1,R1                    THIS LOG ALREADY       SS OCT88 15850000
         BZR   R3                       YES EXIT               SS OCT88 15860000
         LH    R1,SPFFUNLP+0            GET LOG LAST PANEL     SS OCT88 15870000
         LNR   R1,R1                    SET FOR SWAP           SS OCT88 15880000
         BAS   R2,ISPSTKI               SWAP TO LOG PANEL      SS OCT88 15890000
         LA    R15,100                  DISPLAY PANEL          SS OCT88 15900000
         BR    R3                       RETURN TO ROUTER       SS OCT88 15910000
ISPMMLNL DS    0H                                              SS MAR85 15920000
         MVC   MEM2OPT,ISPBLK8  CLEAR X41                      SS JUL87 15930000
         CLI   MEMLDATA,C'*'    IS IT A MSG                    SS MAR85 15940000
         BNE   ISPMMLNK         NO,  CLEAR                     SS MAR85 15950000
         CLC   MEMLDATA,ISPINVLD  INVALID MSG                  SS MAR85 15960000
         BNE   ISPMMLN2         NO, DON'T CLEAR               ABL JUN85 15970074
ISPMMLNK DS    0H                                              SS MAR85 15980000
         MVC   MEMLDATA,ISPBLK8    BLANK OUT DATA              SS MAR85 15990000
ISPMMLN2 DS    0H                                             ABL JUN85 16000000
         BAS   R2,ISPTBMOD      UPDATE TABLE                   SS MAR85 16010000
         B     ISPLNX2                                         SS MAR85 16020000
ISPLNX   DS    0H                                              SS NOV85 16030000
         BAS   R2,ISPQUERY      GET CUR CRP FOR CURSOR         SS MAR85 16040000
         MVC   SPFTCCRP,SPFTCRP SAVE CUR CRP                   SS AUG86 16050000
ISPLNX2  DS    0H                                              SS MAR85 16060000
         NI    SPFTFLG1,255-SPFTLPOS                           SS JUL87 16070000
         TM    SPFTFLG2,SPFRETOP        DO WE NEED TBTOP       SS MAR89 16080000
         BZ    *+12                     NO                     SS MAR89 16090000
         BAS   R2,ISPTOP                START AT TOP           SS MAR89 16100000
         NI    SPFTFLG2,255-SPFRETOP    NOW RESET FLAG         SS MAR89 16110000
         BAS   R2,ISPNXLN       NEXT LINE COMMAND              SS JUL87 16120000
         LTR   R15,R15                  *                      SS JUL87 16130000
         BZ    ISPLNC2          PROCESS IT                     SS JUL87 16140000
*  AT THIS POINT ANY DEFERED LINE COMMAND CAN NOW BE PROCESSED SS JUL87 16150000
ISPLNX3  DS    0H                                              SS AUG89 16160000
         BAS   R2,ISPBOTM       RESET TO BOTTOM                SS JUL87 16170000
         LA    R15,100          TABLE PANEL DISPLAY SUPPORT    SS NOV85 16180000
         BR    R3                  RETURN TO ROUTER            SS NOV85 16190000
         SPACE 2                                               SS SEP84 16200000
ISPMMTAG DS    0H                       *                      SS NOV88 16210000
         BAS   R2,ISPLMSGS         SET DATA FIELD              SS NOV88 16220000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPT                   SS NOV88 16230000
         BAS   R2,ISPTBMOD      UPDATE TABLE                   SS AUG89 16240000
         BAS   R2,ISPSKIP1      POSITION TO NEXT LINE          SS AUG89 16250000
         LTR   R15,R15          ANY MORE LINES                 SS AUG89 16260000
         BNE   ISPLNX3          NO, DONE                       SS AUG89 16270000
         CLC   MEM2OPT,ISPBLK8  ANY OPT                        SS AUG89 16280000
         BE    ISPLNX           NO, SET THIS POSITION          SS AUG89 16290000
         B     ISPLNC2          YES, PROCESS IT                SS AUG89 16300000
ISPLDELP DS    0H                                              SS SEP84 16310000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS SEP84 16320000
         BO    ISPLERR                                         SS SEP84 16330000
         MVI   MEM2STAT+1,C'D'     MARK NO LONGER ACTIVE       SS AUG86 16340000
         CLI   SPFTDEL,C'N'        REMOVE DELETED ENTRIES      SS JUL87 16350000
         BE    ISPGENP             NO, SAME POST PROCESSING    SS JUL87 16360000
         BAS   R2,ISPDEL1          REMOVE FROM TABLE           SS NOV84 16370000
         B     ISPLNX              CONTINUE WITH NEXT ENTRY    SS NOV84 16380000
ISPLRENP DS    0H                                              SS SEP84 16390000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS SEP84 16400000
         BO    ISPLERR             SAME POST PROCESSING        SS SEP84 16410000
         BAS   R2,ISPLMSGS         PROCESS MESSAGE             SS NOV85 16420000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPTION                SS SEP84 16430000
         MVI   MEM2STAT+1,C'R'     NO LONGER ACTIVE            SS AUG86 16440000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS SEP84 16450000
         BAS   R2,MEMLSAVE         SAVE MEML VARS              SS AUG86 16460000
         CLI   SPFSAVM2,C' '       RENAME PASS A NAME          SS AUG85 16470000
         BNH   ISPLREN3            NO                          SS NOV85 16480000
         MVC   MEMLNMSV,SPFSAVM2   YES USE                     SS NOV85 16490000
ISPLREN3 DS    0H                                              SS NOV85 16500000
         XC    MEMLNAME,MEMLNMSV   EXCHANGE NAMES              SS JUL87 16510000
         XC    MEMLNMSV,MEMLNAME        *                      SS JUL87 16520000
         XC    MEMLNAME,MEMLNMSV   ADD ENTRY FOR NEWNAME       SS JUL87 16530000
         BAS   R2,ISPGET          GET IF ANY                   SS AUG86 16540000
         BAS   R2,MEMLSET         SET VARS                     SS AUG86 16550000
         MVI   MEM2STAT+1,C' '     MAKE SURE IT IS ACTIVE      SS AUG86 16560000
         MVC   MEMLDATA,ISPNEWNM   PUT MSG IN MEMLIST TABLE    SS SEP84 16570000
         LTR   R15,R15             OVERLAY ONE                 SS SEP84 16580000
         BZ    ISPLREN5            YES                         SS SEP84 16590000
         BAS   R2,ISPTBADD         UPDATE TABLE                SS AUG86 16600000
         B     ISPLREN6                                        SS JUL87 16610000
ISPLREN5 DS    0H                                              SS SEP84 16620000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS AUG86 16630000
ISPLREN6 DS    0H                                              SS JUL87 16640000
         MVC   MEMLNAME,MEMLNMSV   GET BACK TO ORIGINAL NAME   SS JUL87 16650000
         BAS   R2,ISPGET           POSITION                    SS JUL87 16660054
         CLI   SPFTOLD,C'N'        REMOVE OLD ENTRIES          SS JUL87 16670000
         BE    ISPLNV              NO                          SS JUL87 16680000
         BAS   R2,ISPDEL1          REMOVE FROM TABLE           SS JUL87 16690000
         B     ISPLNV                                          SS JUL87 16700000
ISPLALIP DS    0H                                              SS SEP84 16710000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS SEP84 16720000
         BO    ISPLERR             SAME POST PROCESSING        SS SEP84 16730000
         BAS   R2,ISPLMSGS         PROCESS MESSAGE             SS NOV85 16740000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPTION                SS SEP84 16750000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS SEP84 16760000
         BAS   R2,MEMLSAVE         SAVE MEML VAR               SS AUG86 16770000
         CLI   SPFSAVM2,C' '       RENAME PASS A NAME          SS AUG85 16780000
         BNH   ISPLALI3            NO                          SS NOV85 16790000
         MVC   MEMLNMSV,SPFSAVM2   YES USE                     SS NOV85 16800000
         CLC   MEMLNAME,MEMLNMSV   SAME NAME?                 ABL JAN87 16810000
         BE    ISPLSTAT            YES, QUIT                  ABL JAN87 16820000
ISPLALI3 DS    0H                                              SS NOV85 16830000
         XC    MEMLNAME,MEMLNMSV   EXCHANGE NAMES              SS JUL87 16840000
         XC    MEMLNMSV,MEMLNAME        *                      SS JUL87 16850000
         XC    MEMLNAME,MEMLNMSV   ADD ENTRY FOR NEWNAME       SS JUL87 16860000
         BAS   R2,ISPGET           ANY THE SAVE                SS AUG86 16870000
         BAS   R2,MEMLSET         SET VARS                     SS AUG86 16880000
         MVI   MEM2STAT+1,C' '     MAKE SURE IT IS ACTIVE      SS AUG86 16890000
         MVC   MEMLDATA,ISPNEWNM   PUT MSG IN MEMLIST TABLE    SS SEP84 16900000
         LTR   R15,R15             OVERLAY ONE                 SS SEP84 16910000
         BE    ISPLALI5                                        SS SEP84 16920000
         BAS   R2,ISPTBADD         UPDATE TABLE                SS AUG86 16930000
         B     ISPLSTAT            RESET STATS                 SS SEP84 16940000
ISPLALI5 DS    0H                                              SS SEP84 16950000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS SEP84 16960000
         B     ISPLSTAT            RESET STATS                 SS SEP84 16970000
         SPACE 2                                               SS SEP84 16980000
ISPLREN  DS    0H  RENAME  REQUIRES A NAME IN THE DATA FIELD   SS JUL87 16990000
ISPLALI  DS    0H  ALIAS   REQUIRES A NAME IN THE DATA FIELD   SS JUL87 17000000
ISPLCOM  DS    0H  COMPARE REQUIRES A NAME IN THE DATA FIELD  ABL SEP88 17010000
ISPLREP  DS    0H  REPRO   REQUIRES A NAME IN THE DATA FIELD  ABL SEP88 17020000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS JUL87 17030000
         BH    ISPLNBAD            CANNOT PROCESS              SS JUL87 17040000
         CLI   MEMLDATA,C' '       ANY NEW NAME                SS JUL87 17050000
         BE    ISPLNONW            NO, NO NEW NAME             SS JUL87 17060000
         CLI   MEMLDATA,C'*'       STATUS MESSAGE?             SS JUL87 17070000
         BE    ISPLNONW            NO, NO NEW NAME             SS JUL87 17080000
         B     ISPGEN              PROCESS LIKE THE REST       SS JUL87 17090056
ISPLNONW DS    0H                       *                      SS JUL87 17100000
         MVC   SPFMLIN1,ISPBLK8         *                      SS JUL87 17110000
         MVI   SPFMLIN2,C' '            BLANK                  SS JUL87 17120000
         MVC   SPFMLIN2+1(78),SPFMLIN2  AND REPEL              SS JUL87 17130000
         MVC   SPFMLIN2(L'ISPLNWMG),ISPLNWMG    LEV 2 MSG      SS JUL87 17140000
         B     ISPLERR                  SET UP ERROR MSG       SS JUL87 17150000
ISPLNWMG DC    C'A NAME MUST BE SPECIFIED IN THE DATA FIELD'  ABL SEP88 17160000
ISPLDEL  DS    0H                                              SS SEP84 17170000
* FUTURE .. SAVE DIR DATA IN MEMORY FOR UNDO COMMAND           SS JUL87 17180000
ISPGEN   DS    0H                                              SS SEP84 17190000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS AUG86 17200000
         BH    ISPLNBAD            CANNOT PROCESS              SS NOV84 17210000
         OI    SPFLAG0,SPFCKER     ALSO CHECK FOR ERRORS       SS NOV84 17220000
         TM    $TLF2(R14),#R       REAL CMD OFFSET*2           SS JUL87 17230000
         BZ    ISPGEN4                                         SS JUL87 17240000
         SR    R15,R15                                         SS JUL87 17250000
         IC    R15,$TLEX(R14)                                  SS JUL87 17260000
         LA    R15,ISPREAL(R15)                                SS JUL87 17270000
         MVC   MEM2OPT,0(R15)      SET OPT TO REAL CMD         SS JUL87 17280000
         B     ISPLNC00            REPROCESS                   SS JUL87 17290000
ISPGEN4  DS    0H                                              SS JUL87 17300000
         MVC   SPFTPOSI(1),$TLFU(R14)  POST PROCESSING INDEX   SS JUL85 17310000
         TM    $TLF2(R14),#P       DIFFERENT POST PROC         SS NOV84 17320000
         BZ    ISPGEN2              NO SKIP                    SS NOV84 17330000
         MVC   SPFTPOSI(1),$TLEX(R14) USE IT                   SS NOV84 17340000
ISPGEN2  DS    0H                                              SS SEP84 17350000
         MVC   PUTGETBF(4),ISPCMD34                           ABL JAN87 17360000
         MVC   SPFINPUT(8),$TLCM(R14)  COPY COMMAND NAME       SS JUL87 17370000
         MVI   SPFINPUT+8,C' '                                 SS SEP84 17380000
         MVC   SPFINPUT+9(8),MEMLNAME                          SS SEP84 17390000
         MVI   SPFINPUT+17,C' '                               ABL OCT84 17400000
         MVC   SPFINPUT+18(12),SPFINPUT+17                    ABL JAN87 17410000
         CLI   MEMLDATA,X'00'      NULLS                       SS NOV84 17420000
         BE    ISPGEN5             YES, CONVERT TO BLANKS      SS NOV84 17430000
         CLI   MEMLDATA,C'*'       STATUS MESSAGE?            ABL OCT84 17440000
         BNE   ISPGEN3             NO, BRANCH                 ABL JAN87 17450000
         CLI   MEMLDATA+1,X'40'    "* " FORM?                 ABL JAN87 17460000
         BE    ISPGEN3             YES, BRANCH                ABL JAN87 17470000
ISPGEN5  DS    0H                                              SS NOV84 17480000
         MVC   MEMLDATA(8),ISPBLK8 BLANK IT OUT               ABL OCT84 17490000
ISPGEN3  DS    0H                                             ABL JAN87 17500000
         MVC   SPFINPUT+18(8),MEMLDATA                        ABL OCT84 17510000
         MVC   MEMLNMSV,MEMLDATA                               SS NOV84 17520000
         TM    $TLF1(R14),#O       ADD T( ?                   ABL JAN87 17530000
         BNO   ISPGEN7             NO, BRANCH                 ABL JAN87 17540000
         CLI   MEMLDATA,X'40'      ANY MEMBER NAME?           ABL JAN87 17550000
         BE    ISPGEN7             NO, BRANCH                 ABL JAN87 17560000
*                                  TO(...) FOR BETTER PROMPT  DRK SEP10 17570099
         MVI   SPFINPUT+18,C'T'    ADD T                      DRK SEP10 17580099
         MVI   SPFINPUT+19,C'O'    ADD O                      DRK SEP10 17590099
         MVI   SPFINPUT+20,C'('    ADD (                      DRK SEP10 17600099
         MVC   SPFINPUT+21(8),MEMLDATA  ADD MEMBER NAME       DRK SEP10 17610099
         MVI   SPFINPUT+29,C')'    ADD )                      DRK SEP10 17620099
*        MVI   SPFINPUT+18,C'T'    ADD T                      ABL JAN87 17630099
*        MVI   SPFINPUT+19,C'('    ADD (                      ABL JAN87 17640099
*        MVC   SPFINPUT+20(8),MEMLDATA  ADD MEMBER NAME       ABL JAN87 17650099
*        MVI   SPFINPUT+28,C')'    ADD )                      ABL JAN87 17660099
ISPGEN7  DS    0H                                             ABL JAN87 17670000
         TM    $TLF1(R14),#V       VIEW MODE OUTPUT?           SS DEC84 17680000
         BZ    ISPGEN6             NO, BRANCH                  SS DEC84 17690000
         OI    SPFLAG3,SPFLOGM     YES, MARK FOR LOGGING       SS DEC84 17700000
ISPGEN6  DS    0H                                              SS NOV84 17710000
         TM    $TLF2(R14),#M       UPDATE STATS                SS NOV88 17720000
         BZ    ISPCMDL             NO, SKIP UPDATE FOR EDIT    SS NOV88 17730000
         CLI   SPFALUP,C'Y'        ALIAS UPDATE FOR EDIT       SS JUL87 17740000
         BNE   ISPGEN8             YES                         SS NOV88 17750099
         XC    SPFEDTTR,SPFEDTTR   ZERO TTR                    SS NOV88 17760000
         MVC   DIRNAME(8),MEMLNAME MEMBER NAME                ABL FEB86 17770000
         BAS   R2,ISPBLDL          DO BLDL                     SS AUG86 17780000
         LTR   R15,R15             GOOD BLDL                   SS NOV88 17790000
         BNZ   ISPGEN8             NO                          SS NOV88 17800000
         MVC   SPFEDTTR,DIRTTR     SAVE TTR                    SS NOV88 17810000
         B     ISPGEN9                  *                      SS NOV88 17820000
ISPGEN8  DS    0H                                              SS NOV88 17830000
         CLI   SPFEDUP,C'Y'        FULL UPDATE FOR EDIT        SS JUL87 17840000
         BNE   ISPCMDL             NO                          SS JUL87 17850000
ISPGEN9  DS    0H                                              SS NOV88 17860000
         TIME  DEC                 YES, MARK TIME              SS JUL87 17870000
         ST    R1,SPFDAY                STORE TODAYS DATE      SS JUL87 17880000
         ST    R0,SPFTIME               STORE TIME OF DAY      SS JUL87 17890000
         B     ISPCMDL                                        ABL OCT84 17900000
ISPGENP  DS    0H                                              SS SEP84 17910000
* #V: ATTRIB, COMPARE, DIR, FIND, HISTORY, LIST, MAP & VERIFY ABL DEC84 17920000
         TM    $TLF1(R14),#V       VIEW MODE EXPECTED?        ABL DEC84 17930000
         BO    ISPGENP2            YES, IGNORE ERROR MSG FLG  ABL DEC84 17940000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS?                 SS SEP84 17950000
         BO    ISPLERR             YES, TERMINATE LIST CMDS.   SS SEP84 17960000
ISPGENP2 DS    0H                                             ABL SEP84 17970000
         BAS   R2,ISPLMSGS         PROCESS MESSAGE             SS NOV85 17980000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPTION                SS SEP84 17990000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS SEP84 18000000
         TM    ##ADRPA#,$F         SOFT ATTN SIGNALLED?       ABL APR85 18010000
         BNO   ISPLSTU0            NO, BRANCH                 ABL APR85 18020000
         NI    ##ADRPA#,255-$F     YES, TURN OFF FLAG         ABL APR85 18030000
         MVC   MEMLDATA,ISPATTN    SPECIAL *ATTN* FLAG        ABL APR85 18040000
         B     ISPLNB2             TERMINATE LINE COMMANDS    ABL APR85 18050000
ISPLSTU0 DS    0H                                             ABL APR85 18060000
         L     R14,SPFTTPT         RESTORE R14 WITH TABLE ENT  SS NOV85 18070000
         TM    $TLF2(R14),#M       UPDATE STATS                SS NOV84 18080000
         BZ    ISPLNV              NO CONTINUE                 SS NOV84 18090000
         MVC   MEMLNMSV,MEMLNAME   MAKE SAME                   SS JUL87 18100000
ISPLSTAT DS    0H                                              SS NOV84 18110000
         OI    SPFTFLG2,SPFRETOP        DO CMD SCAN FROM TOP   SS MAR89 18120000
         OI    SPFLAG2,SPFUPDA                                 SS NOV84 18130000
         MVC   DIRNAME(8),MEMLNAME MEMBER NAME                ABL FEB86 18140000
         BAS   R2,ISPBLDL          DO BLDL                     SS AUG86 18150000
         LTR   R15,R15             GOOD BLDL                   SS NOV88 18160000
         BNZ   ISPLSTU2            NO, SKIP                    SS NOV88 18170000
         BAS   R2,MEMLISTI         UPDATE STATS                SS AUG86 18180000
         BAS   R2,MEMLSET          SET VARS                    SS AUG86 18190000
         BAS   R2,ISPTBMOD         MOD OR ADD                  SS AUG86 18200000
ISPLSTU2 DS    0H                                              SS NOV88 18210000
         CLC   MEMLNAME,MEMLNMSV   SAME NAME                   SS JUL87 18220000
         BE    ISPLNV              YES, CONTINUE               SS JUL87 18230000
         MVC   MEMLNAME,MEMLNMSV   GET BACK TO ORIGINAL NAME   SS JUL87 18240000
         BAS   R2,ISPGET           POSITION                    SS JUL87 18250054
         B     ISPLNV                   *                      SS AUG86 18260000
ISPEDITP DS    0H                       *                      SS JUL87 18270000
         MVC   MEMLNMSV,MEMLNAME   SAVE NAME                   SS MAR89 18280000
         CLI   SPFALUP,C'Y'        ALIAS UPDATE                SS NOV88 18290051
         BNE   ISPEDITX            NO, NORMAL POST PROCESSING  SS NOV88 18300000
         CLI   SPFEDTTR+2,0        ANY R                       SS NOV88 18310000
         BE    ISPEDITX            NO, SKIP                    SS NOV88 18320000
         MVC   DIRNAME(8),MEMLNAME MEMBER NAME                 SS NOV88 18330000
         BAS   R2,ISPBLDL          DO BLDL                     SS AUG86 18340000
         LTR   R15,R15             GOOD BLDL                   SS NOV88 18350000
         BNZ   ISPEDITX            NO, SKIP                    SS NOV88 18360000
         MVC   SPFE2TTR,DIRTTR     NEW, TTR                    SS NOV88 18370000
         CLC   SPFE2TTR,SPFEDTTR   SAME *                      SS NOV88 18380000
         BE    ISPEDITX            YES, SKIP                   SS NOV88 18390000
         MVC   PUTGETBF(16),ISPMALL MEMLIST ALL                SS NOV88 18400000
         MVI   SPFTPOSI,52              *                      SS NOV88 18410000
         OI    MEMFLAG2,MEMLTMCK+MEMLTMED SET TIME CHECK       SS NOV88 18420000
         OI    MEMFLAG2,MEMLALED    REPLACE CHANGED ALIAS      SS NOV88 18430000
         B     ISPEXIT                                         SS NOV88 18440000
ISPEDITX DS    0H                       *                      SS NOV88 18450000
         CLI   SPFEDUP,C'Y'        FULL UPDATE                 SS JUL87 18460000
         BNE   ISPGENP             NO, NORMAL POST PROCESSING  SS JUL87 18470000
         MVI   SPFTPOSI,52              *                      SS JUL87 18480000
         OI    MEMFLAG2,MEMLTMCK+MEMLTMED SET TIME CHECK       SS JUL87 18490000
         MVC   PUTGETBF(16),ISPMALL  MEMLIST ALL INTO BUFFER   SS JUL87 18500000
         MVC   PUTGETBF+23(8),ISPBLK8   *                      SS JUL87 18510000
         MVC   PUTGETBF+15(8),ISPLSTU7                         SS JUL87 18520000
         MVC   PUTGETBF(2),ISPCMD30     *                      SS JUL87 18530000
         B     ISPEXIT                                         SS JUL87 18540000
ISPLSTU7 DC    CL8'TODAY'               *                      SS JUL87 18550000
ISPLSTU8 DS    0H                       *                      SS JUL87 18560000
         BAS   R2,ISPTOP                RESET TO TOP           SS JUL87 18570000
ISPLSTU9 BAS   R2,ISPNXLN               *                      SS MAR89 18580000
         LTR   R15,R15                  DID WE FIND ONE        SS MAR89 18590000
         BNZ   ISPLNX2                  NOTHING TO DO          SS MAR89 18600000
         CLC   MEMLNMSV,MEMLNAME   SAME NAME                   SS MAR89 18610000
         BNE   ISPLSTU9            NO, TRY NEXT                SS MAR89 18620000
         OI    SPFTFLG2,SPFRETOP   DO CMD SCAN FROM TOP        SS MAR89 18630000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPTION                SS JUL87 18640000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS JUL87 18650000
         B     ISPLNV                   *                      SS JUL87 18660000
         SPACE 1                                              ABL FEB86 18670000
ISPDELP  DS    0H                 DELETE THIS LINE             SS NOV84 18680000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS NOV84 18690000
         BO    ISPLERR                                         SS NOV84 18700000
ISPDELL  DS    0H                 DELETE THIS LINE             SS NOV84 18710000
         CLI   MEMLDATA,C'*'            MSG                    SS JUL87 18720000
         BE    ISPDELL1                 YES, NORMAL DELETE 1   SS JUL87 18730000
         CLC   MEMLDATA,ISPBLK8         BLANK                  SS JUL87 18740000
         BE    ISPDELL1                 YES, NORMAL DELETE 1   SS JUL87 18750000
         LA    R0,4                     EXCLUDE AMOUNT CODE    SS JUL87 18760000
         LA    R15,156                  EXTENSION FUNCTION     SS JUL87 18770000
         BR    R3                       RETURN TO ROUTER       SS JUL87 18780000
ISPDELL1 BAS   R2,ISPDEL1                                      SS NOV84 18790000
         BAS   R2,ISPQUERY                                     SS MAR89 18800000
         MVC   SPFTCCRP,SPFTCRP     SAVE CUR CPR FOR CURSOR    SS MAR89 18810000
         CLC   SPFTCCRP,SPFTTOP     CURSOR WITHIN RANGE        SS MAR89 18820000
         BNL   ISPLNX2              YES                        SS MAR89 18830000
         MVC   SPFTTOP,SPFTTOP2     USE NON SCROLL VALUE       SS MAR89 18840000
         CLC   SPFTCCRP,SPFTTOP     CURSOR WITHIN RANGE        SS MAR89 18850000
         BNL   ISPLNX2              YES                        SS MAR89 18860000
         MVC   SPFTTOP,SPFTCCRP     SET SCROLL TO CURSOR       SS MAR89 18870000
         B     ISPLNX2                                         SS MAR89 18880000
*                                       *                      SS JUL87 18890000
*   SELECT COMMAND                      *                      SS JUL87 18900000
*                                       *                      SS JUL87 18910000
ISPLNCSL DS    0H                       *                      SS JUL87 18920000
         SR    R15,R15                  ZERO FOR IC            SS JUL87 18930000
         IC    R15,$TLEX(R14)           EX CODE                SS JUL87 18940000
         LA    R15,SPFSELFU(R15)        ADDR, IX SELECT TBL    SS JUL87 18950000
         MVC   MEM2OPT,0(R15)           COPY LINE COMMAND      SS JUL87 18960000
         B     ISPLNC00                 PROCESS FROM TOP       SS JUL87 18970000
*                                       *                      SS JUL87 18980000
* LKED LINE CMD                         *                      SS AUG86 18990000
*                                       *                      SS JUL87 19000000
ISPLKED  DS    0H                       *                      SS AUG86 19010000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS AUG86 19020000
         BH    ISPLNBAD            CANNOT PROCESS              SS NOV84 19030000
         OI    MEMFLAG0,MEMLRIDR   SET FOR READ IDR ONLY       SS AUG86 19040000
         MVC   MEMLXTTR,MEM2XTTR   SET TTR OF LOAD MOD         SS AUG86 19050000
         BAS   R2,MEMLISTI         UPDATE DATE                 SS AUG86 19060000
         MVC   MEM2LDAT,MEMLLDAT   COPY DATE                   SS AUG86 19070000
         MVC   MEM2LCEN,MEMLLCEN   COPY DATE CENTURY          Y2K AUG97 19080006
         MVC   MEM2LDAX,MEMLLDAX   COPY DATE EXTENDED         DRK MAR00 19090029
         MVC   MEM2OPT,ISPBLK8     CLEAR OPT                   SS AUG86 19100000
         BAS   R2,ISPLMSGS         UPDATE DATA LINE            SS AUG86 19110000
         BAS   R2,ISPTBMOD         MOD OR ADD                  SS AUG86 19120000
         B     ISPLNV                   *                      SS AUG86 19130000
*                                                              SS NOV84 19140000
*  LINE CMD MENU PANEL FOR MORE COMMANDS                       SS NOV84 19150000
*                                                              SS NOV84 19160000
ISPLMENU DS    0H                                              SS DEC87 19170000
*                                                              SS NOV84 19180000
*  LINE CMD SELECT PANEL DISPLAY SUPPORT (O LINE COMMAND)      SS NOV84 19190000
*                                                              SS NOV84 19200000
ISPLPND  DS    0H                                              SS NOV84 19210000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS AUG86 19220000
         BH    ISPLNBAD            CANNOT PROCESS              SS NOV84 19230000
         OI    SPFLAG0,SPFCKER     ALSO CHECK FOR ERRORS       SS NOV84 19240000
         CLI   MEMLDATA,X'00'      NULLS                       SS NOV84 19250000
         BE    ISPLPND3            YES, CONVERT TO BLANKS      SS NOV84 19260000
         CLI   MEMLDATA,C'*'       STATUS MESSAGE?             SS NOV84 19270000
         BNE   *+10                NO, BRANCH                  SS NOV84 19280000
ISPLPND3 DS    0H                                              SS NOV84 19290000
         MVC   MEMLDATA(8),ISPBLK8 YES, BLANK IT OUT           SS NOV84 19300000
         MVC   MEMLNMSV,MEMLDATA   SAVE FOR PANEL              SS NOV84 19310000
         MVC   SPFMEMB,MEMLNAME    SAVE FOR PANEL              SS NOV84 19320000
         MVI   SPFVZCMD,C' '             BLANK FIRST           SS NOV84 19330000
         MVC   SPFVZCMD+1(249),SPFVZCMD                        SS NOV84 19340000
         TM    $TLF1(R14),#E       IS THIS FOR CMD SEARCH      SS AUG86 19350000
         BZ    ISPLPND6            NO, CONTINUE                SS AUG86 19360000
         MVC   SPFBLKCM(4),MEM2OPT SAVE COMMAND                SS DEC87 19370000
         MVC   SPFVZCMD(4),MEM2OPT GET CMD NAME                SS AUG86 19380000
         OI    SPFLAG4,SPFNOIV     DO NOT DISPLAY INVALID      SS AUG86 19390000
         B     ISPLPND2            FORCE NONDISPL              SS AUG86 19400000
ISPLPND6 DS    0H                       *                      SS AUG86 19410000
         TM    $TLF2(R14),#Z       NONDISPL                    SS NOV84 19420000
         BO    ISPLPND2            YES                         SS NOV84 19430000
         MVC   SPFVZCMD(4),MEM2OPT ANY .MORE                   SS NOV84 19440000
         BAS   R2,ISPSHCMD         SET IT UP                   SS NOV84 19450000
         CLI   SPFVZCMD,C' '       ANY .MORE                   SS NOV84 19460000
         BE    ISPLPND4            NO                          SS NOV84 19470000
ISPLPND2 DS    0H                                              SS NOV84 19480000
         OI    SPFLAG4,SPFNOND     INVOKE PANEL NON-DISPLAY    SS NOV84 19490000
ISPLPND4 DS    0H                                              SS NOV84 19500000
         BAS   R2,ISPSETVI                                     SS NOV85 19510000
         L     R1,SPFPANT                                      SS NOV84 19520000
         ST    R1,SPFPANC          SET CURRENT TO NEW          SS NOV84 19530000
         L     R14,SPFTTPT         RESTORE R14                 SS NOV85 19540000
         SR    R15,R15                                         SS NOV84 19550000
         IC    R15,$TLEX(R14)      GET                         SS NOV84 19560000
         SLL   R15,3                 TIME 8 : INDEX TO OFFSET  SS OCT88 19570000
         AL    R15,ISP$PNA             PANEL                   SS MAR85 19580000
         MVC   SPFPSTK(8),0(R15)            NAME               SS NOV84 19590000
ISPLPND5 DS    0H                                              SS NOV84 19600000
         BAS   R2,ISPPANDI                                     SS NOV85 19610000
         NI    SPFLAG4,255-SPFNOIV RESET, IF USED              SS AUG86 19620000
         CLC   SPFZSEL(4),ISPCEND     END KEY?                 SS NOV84 19630000
         BNE   ISPLPND7               NO, CONTINUE             SS JUL87 19640000
         MVC   MEM2OPT,ISPBLK8        CLEAR OPT                SS JUL87 19650000
         BAS   R2,ISPTBMOD            PUT INTO TABLE           SS JUL87 19660000
         B     ISPLNX                 YES, DONE                SS JUL87 19670000
ISPLPND7 DS    0H                                              SS JUL87 19680000
         CLI   SPFZSEL,C'?'           INVALID                  SS AUG86 19690000
         BE    ISPLNBAD               YES                      SS AUG86 19700000
         CLC   SPFZSEL(3),ISPPGM      SELECT PGM               SS AUG86 19710000
         BE    ISPLNSEL               LINE SELECT SUPPORT      SS AUG86 19720000
         CLC   SPFZSEL(3),ISPCCMD     SELECT CMD               SS AUG86 19730000
         BE    ISPLNSEL               LINE SELECT SUPPORT      SS AUG86 19740000
         CLC   SPFZSEL(3),ISPTRAP     TRAP   CMD               SS NOV88 19750000
         BE    ISPMMTP                TRAP SUPPORT             SS NOV88 19760000
         MVC   SPFINPUT(250),SPFZSEL                           SS NOV84 19770000
         MVC   PUTGETBF(4),ISPLEN2                             SS NOV84 19780000
         L     R14,SPFTTPT          RESTORE R14                SS NOV85 19790000
         MVI   SPFTPOSI,16          USE GENERAL PURPOSE POST   SS NOV84 19800000
         OI    SPFTFLG1,SPFTLPOS                               SS NOV85 19810000
         TM    $TLF2(R14),#A        RESCAN.. MULTY FUNC PANEL? SS NOV84 19820000
         BZ    ISPCMDL              NO, NO CHANGE              SS NOV84 19830000
*  RESCAN LINE CMD FROM PANEL                                  SS NOV84 19840000
         LA    R1,SPFINPUT                                     SS NOV85 19850000
         L     R14,SPFTBPLC  TABLE FOR SEARCH                  SS NOV85 19860000
         BAS   R2,ISPVERG           CHECK CMD VERB             SS NOV85 19870000
         MVC   SPFTTPT,SPFVTPT      COPY POINTER               SS NOV85 19880000
         C     R15,ISPL8            VALID VERB?                SS NOV84 19890000
         BH    ISPLNB3              NO, ERROR                  SS NOV84 19900000
         TM    $TLF1(R14),#V        VIEW MODE OUTPUT?         ABL DEC84 19910000
         BZ    *+8                  NO, BRANCH                ABL DEC84 19920000
         OI    SPFLAG3,SPFLOGM      YES, MARK FOR LOGGING     ABL DEC84 19930000
ISPLPN2  DS    0H                                              SS NOV84 19940000
         TM    $TLF1(R14),#S        COMMAND FOR SOURCE ONLY?   SS NOV84 19950000
         BZ    ISPLPN3              NO, BRANCH                 SS NOV84 19960000
         TM    FLAGSCC,RECFMU       LOAD LIBRARY?              SS NOV84 19970000
         BO    ISPLNB3              YES, ERROR                 SS NOV84 19980000
         B     ISPLPN4                                         SS NOV84 19990000
ISPLPN3  DS    0H                                              SS NOV84 20000000
         TM    $TLF1(R14),#U        COMMAND FOR LOAD ONLY?     SS NOV84 20010000
         BZ    ISPLPN4              NO, BRANCH                 SS NOV84 20020000
         TM    FLAGSCC,RECFMU       LOAD LIBRARY?              SS NOV84 20030000
         BZ    ISPLNB3              NO, ERROR                  SS NOV84 20040000
ISPLPN4  DS    0H                                              SS NOV84 20050000
         TM    $TLF2(R14),#T        INTERNAL CMD OK FROM O     SS NOV85 20060000
         BO    ISPLNC5              PROCESS INTERNALLY         SS NOV85 20070000
         TM    $TLF1(R14),#V        REVIEW MODE REQUIRED?      SS NOV84 20080000
         BO    ISPLPN5              YES, USE GENERAL PURPOSE   SS NOV84 20090000
         MVI   SPFTPOSI,32          COME BACK TO PANEL POST PR SS NOV84 20100000
ISPLPN5  DS    0H                                              SS NOV84 20110000
         TM    $TLF2(R14),#P        DIFFERENT POST PROCESSOR?  SS NOV84 20120000
         BZ    ISPCMDL              NO, BRANCH                 SS NOV84 20130000
         MVC   SPFTPOSI(1),$TLEX(R14) USE IT                   SS NOV84 20140000
         B     ISPCMDL                                         SS NOV84 20150000
         SPACE 2                        *                      SS AUG86 20160000
*                                       *                      SS NOV88 20170000
*  SYSOUT TRAP CMD                      *                      SS NOV88 20180000
*                                       *                      SS NOV88 20190000
ISPMMTP  DS    0H                       *                      SS NOV88 20200000
         CLC   SPFZENVI(8),ISPMMEV   CHECK FOR 2.3             SS NOV88 20210000
         BL    ISPMMTPE                 NO ENV                 SS NOV88 20220000
         CLI   SPFTPSET,C'Y'            IS TRAP SET            SS NOV88 20230000
         BNE   ISPMMTPE                 NO, NO                 SS NOV88 20240000
         BAS   R2,ISPTRAPI              CALL TRAP PROCESSOR    SS NOV88 20250000
         CLI   SPFTCNT,C'0'             ANY OUTPUT             SS NOV88 20260000
         BE    ISPLNSER                 PROCESS RETURN CODE    SS NOV88 20270000
         LH    R1,SPFTBPDA              DATA OFFSET            SS NOV88 20280000
         LA    R1,SPWRKC(R1)            ADDRESS                SS NOV88 20290000
         LTR   R15,R15                  ZERO RC                SS NOV88 20300000
         BZ    ISPMMTPZ                 PROCESS RETURN CODE    SS NOV88 20310000
         MVC   0(8,R1),SPFMLIN1         GET FORMATTED MSG      SS NOV88 20320000
         BAS   R2,ISPTBPUT              AND UPDATE             SS NOV88 20330000
         MVI   SPFTPOSI,56         COME BACK TO ISPLNB2        SS NOV88 20340000
         B     ISPMMTPL                 GOTO LOG               SS NOV88 20350000
ISPMMTPZ DS    0H                       PROCESS RETURN CODE    SS NOV88 20360000
         MVC   0(8,R1),ISPBLK8          FIRST BLANK            SS NOV88 20370000
         MVI   0(R1),C'*'               MSG TAG                SS NOV88 20380000
         MVC   1(4,R1),SPFBLKCM         COPY NAME              SS NOV88 20390000
         MVC   5(3,R1),ISPBLK8          BLANK REST             SS NOV88 20400000
         LH    R1,SPFTBPOT         OPT                         SS NOV88 20410000
         LA    R1,SPWRKC(R1)                                   SS NOV88 20420000
         MVC   0(4,R1),ISPBLK8     CLEAR OPTION                SS NOV88 20430000
         BAS   R2,ISPTBPUT              AND UPDATE             SS NOV88 20440000
         MVI   SPFTPOSI,0          COME BACK TO ISPLNX         SS NOV88 20450000
ISPMMTPL DS    0H                       DISPLAY OUTPUT IN LOG  SS NOV88 20460000
         OI    SPFTFLG1,SPFTLPOS                               SS NOV88 20470000
         BAS   R2,ISPSETST         SET AND RETREIVE STATUS     SS NOV88 20480000
         LH    R1,SPFFUNLP+0       GET LOG LAST PANEL          SS NOV88 20490000
         LNR   R1,R1               SET FOR SWAP                SS NOV88 20500000
         BAS   R2,ISPSTKI          SWAP TO LOG PANEL           SS NOV88 20510000
         LA    R15,100             CODE.. PROCESS COMMAND      SS NOV88 20520000
         BR    R3                  RETURN TO ROUTER            SS NOV88 20530000
ISPMMTPE DS    0H                       *                      SS NOV88 20540061
         MVC   SPFZSEL(3),ISPCCMD    CHANGE TO A COMMAND       SS NOV88 20550000
         B     ISPLNSEL                 *                      SS NOV88 20560000
ISPMMEV  DC    C'ISPF 2.3'           VERSION REQUIRES TSO/E    SS NOV88 20570000
         SPACE 2                        *                      SS AUG86 20580000
ISPLNSEL DS    0H                       *                      SS AUG86 20590000
         BAS   R2,ISPSLCTI              SELECT PROCESSOR       SS AUG86 20600000
ISPLNSER DS    0H                       *                      SS NOV88 20610000
         LTR   R15,R15                  ZERO RC                SS AUG86 20620000
         BZ    ISPLNSE2                 YES                    SS AUG86 20630000
         MVC   MEMLDATA,SPFMLIN1        GET FORMATTED MSG      SS AUG86 20640000
         B     ISPLNSE3                                        SS AUG86 20650000
ISPLNSE2 DS    0H                       *                      SS AUG86 20660000
         MVC   MEMLDATA,ISPBLK8         FIRST BLANK            SS AUG86 20670000
         MVI   MEMLDATA,C'*'            MSG TAG                SS AUG86 20680000
         MVC   MEMLDATA+1(4),SPFBLKCM   COPY NAME              SS DEC87 20690000
         MVC   MEMLDATA+5(3),ISPBLK8    BLANK REST             SS DEC87 20700000
ISPLNSE3 DS    0H                       *                      SS AUG86 20710000
         MVC   MEM2OPT,ISPBLK8     CLEAR OPTION                SS AUG86 20720000
         BAS   R2,ISPTBMOD         UPDATE TABLE                SS AUG86 20730000
         B     ISPLNX              REENTER MEMLIST DISPLAY     SS DEC87 20740000
         SPACE 2                        *                      SS AUG86 20750000
ISPLPNDP DS    0H                                              SS NOV84 20760000
         B     ISPGENP             USE GENERAL PURPOSE ONE     SS DEC87 20770000
         SPACE 3                                               SS NOV84 20780000
*                                                              SS MAR85 20790000
*   STATUS LINE COMMAND                                        SS MAR85 20800000
*                                                              SS MAR85 20810000
ISPSTAT1 DS    0H                                              SS MAR85 20820000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS AUG86 20830000
         BH    ISPLNBAD            CANNOT PROCESS              SS MAR85 20840000
         MVI   SPFTPOSI,36         SET POST PROCESSING INDEX   SS MAR85 20850000
         OI    SPFLAG0,SPFCKER     ALSO CHECK FOR ERRORS       SS MAR85 20860000
         MVC   PUTGETBF(4),ISPCMD30                            SS MAR85 20870000
         MVC   SPFINPUT(8),$ATT   COPY CMD NAME                SS MAR85 20880000
ISPSTAT2 DS    0H                                              SS MAR85 20890000
         MVI   SPFINPUT+8,C' '                                 SS MAR85 20900000
         MVC   SPFINPUT+9(8),MEMLNAME                          SS MAR85 20910000
         MVI   SPFINPUT+17,C' '                                SS MAR85 20920000
         CLI   MEMLDATA,C'*'       MSG                         SS MAR85 20930000
         BNE   *+10                                           ABL JUN85 20940000
         MVC   MEMLDATA(8),ISPBLK8      BLANK IT OUT           SS MAR85 20950000
         MVC   SPFINPUT+18(8),MEMLDATA                         SS MAR85 20960000
         MVC   MEMLNMSV,MEMLDATA                               SS MAR85 20970000
         OI    SPFLAG3,SPFLOGM                                 SS MAR85 20980000
         B     ISPCMDL                                         SS MAR85 20990000
ISPSTAP2 DS    0H                                              SS MAR85 21000000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS MAR85 21010000
         BO    ISPLERR                                         SS MAR85 21020000
         MVC   SPFTCCRP,SPFSTART   SAVE LOG POSITION           SS AUG86 21030000
         MVI   SPFTPOSI,40         SET POST PROCESSING INDEX   SS MAR85 21040000
         OI    SPFLAG0,SPFCKER     ALSO CHECK FOR ERRORS       SS MAR85 21050000
         MVC   PUTGETBF(4),ISPCMD30                            SS MAR85 21060000
         MVC   SPFINPUT(8),$HIS   COPY CMD NAME                SS MAR85 21070000
         B     ISPSTAT2                                        SS MAR85 21080000
ISPSTAP3 DS    0H                                              SS MAR85 21090000
         TM    SPFLAG0,SPFMSGER    ANY ERRORS                  SS MAR85 21100000
         BO    ISPLERR                                         SS MAR85 21110000
         MVI   SPFTPOSI,44         SET POST PROCESSING INDEX   SS MAR85 21120000
         OI    SPFLAG0,SPFCKER     ALSO CHECK FOR ERRORS       SS MAR85 21130000
         MVC   PUTGETBF(4),ISPCMD30                            SS MAR85 21140000
         MVC   SPFINPUT(8),$MAP   COPY CMD NAME                SS MAR85 21150000
         B     ISPSTAT2                                        SS MAR85 21160000
ISPSTAP4 DS    0H                                              SS NOV85 21170000
         MVC   SPFSTART,SPFTCCRP                               SS NOV85 21180000
         B     ISPGENP            PROCESS AS NORMAL            SS NOV85 21190000
         SPACE 3                                               SS NOV84 21200000
*                                                              SS MAR85 21210000
*   FORMAT UT2 LINE COMMAND                                    SS MAR85 21220000
*                                                              SS MAR85 21230000
ISPUTL1  DS    0H                                              SS MAR85 21240000
         CLI   MEM2STAT+1,C' '     IS THIS A GOOD MEMBER       SS AUG86 21250000
         BH    ISPLNBAD            CANNOT PROCESS              SS MAR85 21260000
         MVI   SPFTPOSI,16         SET POST PROCESSING INDEX   SS MAR85 21270000
         MVC   PUTGETBF(4),ISPUT25  HEADER/LENGTH              SS AUG86 21280000
         MVC   SPFINPUT(8),$UT2   COPY CMD NAME                SS MAR85 21290000
         MVI   SPFINPUT+8,C' '                                 SS MAR85 21300000
         MVC   SPFINPUT+9(8),MEMLNAME  GET MEMBER NAME         SS MAR85 21310000
**       MVC   SPFINPUT+17(5),ISPUTDOT INSERT LITERAL UT.     ABL FEB86 21320000
         MVI   SPFINPUT+17,X'40'   SEPARATOR CHARACTER        ABL APR86 21330000
         TM    $TLF2(R14),#R       IS REAL COMMAND HERE        SS MAR85 21340000
         BO    ISPUTL4             YES, USE AFTER UT.          SS MAR85 21350000
         LA    R15,$TLCM(R14)      COMMAND NAME                SS JUL85 21360000
         B     ISPUTL5             USE IT                      SS MAR85 21370000
ISPUTL4  DS    0H                                              SS MAR85 21380000
         SR    R15,R15             CLEAR FOR INSERT            SS MAR85 21390000
         IC    R15,$TLEX(R14)      GET OFFSET OF REAL CMD      SS MAR85 21400000
         LA    R15,ISPREAL(R15)    GET ADDRESS                 SS JUL85 21410000
ISPUTL5  DS    0H                                              SS MAR85 21420000
         MVC   SPFINPUT+18(4),0(R15) INSERT 4 CHAR OF CMD     ABL APR86 21430000
         MVI   SPFINPUT+22,C' '      BLANK AFTER CMD           SS MAY86 21440000
ISPUTL7  DS    0H                                              SS MAR85 21450000
         CLI   MEMLDATA,C'*'       MSG                         SS MAR85 21460000
         BE    *+10                                            SS MAR85 21470000
         MVC   MEMLDATA(8),ISPBLK8      BLANK IT OUT           SS MAR85 21480000
         MVC   MEMLNMSV,MEMLDATA   SAVE FOR PANEL USE          SS MAR85 21490000
         B     ISPCMDL                                         SS MAR85 21500000
ISPUT25  DC    AL2(25),AL2(0)           BUFFER LENGTH          SS AUG86 21510000
         SPACE 2                                               SS NOV86 21520000
*                                       *                      SS NOV86 21530000
*   COPY  MEMLIST LINE TO LOG           *                      SS NOV86 21540000
*                                       *                      SS NOV86 21550000
ISPMLOG  DS    0H                       *                      SS NOV86 21560000
         BAS   R2,ISPLOGBT              SET LOG TO BOTTOM      SS NOV86 21570000
         BAS   R2,ISPMVTBL              GET FORMAT INFO        SS NOV86 21580000
         SR    R14,R14                  ZERO FOR IC            SS NOV86 21590000
         IC    R14,9(R1)                GET FORMAT LENGTH      SS NOV86 21600000
         BCTR  R14,0                    ONE LESS FOR MVC       SS NOV86 21610000
         STH   R14,SPFTSVH              SAVE FOR LATER         SS NOV86 21620000
         LA    R15,4(,R15)              ALTERNATE ROUT ENTRY   SS NOV86 21630000
ISPMLOGL DS    0H                       *                      SS NOV86 21640000
         LA    R1,WORKTBL               TEMP WORK AREA         SS NOV86 21650000
         MVI   0(R1),C' '               BLANK                  SS NOV86 21660000
         MVC   1(79,1),0(R1)               RIPPLE              SS NOV86 21670000
         BASR  R2,R15                   FORMAT ROUTINE         SS NOV86 21680000
         ST    R15,SPFTSV1              SAVE NEXT STEP ROUTINE SS NOV86 21690000
         LH    R14,SPFTSVH              GET LENGTH             SS NOV86 21700000
*              R1 STILL POINTING TO FORMATTED DATA             SS NOV86 21710000
         BAS   R2,ISPADD79              ADD TO LOG             SS NOV86 21720000
         ICM   R15,15,SPFTSV1           GET ROUTINE ADDRESS    SS NOV86 21730000
         BNZ   ISPMLOGL                 CONTINUE FORMAT        SS NOV86 21740000
         B     ISPGENP2                 DONE, CLEANUP          SS NOV86 21750000
         SPACE 2                                               SS NOV86 21760000
         DROP  R4                                              SS NOV85 21770000
         TITLE  'ISPF - ALIAS CHECK ROUTINES  '                SS AUG86 21780000
*                                       *                      SS AUG86 21790000
* ALIAS CHECK FUNCTION ENTRY 1          *                      SS AUG86 21800000
*                                       *                      SS AUG86 21810000
ISPCKALI DS    0H                                              SS SEP84 21820000
         USING ISPCKALI,R4              *                      SS AUG86 21830000
         TM    MEMFLAG2,255-MEMLNALL  ALL MEMBERS              SS AUG86 21840000
         BO    ISPCKALA             YES                        SS AUG86 21850000
         NI    MEMFLAG2,255-MEMLNTBL-MEMLNALL  RESET NEW MEML  SS AUG86 21860000
         L     R0,ISPSUBA           SUBLIST ROUTINE ADDRESS    SS AUG86 21870000
         BAS   R2,ISPSUBI           SUBROUTINE INTERFACE SUPP  SS AUG86 21880000
         OI    SPFLAG4,SPFCPOST     COMMAND POST PROCESS       SS AUG86 21890000
         MVI   SPFPOST1,84          ISPCKAL2 INDEX             SS AUG86 21900000
         MVC   PUTGETBF(21),ISPSUBL USE SUBLIST * ALIAS        SS AUG86 21910000
         B     ISPEXIT              DO COMMAND                 SS AUG86 21920000
ISPCKALA DS    0H                       *                      SS AUG86 21930000
         NI    MEMFLAG2,255-MEMLNTBL-MEMLNALL  RESET NEW MEML  SS AUG86 21940000
         L     R0,ISPALICA          ALIAS CK ROUTINE ADDR      SS AUG86 21950000
         BAS   R2,ISPSUBI           SUBROUTINE INTERFACE SUPP  SS AUG86 21960000
         LA    R15,40               ISPDISP                    SS AUG86 21970000
         BR    R3                   RETURN TO ROUTER           SS AUG86 21980000
         DROP  R4                       *                      SS AUG86 21990000
*                                       *                      SS AUG86 22000000
* ALIAS CHECK FUNCTION ENTRY 2          *                      SS AUG86 22010000
*                                       *                      SS AUG86 22020000
*  UPDATE MEMLIST FROM SUBLIST          *                      SS AUG86 22030000
*                                       *                      SS AUG86 22040000
ISPCKAL2 DS    0H                                              SS SEP84 22050000
         USING ISPCKAL2,R4              *                      SS AUG86 22060000
         L     R15,PMEMMIN          GET FIRST ENTRY            SS AUG86 22070000
ISPCKALL ST    R15,SPFTSV1          SAVE ENTRY ADDR            SS AUG86 22080000
         TM    0(R15),X'80'         ACTIVE ENTRY               SS AUG86 22090000
         BZ    ISPCKALN             NO, NEXT ENTRY             SS AUG86 22100000
         MVC   MEMLNAME,4+2(R15)    GET MEMBER NAME            SS AUG86 22110000
         BAS   R2,ISPGET            GET THIS MEMBER            SS AUG86 22120000
         LTR   R15,R15              FOUND ONE                  SS AUG86 22130000
         BZ    ISPCKALN             YES, TRY NEXT              SS AUG86 22140000
         MVC   DIRNAME(8),MEMLNAME  SET NAME                   SS AUG86 22150000
         BAS   R2,ISPBLDL           DO BLDL                    SS AUG86 22160000
         BAS   R2,MEMLISTI          GET STATS                  SS AUG86 22170000
         BAS   R2,MEMLSET           SET STATS                  SS AUG86 22180000
         BAS   R2,ISPTBADD          UPDATE STATS               SS AUG86 22190000
ISPCKALN DS    0H                   NEXT ENTRY                 SS AUG86 22200000
         L     R15,SPFTSV1          GET ENTRY                  SS AUG86 22210000
         LA    R15,0(R15)           CLEAR FLAG FOR TEST        SS AUG86 22220000
         C     R15,PMEMMAX          LAST ENTRY                 SS AUG86 22230000
         BE    ISPCKALD             YES, DONE                  SS AUG86 22240000
         ICM   R15,15,0(R15)        NEXT ENTRY                 SS AUG86 22250000
         BZ    ISPCKALD             RAN TO END OF LIST         SS AUG86 22260000
         B     ISPCKALL             LOOP FOR MORE              SS AUG86 22270000
ISPCKALD DS    0H                       *                      SS AUG86 22280000
         L     R0,ISPALICA          ALIAS CK ROUTINE ADDR      SS AUG86 22290000
         BAS   R2,ISPSUBI           SUBROUTINE INTERFACE SUPP  SS AUG86 22300000
         LA    R15,40               ISPDISP6                   SS AUG86 22310000
         BR    R3                   RETURN TO ROUTER           SS AUG86 22320000
         DROP  R4                       *                      SS AUG86 22330000
         SPACE 2                                               SS SEP84 22340000
*                                                              SS SEP84 22350000
*  ALIAS CHECKER  SUBROUTINE                                   SS SEP84 22360000
*  R3 IS RETURN REGISTER                                       SS SEP84 22370000
*                                                              SS SEP84 22380000
ISPALICK DS    0H                                              SS SEP84 22390000
         USING *,R4                                            SS MAR85 22400000
         BAS   R2,ISPTOP             START WITH TOP            SS SEP84 22410000
ISPALI2  DS    0H                                              SS SEP84 22420000
         MVC   MEM2ALIS,ISPALIS      SET CODE FOR ALIAS INDIC  SS SEP84 22430000
         LA    R0,MMLALIS            SCAN VARIABLE             SS SEP84 22440000
         BAS   R2,ISPMEMSC           DO SCAN                   SS SEP84 22450000
         C     R15,ISPL8             NONE FOUND                SS SEP84 22460000
         BER   R3                    DONE                      SS SEP84 22470000
         MVC   MEMLNMSV,MEMLNAME     SAVE NAME                 SS SEP84 22480000
         MVC   MEMLTTSV,MEM2TTR      SAVE TTR                  SS SEP84 22490000
         TM    FLAGSCC,RECFMU        IS IT A LOAD MODE         SS SEP84 22500000
         BO    ISPALI50              YES                       SS SEP84 22510000
ISPALI3  DS    0H                                              SS SEP84 22520000
         BAS   R2,ISPTOP             START AT TOP              SS SEP84 22530000
ISPALI4  DS    0H                                              SS SEP84 22540000
         MVC   MEM2TTR,MEMLTTSV      TTR FOR SCAN              SS SEP84 22550000
         LA    R0,MMLTTR             SCAN FOR                  SS SEP84 22560000
         BAS   R2,ISPMEMSC                   MATCH TTR         SS SEP84 22570000
         C     R15,ISPL8             FOUND ANY                 SS SEP84 22580000
         BE    ISPALI10              NO                        SS SEP84 22590000
         CLC   MEM2ALIS,ISPBLK8      ANOTHER ALIAS             SS SEP84 22600000
         BNE   ISPALI4               YES KEEP TRYING           SS SEP84 22610000
* GOT A MATCH                                                  SS SEP84 22620000
         XC    MEMLNAME,MEMLNMSV     SWITCH                    SS SEP84 22630000
         XC    MEMLNMSV,MEMLNAME          MEMBER               SS SEP84 22640000
         XC    MEMLNAME,MEMLNMSV                NAMES          SS SEP84 22650000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 22660000
         MVC   MEM2ALIS,MEMLNMSV     ALIAS OF NAME             SS SEP84 22670000
         BAS   R2,ISPTBMOD           UPDATE                    SS SEP84 22680000
         B     ISPALI2               CONTINUE WITH NEXT        SS SEP84 22690000
ISPALI10 DS    0H                    NO MATCH                  SS SEP84 22700000
         MVC   MEMLNAME,MEMLNMSV                NAMES          SS SEP84 22710000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 22720000
         MVC   MEM2ALIS,ISPUNKN      MARK UNKNOWN              SS SEP84 22730000
         BAS   R2,ISPTBMOD           UPDATE                    SS SEP84 22740000
         B     ISPALI2               CONTINUE WITH NEXT        SS SEP84 22750000
ISPALI50 DS    0H                                              SS SEP84 22760000
         CLC   MEM2MNAM,ISPBLK8      IS THERE A MAIN NAME      SS SEP84 22770000
         BE    ISPALI3                                         SS SEP84 22780000
         NI    MEMFLAG2,X'FF'-MEMLGMNM-MEMLGTTR  NULLIFY      ABL JAN87 22790000
         MVC   MEMLNAME,MEM2MNAM     GET THIS ON IF THERE      SS SEP84 22800000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 22810000
         C     R15,ISPL8             IS THERE ONE              SS SEP84 22820000
         BE    ISPALI55              NO, TRY BY TTR            SS SEP84 22830000
         OI    MEMFLAG2,MEMLGMNM     FOUND MAIN NAME           SS SEP84 22840000
         CLC   MEMLTTSV,MEM2TTR      SAME TTR                  SS SEP84 22850000
         BNE   ISPALI55              NO                        SS SEP84 22860000
         XC    MEMLNAME,MEMLNMSV     SWITCH                    SS SEP84 22870000
         XC    MEMLNMSV,MEMLNAME          MEMBER               SS SEP84 22880000
         XC    MEMLNAME,MEMLNMSV                NAMES          SS SEP84 22890000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 22900000
         MVC   MEM2ALIS,MEMLNMSV     ALIAS OF NAME             SS SEP84 22910000
         MVC   MEM2MTTR,MEMLNMSV     ALIAS OF NAME             SS SEP84 22920000
         BAS   R2,ISPTBMOD           UPDATE                    SS SEP84 22930000
         B     ISPALI2               CONTINUE WITH NEXT        SS SEP84 22940000
ISPALI55 DS    0H                                              SS SEP84 22950000
         MVC   MEM2TTR,MEMLTTSV      TRY  TTR                  SS SEP84 22960000
         BAS   R2,ISPTOP             START AT TOP              SS SEP84 22970000
ISPALI56 DS    0H                                              SS SEP84 22980000
         LA    R0,MMLTTR             SCAN FOR                  SS SEP84 22990000
         BAS   R2,ISPMEMSC                   MATCH TTR         SS SEP84 23000000
         C     R15,ISPL8             FOUND ANY                 SS SEP84 23010000
         BE    ISPALI57              UNKNOWN                   SS SEP84 23020000
         CLC   MEM2ALIS,ISPBLK8      ANOTHER ALIAS             SS SEP84 23030000
         BNE   ISPALI56              YES KEEP TRYING           SS SEP84 23040000
* GOT A MATCH                                                  SS SEP84 23050000
         OI    MEMFLAG2,MEMLGTTR     FOUND TTR MATCH           SS SEP84 23060000
         XC    MEMLNAME,MEMLNMSV     SWITCH                    SS SEP84 23070000
         XC    MEMLNMSV,MEMLNAME          MEMBER               SS SEP84 23080000
         XC    MEMLNAME,MEMLNMSV                NAMES          SS SEP84 23090000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 23100000
         MVC   MEM2MTTR,MEMLNMSV     ALIAS OF NAME             SS SEP84 23110000
         B     ISPALI58                                        SS SEP84 23120000
ISPALI57 DS    0H                                              SS SEP84 23130000
         MVC   MEMLNAME,MEMLNMSV     ORIGINAL MEMBER NAME      SS SEP84 23140000
         BAS   R2,ISPGET             GET ORIGINAL MEMBER       SS SEP84 23150000
ISPALI58 DS    0H                                              SS SEP84 23160000
         MVC   MEM2ALIS,ISPORP       ORPHAN                    SS SEP84 23170000
         TM    MEMFLAG2,MEMLGTTR     TTR MATCH?               ABL JAN87 23180000
         BNO   *+10                  NO, BRANCH               ABL JAN87 23190000
         MVC   MEM2ALIS,ISPBYTTR     YES, MARK =BYTTR         ABL JAN87 23200000
         TM    MEMFLAG2,MEMLGMNM     NAME MATCH?              ABL JAN87 23210000
         BNO   *+10                  NO, BRANCH               ABL JAN87 23220000
         MVC   MEM2ALIS,ISPBYNAM     YES, MARK =BYNAME        ABL JAN87 23230000
*        SR    R15,R15               CLEAR                     SS SEP84 23240000
*        IC    R15,MEMFLAG2          GET STATUS                SS SEP84 23250000
*        LA    R15,X'F1'(,R15)       ADD 1 AND MAKE PRINTABLE  SS SEP84 23260000
*        STC   R15,MEM2ALIS+7        TYPE ORPHAN               SS SEP84 23270000
         BAS   R2,ISPTBMOD           UPDATE                    SS SEP84 23280000
         B     ISPALI2               CONTINUE WITH NEXT        SS SEP84 23290000
ISPBYTTR DC    CL8'=BYTTR'   TTR MATCHES ANOTHER MEMBER       ABL JAN87 23300000
ISPBYNAM DC    CL8'=BYNAME'  CLAIMED NAME MATCHES ANOTHER MEM ABL JAN87 23310000
         DROP  R4                                              SS MAR85 23320000
         TITLE 'ISPF - SUBLIST FUNCTION'                       SS AUG86 23330000
***  RESET THE SUBLIST TO THE MEMBER TABLE                    ABL APR86 23340000
ISPSUB   DS    0H                                             ABL APR86 23350000
         USING *,R4                                           ABL APR86 23360000
         LA    R15,40                   RETURN HERE IF INACT   SS MAY89 23370000
         CLI   SPFFUNST+1,C'I'          INACTIVE               SS MAY89 23380000
         BER   R3                       RETURN IF YES          SS MAY89 23390000
         LA    R14,TBTOP                    TBTOP                       23400000
         L     R15,SPFMEMTA                 TABLE ADDRESS      SS MAY89 23410000
         STM   R14,R15,PARMLIST                                         23420000
         OI    PARMLIST+4,X'80'                                         23430000
         LA    R1,PARMLIST                                              23440000
         L     R15,ISPLINK                                              23450000
         BASR  R14,R15                                                  23460000
         SPACE 2                                                        23470000
ISPSU010 LA    R14,TBSKIP                   TBSKIP                      23480000
         L     R15,SPFMEMTA                 TABLE ADDRESS      SS MAY89 23490000
         STM   R14,R15,PARMLIST                                         23500000
         OI    PARMLIST+4,X'80'                                         23510000
         LA    R1,PARMLIST                                              23520000
         L     R15,ISPLINK                                              23530000
         BASR  R14,R15                                                  23540000
         LTR   R15,R15                      END OF DATA?                23550000
         BNZ   ISPSU900                     NO, BRANCH                  23560000
         CLI   MEM2STAT+1,C' '            GOOD MEMBER          SS FEB88 23570000
         BNE   ISPSU010                   NO, SKIP             SS FEB88 23580000
         TM    SPFLAG5,SPFTAG           ONLY TAGGED MEMBERS    SS NOV88 23590000
         BZ    ISPSU020                 NO, ANY MEMBER         SS NOV88 23600000
         CLC   MEMLDATA,ISPSU090        THIS ONE TAGGED        SS NOV88 23610000
         BNE   ISPSU010                 NO, SKIP IT            SS NOV88 23620000
ISPSU020 DS    0H                       *                      SS NOV88 23630000
         SPACE 1                                                        23640000
         TM    FLAGSEE,FMEMGRP            MEMBER GROUP DEFINE START?    23650000
         BO    ISPSU100                   YES, BRANCH                   23660000
         SPACE 1                                                        23670000
         OI    FLAGSEE,FMEMGRP            FIRST SUBLIST ELEMENT         23680000
         MVC   MMEMMAX(4),MMEMMIN         POINT TO THE FIRST ELEMENT    23690000
         XC    MMEMBERD(1+2+8+8+2),MMEMBERD  CLEAR THE MEMBER NAME      23700000
         MVC   MMEMBERD+1+2(8),MEMLNAME      MEMBER NAME                23710000
         MVC   DIRNAME(8),MEMLNAME           SAVE FOR LATER             23720000
         MVC   MMEMBERD+1+2+8+8+2(3),MEM2XTTR   TTR FIRST MEM  SS AUG86 23730000
         LA    R1,MEMLNAME+7              END OF MEMBER NAME            23740000
         LA    R0,7                       MACHINE LENGTH                23750000
ISPSU050 CLI   0(R1),X'40'                BLANK?                        23760000
         BNE   ISPSU060                   NO, BRANCH                    23770000
         BCTR  R1,0                       PREVIOUS CHARACTER            23780000
         BCT   R0,ISPSU050                CHECK ALL BYTES               23790000
ISPSU060 STCM  R0,B'1100',MMEMBERD+1      SAVE THE MACHINE LENGTH       23800000
         MVI   MMEMBERD,FMEMBER1          A SINGLE MEMBER NAME          23810000
         NI    MMEMMIN,FF-X'80'           MEMBER LIST IS INACTIVE       23820000
         SPACE 1                                                        23830000
         ICM   R1,B'0111',MMEMMIN+1       FIRST ELEMENT POINTER?        23840000
         BZ    ISPSU010                   NO, DONE                      23850000
         MVI   0(R1),0                    YES, INACTIVE ELEMENT         23860000
         B     ISPSU010                                                 23870000
ISPSU090 DC    CL8'*TAG*'               *                      SS NOV88 23880000
         SPACE 2                                                        23890000
ISPSU100 L     R1,MMEMMAX                 CURRENT END POINTER           23900000
         CLC   1(3,R1),=F'0'              ANY SLOT ENTRIES LEFT?        23910000
         BNE   ISPSU180                   YES, BRANCH                   23920000
         LA    R0,36*28                   36 MEMBERS, 28 WIDE EACH      23930000
         ICM   R0,B'1000',=AL1(24)        ASSUME SPF IS INITIALIZED     23940000
         STCM  R0,B'1000',SUBLIST2        MARK FOR LATER RELEASE        23950000
         GETMAIN R,LV=(0)                 GET MORE ELEMENT STORAGE      23960000
         LR    R15,R1                     START OF TABLE                23970000
         L     R1,MMEMMAX                 CURRENT ELEMENT               23980000
         LA    R0,36-1                    NUMBER OF ELEMENTS -1         23990000
ISPSU136 LA    R15,28(,R15)               NEXT ELEMENT POINTER          24000000
         ST    R15,0(,R1)                 POINT TO THE NEXT ELEMENT     24010000
         LR    R1,R15                     NEXT ELEMENT                  24020000
         BCT   R0,ISPSU136                DO 36 ELEMENTS                24030000
         XC    0(4,R1),0(R1)              CLEAR THE LAST POINTER        24040000
         SPACE 2                                                        24050000
ISPSU180 LA    R1,MMEMMIN                 ANCHOR FOR MEMBER LIST        24060000
         CLC   MEMLNAME(8),MMEMBERD+1+2   ALREADY IN LIST?              24070000
         BE    ISPSU010                   YES, DO NOT ADD AGAIN         24080000
         SPACE 2                                                        24090000
ISPSU190 L     R1,0(,R1)                  NEXT ELEMENT                  24100000
         TM    0(R1),X'80'                ACTIVE ELEMENT?               24110000
         BNO   ISPSU200                   NO, NOT FOUND                 24120000
         CLC   MEMLNAME(8),4+2(R1)        ALREADY IN LIST?              24130000
         BE    ISPSU010                   YES, DO NOT ADD AGAIN         24140000
         B     ISPSU190                   SEARCH THE ENTIRE LIST        24150000
         SPACE 2                                                        24160000
ISPSU200 L     R1,MMEMMAX                 CURRENT ADDED ELEMENT         24170000
         L     R15,0(,R1)                 NEXT POINTER                  24180000
         MVI   0(R15),0                   INACTIVE THE NEXT ELEMENT     24190000
         ST    R15,MMEMMAX                NEXT ELEMENT TO ADD           24200000
         OI    0(R1),X'80'                ACTIVE ELEMENT                24210000
         OI    MMEMMIN,X'80'              MEMBER LIST IS ACTIVE         24220000
         XC    4(2+8+8+2,R1),4(R1)        CLEAR THE MEMBER NAME         24230000
         MVC   4+2(8,R1),MEMLNAME         MEMBER NAME                   24240000
         MVC   4+2+8+8+2(3,R1),MEM2TTR    ADD THIS TTR                  24250000
         LA    R15,MEMLNAME+7             END OF MEMBER NAME            24260000
         LA    R0,7                       MACHINE LENGTH                24270000
ISPSU250 CLI   0(R15),X'40'               BLANK?                        24280000
         BNE   ISPSU260                   NO, BRANCH                    24290000
         BCTR  R15,0                      PREVIOUS CHARACTER            24300000
         BCT   R0,ISPSU250                CHECK ALL BYTES               24310000
ISPSU260 STC   R0,5(R1)                   SAVE THE MACHINE LENGTH       24320000
         MVI   4(R1),FMEMBER1             A SINGLE MEMBER NAME          24330000
         B     ISPSU010                                                 24340000
         SPACE 3                                                        24350000
ISPSU900 DS    0H                                                       24360000
         NI    SPFLAG0,255-SPFCKER-SPFMSGER   RESET           ABL APR86 24370000
         NI    SPFLAG5,255-SPFTAG             RESET            SS NOV88 24380000
         MVC   PMEMCURR(4),PMEMMIN     RESET THE CURRENT POINTER        24390000
         MVC   LMEMBER1(2+8+8+2),MMEMBERD+1  RESET THE MEMBER NAME      24400000
         MVC   FLAGSAA(1),MMEMBERD     RESET THE MEMBER FLAG  ABL JAN87 24410000
         XC    MMEMMIN(12),PMEMMIN     INTERCHANGE                      24420000
         XC    PMEMMIN(12),MMEMMIN                THE                   24430000
         XC    MMEMMIN(12),PMEMMIN                   MEMBER LISTS       24440000
         MVC   MEMBERD(1+2+8+8+2),MMEMBERD    RESET THE DEFAULT NAME    24450000
         BAS   R14,DEFGROUP            ADD DEFAULT GROUP                24460000
         XI    FLAGSEE,FMEMGRP         MEMGRP USED NOW                  24470000
         MVI   FLAGSAA,00              RESET THE MEMBER FLAG  ABL JAN89 24480000
         LA    R15,40                  RETURN TO ISPDISP6               24490000
         BR    R3                                                       24500000
         DROP  R4                                             ABL APR86 24510000
