PARSE    TITLE 'P D S  --  PDS PARSE PROCESSING ROUTINE      09/28/88'  00010000
         SPACE 2                                                        00020099
         MACRO                                                          00030000
&L       $T    &Z,&PF,&RTN,&O,&PCL,&P,&PP,&CR,&HD                       00040000
         LCLA  &NUM                                                     00050000
         LCLC  &NAME,&P2                                                00060000
&NAME    SETC  '&Z'.' '                                                 00070000
&L       DC    0F'0',CL8'&NAME'                *** SUBCOMMAND NAME      00080000
&P2      SETC  '&RTN'                                                   00090000
         AIF   ('&P2'(1,1) EQ '0').RTT00                                00100000
&NUM     SETA  7                                                        00110000
.DROPRT  ANOP                                                           00120000
         AIF   ('&P2'(1,1) NE '+').RTTP2                                00130000
&P2      SETC  '&P2'(2,&NUM)                                            00140000
&NUM     SETA  &NUM-1                                                   00150000
         AGO   .DROPRT                                                  00160000
.RTTP2   DC    X'&PF',VL3(&P2)                 *** FLAGS, RTN ADDRESS   00170000
         AGO   .RTTPP                                                   00180000
.RTT00   DC    X'&PF',AL3(&P2)                 *** FLAGS, RTN ADDRESS   00190000
.RTTPP   ANOP                                                           00200000
&P2      SETC  '&PCL'                                                   00210000
         AIF   ('&P2'(1,1) EQ '0').PCT00                                00220000
&NUM     SETA  7                                                        00230000
.DROPPC  ANOP                                                           00240000
         AIF   ('&P2'(1,1) NE '+').PCTP2                                00250000
&P2      SETC  '&P2'(2,&NUM)                                            00260000
&NUM     SETA  &NUM-1                                                   00270000
         AGO   .DROPPC                                                  00280000
.PCTP2   DC    AL1(&O),AL3(&P2)                *** FLAGS, PCL ADDRESS   00290000
         AGO   .PCTPP                                                   00300000
.PCT00   DC    AL1(&O),AL3(&P2)                *** FLAGS, PCL ADDRESS   00310000
.PCTPP   ANOP                                                           00320000
&P2      SETC  '&PP'                                                    00330000
         AIF   ('&P2'(1,1) EQ '0').PPT00                                00340000
&NUM     SETA  7                                                        00350000
.DROPPP  ANOP                                                           00360000
         AIF   ('&P2'(1,1) NE '+').PPTP2                                00370000
&P2      SETC  '&P2'(2,&NUM)                                            00380000
&NUM     SETA  &NUM-1                                                   00390000
         AGO   .DROPPP                                                  00400000
.PPTP2   DC    AL1(&P),AL3(&P2)                *** FLAGS, PP ADDRESS    00410000
         AGO   .PPTPP                                                   00420000
.PPT00   DC    AL1(&P),AL3(&P2)                *** FLAGS, PP ADDRESS    00430000
.PPTPP   ANOP                                                           00440000
         DC    CL8'&CR'                        *** ATTACHED TSO COMMAND 00450000
         DC    AL2(&HD-ONIX),XL2'FFFF'         *** HELP, AVAILABLE      00460000
.EXIT    MEND                                                           00470000
         SPACE 2                                                        00480000
         MACRO                                                          00490000
&L       COND  &OPRAND,&OPRAT                                           00500000
         AIF   ('&L' EQ '').EXIT                                        00510000
         &OPRAND &OPRAT                                                 00520000
.EXIT    MEND                                                           00530000
         SPACE 2                                                        00540000
         MACRO                                                          00550000
&L       CONDIKJ &OPRAT                                                 00560099
         AIF   ('&L' EQ '').EXIT                                        00570000
         IKJNAME &OPRAT                                                 00580000
.EXIT    MEND                                                           00590000
         SPACE 2                                                        00600000
         PRINT OFF                                                      00610000
         COPY  #PDSGEN                                                  00620000
         SPACE 2                                                        00630000
&CBRO    SETC  'BROWSE'   ***  SPF BROWSE SERVICE NAME                  00640000
&CEDI    SETC  'EDIT'     ***  SPF EDIT SERVICE NAME                    00650000
&CVIE    SETC  'VIEW'     ***  SPF VIEW SERVICE NAME          DRK JUL01 00660000
         SPACE 1                                                        00670000
         PRINT ON                                                       00680000
         SPACE 1                                                        00690000
         AIF   ('&CISP' EQ '').NOSPF                                    00700000
         AIF   ('&CISP' EQ 'SPF').SMNOTE                                00710000
         AIF   ('&CISP' EQ 'ISPF').SMNOTE                               00720000
         AIF   ('&CISP' EQ 'ISPFV2').SMNOTE                             00730000
         SPACE 3                                                        00740000
         MNOTE 12,'*** CISP -- SPF CONTROL &CISP IS INVALID ***'        00750000
         SPACE 2                                                        00760000
         AGO   .NOGEN                                                   00770000
.NOSPF   ANOP                                                           00780000
*&CISP    SETC  'NO SPF'                                                00790000
&NBRO    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00800000
&NEDI    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00810000
&NVIE    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00820000
&NISP    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00830000
&NSPF    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00840000
&NMML    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00850000
&NISM    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00860000
&NISX    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00870000
&NEDR    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00880000
&IMLX    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    00890000
.SMNOTE  ANOP                                                           00900000
         PRINT NOGEN                                                    00910099
         TITLE 'P D S  --  PDS PARSE PROCESSING ROUTINE      09/28/88'  00920000
*                                                                       00930000
*        PARSE INTERFACE SUBROUTINE                                     00940000
*                                                                       00950000
         SPACE 1                                                        00960000
PARSE    CSECT                                                          00970000
R0       EQU   0                                                        00980000
R1       EQU   1                                                        00990000
R2       EQU   2                                                        01000000
R3       EQU   3                                                        01010000
R4       EQU   4                                                        01020000
R5       EQU   5                                                        01030000
R6       EQU   6                                                        01040000
R7       EQU   7                                                        01050000
R8       EQU   8                                                        01060000
R9       EQU   9                                                        01070000
R10      EQU   10                                                       01080000
R11      EQU   11                                                       01090000
R12      EQU   12                                                       01100000
R13      EQU   13                                                       01110000
R14      EQU   14                                                       01120000
R15      EQU   15                                                       01130000
FF       EQU   255                                                      01140000
         USING *,R8                                                     01150000
         USING WORKAREA,R7                                              01160000
         ENTRY $TBL,$ATT,$PRI,$CHA                                      01170000
         ST    R8,R8PARSE                                               01180000
         ST    R14,R14PARSE                                             01190000
         LR    R8,R15                                                   01200000
         L     R1,=A($CHA)              START OF CHANGE ENTRY           01210000
         CLC   ##ADRPCL+1(3),13(R1)     PARSE FOR NEW DATA SET?         01220000
         BNE   PARSE2                   NO, BRANCH                      01230000
         STAX  ,                        YES, CANCEL ANY PREVIOUS STAX   01240000
PARSE2   BAS   R2,FREEPDL               FREE ANY PREVIOUS PARSE STORAGE 01250000
         SPACE 1                                                        01260000
         LA    R15,PARMPARS             AREA FOR PARSE PARAMETERS       01270000
         USING PPL,R15                  BASE FOR PARSE PARAMETER LIST   01280000
         SPACE 1                                                        01290000
         L     R1,ADDRUPT                                               01300000
         L     R2,ADDRECT                                               01310000
         LA    R3,ATTNECB                                               01320000
         L     R4,##ADRPCL                                              01330000
         LA    R5,ADDRANSR                                              01340000
         L     R6,ADDRCBUF                                              01350000
***      LA    R7,MAINSAVE                                              01360000
         SPACE 1                                                        01370000
         TM    ##ADRPC#,@S+@G       NON-PARTITIONED AND MEMBER NEEDED?  01380000
         BNO   PARSE4               NO, BRANCH                          01390000
         SPACE 1                                                        01400000
*    THE FOLLOWING 6 LINES OF CODE ADD A MEMBER PARAMETER WHEN          01410000
*      REQUIRED FOR NON-PARTITIONED DATA SET SUBCOMMAND PARSE.          01420000
         LH    R14,2(,R6)           OFFSET FOR OPERANDS                 01430000
         A     R14,=F'-2'           LESS TWO                            01440000
         STH   R14,2(,R6)           UPDATE THE OFFSET                   01450000
         LA    R14,0(R6,R14)        POINT TO THE NEW OPERAND            01460000
         MVI   4(R14),C'Z'          DUMMY MEMBER NAME                   01470000
         MVI   5(R14),X'40'         SEPARATOR CHARACTER                 01480000
         SPACE 1                                                        01490000
PARSE4   STM   R1,R7,PPLUPT         INITIALIZE PPLUPT, PPLECT, PPLECB   01500000
*                                   PPLPCL, PPLANS, PPLCBUF AND PPLUWA  01510000
         DROP  R15                                                      01520000
         LR    R1,R15                                                   01530000
         MVI   ATTNECB,1            FLAG -- CAN BE ATTENTIONED          01540000
         SPACE 2                                                        01550000
         L     R15,ADDRPARS         INVOKE                              01560000
         BASR  R14,R15                    PARSE                         01570000
         STC   R15,R14PARSE                                             01580000
         MVI   ATTNECB,0            CLEAR ATTENTION ECB                 01590000
         SPACE 3                                                        01600000
         L     R6,ADDRANSR             PARSE RESULT BASE REGISTER       01610000
         LTR   R15,R15                 GOOD PARSE?                      01620000
         BNZ   PARSPOST                NO, BRANCH                       01630000
         SPACE 1                                                        01640000
         ICM   R4,B'0111',##ADRPAR+1   ANY PROCESSING ROUTINE?          01650000
         BNZR  R4                      YES, BRANCH                      01660000
         SPACE 3                                                        01670000
*** PARSE POST PROCESSING OF OPERANDS IS COMPLETE                       01680000
PARSPOST SR    R15,R15                                                  01690000
         IC    R15,R14PARSE                                             01700000
         SPACE 1                                                        01710000
         LA    R14,MAXPARSE         RETURN CODE LIMIT                   01720000
         CR    R15,R14              RETURN CODE WITHIN LIMITS?          01730000
         BH    PARSEBAD             NO, ERROR                           01740000
         SPACE 1                                                        01750000
         LA    R3,4                 OFFSET OF RETURN IF SUCCESSFUL      01760000
         B     *+4(R15)             PROCESS RETURN CODE                 01770000
PARSERET B     PARSEOK                00 - SUCCESSFUL                   01780000
         B     EXIT8N                 04 - PARSE UNABLE TO PROMPT       01790099
         B     PARSERR                08 - USER ENTERED ATTENTION       01800000
         B     PARSEBAD               12 - INVALID PARAMETERS           01810000
         B     PARSEBAD               16 - PARSE INTERNAL FAILURE       01820000
         B     EXIT8N                 20 - VALIDITY CHECK ERROR         01830000
MAXPARSE EQU   *-PARSERET                                               01840000
         SPACE 2                                                        01850000
PARSEBAD LA    R1,GFPARMS                                               01860000
         ST    R1,GFPARMP           SAVE ADDRESS OF PARMLIST            01870000
         L     R0,ADDRFF02          ADDRESS OF IKJEFF02                 01880000
         STM   R15,R0,GFRCODE       SAVE GFRCODE AND GF02PTR            01890000
         LA    R1,GFPARSE                                               01900000
         STH   R1,GFCALLID          SAVE CALLER-ID FOR PARSE            01910000
         L     R0,ADDRCPPL          CPPL                                01920000
         LA    R1,ATTNECB           ATTENTION ECB                       01930000
         STM   R0,R1,GFCPPLP        SAVE GFCPPLP AND GFECBP             01940000
         MVI   ATTNECB,0            CLEAR THE ECB                       01950000
         LINK  EP=IKJEFF19,MF=(E,GFPARMP)                               01960000
         CLI   R14PARSE,X'4'        USER ENTER ATTENTION?               01970000
         BE    PARSERR              YES, BRANCH -- IGNORE COMMAND       01980000
         LTR   R15,R15              ERROR MESSAGE OUTPUT?               01990000
         BZ    EXIT8N               YES, BRANCH                         02000000
         CVD   R15,DOUBLE                                               02010000
         MVI   MTLEN,4                                                  02020000
         MVC   INSERT#1(4),=X'40202120'                                 02030000
         ED    INSERT#1(4),DOUBLE+6                                     02040000
         MVI   INSERT#1,C'='                                            02050000
         LA    R1,L834$1                                                02060000
         B     EXIT8M                                                   02070000
         SPACE 1                                                        02080000
PARSERR  SR    R3,R3                RETURN AT OFFSET 0                  02090000
         SPACE 1                                                        02100000
PARSEOK  BAS   R2,FREEPDL           FREE PARSE STORAGE                  02110000
         L     R8,R8PARSE           ORIGINAL BASE REGISTER              02120000
         L     R14,R14PARSE         EXIT BASE ADDRESS                   02130000
         B     0(R3,R14)            EXIT FROM PARSE AT +0 OR +4         02140000
         SPACE 2                                                        02150000
PARSATTN BAS   R2,FREEPDL           FREE PARSE STORAGE                  02160000
         B     NEWCMD                                                   02170000
         SPACE 2                                                        02180000
*                                                                       02190000
*        PARSE CLEANUP ROUTINE                                          02200000
*                                                                       02210000
         SPACE 1                                                        02220000
FREEPDL  IKJRLSA ADDRANSR            RELEASE THE STORAGE                02230000
         SPACE 1                                                        02240000
         XC    ADDRANSR,ADDRANSR                                        02250000
         BR    R2                                                       02260000
         SPACE 3                                                        02270000
*                                                                       02280000
*        ROUTINE TO CONVERT HEXADECIMAL INPUT TO BINARY                 02290000
*                                                                       02300000
         SPACE 1                                                        02310000
*R5          START OF STRING                                            02320000
*R1          LENGTH OF STRING; WHERE OUTPUT GOES                        02330000
*MSGTEXT1    PROMPTING MESSAGE FOR ANY ERROR                            02340000
*MSGTEXT2+0  LENGTH OF RESULT                                           02350000
*MSGTEXT2+1  MAXIMUM LENGTH OF RESULT                                   02360000
*MSGTEXT2+4  RESULTANT STRING                                           02370000
*R0          RESULT IN BINARY (UP TO FOUR BYTES)                        02380000
*R2          RETURN REGISTER                                            02390000
         SPACE 1                                                        02400000
HEXC     STC   R1,MSGTEXT2+2        ORIGINAL STRING LENGTH              02410000
         LA    R3,1(,R1)            STRING LENGTH +1                    02420000
         N     R3,=F'-2'            NEXT EVEN NUMBER                    02430000
         SR    R15,R15              ZERO                                02440000
         LA    R0,2                 PAIRWISE COUNTER                    02450000
         BCTR  R5,0                 PREPARE FOR THE FIRST ADD           02460000
         CR    R1,R3                EVEN LENGTH ORIGINALLY?             02470000
         SRL   R3,1                                                     02480000
         STC   R3,MSGTEXT2          (STRING LENGTH +1)/2                02490000
         LA    R1,MSGTEXT2+4        WHERE OUTPUT GOES                   02500000
         BNE   HEXC20               NO, BRANCH                          02510000
         SPACE 1                                                        02520000
HEXC10   LA    R5,1(,R5)            NEXT CHARACTER                      02530000
         IC    R15,0(,R5)           GET A BYTE TO CONVERT               02540000
         CLI   0(R5),C'0'                                               02550000
         BL    *+12                 0-9?                                02560000
         CLI   0(R5),C'9'                                               02570000
         BNH   HEXC20               YES, BRANCH                         02580000
         SPACE 1                                                        02590000
         LA    R15,9(,R15)          NO, ADJUST LOW DIGIT 1-5 TO A-F     02600000
         CLI   0(R5),C'A'           BELOW AN A?                         02610000
         BL    HEXC50               YES, INVALID                        02620000
         CLI   0(R5),C'F'           ABOVE AN F?                         02630000
         BH    HEXC50               YES, INVALID                        02640000
         SPACE 1                                                        02650000
HEXC20   SLL   R15,28               SHIFT                               02660000
         SLDL  R14,4                GET A GOOD DIGIT                    02670000
         BCT   R0,HEXC10            DO THE NEXT DIGIT OF A PAIR         02680000
         LA    R0,2                 PAIRWISE COUNTER                    02690000
         STC   R14,0(,R1)           SAVE AN OUTPUT CHARACTER            02700000
         LA    R1,1(,R1)            ANOTHER OUTPUT CHARACTER            02710000
         BCT   R3,HEXC10            DO ALL DIGITS                       02720000
         SPACE 2                                                        02730000
         CLC   MSGTEXT2(1),MSGTEXT2+1  TOO MANY DIGITS?                 02740000
         BH    HEXC40                  YES, INVALID                     02750000
         ICM   R0,B'1111',MSGTEXT2+4   RESULT REGISTER                  02760000
         CLI   MSGTEXT2,3              LENGTH:3                         02770000
         BH    4(R2)                     ABOVE, DONE                    02780000
         SRL   R0,8                                                     02790000
         BE    4(R2)                     EQUAL, RETURN                  02800000
         SRL   R0,8                                                     02810000
         CLI   MSGTEXT2,1              LENGTH:1                         02820000
         BH    4(R2)                     ABOVE, DONE                    02830000
         SRL   R0,8                                                     02840000
         B     4(R2)                     EQUAL, RETURN                  02850000
         SPACE 3                                                        02860000
HEXC40   M$MSG L840                 STRING IS TOO LONG                  02870000
         B     HEXC60                                                   02880000
         SPACE 1                                                        02890000
HEXC50   M$MSG L841                 INVALID HEXADECIMAL DIGITS          02900000
         SPACE 1                                                        02910000
HEXC60  M$PUTGT MSGTEXT1,ATTN=0(R2) SECOND PART OF MESSAGE              02920000
         L     R5,ADDRCBUF          ENTERED DATA                        02930000
         LH    R1,0(,R5)            LENGTH OF STRING                    02940000
         LA    R5,4(,R5)            START OF DATA IN THE STRING         02950000
         SH    R1,=H'5'             VALID MACHINE LENGTH?               02960000
         LA    R3,0(R5,R1)          LAST BYTE OF INPUT STRING           02970000
         BZ    HEXC90               MAYBE, CHECK FURTHER                02980000
         BNP   HEXC60               NO, NULL STRING -- PROMPT AGAIN     02990000
         SPACE 1                                                        03000000
HEXC70   CLI   0(R3),X'40'          SCAN                                03010000
         BNE   HEXC80                   BACKWARDS                       03020000
         BCTR  R3,0                              FOR A                  03030000
         BCT   R1,HEXC70                               NON-BLANK        03040000
         B     HEXC90               POSSIBLE STRING -- CHECK            03050000
         SPACE 1                                                        03060000
HEXC80   CLI   0(R5),X'40'          SCAN                                03070000
         BNE   HEXC90                   FORWARDS                        03080000
         LA    R5,1(,R5)                        FOR A                   03090000
         BCT   R1,HEXC80                              NON-BLANK         03100000
         SPACE 1                                                        03110000
HEXC90   CLI   0(R5),X'40'          REAL STRING?                        03120000
         BE    HEXC60               NO, PROMPT AGAIN                    03130000
         MVI   MSGTEXT2+4,X'40'     BLANKS FOR                          03140000
         MVC   MSGTEXT2+5(40),MSGTEXT2+4      UPPER-CASING INPUTS       03150000
         OC    0(*-*,R5),MSGTEXT2+4 <<EXECUTED>>                        03160000
         EX    R1,*-6               UPPER-CASE THE INPUT DATA           03170000
         LA    R1,1(,R1)            ACTUAL STRING LENGTH                03180000
         B     HEXC                 PARSE THIS NEW STRING               03190000
         SPACE 2                                                        03200000
PACKMAX  LH    R15,4(,R1)             NUMBER OF DIGITS                  03210000
         S     R15,=F'1'              ANY CODED?                        03220000
         BM    4(R14)                 NO, RETURN AT +4                  03230000
         L     R1,0(,R1)              POINT TO INPUT STRING             03240000
         EX    R15,PACKNUMB           PACK ALL THE DIGITS               03250000
         CVB   R1,DOUBLE              CONVERT TO BINARY                 03260000
         BR    R14                    RETURN AT +0                      03270000
PACKNUMB PACK  DOUBLE(8),0(*-*,R1)    <<EXECUTED>>                      03280000
         SPACE 1                                                        03290099
CHKTHEN  DS    0H                                             DRK JAN18 03300099
         ICM   R1,B'1111',#ACTIONT    THEN ACTION                       03310099
         BZ    CHKELSE                NO                                03320099
         CLC   0(8,R1),MEMLI$T        MEMLIST COMMAND                   03330099
         BE    CHKRESET               YES                               03340099
         BR    R14                    NO, RETURN                        03350099
CHKELSE  DS    0H                                             DRK JAN18 03360099
         ICM   R1,B'1111',#ACTIONE    ELSE ACTION                       03370099
         BZR   R14                    NO                                03380099
         CLC   0(8,R1),MEMLI$T        MEMLIST COMMAND                   03390099
         BE    CHKRESET               YES                               03400099
         BR    R14                    NO, RETURN                        03410099
CHKRESET DS    0H                                             DRK JAN18 03420099
         TM    #ACTIONT,X'80'         NEWML                             03430099
         BO    SETRESET               YES                               03440099
         TM    #ACTIONE,X'80'         NEWML                             03450099
         BO    SETRESET               YES                               03460099
         TM    FLAGSZZ,ML#RES         MEML RESET TOGGLE ON?             03470099
         BNOR  R14                    NO                                03480099
SETRESET DS    0H                                             DRK JAN18 03490099
         OI    SPFLAG3,SPFCHN         YES, SIGNAL ISPMODE               03500099
         NI    #ACTIONT,255-X'80'     TURN OFF NEWML IF ON              03510099
         NI    #ACTIONE,255-X'80'     TURN OFF NEWML IF ON              03520099
         BR    R14                    RETURN                            03530099
MEMLI$T  DC    CL8'MEMLIST'                                             03540099
         SPACE 3                                                        03550000
PARSEINN CSECT                                                          03560000
         USING PDLAMB,R6                                      DRK OCT12 03570099
         USING *,R4                                                     03580099
ZAMB     MVC   #AMBLOUT(1),AMBLOUT+1  SAVE XREF/BOTH                    03590099
         B     PARSPOST                                                 03600099
         SPACE 2                                                        03610099
         USING PDLATTR,R6                                               03620000
         USING *,R4                                                     03630000
ZATTRIB  MVC   #ALIAOPT(1),INFOALIA+1     SAVE ALIASINFO/NOALIAS/SHORT  03640000
         MVC   #LKEDOPT(1),INFOLKED+1     SAVE LKEDDATE/NOLKEDDATE      03650000
         MVC   #RLDERR(1),LKEDRLDF+1      SAVE RLDFIX/NORLDFIX          03660000
         MVC   #UNALIAS(1),LKEDUNAL+1     SAVE UNALIAS                  03670000
         MVC   #ADDSTAT(1),LKEDNONE+1     SAVE NONE/ADDSTAT             03680000
         MVC   #EXTEND(1),LKEDEXT+1       SAVE NOEXTEND/EXTEND          03690000
         MVC   #LONGOPT(1),SPFLONG+1      SAVE LONG                     03700000
         SPACE 1                                                        03710000
         CLI   LKEDNONE+1,X'01'           NONE ATTRIBUTE USED?          03720000
         BNE   ZATTR00                    NO, BRANCH                    03730000
         TM    FLAGSCC,RECFMU             LOAD MODULE?                  03740000
         BNO   ZATTR00                    NO, BRANCH                    03750000
         MVI   #ADDSTAT,0                 CLEAR NONE/ADDSTAT FOR LOAD   03760000
         MVI   #AUTHOPT,2                 SIMULATE "NOAUTH"             03770000
         MVI   #PAGEOPT,2                 SIMULATE "NOPAGE"             03780000
         MVI   #RMODE,1                   SIMULATE "RMODE24"            03790000
         MVI   #AMODE,1                   SIMULATE "AMODE24"            03800000
         MVI   #SSIOPT,2                  SIMULATE "NOSSI"              03810000
         OI    #ATTRNO,ATTRREUS+ATTRRENT+ATTRLOAD  "NO" REUS/RENT/LOAD  03820000
         OI    #ATTRNO+1,ATTRREFR+ATTRNE  "NOREFR" AND "EDIT"           03830000
         OI    #ATTRYES,ATTREXEC          "EXEC"                        03840000
         OI    #ATTRYES+1,ATTRNODC        "NODC"                        03850000
         SPACE 2                                                        03860000
ZATTR00  LA    R1,ATTRVER               VER(NUMBER)                     03870000
         BAS   R14,PACKMAX              ANY RESULT?                     03880000
         B     *+8                      YES, BRANCH                     03890000
         B     ZATTR02                  NO, BRANCH                      03900000
         OI    #ATTROPT,X'40'           SET A FLAG                      03910000
         STC   R1,#ATTRVER              SAVE RESULT                     03920000
         SPACE 2                                                        03930000
ZATTR02  LA    R1,ATTRMOD               MOD(NUMBER)                     03940000
         BAS   R14,PACKMAX              ANY RESULT?                     03950000
         B     *+8                      YES, BRANCH                     03960000
         B     ZATTR04                  NO, BRANCH                      03970000
         OI    #ATTROPT,X'20'           SET A FLAG                      03980000
         STC   R1,#ATTRMOD              SAVE RESULT                     03990000
         SPACE 2                                                        04000000
ZATTR04  MVC   #USERTXT(8),BLANKS       BLANK THE USERID AREA           04010000
         LH    R15,ATTRUSER+4           LENGTH OF STRING                04020000
         S     R15,=F'1'                ANY STRING?                     04030000
         BM    ZATTR06                  NO, BRANCH                      04040000
         OI    #ATTROPT,X'80'           SET A FLAG FOR LATER            04050000
         L     R1,ATTRUSER              ADDRESS OF ENTRY STRING         04060000
         MVC   #USERTXT(*-*),0(R1)      <<EXECUTED>>                    04070000
         EX    R15,*-6                  SAVE THE STRING FOR LATER       04080000
         SPACE 2                                                        04090000
ZATTR06  LA    R1,ATTRCRE               CREATED(DATE)         DRK FEB01 04100000
         BAS   R14,PACKMAX              ANY RESULT?           DRK FEB01 04110000
         B     *+8                      YES, BRANCH           DRK FEB01 04120000
         B     ZATTR061                 NO, BRANCH            DRK FEB01 04130000
         OI    #ATTROPT,X'10'           SET A FLAG            DRK FEB01 04140000
         MVC   #IFCREIF(3),DOUBLE+5     SAVE RESULT           DRK FEB01 04150000
         SPACE 1                                              DRK FEB01 04160000
ZATTR061 LA    R1,ATTRCHG               MODIFIED(DATE)        DRK FEB01 04170000
         BAS   R14,PACKMAX              ANY RESULT?           DRK FEB01 04180000
         B     *+8                      YES, BRANCH           DRK FEB01 04190000
         B     ZATTR062                 NO, BRANCH            DRK FEB01 04200000
         OI    #ATTROPT,X'08'           SET A FLAG            DRK FEB01 04210000
         MVC   #IFMODIF(3),DOUBLE+5     SAVE RESULT           DRK FEB01 04220000
         SPACE 1                                              DRK FEB01 04230000
ZATTR062 LA    R1,ATTRTIM               TIME(HHMM)            DRK FEB01 04240000
         BAS   R14,PACKMAX              ANY RESULT?           DRK FEB01 04250000
         B     *+8                      YES, BRANCH           DRK FEB01 04260000
         B     ZATTR063                 NO, BRANCH            DRK FEB01 04270000
         OI    #ATTROPT,X'04'           SET A FLAG            DRK FEB01 04280000
         MVO   DOUBLE+5(3),DOUBLE+5(3)  SHIFT LEFT            DRK FEB01 04290000
         MVC   #ATTRTIM(2),DOUBLE+5     SAVE RESULT           DRK FEB01 04300000
         SPACE 2                                              DRK FEB01 04310000
ZATTR063 LA    R1,ATTRSEC               SEC(SS)               DRK FEB01 04320000
         BAS   R14,PACKMAX              ANY RESULT?           DRK FEB01 04330000
         B     *+8                      YES, BRANCH           DRK FEB01 04340000
         B     ZATTR08                  NO, BRANCH            DRK FEB01 04350000
         OI    #ATTROPT,X'02'           SET A FLAG            DRK FEB01 04360000
         MVO   DOUBLE+6(2),DOUBLE+6(2)  SHIFT LEFT            DRK FEB01 04370000
         MVC   #ATTRSEC(1),DOUBLE+6     SAVE RESULT           DRK FEB01 04380000
         SPACE 2                                              DRK FEB01 04390000
ZATTR08  TM    FLAGSCC,RECFMU             LOAD MODULE?                  04400000
         BO    ZATTR10                    YES, BRANCH                   04410000
         CLI   #ADDSTAT,1                 NONE REQUESTED?               04420000
         BNE   ZATTR10                    NO, BRANCH                    04430000
         OI    FLAGSII,FSINGLE            YES, FORCE SINGLE BUFFERING   04440000
         SPACE 2                                                        04450000
ZATTR10  ICM   R1,B'0001',LKEDAUTH+1    AUTH/NOAUTH                     04460000
         BZ    *+8                                                      04470000
         STCM  R1,B'0001',#AUTHOPT                                      04480000
         ICM   R1,B'0001',LKEDPAGE+1    PAGE/NOPAGE                     04490000
         BZ    *+8                                                      04500000
         STCM  R1,B'0001',#PAGEOPT                                      04510000
         ICM   R1,B'0001',LKEDRMOD+1    RMODE24/RMODEANY                04520000
         BZ    *+8                                                      04530000
         STCM  R1,B'0001',#RMODE                                        04540000
         ICM   R1,B'0001',LKEDAMOD+1    AMODE24/AMODE31/AMODEANY/..64   04550000
         BZ    *+8                                                      04560000
         STCM  R1,B'0001',#AMODE                                        04570000
         ICM   R1,B'0001',LKEDSSIK+1    SSI/NOSSI                       04580000
         BZ    *+8                                                      04590000
         STCM  R1,B'0001',#SSIOPT                                       04600000
         SPACE 2                                                        04610000
ZATTR30  CLI   LKEDREUS+1,X'01'       REUSABLE ATTRIBUTE STATUS:        04620000
         BL    ZATTR34                  NONE, BRANCH                    04630000
         BH    ZATTR32                  "NO" FORM, BRANCH               04640000
         OI    #ATTRYES,ATTRREUS        "REUS"                          04650000
         NI    #ATTRNO,FF-ATTRREUS      MAKE SURE NEGATIVE IS OFF       04660000
         B     ZATTR34                                                  04670000
ZATTR32  OI    #ATTRNO,ATTRREUS         "NOREUS"                        04680000
         SPACE 1                                                        04690000
ZATTR34  CLI   LKEDREFR+1,X'01'       REFRESHABLE ATTRIBUTE STATUS:     04700000
         BL    ZATTR40                  NONE, BRANCH                    04710000
         BH    ZATTR36                  "NO" FORM, BRANCH               04720000
         OI    #ATTRYES+1,ATTRREFR      "REFR"                          04730000
         NI    #ATTRNO+1,FF-ATTRREFR    MAKE SURE NEGATIVE IS OFF       04740000
         B     ZATTR40                                                  04750000
ZATTR36  OI    #ATTRNO+1,ATTRREFR       "NOREFR"                        04760000
         SPACE 1                                                        04770000
ZATTR40  CLI   LKEDRENT+1,X'01'       REENTRANT ATTRIBUTE STATUS:       04780000
         BL    ZATTR44                  NONE, BRANCH                    04790000
         BH    ZATTR42                  "NO" FORM, BRANCH               04800000
         OI    #ATTRYES,ATTRRENT        "RENT"                          04810000
         NI    #ATTRNO,FF-ATTRRENT      MAKE SURE NEGATIVE IS OFF       04820000
         B     ZATTR44                                                  04830000
ZATTR42  OI    #ATTRNO,ATTRRENT         "NORENT"                        04840000
         SPACE 1                                                        04850000
ZATTR44  CLI   LKEDEXEC+1,X'01'       EXECUTABLE ATTRIBUTE STATUS:      04860000
         BL    ZATTR50                  NONE, BRANCH                    04870000
         BH    ZATTR46                  "NO" FORM, BRANCH               04880000
         OI    #ATTRYES,ATTREXEC        "EXEC"                          04890000
         NI    #ATTRNO,FF-ATTREXEC      MAKE SURE NEGATIVE IS OFF       04900000
         B     ZATTR50                                                  04910000
ZATTR46  OI    #ATTRNO,ATTREXEC         "NOEXEC"                        04920000
         SPACE 1                                                        04930000
ZATTR50  CLI   LKEDLOAD+1,X'01'       LOADABLE ATTRIBUTE STATUS:        04940000
         BL    ZATTR54                  NONE, BRANCH                    04950000
         BH    ZATTR52                  "NO" FORM, BRANCH               04960000
         OI    #ATTRYES,ATTRLOAD        "LOAD"                          04970000
         NI    #ATTRNO,FF-ATTRLOAD      MAKE SURE NOLOAD IS OFF         04980000
         B     ZATTR54                                                  04990000
ZATTR52  OI    #ATTRNO,ATTRLOAD         "NOLOAD"                        05000000
         SPACE 1                                                        05010000
ZATTR54  CLI   LKEDEDIT+1,X'01'       NOT EDITABLE ATTRIBUTE STATUS:    05020000
         BL    ZATTR60                  NONE, BRANCH                    05030000
         BH    ZATTR56                  "NO" FORM, BRANCH               05040000
         OI    #ATTRNO+1,ATTRNE        "EDIT"  -- BIT MUST BE REVERSED  05050000
         B     ZATTR60                                                  05060000
ZATTR56  OI    #ATTRYES+1,ATTRNE        "NOEDIT"                        05070000
         NI    #ATTRNO+1,FF-ATTRNE     MAKE SURE EDIT IS OFF            05080000
         SPACE 1                                                        05090000
ZATTR60  CLI   LKEDDC+1,X'01'         DC ATTRIBUTE STATUS:              05100000
         BL    ZATTR70                  NONE, BRANCH                    05110000
         BH    ZATTR62                  "NO" FORM, BRANCH               05120000
         OI    #ATTRNO+1,ATTRNODC       "DC"                            05130000
         NI    #ATTRYES+1,FF-ATTRNODC   MAKE SURE NODC IS OFF           05140000
         B     ZATTR70                                                  05150000
ZATTR62  OI    #ATTRYES+1,ATTRNODC      "NODC"                          05160000
         SPACE 1                                                        05170000
ZATTR70  TM    LKEDSSI+6,X'80'      STRING CODED?                       05180000
         BNO   ZATTR80              NO, DONE                            05190000
         L     R5,LKEDSSI           NEW STRING ADDRESS                  05200000
         LH    R1,LKEDSSI+4         LENGTH OF STRING                    05210000
         LTR   R1,R1                NULL STRING CODED?                  05220000
         BNP   ZATTR80              YES, DONE                           05230000
         MVI   MSGTEXT2+1,4         MAXIMUM OF 4 DIGITS                 05240000
         MVC   MSGTEXT1,PDS385A     SSI MESSAGE                         05250000
         BAS   R2,HEXC              CONVERT TO BINARY                   05260000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        05270000
         STCM  R0,B'1111',#SSITEXT  SAVE THE RESULTING TTR              05280000
         SPACE 2                                                        05290000
ZATTR80  MVC   #MODTXT(8),BLANKS      BLANK THE MODULE AREA             05300000
         LH    R15,AENTRYS+4          LENGTH OF BLOCK/DUMP STRING       05310000
         S     R15,=F'1'              ANY STRING?                       05320000
         BM    ZATTR99                NO, BRANCH                        05330000
         MVI   #OPTOPT,X'FF'          SET A FLAG FOR LATER              05340000
         L     R1,AENTRYS             ADDRESS OF ENTRY STRING           05350000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      05360000
         EX    R15,*-6                SAVE THE STRING FOR LATER         05370000
         SPACE 2                                                        05380000
*ZATTR99 OC    #ZAPOPT(14),#ZAPOPT    ANY LINKAGE EDITOR ATTRIBUTES?    05390099
ZATTR99  OC    #ATTRYES(8),#ATTRYES   ANY LINKAGE EDITOR ATTR? GP DEC17 05400099
         BZ    *+8                    NO, BRANCH                        05410000
         MVI   #OPTOPT,FF             YES, SET A FLAG FOR LATER         05420000
         CLI   #SSIOPT,0              ANY SSI CHANGE?                   05430000
         BE    *+8                    NO, BRANCH                        05440000
         OI    #OPTOPT,X'F0'          YES, SET A FLAG FOR LATER         05450000
         CLI   #UNALIAS,0             ANY UNALIAS?                      05460000
         BE    *+8                    NO, BRANCH                        05470000
         OI    #OPTOPT,X'F0'          YES, SET A FLAG FOR LATER         05480000
         CLI   #ADDSTAT,0             ANY NONE/ADDSTAT?                 05490000
         BE    *+8                    NO, BRANCH                        05500000
         OI    #OPTOPT,X'F0'          YES, SET A FLAG FOR LATER         05510000
         CLI   #EXTEND,0              ANY NOEXTEND/EXTEND?    DRK AUG09 05520000
         BE    *+8                    NO, BRANCH              DRK AUG09 05530000
         OI    #OPTOPT,X'F0'          YES, SET A FLAG FOR LATER       " 05540000
         XC    #ATTRNO(2),=F'-1'      INVERT THE #ATTRNO BITS           05550000
         B     PARSPOST                                                 05560000
         SPACE 2                                                        05570099
         USING PDLCOB,R6                                      DRK NOV07 05580000
         USING *,R4                                                     05590000
ZCOB     MVC   #COBALI(1),COBALIAS+1  SAVE ALIAS/NOALIAS                05600000
         MVC   #COBLIST(1),COBLIST+1  SAVE LIST/NOLIST                  05610000
         MVC   #COBSUMM(1),COBSUMM+1  SAVE SUMMARY/NOSUMMARY            05620000
         B     PARSPOST                                                 05630000
         SPACE 2                                                        05640000
         USING PDLCOMPA,R6                                              05650000
         USING *,R4                                                     05660000
ZCOMPARE MVC   MSGDS1(64),BLANK128  CLEAR THE DATA SET NAME AREA        05670099
         LH    R2,PCLCAR1+4         LENGTH OF STRING                    05680000
         STH   R2,MSGDS1+62         SAVE LENGTH USED                    05690000
         BCTR  R2,0                 MACHINE LENGTH                      05700000
         L     R1,PCLCAR1           NEW STRING ADDRESS                  05710000
         MVC   MSGDS1(*-*),0(R1)    <<EXECUTED>>                        05720000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          05730000
         SPACE 1                                                        05740000
         MVC   MSGDS2(64),BLANK128  CLEAR THE DATA SET NAME AREA        05750000
         LH    R2,PCLCAR2+4         LENGTH OF STRING                    05760000
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    05770000
         BCTR  R2,0                 MACHINE LENGTH                      05780000
         L     R1,PCLCAR2           NEW STRING ADDRESS                  05790000
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        05800000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          05810000
         SPACE 1                                                        05820000
         TM    PCLCOSTR+6,X'80'     ANY STRING CODED?                   05830000
         BNO   PARSPOST             NO, BRANCH                          05840000
         LH    R2,PCLCOSTR+4        LENGTH OF STRING                    05850000
         CH    R2,=H'100'           LENGTH(STRING)>=100?                05860000
         BL    *+8                  NO, BRANCH                          05870000
         LH    R2,=H'100'           YES, USE 100 AS A MAXIMUM LENGTH    05880000
         STH   R2,#COMMDSZ          SAVE LENGTH USED                    05890000
         BCTR  R2,0                 MACHINE LENGTH                      05900000
         MVC   MSGLINE(100),BLANK128  BLANK THE TEXT AREA               05910000
         L     R1,PCLCOSTR          NEW STRING ADDRESS                  05920000
         MVC   MSGLINE(*-*),0(R1)   <<EXECUTED>>                        05930000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          05940000
         B     PARSPOST                                                 05950000
         SPACE 2                                                        05960000
         USING PDLCOMPR,R6                                              05970000
         USING *,R4                                                     05980000
ZCOMPRES MVC   #CMXFLAG(1),CMXLIST+1     SAVE SUMMARY/LIST/NOLIST       05990000
         MVC   #CMXSHR(1),CMXSHARE+1     SAVE SHR                       06000000
         B     PARSPOST                                                 06010000
         SPACE 2                                                        06020000
         USING PDLCONDE,R6                                    DRK APR08 06030000
         USING *,R4                                           DRK APR08 06040000
ZCONDEND MVI   #CONDLVL,C'W'             DEFAULT TO WARN MSG  DRK APR08 06050000
         CLI   CONDLVL+1,X'02'           ERRORS?              DRK APR08 06060000
         BNE   *+4+4                     NO                   DRK APR08 06070000
         MVI   #CONDLVL,C'E'             YES, END ON ERROR MSGDRK APR08 06080000
         CLI   CONDLVL+1,X'03'           TURN OFF CONDEND?    DRK APR08 06090000
         BNE   *+4+4                     NO                   DRK APR08 06100000
         MVI   #CONDLVL,X'00'            YES, DO NOT END      DRK APR08 06110000
         CLI   CONDRC+1,X'01'            RC=4 WARN, RC=8 ERRORDRK APR08 06120000
         BNE   *+4+4                     NO                   DRK APR08 06130000
         MVI   #CONDRC,C'Y'              YES                  DRK APR08 06140000
         B     PARSPOST                                       DRK APR08 06150000
         SPACE 2                                                        06160000
         USING PDLCONT,R6                                               06170000
         USING *,R4                                                     06180000
ZCONTROL MVC   #OUT+0(1),PALINCON+1                                     06190000
         MVC   #OUT+1(1),PTRANCON+1                                     06200000
         MVC   #OUT+2(1),PLKEDCON+1                                     06210000
         MVC   #OUT+3(1),PPROMCON+1                                     06220000
         MVC   #OUT+4(1),PRECVCON+1                                     06230000
         MVC   #OUT+5(1),PDOUBCON+1                                     06240000
         MVC   #OUT+7(1),PIMMCON+1                                      06250000
         CLI   PIMMCON+1,15               ISPLOG ALL CMDS?    DRK APR16 06260099
         BNE   ZCONT007                   NO                          " 06270099
         XI    FLAGSZZ,LOG#CMDS           YES, TOGGLE SWITCH          " 06280099
         SPACE 1                                                        06290099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK MAY16 06300099
         MVC   INSERT#1(3),SCLOGON        ASSUME LOGGING ON   DRK MAY16 06310099
         TM    FLAGSZZ,LOG#CMDS           ISPLOG ON?          DRK MAY16 06320099
         BO    ZCONT005                                       DRK MAY16 06330099
         MVC   INSERT#1(3),SCLOGOFF       LOGGING OFF         DRK MAY16 06340099
ZCONT005 DS    0H                                             DRK MAY16 06350099
         M$MSG L195$1                                         DRK MAY16 06360099
         SPACE 1                                                        06370099
ZCONT007 DS    0H                                             DRK MAY16 06380099
         CLI   PIMMCON+1,16               MBR VALIDATION?     DRK NOV16 06390099
         BNE   ZCONT009                   NO                          " 06400099
         XI    FLAGSZZ,MBR#VAL            YES, TOGGLE SWITCH          " 06410099
         SPACE 1                                                        06420099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK NOV16 06430099
         MVC   INSERT#1(3),MVALON         ASSUME VALIDATION   DRK NOV16 06440099
         TM    FLAGSZZ,MBR#VAL            MBR VALIDATION ON?  DRK NOV16 06450099
         BNO   ZCONT008                   YES                 DRK NOV16 06460099
         MVC   INSERT#1(3),MVALOFF        VALIDATION OFF      DRK NOV16 06470099
ZCONT008 DS    0H                                             DRK NOV16 06480099
         M$MSG L196$1                                         DRK NOV16 06490099
         SPACE 1                                                        06500099
ZCONT009 DS    0H                                             DRK NOV16 06510099
         CLI   PIMMCON+1,17               MEMLIST RESET?      DRK JAN18 06520099
         BNE   ZCONT09B                   NO                  DRK JAN18 06530099
         XI    FLAGSZZ,ML#RES             YES, TOGGLE SWITCH  DRK JAN18 06540099
         SPACE 1                                                        06550099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK JAN18 06560099
         MVC   INSERT#1(3),MLRESON        ASSUME RESET ON     DRK JAN18 06570099
         TM    FLAGSZZ,ML#RES             MEMLIST RESET ON?   DRK JAN18 06580099
         BO    ZCONT09A                   YES                 DRK JAN18 06590099
         MVC   INSERT#1(3),MLRESOFF       MEMLIST RESET OFF   DRK JAN18 06600099
ZCONT09A DS    0H                                             DRK JAN18 06610099
         M$MSG L197$1                                         DRK JAN18 06620099
         SPACE 1                                                        06630099
ZCONT09B DS    0H                                             DRK JAN18 06640099
* LIST TOGGLE SWITCHES                                                  06650099
         CLI   PIMMCON+1,18               LIST TOGGLES?       DRK JAN18 06660099
         BNE   ZCONT09C                   NO                  DRK JAN18 06670099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK JAN18 06680099
         MVC   INSERT#1(3),SCLOGON        ASSUME LOGGING ON   DRK JAN18 06690099
         TM    FLAGSZZ,LOG#CMDS           ISPLOG ON?          DRK JAN18 06700099
         BO    *+4+6                                          DRK JAN18 06710099
         MVC   INSERT#1(3),SCLOGOFF       LOGGING OFF         DRK JAN18 06720099
         M$MSG L195$1                                         DRK JAN18 06730099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK JAN18 06740099
         MVC   INSERT#1(3),MVALON         ASSUME VALIDATION   DRK JAN18 06750099
         TM    FLAGSZZ,MBR#VAL            MBR VALIDATION ON?  DRK JAN18 06760099
         BNO   *+4+6                      YES                 DRK JAN18 06770099
         MVC   INSERT#1(3),MVALOFF        VALIDATION OFF      DRK JAN18 06780099
         M$MSG L196$1                                         DRK JAN18 06790099
         MVI   MTLEN,3                    LENGTH OF INSERT    DRK JAN18 06800099
         MVC   INSERT#1(3),MLRESON        ASSUME RESET ON     DRK JAN18 06810099
         TM    FLAGSZZ,ML#RES             MEMLIST RESET ON?   DRK JAN18 06820099
         BO    *+4+6                      YES                 DRK JAN18 06830099
         MVC   INSERT#1(3),MLRESOFF       MEMLIST RESET OFF   DRK JAN18 06840099
         M$MSG L197$1                                         DRK JAN18 06850099
ZCONT09C DS    0H                                             DRK JAN18 06860099
         CLI   PIMMCON+1,19               19?                           06870099
         BNE   ZCONT09D                   NO                            06880099
         L     R1,MSGENTDA                M$TX 'PDS300A ...'            06890099
         LA    R1,25+7(,R1)               PDS300A ENTER OPTION -- DSN=  06900099
         AH    R1,DSNLEN                                                06910099
         MVC   9(6,R1),=C'MVSRES'         ,VOL=SER=                     06920099
ZCONT09D DS    0H                                                       06930099
         MVC   #OUT+10(1),CLOGTYPE+1      SYSOUT/NOSYSOUT/DSNAME/NODSN  06940099
         MVC   #OUT+11(1),CLOGDISP+1      OLD/SHR/MOD/NEW               06950000
         MVC   #OUT+12(1),CLOGFORM+1      FORM/NOFORM                   06960000
         MVC   #OUT+13(1),CLOGDEST+1      DEST/NODEST                   06970000
         MVC   #OUT+30(80),BLANK128       CLEAR THE OPERANDS            06980000
         LH    R15,CDESTT+4               LENGTH OF STRING              06990000
         STH   R15,#OUT+14                14,15                         07000000
         S     R15,=F'1'                  ANY DATA?                     07010000
         BM    ZCONT010                   NO, BRANCH                    07020000
         L     R1,CDESTT                                                07030000
         MVC   #OUT+30(*-*),0(R1)         <<EXECUTED>> 30-37            07040000
         EX    R15,*-6                    MOVE IT IN                    07050000
         SPACE 1                                                        07060000
ZCONT010 LH    R15,CFORMT+4               LENGTH OF STRING              07070000
         STH   R15,#OUT+16                16,17                         07080000
         S     R15,=F'1'                  ANY DATA?                     07090000
         BM    ZCONT020                   NO, BRANCH                    07100000
         L     R1,CFORMT                                                07110000
         MVC   #OUT+38(*-*),0(R1)         <<EXECUTED>> 38-41            07120000
         EX    R15,*-6                    MOVE IT IN                    07130000
         SPACE 1                                                        07140000
ZCONT020 LH    R15,CSYSOUTT+4             LENGTH OF STRING              07150000
         S     R15,=F'1'                  ANY DATA?                     07160000
         BM    ZCONT030                   NO, BRANCH                    07170000
         L     R1,CSYSOUTT                                              07180000
         MVC   CONTSYS(1),0(R1)           <<EXECUTED>>                  07190000
         SPACE 1                                                        07200000
ZCONT030 L     R15,CDSNAMET               ADDRESS OF DSNAME             07210000
         LH    R14,CDSNAMET+4             LENGTH OF DSNAME              07220000
         STH   R14,#OUT+18                18,19                         07230000
         S     R14,=F'1'                  ANY DATA?                     07240000
         BM    ZCONT060                   NO, BRANCH                    07250000
         MVC   #OUT+44(*-*),0(R15)        <<EXECUTED>> 44-87            07260000
         EX    R14,*-6                    MOVE IT IN                    07270000
         SPACE 1                                                        07280000
         TM    CDSNAMET+14,X'80'          ANY MEMBER?                   07290000
         BZ    ZCONT034                   NO, BRANCH                    07300000
         L     R15,CDSNAMET+8             ADDRESS OF DSNAME             07310000
         LH    R14,CDSNAMET+12            LENGTH OF MEMBER              07320000
         STH   R14,#OUT+20                20,21                         07330000
         S     R14,=F'1'                  ANY DATA?                     07340000
         BM    ZCONT060                   NO, BRANCH                    07350000
         MVC   #OUT+88(*-*),0(R15)        <<EXECUTED>> 88-95            07360000
         EX    R14,*-6                    MOVE IT IN                    07370000
         SPACE 1                                                        07380000
ZCONT034 TM    CDSNAMET+22,X'80'          ANY PASSWORD?                 07390000
         BZ    ZCONT060                   NO, BRANCH                    07400000
         L     R15,CDSNAMET+16            ADDRESS OF DSNAME             07410000
         LH    R14,CDSNAMET+20            LENGTH OF MEMBER              07420000
         STH   R14,#OUT+22                22,23                         07430000
         S     R14,=F'1'                  ANY DATA?                     07440000
         BM    ZCONT060                   NO, BRANCH                    07450000
         MVC   #OUT+96(*-*),0(R15)        <<EXECUTED>> 96-103           07460000
         EX    R14,*-6                    MOVE IT IN                    07470000
*                                                                       07480000
ZCONT060 LA    R1,CRETAINA                NUMBER(COUNT)                 07490000
         BAS   R14,PACKMAX                CONVERT TO BINARY             07500000
         STH   R1,INUMSAV                 SAVE RESULT                   07510000
         LH    R1,INUMSAV                 GET RESULT                    07520000
         LA    R2,FIRST4K                                               07530000
         LA    R2,IOBUFN-FIRST4K(,R2)     START OF BUFFER ADDRESSES     07540000
         DROP  R6                                                       07550000
         LTR   R6,R1                      NUMBER OF ELEMENTS=0?         07560000
         BNZ   *+8                        NO, BRANCH                    07570000
         LA    R6,1                       YES, USE 1                    07580000
         CH    R6,=AL2((IOBUFEND-IOBUFN)/32)   TOO MANY ELEMENTS?       07590000
         BL    *+8                             NO, BRANCH               07600000
         LH    R6,=AL2((IOBUFEND-IOBUFN)/32)   YES, USE THE MAX         07610000
         STH   R6,INUMSAV                 SET RESULT IN LIMITS          07620000
*                                                                       07630000
ZCONT062 ICM   R1,B'1111',0(R2)           ANY BUFFER ADDRESS?           07640000
         BNZ   ZCONT066                   YES, BRANCH                   07650000
         L     R0,=F'58786'               MAX 3390 TRACK LEN  DRK FEB00 07660000
         TM    FLAGSFF,FSPFCALL+FSPFDIAL  SPF INITIALIZED?              07670000
         BM    ZCONT064                   YES, BRANCH                   07680000
         AIF   ('&CISP' NE 'ISPFV2').NSPFCNT                            07690000
         TM    FLAGSFF,FSPFOPT6           CALLED FROM OPTION 6?         07700000
         BO    ZCONT064                   YES, BRANCH                   07710000
.NSPFCNT ANOP                                                           07720000
         PRINT GEN                                                      07730000
         GETMAIN RC,LV=(0),SP=23          GET MORE BUFFER STORAGE       07740000
         LTR   R15,R15                    ANY PROBLEM?                  07750000
         BNZ   ZCONT067                   YES, BRANCH                   07760000
         MVI   SUBLIST1,23                MARK FOR LATER RELEASE        07770000
         B     ZCONT065                                                 07780000
ZCONT064 GETMAIN RC,LV=(0),SP=24          GET MORE BUFFER STORAGE       07790000
         LTR   R15,R15                    ANY PROBLEM?                  07800000
         BNZ   ZCONT067                   YES, BRANCH                   07810000
         MVI   SUBLIST2,24                MARK FOR LATER RELEASE        07820000
         PRINT NOGEN                                                    07830099
ZCONT065 STCM  R1,B'1111',0(R2)           UPDATE BUFFER ADDRESS         07840000
ZCONT066 LA    R2,32(,R2)                 NEXT ELEMENT STORAGE          07850000
         BCT   R6,ZCONT062                DO ALL N ELEMENTS             07860000
         B     PARSPOST                                                 07870000
*                                                                       07880000
*        GETMAIN FAILED; UPDATE WITH THE NUMBER OBTAINED                07890000
ZCONT067 SR    R1,R1                      COUNT SUCCESSFUL GETMAINS     07900000
         LA    R2,FIRST4K                                               07910000
         LA    R2,IOBUFN-FIRST4K(,R2)     START OF BUFFER ADDRESSES     07920000
         LH    R6,INUMSAV                 MAXIMUM GETMAINS              07930000
*                                                                       07940000
ZCONT068 ICM   R0,B'1111',0(R2)           ANY BUFFER ADDRESS?           07950000
         BZ    ZCONT069                   NO, QUIT                      07960000
         LA    R1,1(,R1)                  ANOTHER GOOD GETMAIN          07970000
         LA    R2,32(,R2)                 NEXT ELEMENT STORAGE          07980000
         BCT   R6,ZCONT068                DO ALL N ELEMENTS             07990000
ZCONT069 STH   R1,INUMSAV                 UPDATE WITH ACTUAL GETMAINS   08000000
         B     PARSPOST                                                 08010000
         SPACE 2                                                        08020000
         USING PDLCOPY,R6                                               08030000
         USING *,R4                                                     08040000
ZCOPY    MVC   #CMXFLAG(1),COPLIST+1  SAVE SUMMARY/LIST/NOLIST          08050000
         MVC   #CMXSHR(1),COPDISP+1   SAVE SHR/OLD/NEW                  08060000
         MVC   #COPREP(1),COPREPL+1   SAVE REPLACE/NOREPLACE            08070000
         MVC   #COPALI(1),COPALIAS+1  SAVE ALIAS/NOALIAS                08080000
         MVC   #COPNCAL(1),COPCALL+1  SAVE CALL/NOCALL                  08090000
         MVC   #COPTRCY(1),COPTRCYL+1 SAVE TRK/CYL                      08100000
         MVC   #COPEXST(1),COPEXIST+1 SAVE EXIST/NOEXIST/NOBLDL/EXCLUDE 08110000
         MVC   #COPGENS(1),COPGENS+1  SAVE GENS                         08120099
         MVC   #COPTYPE(8),BLANKS     CLEAR DSNTYPE                     08130000
         SPACE 1                                                        08140000
         MVC   MSGDS2(64),BLANK128    CLEAR THE DATA SET NAME AREA      08150000
         LH    R2,COPDSN2+4           LENGTH OF STRING                  08160000
         STH   R2,MSGDS2+62           SAVE LENGTH USED                  08170000
         BCTR  R2,0                   MACHINE LENGTH                    08180000
         L     R1,COPDSN2             NEW STRING ADDRESS                08190000
         MVC   MSGDS2(*-*),0(R1)      <<EXECUTED>>                      08200000
         EX    R2,*-6                 MOVE IN THE STRING                08210000
***TEST  LA    R1,FIRST4K                                               08220000
***TEST  CLC   MSGDS2(2),=C'* '               PREVIOUS DSNAME DESIRED?  08230000
***TEST  BNE   ZCOPY02                        NO, BRANCH                08240000
***TEST  CLI   PMSGDS2-FIRST4K(R1),0          ANY PREVIOUS DSNAME?      08250000
***TEST  BE    ZCOPY10                        NO, ERROR                 08260000
***TEST  MVC   MSGDS2(64),PMSGDS2-FIRST4K(R1) YES, REFRESH              08270000
***PY02  MVC   PMSGDS2-FIRST4K(64,R1),MSGDS2  SAVE CURRENT DSNAME       08280000
         SPACE 1                                                        08290000
ZCOPY10  TM    COPVOL+6,X'80'       ANY NAME REQUESTED?                 08300000
         BNO   ZCOPY20              NO, BRANCH                          08310000
         LH    R15,COPVOL+4         LENGTH OF NAME                      08320000
         S     R15,=F'1'            VALID?                              08330000
         BM    ZCOPY20              NO, BRANCH                          08340000
         MVC   #COPVOL(6),BLANKS    INITIALIZE VOLUME NAME              08350000
         L     R1,COPVOL            ADDRESS OF NAME                     08360000
         MVC   #COPVOL(*-*),0(R1)   <<EXECUTED>>                        08370000
         EX    R15,*-6              MOVE IN THE NAME                    08380000
         SPACE 1                                                        08390000
ZCOPY20  TM    COPAS+6,X'80'        ANY NAME REQUESTED?                 08400000
         BNO   ZCOPY30              NO, BRANCH                          08410000
         LH    R15,COPAS+4          LENGTH OF NAME                      08420000
         STC   R15,#COPTO#          SAVE STRING LENGTH                  08430000
         S     R15,=F'1'            VALID?                              08440000
         BM    ZCOPY30              NO, BRANCH                          08450000
         MVC   #COPTON(8),BLANKS    INITIALIZE TO BLANKS                08460000
         L     R1,COPAS             ADDRESS OF NAME                     08470000
         MVC   #COPTON(*-*),0(R1)   <<EXECUTED>>                        08480000
         EX    R15,*-6              MOVE IN THE NAME                    08490000
         SPACE 1                                                        08500000
ZCOPY30  LA    R1,COPDIRCO          DIR(COUNT)                          08510000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   08520000
         ST    R1,#COPDIR#          SAVE RESULT                         08530000
         SPACE 1                                                        08540000
ZCOPY40  LA    R1,COPSPACE          SPACE(PRIMARY)                      08550000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   08560000
         STH   R1,#COPSPAC          SAVE RESULT                         08570000
         SPACE 1                                                        08580000
ZCOPY50  SR    R1,R1                                                    08590000
         ICM   R1,B'0111',COPSPACE+9  NEXT LIST ITEM PRESENT?           08600000
         BZ    ZCOPY60                NO, BRANCH                        08610000
*        LR    R1,R1                SPACE(,SECONDARY)                   08620000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   08630000
         STH   R1,#COPSPAC+2        SAVE RESULT                         08640000
         SPACE 1                                                        08650000
ZCOPY60  LA    R1,COPCONCA          NUMBER(COUNT)                       08660000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   08670000
         ST    R1,#COPCONC          SAVE RESULT                         08680000
         SPACE 1                                                        08690000
         LA    R1,COPMAX              MAXBLK(COUNT)                     08700000
         BAS   R14,PACKMAX            ANY RESULT?                       08710000
         ST    R1,#REPRBLK            SAVE RESULT                       08720000
         SPACE 1                                                        08730000
         LA    R1,COPMAX2             MAXGENS(COUNT)          DRK MAY18 08740099
         BAS   R14,PACKMAX            ANY RESULT?             DRK MAY18 08750099
         ST    R1,#COPMAXG            SAVE RESULT             DRK MAY18 08760099
         SPACE 1                                                        08770099
         LH    R2,COPTYPET+4          LENGTH OF STRING        DRK MAR07 08780099
         S     R2,=F'1'               ANY DATA?               DRK MAR07 08790099
         BM    ZCOPY70                NO, BRANCH              DRK MAR07 08800099
         L     R1,COPTYPET                                    DRK MAR07 08810099
         MVC   #COPTYPE(*-*),0(R1)    <<EXECUTED>>            DRK MAR07 08820099
         EX    R2,*-6                 MOVE IN THE STRING      DRK MAR07 08830099
ZCOPY70  DS    0H                                             DRK MAR07 08840099
         SPACE 1                                                        08850000
         B     PARSPOST                                                 08860000
         USING PDLCPK,R6                                      DRK JUL07 08870000
         USING *,R4                                                     08880000
ZCPKMAP  LH    R15,CPKVOL+4         LENGTH OF NAME                      08890000
         S     R15,=F'1'            VALID?                              08900000
         BM    ZCPK10               NO, BRANCH                          08910000
         MVC   #CPKVOL(6),VOLALLOC  CURRENT DSN VOLUME                  08920000
         L     R1,CPKVOL            ADDRESS OF NAME                     08930000
         CLI   0(R1),C'*'           ASTERISK                            08940000
         BE    ZCPK10               YES, USE CURRENT                    08950000
         MVC   #CPKVOL(6),BLANKS    NO, INITIALIZE VOLUME NAME          08960000
         L     R1,CPKVOL            ADDRESS OF NAME                     08970000
         MVC   #CPKVOL(*-*),0(R1)   <<EXECUTED>>                        08980000
         EX    R15,*-6              MOVE IN THE NAME                    08990000
         SPACE 1                                                        09000000
ZCPK10   B     PARSPOST                                                 09010000
         SPACE 2                                                        09020000
         USING PDLDELET,R6                                              09030000
         USING *,R4                                                     09040000
ZDELETE  MVC   #DELFLAG(1),PCLDELAL+1                                   09050000
         B     PARSPOST                                                 09060000
         SPACE 2                                                        09070000
         USING PDLDIR,R6                                                09080000
         USING *,R4                                                     09090000
ZDIRENTR MVC   #DIRSHOR(1),PCLSHOR+1       SHORT/LONG                   09100099
         MVC   #DIRSTAT(1),PCLSTAT+1       ISPF/DEBUG         DRK JUN10 09110099
         B     PARSPOST                                                 09120000
         SPACE 2                                                        09130000
         USING PDLDSNA,R6                                               09140000
         USING *,R4                                                     09150000
ZDSNAMES NI    FLAGSJJ,FF-FDSNTSO-FDSNJCL  CLEAR THE FLAGS              09160000
         OC    FLAGSJJ(1),PCLDSN+1         SET THE FALL FLAGS           09170000
         B     PARSPOST                                                 09180000
         SPACE 2                                                        09190000
         USING PDLEDIT,R6                                               09200000
         USING *,R4                                                     09210000
ZEDIT    MVC   #SPFOLD(1),SPFNEWOP+1       SAVE ANY OLD/NEW OPTION      09220000
         CLI   SPFNEWOP+1,X'02'            "OLD"?                       09230000
         BNE   *+8                         NO, BRANCH                   09240000
         OI    ##ADRPC#,@B                 YES, MUST EXIST              09250000
         SPACE 1                                                        09260000
         TM    SPFMACRO+6,X'80'            ANY MACRO NAME?              09270000
         BNO   ZEDIT10                     NO, BRANCH                   09280000
         LH    R15,SPFMACRO+4              LENGTH OF NAME               09290000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        09300000
         BM    ZEDIT10                     NO, BRANCH                   09310000
         MVC   #SPFMACR,BLANKS             INITIALIZE THE MACRO NAME    09320000
         L     R1,SPFMACRO                 MACRO NAME                   09330000
         MVC   #SPFMACR(*-*),0(R1)         <<EXECUTED>>                 09340000
         EX    R15,*-6                     MOVE INTO STORAGE            09350000
         SPACE 1                                                        09360000
ZEDIT10  TM    SPFPRSET+6,X'80'            ANY SETPROF NAME?            09370000
         BNO   ZEDIT20                     NO, BRANCH                   09380000
         LH    R15,SPFPRSET+4              LENGTH OF NAME               09390000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        09400000
         BM    ZEDIT20                     NO, BRANCH                   09410000
         L     R1,SPFPRSET                 PROFILE NAME                 09420000
         MVC   SETPROF(8),BLANKS           INITIALIZE SETPROF           09430000
         CLI   0(R1),C'*'                  NULLIFY PARAMETER?           09440000
         BE    ZEDIT20                     YES, BRANCH                  09450000
         MVC   SETPROF(*-*),0(R1)          <<EXECUTED>>                 09460000
         EX    R15,*-6                     MOVE INTO STORAGE            09470000
         SPACE 1                                                        09480000
ZEDIT20  TM    SPFMCSET+6,X'80'            ANY SETMACRO NAME?           09490000
         BNO   ZEDIT30                     NO, BRANCH                   09500000
         LH    R15,SPFMCSET+4              LENGTH OF NAME               09510000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        09520000
         BM    ZEDIT30                     NO, BRANCH                   09530000
         L     R1,SPFMCSET                 MACRO NAME                   09540000
         MVC   SETMACRO(8),BLANKS          INITIALIZE SETMACRO          09550000
         CLI   0(R1),C'*'                  NULLIFY PARAMETER?           09560000
         BE    ZEDIT30                     YES, BRANCH                  09570000
         MVC   SETMACRO(*-*),0(R1)         <<EXECUTED>>                 09580000
         EX    R15,*-6                     MOVE INTO STORAGE            09590000
         SPACE 1                                                        09600000
ZEDIT30  TM    SPFPROFL+6,X'80'            ANY PROFILE NAME?            09610000
         BNO   PARSPOST                    NO, BRANCH                   09620000
         LH    R15,SPFPROFL+4              LENGTH OF NAME               09630000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        09640000
         BM    PARSPOST                    NO, BRANCH                   09650000
         MVC   #SPFPROF,BLANKS             INITIALIZE WITH BLANKS       09660000
         L     R1,SPFPROFL                 PROFILE NAME                 09670000
         MVC   #SPFPROF(*-*),0(R1)         <<EXECUTED>>                 09680000
         EX    R15,*-6                     MOVE INTO STORAGE            09690000
         B     PARSPOST                                                 09700000
         SPACE 2                                                        09710000
         USING PDLFIND,R6                                               09720000
         USING *,R4                                                     09730000
ZFIND    TM    FINDSTRG+6,X'80'     STRING CODED?                       09740000
         BNO   PARSPOST             NO, ASSUME OK                       09750000
         CLI   FINDINC+1,2          INC1?                               09760000
         BL    ZFINDINC             YES, BRANCH                         09770000
         MVI   #REPINCR+1,1         ASSUME INC2                         09780000
         CLI   FINDINC+1,2          INC2?                               09790000
         BE    ZFINDINC             YES, BRANCH                         09800000
         MVI   #REPINCR+1,3         ASSUME INC4                         09810000
         CLI   FINDINC+1,3          INC4?                               09820000
         BE    ZFINDINC             YES, BRANCH                         09830000
         MVI   #REPINCR+1,7         ASSUME INC8                         09840000
         CLI   FINDINC+1,4          INC8?                               09850000
         BE    ZFINDINC             YES, BRANCH                         09860000
         MVI   #REPINCR+1,15        ASSUME INC16                        09870000
         CLI   FINDINC+1,5          INC16?                              09880000
         BE    ZFINDINC             YES, BRANCH                         09890000
         MVI   #REPINCR+1,79        ASSUME INC80                        09900000
ZFINDINC DS    0H                                                       09910000
         L     R5,FINDSTRG          NEW STRING ADDRESS                  09920000
         LH    R2,FINDSTRG+4        LENGTH OF STRING                    09930000
ZFINTEST LTR   R2,R2                NULL STRING CODED?                  09940000
         BNP   ZFINCHK              YES, CHECK FORMAT                   09950000
         BCTR  R5,0                 BACK UP ONE                         09960000
         OI    0(R5),X'40'          UPPER CASE THE DELIMITER            09970000
         CLI   0(R5),C'X'           POSSIBLE HEX STRING?                09980000
         BNE   ZFINCHAR             NO, BRANCH                          09990000
         MVC   MSGTEXT1(3),L841     BAD HEX STRING MESSAGE              10000000
         LA    R3,1(,R2)            STRING LENGTH +1                    10010000
         N     R3,=F'-2'            NEXT EVEN NUMBER                    10020000
         SR    R15,R15              ZERO                                10030000
         LA    R1,MSGTEXT2+4        WHERE OUTPUT GOES                   10040000
         LA    R0,2                 PAIRWISE COUNTER                    10050000
         CR    R2,R3                EVEN LENGTH ORIGINALLY?             10060000
         SRL   R3,1                 (STRING LENGTH +1)/2                10070000
         ST    R3,MSGTEXT2          (STRING LENGTH +1)/2                10080000
         BNE   ZFINHEX2             NO, BRANCH                          10090000
         SPACE 1                                                        10100000
ZFINHEX1 LA    R5,1(,R5)            NEXT CHARACTER                      10110000
         OI    0(R5),X'40'          UPPER CASE THE HEX CHARACTER        10120000
         IC    R15,0(,R5)           GET A BYTE TO CONVERT               10130000
         CLI   0(R5),C'0'                                               10140000
         BL    *+12                 0-9?                                10150000
         CLI   0(R5),C'9'                                               10160000
         BNH   ZFINHEX2             YES, BRANCH                         10170000
         LA    R15,9(,R15)          NO, ADJUST LOW DIGIT 1-5 TO A-F     10180000
         CLI   0(R5),C'A'           BELOW AN A?                         10190000
         BL    ZFINNEWS             YES, INVALID                        10200000
         CLI   0(R5),C'F'           ABOVE AN F?                         10210000
         BH    ZFINNEWS             YES, INVALID                        10220000
         SPACE 1                                                        10230000
ZFINHEX2 SLL   R15,28               SHIFT                               10240000
         SLDL  R14,4                GET A GOOD DIGIT                    10250000
         BCT   R0,ZFINHEX1          DO THE NEXT DIGIT OF A PAIR         10260000
         LA    R0,2                 PAIRWISE COUNTER                    10270000
         STC   R14,0(,R1)           SAVE AN OUTPUT CHARACTER            10280000
         LA    R1,1(,R1)            ANOTHER OUTPUT CHARACTER            10290000
         BCT   R3,ZFINHEX1          DO ALL DIGITS                       10300000
         SPACE 1                                                        10310000
         LA    R5,MSGTEXT2+4-1      START OF CONVERTED STRING -1        10320000
         L     R2,MSGTEXT2          LENGTH OF CONVERTED STRING          10330000
         CH    R2,=H'32'            VALID LENGTH?                       10340000
         BH    ZFINNEWS             NO, BRANCH                          10350000
         STH   R2,FINDLTH           SAVE ACTUAL LENGTH                  10360000
         BCTR  R2,0                 MACHINE LENGTH                      10370000
         MVC   FINDSTR(*-*),1(R5)   <<EXECUTED>>                        10380000
         EX    R2,*-6               SAVE THE NEW STRING                 10390000
         B     ZFINCHK                                                  10400000
         SPACE 2                                                        10410000
ZFINCHAR MVC   MSGTEXT1(3),L842     INVALID LENGTH MESSAGE              10420000
         CH    R2,=H'32'            VALID LENGTH?                       10430000
         BH    ZFINNEWS             NO, BRANCH                          10440000
         STH   R2,FINDLTH           SAVE ACTUAL LENGTH                  10450000
         BCTR  R2,0                 MACHINE LENGTH                      10460000
         MVC   FINDSTR(*-*),1(R5)   <<EXECUTED>>                        10470000
         EX    R2,*-6               SAVE THE NEW STRING                 10480000
         CLI   FINDASIS+1,1         ASIS REQUESTED?                     10490000
         BE    ZFINCHK              YES, BRANCH                         10500000
         CLI   FINDASIS+1,2         CAPS REQUESTED?           DRK DEC02 10510000
         BE    ZFINCAP1             YES                       DRK DEC02 10520000
         CLI   FINDASIS+1,3         IGNORE REQUESTED?         DRK DEC02 10530000
         BNE   *+4+4                NO                        DRK DEC02 10540000
         MVI   #IGNCASE,1           YES, IGNORE CASE          DRK DEC02 10550000
         AIF   ('&FNDCASE' EQ 'CAPS').CAPS1                   DRK DEC02 10560000
         MVI   #IGNCASE,1           DEFAULT TO IGNORE CASE    DRK DEC02 10570000
.CAPS1   ANOP                                                 DRK DEC02 10580000
ZFINCAP1 DS    0H                                             DRK DEC02 10590000
         OC    FINDSTR(32),BLANK128 UPPER CASE THE DATA                 10600000
         B     ZFINCHK                                                  10610000
         SPACE 2                                                        10620000
ZFINNEWS M$MSG MSGTEXT1             INVALID LENGTH STRING -- REENTER    10630000
         TM    FLAGSEE,FBKGRND      BACKGROUND EXECUTION?     DRK APR08 10640000
         BO    NEWCMD               YES, BRANCH               DRK APR08 10650000
ZFINNEW0 LA    R2,NEWCMD            EXIT ADDRESS FOR ATTENTION          10660000
        M$PUTGT PDS380A,ATTN=PARSATTN  SECOND PART OF MESSAGE           10670000
         L     R5,ADDRCBUF          ENTERED DATA                        10680000
         LH    R2,0(,R5)            LENGTH OF STRING                    10690000
         SH    R2,=H'5'             VALID MACHINE LENGTH?               10700000
         LA    R1,4(R5,R2)          LAST BYTE OF INPUT STRING           10710000
         BZ    ZFINNEW3             MAYBE, CHECK FURTHER                10720000
         BNP   ZFINNEW0             NO, NULL STRING -- PROMPT AGAIN     10730000
         SPACE 1                                                        10740000
ZFINNEW1 CLI   0(R1),X'40'          SCAN                                10750000
         BNE   ZFINNEW2                 BACKWARDS                       10760000
         BCTR  R1,0                              FOR A                  10770000
         BCT   R2,ZFINNEW1                             NON-BLANK        10780000
         B     ZFINNEW3             POSSIBLE STRING -- CHECK            10790000
         SPACE 1                                                        10800000
ZFINNEW2 CLI   4(R5),X'40'          SCAN                                10810000
         BNE   ZFINNEW3                 FORWARDS                        10820000
         LA    R5,1(,R5)                        FOR A                   10830000
         BCT   R2,ZFINNEW2                            NON-BLANK         10840000
         SPACE 1                                                        10850000
ZFINNEW3 CLI   4(R5),X'40'          REAL STRING?                        10860000
         BE    ZFINNEW0             NO, PROMPT AGAIN                    10870000
         CLI   FINDASIS+1,1         ASIS REQUESTED?                     10880000
         BE    ZFINNEW4             YES, BRANCH                         10890000
         CLI   FINDASIS+1,2         CAPS REQUESTED?           DRK DEC02 10900000
         BE    ZFINCAP2             YES, BRANCH               DRK DEC02 10910000
         CLI   FINDASIS+1,3         IGNORE REQUESTED?         DRK DEC02 10920000
         BNE   *+4+4                NO                        DRK DEC02 10930000
         MVI   #IGNCASE,1           YES, IGNORE CASE          DRK DEC02 10940000
         AIF   ('&FNDCASE' EQ 'CAPS').CAPS2                   DRK DEC02 10950000
         MVI   #IGNCASE,1           DEFAULT TO IGNORE CASE    DRK DEC02 10960000
.CAPS2   ANOP                                                 DRK DEC02 10970000
ZFINCAP2 DS    0H                                             DRK DEC02 10980000
         OC    4(*-*,R5),BLANK128   <<EXECUTED>>                        10990000
         EX    R2,*-6               UPPER-CASE DATA AND DELIMITERS      11000000
         SPACE 1                                                        11010000
ZFINNEW4 OI    4(R5),X'40'          UPPER-CASE THE FIRST DELIMITER      11020000
         MVC   0(1,R5),0(R1)        ENDING CHARACTER                    11030000
         OI    0(R5),X'40'          UPPER-CASE THE LAST DELIMITER       11040000
         CLC   0(1,R5),4(R5)        SAME DELIMITERS?                    11050000
         BNE   *+6                  NO, BRANCH                          11060000
         BCTR  R2,0                 YES, ALLOW FOR LAST DELIMITER       11070000
         LA    R5,5(,R5)            FIRST CHARACTER OF STRING           11080000
         B     ZFINTEST             PARSE THIS NEW STRING               11090000
         SPACE 2                                                        11100000
ZFINCHK  CLI   FINDLIST+1,1           FINDLIST SPECIFIED?               11110000
         BNE   ZFINCHK1               NO, BRANCH                        11120000
         OI    ##ADRPA#,$F            YES, TURN ON THE FLAG             11130000
         SPACE 1                                                        11140000
ZFINCHK1 CLI   FINDFMT+1,0            WAS A FORMAT SPECIFIED?           11150000
         BE    ZFINCHK2               NO, BRANCH                        11160000
         NI    HFLAGSDD,FF-NONUM-SNUM-BLOCK-DUMP-LBLOCK-LDUMP           11170000
         LH    R15,FINDFMT            FORMAT REQUESTED                  11180000
         A     R15,=F'-2'             LESS 2 -- NEGATIVE?               11190000
         BM    ZFINCHK2               YES, BRANCH                       11200000
         LA    R1,1                   SHIFT VALUE                       11210000
         SLL   R1,0(R15)              SHIFT INTO POSITION               11220000
         OI    HFLAGSDD,*-*           <<EXECUTED>>                      11230000
         EX    R1,*-4                 MOVE INTO FLAG BYTE               11240000
         SPACE 1                                                        11250000
ZFINCHK2 LA    R1,FMAXLENC            MAXLEN                            11260000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11270000
         ST    R1,#MAXLEN             SAVE RESULT                       11280000
         SPACE 1                                                        11290000
         LA    R1,FMAXINC             MAXIN                             11300000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11310000
         ST    R1,#MAXIN              SAVE RESULT                       11320000
         SPACE 1                                                        11330000
         LA    R1,FMAXOUTC            MAXOUT                            11340000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11350000
         ST    R1,#MAXOUT             SAVE RESULT                       11360000
         SPACE 1                                                        11370000
         LA    R1,FMAXFIND            MAXFIND                           11380000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11390000
         ST    R1,#MAXFIND            SAVE RESULT                       11400000
         SPACE 1                                                        11410000
         LA    R1,FSKIPRC             SKIPREC                           11420000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11430000
         ST    R1,#SKIPREC            SAVE RESULT                       11440000
         SPACE 1                                                        11450000
         LA    R1,FSKIPCC             SKIPCOL                           11460000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 11470000
         STH   R1,#SKIPCOL            SAVE RESULT                       11480000
         SPACE 1                                                        11490000
         LH    R1,FTHENCC             THEN ACTION NUMBER                11500000
         SLA   R1,2                   ACTION SPECIFIED                  11510000
         L     R1,THENTBL(R1)         THEN ACTION POINTER               11520000
         ST    R1,#ACTIONT            NOTE FOR LATER                    11530000
         OC    FLAGSII(1),#ACTIONT    SET POSSIBLE FSINGLE FLAG         11540000
***TEST  OC    SPFLAG3(1),#ACTIONT    SET POSSIBLE INVALID    ABL OCT84 11550000
         SPACE 1                                                        11560000
ZFINCHK3 LH    R1,FELSECC             ELSE ACTION NUMBER                11570000
         SLA   R1,2                   ACTION SPECIFIED                  11580000
         L     R1,THENTBL(R1)         ELSE ACTION POINTER               11590000
         ST    R1,#ACTIONE            NOTE FOR LATER                    11600000
         OC    FLAGSII(1),#ACTIONE    SET POSSIBLE FSINGLE FLAG         11610000
***TEST  OC    SPFLAG3(1),#ACTIONE    SET POSSIBLE INVALID    ABL OCT84 11620000
         BAS   R14,CHKTHEN            THEN/ELSE MEMLIST SUB   DRK JAN18 11630099
         SPACE 1                                                        11640000
         TM    FINDOFF+6,X'80'        OFFSET CODED?                     11650000
         BNO   ZFINCHK4               NO, DONE                          11660000
         L     R5,FINDOFF             OFFSET ADDRESS                    11670000
         LH    R1,FINDOFF+4           LENGTH OF OFFSET                  11680000
         LTR   R1,R1                  NULL STRING CODED?                11690000
         BNP   ZFINCHK4               YES, DONE                         11700000
         MVI   MSGTEXT2+1,3           MAXIMUM OF 3 DIGITS               11710000
         MVC   MSGTEXT1,PDS384A       OFFSET INVALID MESSAGE            11720000
         BAS   R2,HEXC                CONVERT TO BINARY                 11730000
         B     PARSATTN               ATTENTION -- IGNORE THE REST      11740000
         STCM  R0,B'0111',#LISTOFF+1  SAVE THE RESULTING OFFSET         11750000
         SPACE 1                                                        11760000
ZFINCHK4 LH    R15,FDUMPCS+4          LENGTH OF BLOCK/DUMP STRING       11770000
         STC   R15,#MODLEN                                              11780000
         S     R15,=F'1'              ANY STRING?                       11790000
         BM    PARSPOST               NO, BRANCH                        11800000
         L     R1,FDUMPCS             ADDRESS OF BLOCK/DUMP STRING      11810000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        11820000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      11830000
         EX    R15,*-6                SAVE THE STRING FOR LATER         11840000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       11850000
         BNE   *+16                   NO, BRANCH                        11860000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  11870000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  11880000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     11890000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    11900000
         MVC   #LISTMFF(4),#LISTOFF   SAVE MODULE OFFSET                11910000
         XC    #LISTOFF(4),#LISTOFF   CLEAR LIST OFFSET                 11920000
         B     PARSPOST                                                 11930000
         SPACE 2                                                        11940000
         USING PDLFIX,R6                                                11950000
         USING *,R4                                                     11960000
ZFIXPDS  MVC   #FIXOPT(1),PCLFIXOP+1  SAVE FIXPDS MAIN KEYWORD OPTION   11970000
         MVC   #FIXCHK(1),PCLFIXCK+1  SAVE FIXPDS CHECK/NOCHECK         11980000
         MVC   #FIXOPT2(1),PCLRELOP+1 SAVE FIXPDS RELEASE/RELSAVE/MAXSP 11990000
         MVC   #FIXOPT3(1),PCLADDOP+1 SAVE FIXPDS ADDTRK/ADDCYL         12000000
         MVC   #OPTCD(1),ROPTCD+1     SAVE OPTCD/NOOPTCD                12010000
         SPACE 1                                                        12020000
         SR    R1,R1                                                    12030000
         MVC   #RTYPE(1),RTYPE+1    SAVE FIXPDS DATA TYPE     DRK JAN06 12040000
         ICM   R1,B'0001',RTYPE+1   ANY GENERAL DATA TYPE?              12050000
         BZ    ZFIX010              NO, BRANCH                          12060000
         MH    R1,=H'24'            INDEX VALUE               DRK APR03 12070000
         LA    R3,RTABLE-24-24(R1)  CURRENT ENTRY -24         DRK APR03 12080000
         MVC   #RECFM+3(1),24+1(R3) RECFM                     DRK APR03 12090000
         MVC   #LRECL+2(2),24+2(R3) LRECL                     DRK APR03 12100000
         IC    R1,BYTEUCB+1         DEVICE INDEX                        12110000
         LA    R0,X'0000000F'       MAXIMUM DEFINED INDEX     DRK APR03 12120000
         CR    R1,R0                ABOVE 3390?               DRK APR03 12130000
         BNH   *+6                  NO, BRANCH                          12140000
         LR    R1,R0                YES, USE 3390 DATA        DRK APR03 12150000
         AR    R1,R1                DEVICE INDEX * 2 (FOR TABLE ENTRY)  12160000
         LA    R3,24+4-12(R3,R1)    POINT TO DEVICE BLOCKSIZE           12170000
         MVC   #BLKSI+2(2),0(R3)    BLKSIZE                             12180000
         SPACE 1                                                        12190000
ZFIX010  LH    R1,RRECFMZI          RECORD FORMAT INDEX (0 IF NONE)     12200000
         LA    R1,RECFMVAL(R1)      INDEX TO CORRESPONDING DCBRECFM     12210000
         CLI   0(R1),X'00'          DEFAULT RECFM VALUE?                12220000
         BE    *+10                 YES, BRANCH                         12230000
         MVC   #RECFM+3(1),0(R1)    NO, NEW RECORD FORMAT               12240000
         SPACE 1                                                        12250000
         LH    R1,ROPTCDZI          OPTCD VALUE (0 IF NONE)             12260000
         LA    R1,OPTCDVAL(R1)      INDEX TO CORRESPONDING DCBOPTCD     12270000
         CLI   0(R1),X'00'          DEFAULT RECFM VALUE?                12280000
         BE    *+10                 YES, BRANCH                         12290000
         MVC   #OPTCD+3(1),0(R1)    NO, NEW OPTCD VALUE                 12300000
         SPACE 1                                                        12310000
         LA    R1,RTRKSI            COUNT OF TRACKS OR CYLINDERS        12320000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   12330000
         STCM  R1,B'0111',#FIXOPT3+1  SAVE RESULT IF CODED              12340000
         SPACE 1                                                        12350000
         LA    R1,RDIRZI            NUMBER OF DIRECTORY BLOCKS          12360000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   12370000
         B     FIXPDS20             A RESULT WAS CODED                  12380000
         SPACE 1                                                        12390000
         SR    R1,R1                ASSUME ZERO                         12400000
         CLI   #FIXOPT,X'03'        DCB OR RESET?                       12410000
         BL    FIXPDS20             YES, BRANCH                         12420000
         LA    R1,50                ASSUME EXPANDIR                     12430000
         CLI   #FIXOPT,X'04'        CORRECT?                  DRK MAY03 12440000
         BE    FIXPDS20             YES, BRANCH                         12450000
         LA    R1,5                 NO, FREEDIR                         12460000
FIXPDS20 ST    R1,#NEWDIR           SAVE RESULT (OR DEFAULT)            12470000
         SPACE 1                                                        12480000
         LA    R1,RLRECLZI          LRECL DESIRED                       12490000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   12500000
         ST    R1,#LRECL            SAVE RESULT IF CODED                12510000
         SPACE 1                                                        12520000
         LA    R1,RBLKSIZI          BLOCKSIZE DESIRED                   12530000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   12540000
         ST    R1,#BLKSI            SAVE RESULT IF CODED                12550000
         SPACE 1                                                        12560000
         LA    R1,RRESV             RESERVE COUNT                       12570000
         BAS   R14,PACKMAX          CONVERT TO BINARY                   12580000
         ST    R1,#FIXRES           SAVE RESULT IF CODED                12590000
         B     PARSPOST                                                 12600000
         SPACE 2                                                        12610000
******           23051 23052  2314  3330  3340  3350  3375 33301  3380  12620000
******           ***** *****  ****  ****  ****  ****  **** *****  ****  12630000
******            3390                                                  12640000
******            ****                                                  12650000
RTABLE   DC  XL2'C0',AL2(0)      ...LOAD                                12660000
         DC  AL2(14136,14660,+7294,13030,+8368,19069,19069,13030,32760) 12670000
         DC  AL2(32760)                                                 12680000
         DC  XL2'90',AL2(80)     ...OBJECT                              12690000
         DC  AL2(+3200,+2720,+2240,+3120,+2640,+2960,+3200,+3120,+3120) 12700000
         DC  AL2(+3120)                                                 12710000
         DC  XL2'50',AL2(255)    ...CLIST                               12720000
         DC  AL2(+4424,+4754,+2296,+4252,+1964,+6232,+6816,+4252,+6356) 12730000
         DC  AL2(27998)                                                 12740000
         DC  XL2'90',AL2(80)     ...CNTL                                12750000
         DC  AL2(+6800,+7200,+3520,+6400,+4080,+6160,+6800,+6400,+6320) 12760000
         DC  AL2(27920)                                                 12770000
         DC  XL2'90',AL2(80)     ...ASM                                 12780000
         DC  AL2(+6800,+7200,+3520,+6400,+4080,+6160,+6800,+6400,+6320) 12790000
         DC  AL2(27920)                                                 12800000
         DC  XL2'90',AL2(80)     ...SOURCE                              12810000
         DC  AL2(+6800,+7200,+3520,+6400,+4080,+6160,+6800,+6400,+6320) 12820000
         DC  AL2(27920)                                                 12830000
         SPACE 2                                                        12840000
RECFMVAL DC    X'00',X'80',X'90',X'A0',X'B0',X'84',X'94',X'A4',X'B4'    12850000
         DC    X'82',X'92',X'A2',X'B2'  RECFM(F) THROUGH RECFM(FBTM)    12860000
         DC          X'40',X'50',X'60',X'70',X'44',X'54',X'64',X'74'    12870000
         DC    X'42',X'52',X'62',X'72'  RECFM(V) THROUGH RECFM(VBTM)    12880000
         DC          X'C0',X'E0',X'C4',X'C2',X'E4',X'E2'                12890000
         SPACE 2                                                        12900000
OPTCDVAL DC    X'00',X'80',X'A0',X'84',X'A4',X'A4'                      12910000
         DC          X'20',X'24',X'A0',X'A4',X'A4'                      12920000
         DC          X'04',X'24',X'84',X'A4',X'A4'                      12930000
         SPACE 2                                                        12940000
         DS    0H                                                       12950000
         USING PDLHIST,R6                                               12960000
         USING *,R4                                                     12970000
ZHISTORY MVC   #ZAPOPT(1),PCLHZAPK+1    SAVE THE ZAP OPTION             12980000
         MVC   #USEROPT(1),PCLHUSRK+1   SAVE USERDATA/SYSMOD            12990000
         MVC   #TRANOPT(1),PCLHTRNK+1   SAVE THE TRAN OPTION            13000000
         MVC   #LKEDOPT(1),PCLHLKDK+1   SAVE THE LKED OPTION            13010000
         MVC   #LONGOPT(1),SPFLONGH+1   SAVE THE LONG OPTION            13020000
         SPACE 1                                                        13030000
         TM    PCLHMOD+6,X'80'        ANY MODULE NAME FILTERING?        13040000
         BNO   ZHIST10                NO, BRANCH                        13050000
         LH    R15,PCLHMOD+4          LENGTH OF MODULE NAME             13060000
         STC   R15,#MODLEN            SAVE FOR LATER                    13070000
         S     R15,=F'1'              MACHINE LENGTH VALID?             13080000
         BM    ZHIST10                NO, BRANCH                        13090000
         L     R1,PCLHMOD             PARTIAL MODULE NAME               13100000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        13110000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      13120000
         EX    R15,*-6                SAVE THE STRING FOR LATER         13130000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       13140000
         BNE   *+16                   NO, BRANCH                        13150000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  13160000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  13170000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     13180000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    13190000
         SPACE 3                                                        13200000
ZHIST10  TM    PCLHTRN+6,X'80'        ANY TRANSLATOR NAME FILTERING?    13210000
         BNO   ZHIST20                NO, BRANCH                        13220000
         LH    R15,PCLHTRN+4          LENGTH OF NAME                    13230000
         STC   R15,#TRANLEN           SAVE FOR LATER                    13240000
         S     R15,=F'1'              MACHINE LENGTH VALID?             13250000
         BM    ZHIST20                NO, BRANCH                        13260000
         L     R1,PCLHTRN             PARTIAL TRANSLATOR NAME           13270000
         MVC   #TRANTXT(*-*),0(R1)    <<EXECUTED>>                      13280000
         EX    R15,*-6                MOVE INTO STORAGE                 13290000
         SPACE 1                                                        13300000
ZHIST20  TM    PCLHZAP+6,X'80'        ANY ZAP IDRDATA NAME FILTERING?   13310000
         BNO   ZHIST30                NO, BRANCH                        13320000
         LH    R15,PCLHZAP+4          LENGTH OF NAME                    13330000
         STC   R15,#ZAPLEN            SAVE FOR LATER                    13340000
         S     R15,=F'1'              MACHINE LENGTH VALID?             13350000
         BM    ZHIST30                NO, BRANCH                        13360000
         L     R1,PCLHZAP             PARTIAL IDRDATA DATA              13370000
         MVC   #ZAPTXT(*-*),0(R1)     <<EXECUTED>>                      13380000
         EX    R15,*-6                MOVE INTO STORAGE                 13390000
         SPACE 1                                                        13400000
ZHIST30  TM    PCLHUSR+6,X'80'        ANY USER IDRDATA FILTERING?       13410000
         BNO   ZHIST40                NO, BRANCH                        13420000
         LH    R15,PCLHUSR+4          LENGTH OF NAME                    13430000
         STC   R15,#USERLEN           SAVE FOR LATER                    13440000
         S     R15,=F'1'              MACHINE LENGTH VALID?             13450000
         BM    ZHIST40                NO, BRANCH                        13460000
         L     R1,PCLHUSR             PARTIAL IDRDATA DATA              13470000
         MVC   #USERTXT(*-*),0(R1)    <<EXECUTED>>                      13480000
         EX    R15,*-6                MOVE INTO STORAGE                 13490000
         SPACE 1                                                        13500000
ZHIST40  TM    PCLHLKD+6,X'80'        ANY LKED IDRDATA FILTERING?       13510000
         BNO   PARSPOST               NO, BRANCH                        13520000
         LH    R15,PCLHLKD+4          LENGTH OF NAME                    13530000
         STC   R15,#LKEDLEN           SAVE FOR LATER                    13540000
         S     R15,=F'1'              MACHINE LENGTH VALID?             13550000
         BM    PARSPOST               NO, BRANCH                        13560000
         L     R1,PCLHLKD             PARTIAL IDRDATA DATA              13570000
         MVC   #LKEDTXT(*-*),0(R1)    <<EXECUTED>>                      13580000
         EX    R15,*-6                MOVE INTO STORAGE                 13590000
         B     PARSPOST                                                 13600000
         SPACE 2                                                        13610000
         USING PDLIFTTR,R6                                              13620000
         USING *,R4                                                     13630000
ZIF      MVC   #ALIAOPT(1),IFLKALIA+1   ALIAS/NOALIAS                   13640000
         MVC   #SSIOPT(1),IFLKSSI+1     SSI/NOSSI/PARTSSI               13650000
         MVC   #AUTHOPT(1),IFLKAUTH+1   AUTH/NOAUTH                     13660000
         MVC   #PAGEOPT(1),IFLKPAGE+1   PAGE/NOPAGE                     13670000
         MVC   #VSLKED(1),IFLKVSLE+1    VSLKED/NOVSLKED                 13680000
         MVC   #RMODE(1),IFRMODE+1      RMODE24/RMODEANY                13690000
         MVC   #AMODE(1),IFAMODE+1      AMODE24/AMODE31/AMODEANY/NOA... 13700000
         MVC   #USERIDO(1),IFTUSERK+1   USERID/NOUSERID/NOTUSERID       13710000
         MVC   #LOADERR(1),IFLOADER+1   LOADERR/NOLOADERR               13720000
         MVC   #LKEDERR(1),IFLKEDER+1   LKEDERR/NOLKEDERR               13730000
         MVC   #IOERROR(1),IFIOERR+1    IOERR/NOIOERR                   13740000
         MVC   #BLOCKER(1),IFBLKERR+1   BLOCKERR/MAXBLK(SIZ)/NOBLOCKERR 13750000
         MVC   #LRECLER(1),IFLRECLE+1   LRECLERR/NOLRECLERR             13760000
         MVC   #NULL(1),IFNULL+1        NULL/NONULL                     13770000
         MVC   #AALIAS(1),IFAALIAS+1    APPARENTALIAS/NOAPPARENTALIAS   13780000
         MVC   #ORPHAN(1),IFORPHAN+1    ORPHAN/NOORPHAN                 13790000
         MVC   #SPFEDIT(1),IFSPFEDT+1   SPFEDIT/NOSPFEDIT               13800000
         MVC   #NAMEERR(1),IFNAMERR+1   NAMEERR/NONAMEERR               13810000
         MVC   #HASALIA(1),IFHASALI+1   HASALIAS/NOHASALIAS             13820000
         MVC   #XSTATS(1),IFXSTATS+1    XSTATS/NOXSTATS       DRK OCT09 13830099
         MVC   #PACKED(1),IFPACKED+1    PACKED/NOPACKED       DRK APR18 13840099
         MVC   #ATTRHI(3),=F'-1'        INITIALIZE THE SECOND TTR VALUE 13850000
         SPACE 1                                                        13860000
ZIF380   CLI   IFLKREUS+1,X'01'       REUSABLE ATTRIBUTE STATUS:        13870000
         BL    ZIF384                   NONE, BRANCH                    13880000
         BH    ZIF382                   "NO" FORM, BRANCH               13890000
         OI    #ATTRYES,ATTRREUS        "REUS"                          13900000
         B     ZIF384                                                   13910000
ZIF382   OI    #ATTRNO,ATTRREUS         "NOREUS"                        13920000
         SPACE 1                                                        13930000
ZIF384   CLI   IFLKREFR+1,X'01'       REFRESHABLE ATTRIBUTE STATUS:     13940000
         BL    ZIF400                   NONE, BRANCH                    13950000
         BH    ZIF386                   "NO" FORM, BRANCH               13960000
         OI    #ATTRYES+1,ATTRREFR      "REFR"                          13970000
         B     ZIF400                                                   13980000
ZIF386   OI    #ATTRNO+1,ATTRREFR       "NOREFR"                        13990000
         SPACE 1                                                        14000000
ZIF400   CLI   IFLKRENT+1,X'01'       REENTRANT ATTRIBUTE STATUS:       14010000
         BL    ZIF404                   NONE, BRANCH                    14020000
         BH    ZIF402                   "NO" FORM, BRANCH               14030000
         OI    #ATTRYES,ATTRRENT        "RENT"                          14040000
         B     ZIF404                                                   14050000
ZIF402   OI    #ATTRNO,ATTRRENT         "NORENT"                        14060000
         SPACE 1                                                        14070000
ZIF404   CLI   IFLKEXEC+1,X'01'       EXECUTABLE ATTRIBUTE STATUS:      14080000
         BL    ZIF420                   NONE, BRANCH                    14090000
         BH    ZIF406                   "NO" FORM, BRANCH               14100000
         OI    #ATTRYES,ATTREXEC        "EXEC"                          14110000
         B     ZIF420                                                   14120000
ZIF406   OI    #ATTRNO,ATTREXEC         "NOEXEC"                        14130000
         SPACE 1                                                        14140000
ZIF420   CLI   IFLKLOAD+1,X'01'       LOADABLE ATTRIBUTE STATUS:        14150000
         BL    ZIF424                   NONE, BRANCH                    14160000
         BH    ZIF422                   "NO" FORM, BRANCH               14170000
         OI    #ATTRYES,ATTRLOAD        "LOAD"                          14180000
         B     ZIF424                                                   14190000
ZIF422   OI    #ATTRNO,ATTRLOAD         "NOLOAD"                        14200000
         SPACE 1                                                        14210000
ZIF424   CLI   IFLKEDIT+1,X'01'       NOT EDITABLE ATTRIBUTE STATUS:    14220000
         BL    ZIF440                   NONE, BRANCH                    14230000
         BH    ZIF426                   "NO" FORM, BRANCH               14240000
         OI    #ATTRNO+1,ATTRNE        "EDIT"  -- BIT MUST BE REVERSED  14250000
         B     ZIF440                                                   14260000
ZIF426   OI    #ATTRYES+1,ATTRNE        "NOEDIT"                        14270000
         SPACE 1                                                        14280000
ZIF440   CLI   IFLKLKED+1,X'01'       LINKAGE EDITOR ATTRIBUTE:         14290000
         BL    ZIF444                   NEITHER, BRANCH                 14300000
         BH    ZIF442                   NULL FORM, BRANCH               14310000
         OI    #ATTRYES+1,ATTRFLEV      "FLEVEL"                        14320000
         B     ZIF444                                                   14330000
ZIF442   OI    #ATTRNO+1,ATTRFLEV       "NOFLEVEL"                      14340000
         SPACE 1                                                        14350000
ZIF444   CLI   IFLKOVER+1,X'01'       OVERLAY ATTRIBUTE STATUS:         14360000
         BL    ZIF460                   NONE, BRANCH                    14370000
         BH    ZIF446                   "NO" FORM, BRANCH               14380000
         OI    #ATTRYES,ATTROVLY        "OVERLAY"                       14390000
         B     ZIF460                                                   14400000
ZIF446   OI    #ATTRNO,ATTROVLY         "NOOVERLAY"                     14410000
         SPACE 1                                                        14420000
ZIF460   CLI   IFLKTEST+1,X'01'       TEST ATTRIBUTE STATUS:            14430000
         BL    ZIF464                   NONE, BRANCH                    14440000
         BH    ZIF462                   "NO" FORM, BRANCH               14450000
         OI    #ATTRYES,ATTRTEST        "TEST"                          14460000
         B     ZIF464                                                   14470000
ZIF462   OI    #ATTRNO,ATTRTEST         "NOTEST"                        14480000
         SPACE 1                                                        14490000
ZIF464   CLI   IFLKSCTR+1,X'01'       SCATTER ATTRIBUTE STATUS:         14500000
         BL    ZIF480                   NONE, BRANCH                    14510000
         BH    ZIF466                   "NO" FORM, BRANCH               14520000
         OI    #ATTRYES,ATTRSCTR        "SCTR"                          14530000
         B     ZIF480                                                   14540000
ZIF466   OI    #ATTRNO,ATTRSCTR         "NOSCTR"                        14550000
         SPACE 1                                                        14560000
ZIF480   CLI   IFLKDC+1,X'01'         DOWNWARD COMPATIBLE ATTRIBUTE:    14570000
         BL    ZIF484                   NONE, BRANCH                    14580000
         BH    ZIF482                   "NO" FORM, BRANCH               14590000
         OI    #ATTRNO+1,ATTRNODC       "DC" -- BIT IS REVERSED         14600000
         B     ZIF484                                                   14610000
ZIF482   OI    #ATTRYES+1,ATTRNODC      "NODC"                          14620000
         SPACE 1                                                        14630000
ZIF484   TM    IFTUSER+6,X'80'        ANY USERID NAME FILTERING?        14640000
         BNO   ZIF500                 NO, BRANCH                        14650000
         LH    R15,IFTUSER+4          LENGTH OF USERID NAME             14660000
         STC   R15,#USERIDL           SAVE FOR LATER                    14670000
         S     R15,=F'1'              MACHINE LENGTH VALID?             14680000
         BM    ZIF500                 NO, BRANCH                        14690000
         L     R1,IFTUSER             PARTIAL USERID NAME               14700000
         MVC   #USERTXT(*-*),0(R1)    <<EXECUTED>>                      14710000
         EX    R15,*-6                MOVE INTO STORAGE                 14720000
         SPACE 1                                                        14730000
ZIF500   MVC   #ZAPOPT(1),IFTLZAPK+1   SAVE ZAP/NOZAP                   14740000
         MVC   #USEROPT(1),IFTLUSRK+1  SAVE USERDATA/SYSMOD             14750000
         MVC   #TRANOPT(1),IFTLTRNK+1  SAVE TRAN/NOTRAN                 14760000
         MVC   #LKEDOPT(1),IFTLKEDK+1  SAVE LKED/NOLKED                 14770000
         MVC   #RLDERR(1),IFRLDERR+1   SAVE RLDERR/NORLDERR             14780000
         MVC   #RLD0(1),IFRLD0+1       SAVE RLDZERO/NORLDZERO           14790000
         MVC   #APFERR(1),IFAPFERR+1   SAVE APFERR/NOAPFERR             14800000
         SPACE 1                                                        14810000
         IC    R14,IFTLMODK+1         MODULE                            14820000
         IC    R15,IFEXTERN+1         WKEXTERN/EXTERN                   14830000
         SLL   R14,4                  SHIFT MODULE UP 4                 14840000
         OR    R14,R15                PUT IN SAME CHARACTER             14850000
         STC   R14,#MODOPT            SAVE MODULE, WKEXTERN/EXTERN      14860000
         SPACE 1                                                        14870000
         TM    IFTLKED+6,X'80'        ANY LINKAGE EDITOR FILTERING?     14880000
         BNO   ZIF502                 NO, BRANCH                        14890000
         LH    R15,IFTLKED+4          LENGTH OF LKED NAME               14900000
         STC   R15,#LKEDLEN           SAVE FOR LATER                    14910000
         S     R15,=F'1'              MACHINE LENGTH VALID?             14920000
         BM    ZIF502                 NO, BRANCH                        14930000
         L     R1,IFTLKED             PARTIAL MODULE NAME               14940000
         MVC   #LKEDTXT(*-*),0(R1)    <<EXECUTED>>                      14950000
         EX    R15,*-6                MOVE INTO STORAGE                 14960000
         SPACE 1                                                        14970000
ZIF502   TM    IFTLMOD+6,X'80'        ANY MODULE NAME FILTERING?        14980000
         BNO   ZIF504                 NO, BRANCH                        14990000
         LH    R15,IFTLMOD+4          LENGTH OF MODULE NAME             15000000
         STC   R15,#MODLEN            SAVE FOR LATER                    15010000
         S     R15,=F'1'              MACHINE LENGTH VALID?             15020000
         BM    ZIF504                 NO, BRANCH                        15030000
         L     R1,IFTLMOD             PARTIAL MODULE NAME               15040000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        15050000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      15060000
         EX    R15,*-6                SAVE THE STRING FOR LATER         15070000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       15080000
         BNE   *+16                   NO, BRANCH                        15090000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  15100000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  15110000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     15120000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    15130000
         SPACE 1                                                        15140000
ZIF504   TM    IFTLTRN+6,X'80'        ANY TRANSLATOR NAME FILTERING?    15150000
         BNO   ZIF506                 NO, BRANCH                        15160000
         LH    R15,IFTLTRN+4          LENGTH OF NAME                    15170000
         STC   R15,#TRANLEN           SAVE FOR LATER                    15180000
         S     R15,=F'1'              MACHINE LENGTH VALID?             15190000
         BM    ZIF506                 NO, BRANCH                        15200000
         L     R1,IFTLTRN             PARTIAL TRANSLATOR NAME           15210000
         MVC   #TRANTXT(*-*),0(R1)    <<EXECUTED>>                      15220000
         EX    R15,*-6                MOVE INTO STORAGE                 15230000
         SPACE 1                                                        15240000
ZIF506   TM    IFTLZAP+6,X'80'        ANY ZAP IDRDATA NAME FILTERING?   15250000
         BNO   ZIF508                 NO, BRANCH                        15260000
         LH    R15,IFTLZAP+4          LENGTH OF NAME                    15270000
         STC   R15,#ZAPLEN            SAVE FOR LATER                    15280000
         S     R15,=F'1'              MACHINE LENGTH VALID?             15290000
         BM    ZIF508                 NO, BRANCH                        15300000
         L     R1,IFTLZAP             PARTIAL IDRDATA DATA              15310000
         MVC   #ZAPTXT(*-*),0(R1)     <<EXECUTED>>                      15320000
         EX    R15,*-6                MOVE INTO STORAGE                 15330000
         SPACE 1                                                        15340000
ZIF508   TM    IFTLUSR+6,X'80'        ANY USERDATA IDRDATA FILTERING?   15350000
         BNO   ZIF540                 NO, BRANCH                        15360000
         LH    R15,IFTLUSR+4          LENGTH OF NAME                    15370000
         STC   R15,#USERLEN           SAVE FOR LATER                    15380000
         S     R15,=F'1'              MACHINE LENGTH VALID?             15390000
         BM    ZIF540                 NO, BRANCH                        15400000
         L     R1,IFTLUSR             PARTIAL IDRDATA DATA              15410000
         MVC   #USERTXT(*-*),0(R1)    <<EXECUTED>>                      15420000
         EX    R15,*-6                MOVE INTO STORAGE                 15430000
         SPACE 3                                                        15440000
ZIF540   TM    IFTTTR+6,X'80'       STRING CODED?                       15450000
         BNO   ZIF560               NO, DONE                            15460000
         L     R5,IFTTTR            NEW STRING ADDRESS                  15470000
         LH    R1,IFTTTR+4          LENGTH OF STRING                    15480000
         LTR   R1,R1                NULL STRING CODED?                  15490000
         BNP   ZIF560               YES, DONE                           15500000
         MVI   MSGTEXT2+1,3         MAXIMUM OF 3 DIGITS                 15510000
         MVC   MSGTEXT1,PDS382A     FIRST TTR MESSAGE                   15520000
         BAS   R2,HEXC              CONVERT TO BINARY                   15530000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        15540000
         STCM  R0,B'0111',#ATTRLO   SAVE THE RESULTING TTR              15550000
         SPACE 2                                                        15560000
         TM    IFTTTR+8+6,X'80'     STRING CODED?                       15570000
         BNO   ZIF560               NO, DONE                            15580000
         L     R5,IFTTTR+8          NEW STRING ADDRESS                  15590000
         LH    R1,IFTTTR+8+4        LENGTH OF STRING                    15600000
         LTR   R1,R1                NULL STRING CODED?                  15610000
         BNP   ZIF560               YES, DONE                           15620000
         MVC   MSGTEXT1,PDS383A     SECOND TTR MESSAGE                  15630000
         BAS   R2,HEXC              CONVERT TO BINARY                   15640000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        15650000
         STCM  R0,B'0111',#ATTRHI   SAVE THE RESULTING TTR              15660000
         SPACE 2                                                        15670000
ZIF560   MVI   #OPTOPT,X'80'          PARSE WAS CALLED FOR IF           15680000
         LA    R1,IFABOSUB            ABOVE(COUNT)                      15690000
         BAS   R14,PACKMAX            ANY RESULT?                       15700000
         B     ZIF600                 YES, BRANCH                       15710000
         B     ZIF620                 NO, BRANCH                        15720000
ZIF600   ST    R1,#IFABOVE            SAVE RESULT                       15730000
         OI    #IFABOVE,X'80'         MARK AS ENTERED                   15740000
         SPACE 1                                                        15750000
ZIF620   LA    R1,IFBELSUB            BELOW(COUNT)                      15760000
         BAS   R14,PACKMAX            ANY RESULT?                       15770000
         B     ZIF640                 YES, BRANCH                       15780000
         B     ZIF650                 NO, BRANCH                        15790000
ZIF640   ST    R1,#IFBELOW            SAVE RESULT                       15800000
         OI    #IFBELOW,X'80'         MARK AS ENTERED         DRK NOV09 15810099
         SPACE 1                                                        15820000
ZIF650   LA    R1,IFTMAXBL            MAXBLK(COUNT)                     15830000
         BAS   R14,PACKMAX            ANY RESULT?                       15840000
         B     ZIF652                 YES, BRANCH                       15850000
         B     ZIF660                 NO, BRANCH                        15860000
ZIF652   STH   R1,#MAXBLKI            SAVE RESULT                       15870000
         SPACE 1                                                        15880000
ZIF660   LA    R1,IFMODSUB              CHANGED(DATE:                   15890000
         BAS   R14,PACKMAX              ANY RESULT?                     15900000
         B     ZIF662                   YES, BRANCH                     15910000
         B     ZIF670                   NO, BRANCH                      15920000
ZIF662   MVC   #IFMODIF(3),DOUBLE+5     SAVE RESULT                     15930000
         MVC   #IFMODIF+3(3),DOUBLE+5   IF SECOND IS MISSING, USE FIRST 15940000
         SPACE 1                                                        15950000
ZIF670   LA    R1,IFMODSUB+8            CHANGED(:DATE                   15960000
         BAS   R14,PACKMAX              ANY RESULT?                     15970000
         B     ZIF672                   YES, BRANCH                     15980000
         B     ZIF680                   NO, BRANCH                      15990000
ZIF672   MVC   #IFMODIF+3(3),DOUBLE+5   SAVE RESULT                     16000000
         OI    #IFMODIF+2,X'0F'         IF FIRST IS MISSING, USE 00000F 16010000
         SPACE 1                                                        16020000
ZIF680   LA    R1,IFCRESUB              CREATED(DATE:                   16030000
         BAS   R14,PACKMAX              ANY RESULT?                     16040000
         B     ZIF682                   YES, BRANCH                     16050000
         B     ZIF690                   NO, BRANCH                      16060000
ZIF682   MVC   #IFCREIF(3),DOUBLE+5     SAVE RESULT                     16070000
         MVC   #IFCREIF+3(3),DOUBLE+5   IF SECOND IS MISSING, USE FIRST 16080000
         SPACE 1                                                        16090000
ZIF690   LA    R1,IFCRESUB+8            CREATED(:DATE                   16100000
         BAS   R14,PACKMAX              ANY RESULT?                     16110000
         B     ZIF692                   YES, BRANCH                     16120000
         B     ZIF696                   NO, BRANCH                      16130000
ZIF692   MVC   #IFCREIF+3(3),DOUBLE+5   SAVE RESULT                     16140000
         OI    #IFCREIF+2,X'0F'         IF FIRST IS MISSING, USE 00000F 16150000
ZIF696   XC    FULLWORD,FULLWORD        CLEAR THE INCREMENT AMOUNT      16160000
         CLI   IFDATEKY+1,0             ANY DATE KEYWORD?               16170000
         BE    ZIF900                   NO, BRANCH                      16180000
         CLI   IFDATEKY+1,10            PREV0 THROUGH PREV9?            16190000
         BH    ZIF700                   NO, BRANCH                      16200000
         LH    R0,IFDATEKY              LOAD DATE                       16210000
         BCTR  R0,0                     LESS ONE                        16220000
         SLL   R0,4                     SHIFT FOR SIGN                  16230000
         STC   R0,FULLWORD+3            STORE NUMERIC VALUE             16240000
         OI    FULLWORD+3,X'0F'         ADD PACKED SIGN                 16250000
         B     ZIF790                                                   16260000
         SPACE 1                                                        16270000
ZIF700   MVI   FULLWORD+2,01            1X TYPE DATE                    16280000
         CLI   IFDATEKY+1,11            PREV10?                         16290000
         BNE   ZIF702                   NO, BRANCH                      16300000
         MVI   FULLWORD+3,X'0F'         PREV10                          16310000
         B     ZIF790                                                   16320000
         SPACE 1                                                        16330000
ZIF702   CLI   IFDATEKY+1,12            PREV11?                         16340000
         BNE   ZIF704                   NO, BRANCH                      16350000
         MVI   FULLWORD+3,X'1F'         PREV11                          16360000
         B     ZIF790                                                   16370000
         SPACE 1                                                        16380000
ZIF704   CLI   IFDATEKY+1,13            PREV12?                         16390000
         BNE   ZIF706                   NO, BRANCH                      16400000
         MVI   FULLWORD+3,X'2F'         PREV12                          16410000
         B     ZIF790                                                   16420000
         SPACE 1                                                        16430000
ZIF706   CLI   IFDATEKY+1,14            PREV13?                         16440000
         BNE   ZIF708                   NO, BRANCH                      16450000
         MVI   FULLWORD+3,X'3F'         PREV13                          16460000
         B     ZIF790                                                   16470000
         SPACE 1                                                        16480000
ZIF708   CLI   IFDATEKY+1,15            BIWEEK?                         16490000
         BNE   ZIF710                   NO, BRANCH                      16500000
         MVI   FULLWORD+3,X'4F'         PREV14                          16510000
         B     ZIF790                                                   16520000
         SPACE 1                                                        16530000
ZIF710   CLI   IFDATEKY+1,16            MONTH                           16540000
         BNE   ZIF712                   NO, BRANCH                      16550000
         MVI   FULLWORD+2,03            3X TYPE DATE                    16560000
         MVI   FULLWORD+3,X'0F'         MONTH                           16570000
         B     ZIF790                                                   16580000
         SPACE 1                                                        16590000
ZIF712   CLI   IFDATEKY+1,17            QUARTER?                        16600000
         BNE   ZIF714                   NO, BRANCH                      16610000
         MVI   FULLWORD+2,X'09'         9X TYPE DATE          DRK FEB00 16620000
         MVI   FULLWORD+3,X'0F'         QUARTER                         16630000
         B     ZIF790                                                   16640000
         SPACE 1                                                        16650000
ZIF714   CLI   IFDATEKY+1,18            HALFYEAR                        16660000
         BNE   ZIF716                   NO, BRANCH                      16670000
         MVI   FULLWORD+2,X'18'         18X TYPE DATE                   16680000
         MVI   FULLWORD+3,X'3F'         HALFYEAR                        16690000
         B     ZIF790                                                   16700000
         SPACE 1                                                        16710000
ZIF716   CLI   IFDATEKY+1,19            YEAR?                           16720000
         BNE   ZIF718                   NO, BRANCH                      16730000
         MVC   FULLWORD+1(3),=PL3'1000' ONE YEAR                        16740000
         B     ZIF790                                                   16750000
         SPACE 1                                                        16760000
ZIF718   CLI   IFDATEKY+1,20            BIYEAR?                         16770000
         BNE   ZIF720                   NO, BRANCH                      16780000
         MVC   FULLWORD+1(3),=PL3'2000' TWO YEARS                       16790000
         B     ZIF790                                                   16800000
         SPACE 1                                                        16810000
ZIF720   CLI   IFDATEKY+1,21            LAST(NNN)?                      16820000
         BNE   ZIF740                   NO, BRANCH                      16830000
         LA    R1,IFLASTSU              NNN                             16840000
         BAS   R14,PACKMAX              ANY RESULT?                     16850000
         B     ZIF730                   YES, BRANCH                     16860000
         B     ZIF740                   NO, BRANCH                      16870000
ZIF730   SR    R0,R0                                                    16880000
         D     R0,=F'365'               DAYS IN ONE YEAR                16890000
         MH    R1,=H'1000'              NUMBER OF YEARS                 16900000
         AR    R1,R0                    IN YYDDD FORMAT                 16910000
         CVD   R1,DOUBLE                IN DECIMAL                      16920000
         MVC   FULLWORD(4),DOUBLE+4     PLACE IN FULLWORD               16930000
         B     ZIF790                                                   16940000
         SPACE 1                                                        16950000
ZIF740   CLI   IFDATEKY+1,22            DATE(YYDDD)                     16960000
         BNE   ZIF752                   NO, BRANCH                      16970000
         LA    R1,IFDATESU              YYDDD                           16980000
         BAS   R14,PACKMAX              ANY RESULT?                     16990000
         B     ZIF750                   YES, BRANCH                     17000000
         B     ZIF789                   NO, BRANCH                      17010000
ZIF750   MVC   DOUBLE+1(3),DOUBLE+5     SAVE RESULT                     17020000
         B     ZIF792                                                   17030000
         SPACE 1                                                        17040000
ZIF752   CLI   IFDATEKY+1,23            BIMONTH?              DRK MAR05 17050000
         BNE   ZIF789                   NO, BRANCH            DRK MAR05 17060000
         MVI   FULLWORD+2,X'06'         6X TYPE DATE          DRK MAR05 17070000
         MVI   FULLWORD+3,X'0F'         TWO MONTHS            DRK MAR05 17080000
         B     ZIF790                                         DRK MAR05 17090000
         SPACE 1                                                        17100000
ZIF789   DS    0H                                                       17110000
         B     ZIF900                   NONE OF THE ABOVE, BRANCH       17120000
         SPACE 1                                                        17130000
ZIF790   TIME  DEC                      CURRENT TIME AND DATE           17140000
         ST    R1,DOUBLE                CURRENT DATE                    17150000
         OI    FULLWORD+3,X'0F'         INSURE STANDARD SIGN            17160000
         CLC   FULLWORD+2(2),DOUBLE+2   ROTATE A YEAR?                  17170000
         BL    ZIF791                   NO, BRANCH                      17180000
         SP    DOUBLE(4),=PL3'1000'     LESS ONE YEAR                   17190000
         AP    DOUBLE(4),=PL2'365'      ADD THE DAYS                    17200000
ZIF791   SP    DOUBLE(4),FULLWORD(4)    LESS INCREMENT                  17210000
         OI    DOUBLE+3,X'0F'           INSURE STANDARD SIGN            17220000
ZIF792   CLI   IFFROMKY+1,1             FROM/SINCE?                     17230000
         BH    ZIF795                   NO, TO/BEFORE                   17240000
         TIME  DEC                      CURRENT TIME AND DATE           17250000
         TM    FLAGSCC,RECFMU           LOAD MODULE?                    17260000
         BO    ZIF794                   YES, BRANCH                     17270000
         MVC   #IFMODIF(3),DOUBLE+1     FIRST DATE                      17280000
         STCM  R1,B'0111',#IFMODIF+3    SECOND DATE                     17290000
         B     ZIF799                                                   17300000
ZIF794   MVC   #IFCREIF(3),DOUBLE+1     FIRST DATE                      17310000
         STCM  R1,B'0111',#IFCREIF+3    SECOND DATE                     17320000
         B     ZIF799                                                   17330000
ZIF795   DS    0H                                                       17340000
         SP    DOUBLE(4),=PL1'1'        LESS ANOTHER DAY                17350000
         OI    DOUBLE+3,X'0F'           INSURE STANDARD SIGN            17360000
         TM    FLAGSCC,RECFMU           LOAD MODULE?                    17370000
         BO    ZIF797                   YES, BRANCH                     17380000
         MVC   #IFMODIF(3),=X'00000F'   FIRST DATE                      17390000
         MVC   #IFMODIF+3(3),DOUBLE+1   SECOND DATE                     17400000
         B     ZIF799                                                   17410000
ZIF797   MVC   #IFCREIF(3),=X'00000F'   FIRST DATE                      17420000
         MVC   #IFCREIF+3(3),DOUBLE+1   SECOND DATE                     17430000
ZIF799   DS    0H                                                       17440000
         SPACE 1                                                        17450000
ZIF900   TM    IFTSSI+6,X'80'       STRING CODED?                       17460000
         BNO   ZIF980               NO, DONE                            17470000
         L     R5,IFTSSI            NEW STRING ADDRESS                  17480000
         LH    R1,IFTSSI+4          LENGTH OF STRING                    17490000
         LTR   R1,R1                NULL STRING CODED?                  17500000
         BNP   ZIF980               YES, DONE                           17510000
         MVI   MSGTEXT2+1,4         MAXIMUM OF 4 DIGITS                 17520000
         MVC   MSGTEXT1,PDS385A     SSI MESSAGE                         17530000
         BAS   R2,HEXC              CONVERT TO BINARY                   17540000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        17550000
         OI    #SSIOPT,X'04'        A SSI VALUE HAS BEEN REQUESTED      17560000
         LA    R15,8                                                    17570000
         SR    R1,R1                                                    17580000
         IC    R1,MSGTEXT2+2        GET ORIGINAL TEXT LENGTH            17590000
         SR    R15,R1               8-LENGTH                            17600000
         STC   R15,SHIFTSSI         SAVE NUMBER OF DIGITS               17610000
         SLL   R15,2                (8-LENGTH)*4                        17620000
         SLL   R0,0(R15)            SHIFT LEFT BY 0, 4, 8, ... OR 28    17630000
         STCM  R0,B'1111',#SSITEXT  SAVE THE RESULTING PARTIAL SSI      17640000
         SR    R0,R0                                                    17650000
         BCTR  R0,0                 FFFFFFFF                            17660000
         SLL   R0,0(R15)            SHIFT LEFT BY 0, 4, 8, ... OR 28    17670000
         STCM  R0,B'1111',SSIMASK   SAVE THE RESULTING SSI MASK         17680000
         SPACE 2                                                        17690000
ZIF980   TM    FLAGSCC,RECFMU         LOAD MODULE?                      17700000
         BNO   ZIF990                 NO, BRANCH                        17710000
         OC    #IFCREIF(6),#IFCREIF   ANY CREATION DATE CHECK?          17720000
         BZ    ZIF984                 NO, BRANCH                        17730000
         OI    #OPTOPT,X'02'          YES, SET A FLAG FOR LATER         17740000
         MVC   FULLWORD(3),#IFCREIF   FIRST FIELD                       17750000
         LA    R1,FULLWORD                                              17760000
         LA    R15,#IFCREIF                                             17770000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          17780000
         ICM   R1,B'0100',#IFCREIF+2  GET YY                            17790000
         ICM   R1,B'0011',#IFCREIF    GET MMDD                          17800000
         STCM  R1,B'0111',#IFCREIF    SAVE AS YYMMDD                    17810000
         MVC   FULLWORD(3),#IFCREIF+3 GET SECOND FIELD                  17820000
         LA    R1,FULLWORD                                              17830000
         LA    R15,#IFCREIF+3                                           17840000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          17850000
         ICM   R1,B'0100',#IFCREIF+5  GET YY                            17860000
         ICM   R1,B'0011',#IFCREIF+3  GET MMDD                          17870000
         STCM  R1,B'0111',#IFCREIF+3  SAVE AS YYMMDD                    17880000
         SPACE 1                                                        17890000
ZIF984   OC    #IFMODIF(6),#IFMODIF   ANY MODIFICATION DATE CHECK?      17900000
         BZ    ZIF990                 NO, BRANCH                        17910000
         OI    #OPTOPT,X'02'          YES, SET A FLAG FOR LATER         17920000
         MVC   FULLWORD(3),#IFMODIF   FIRST FIELD                       17930000
         LA    R1,FULLWORD                                              17940000
         LA    R15,#IFMODIF                                             17950000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          17960000
         ICM   R1,B'0100',#IFMODIF+2  GET YY                            17970000
         ICM   R1,B'0011',#IFMODIF    GET MMDD                          17980000
         STCM  R1,B'0111',#IFMODIF    SAVE AS YYMMDD                    17990000
         MVC   FULLWORD(3),#IFMODIF+3 SECOND FIELD                      18000000
         LA    R1,FULLWORD                                              18010000
         LA    R15,#IFMODIF+3                                           18020000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          18030000
         ICM   R1,B'0100',#IFMODIF+5  GET YY                            18040000
         ICM   R1,B'0011',#IFMODIF+3  GET MMDD                          18050000
         STCM  R1,B'0111',#IFMODIF+3  SAVE AS YYMMDD                    18060000
         SPACE 1                                                        18070000
ZIF990   L     R6,ADDRANSR            RESET THE PDL BASE ADDRESS        18080000
         OC    #ATTRYES(13),#ATTRYES  ANY LINKAGE EDITOR ATTRIBUTES?    18090000
         BZ    *+8                    NO, BRANCH                        18100000
         OI    #OPTOPT,X'01'          YES, SET A FLAG FOR LATER         18110000
         OC    #ZAPOPT(6),#ZAPOPT     ZAP/USER/TRAN/LKED/MODULE/RLDERR? 18120000
         BZ    *+8                    NO, BRANCH                        18130000
         OI    #OPTOPT,X'02'+X'01'    YES, SET A FLAG FOR LATER         18140000
         OC    #IOERROR(4),#IOERROR   IOERROR/BLOCKERR/LRECLERR/NULL?   18150000
         BZ    *+8                    NO, BRANCH                        18160000
         OI    #OPTOPT,X'04'          YES, SET A FLAG FOR LATER         18170000
         SPACE 1                                                        18180099
         OC    #PACKED(1),#PACKED     PACKED/NOPACKED?        DRK APR18 18190099
         BZ    *+8                    NO, BRANCH              DRK APR18 18200099
         OI    #OPTOPT,X'04'          YES, SET A FLAG FOR LATER       " 18210099
         SPACE 1                                                        18220000
         LH    R1,IFTHENCC            THEN ACTION NUMBER                18230000
         SLA   R1,2                   ACTION SPECIFIED                  18240000
         L     R1,THENTBL(R1)         THEN ACTION POINTER               18250000
         ST    R1,#ACTIONT            NOTE FOR LATER                    18260000
         OC    FLAGSII(1),#ACTIONT    SET POSSIBLE FSINGLE FLAG         18270000
***TEST  OC    SPFLAG3(1),#ACTIONT    SET POSSIBLE INVALID    ABL OCT84 18280000
         SPACE 1                                                        18290000
         LH    R1,IFELSECC            ELSE ACTION NUMBER                18300000
         SLA   R1,2                   ACTION SPECIFIED                  18310000
         L     R1,THENTBL(R1)         ELSE ACTION POINTER               18320000
         ST    R1,#ACTIONE            NOTE FOR LATER                    18330000
         OC    FLAGSII(1),#ACTIONE    SET POSSIBLE FSINGLE FLAG         18340000
***TEST  OC    SPFLAG3(1),#ACTIONE    SET POSSIBLE INVALID    ABL OCT84 18350000
         BAS   R14,CHKTHEN            THEN/ELSE MEMLIST SUB   DRK JAN18 18360099
         B     PARSPOST                                                 18370000
         SPACE 2                                                        18380000
THENTBL  DC    A(0)                        NO ASSOCIATED THEN/ELSE      18390000
&NATT    COND  DC,A($ATT)                  ATTRIB                       18400000
&NBRO    COND  DC,A($BRO)                  BROWSE                       18410000
&NDIR    COND  DC,A($DIR)                  DIRENTRY                     18420099
     AIF ('&NDEL' EQ '').NDEL120                                        18430000
         DC    AL1(FSINGLE),AL3($DEL)      DELETE                       18440000
.NDEL120 ANOP                                                           18450000
&NDSP    COND  DC,A($DSP)                  DSPRINT                      18460000
&NEDI    COND  DC,A($EDI)                  EDIT                         18470000
&NEND    COND  DC,A($END)                  END                          18480000
&NFIN    COND  DC,A($FIN)                  FIND                         18490000
&NFSE    COND  DC,A($FSE)                  FSE                          18500000
&NHIS    COND  DC,A($HIS)                  HISTORY                      18510000
&NLIS    COND  DC,A($LIS)                  LIST                         18520000
&NMAP    COND  DC,A($MAP)                  MAP                          18530000
     AIF ('&NMEM' EQ '').NMEM120                                        18540000
         DC    AL1(FMEMBERS),AL3($MEM)     MEMBERS                      18550000
.NMEM120 ANOP                                                           18560000
     AIF ('&NMML' EQ '').NMML120                                        18570000
         DC    AL1(FMEMLIST),AL3($MML)     MEMLIST                      18580000
.NMML120 ANOP                                                           18590000
     AIF ('&IMLX' EQ '').NIML120                                        18600000
         DC    AL1(FMEMLIST),AL3($MML)     ML                           18610000
.NIML120 ANOP                                                           18620000
     AIF ('&NMML' EQ '').NNML120                              DRK JAN18 18630099
NEWML    DC    AL1(FMEMLIST+X'80'),AL3($MML) NEWML            DRK JAN18 18640099
.NNML120 ANOP                                                 DRK JAN18 18650099
&NOUT    COND  DC,A($OUT)                  OUTCOPY                      18660000
&NPRI    COND  DC,A($PRI)                  PRINTOFF                     18670000
&NREV    COND  DC,A($REV)                  REVIEW                       18680000
&NSPF    COND  DC,A($SPF)                  SPFEDIT                      18690000
     AIF ('&NSUB' EQ '').NSUB120                                        18700000
         DC    AL1(FMEMBERS),AL3($SUB)     SUBMIT                       18710000
.NSUB120 ANOP                                                           18720000
     AIF ('&NSUL' EQ '').NSUL120                                        18730000
         DC    AL1(FSUBLIST),AL3($SUL)     SUBLIST                      18740000
.NSUL120 ANOP                                                           18750000
&NTSE    COND  DC,A($TSE)                  TSOEDIT                      18760000
&NTSL    COND  DC,A($TSL)                  TSOLIST                      18770000
&NVIE    COND  DC,A($VIE)                  VIEW               DRK JUL02 18780000
&NVER    COND  DC,A($VER)                  VERIFY                       18790000
         SPACE 2                                                        18800000
         USING PDLISPF,R6                                               18810000
         USING *,R4                                                     18820000
ZISPF    TM    PCLISSTR+6,X'80'     STRING CODED?                       18830000
         BNO   PARSPOST             NO, DONE                            18840000
         LH    R2,PCLISSTR+4        LENGTH OF STRING                    18850000
         LTR   R2,R2                NULL STRING CODED?                  18860000
         BZ    PARSPOST             YES, DONE                           18870000
         CH    R2,=H'256'           LENGTH(STRING)>=256?                18880000
         BL    *+8                  NO, BRANCH                          18890000
         LH    R2,=H'256'           YES, USE 256 AS A MAXIMUM LENGTH    18900000
         STH   R2,#COMMDSZ          SAVE ACTUAL LENGTH                  18910000
         L     R1,PCLISSTR          NEW STRING ADDRESS                  18920000
         BCTR  R2,0                 MACHINE LENGTH                      18930000
         MVC   MSGLINE(*-*),0(R1)   <<EXECUTED>>                        18940000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          18950000
         B     PARSPOST                                                 18960000
         SPACE 1                                                        18970000
         USING PDLLCS,R6                                      THG MAR06 18980000
         USING *,R4                                                     18990000
ZLCS     TM    PCLCMOD+6,X'80'        ANY MODULE NAME FILTERING?        19000000
         BNO   PARSPOST               NO, BRANCH                        19010000
         LH    R15,PCLCMOD+4          LENGTH OF MODULE NAME             19020000
         STC   R15,#MODLEN            SAVE FOR LATER                    19030000
         S     R15,=F'1'              MACHINE LENGTH VALID?             19040000
         BM    PARSPOST               NO, BRANCH                        19050000
         L     R1,PCLCMOD             PARTIAL MODULE NAME               19060000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      19070000
         EX    R15,*-6                MOVE INTO STORAGE                 19080000
         B     PARSPOST                                                 19090000
         SPACE 2                                                        19100000
         USING PDLLIST,R6                                               19110000
         USING *,R4                                                     19120000
ZLIST    CLI   LISTFMT+1,0            WAS A FORMAT SPECIFIED?           19130000
         BE    ZLISCHK2               NO, QUIT                          19140000
         NI    HFLAGSDD,FF-NONUM-SNUM-BLOCK-DUMP-LBLOCK-LDUMP           19150000
         LH    R15,LISTFMT            FORMAT REQUESTED                  19160000
         A     R15,=F'-2'             LESS 2 -- NEGATIVE?               19170000
         BM    ZLISCHK2               YES, BRANCH                       19180000
         LA    R1,1                   SHIFT VALUE                       19190000
         SLL   R1,0(R15)              SHIFT INTO POSITION               19200000
         OI    HFLAGSDD,*-*           <<EXECUTED>>                      19210000
         EX    R1,*-4                 OR INTO FLAG BYTE                 19220000
         SPACE 1                                                        19230000
ZLISCHK2 LA    R1,LMAXLENC            MAXLEN                            19240000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 19250000
         ST    R1,#MAXLEN             SAVE RESULT                       19260000
         SPACE 1                                                        19270000
         LA    R1,LMAXINC             MAXIN                             19280000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 19290000
         ST    R1,#MAXIN              SAVE RESULT                       19300000
         SPACE 1                                                        19310000
         LA    R1,LMAXOUTC            MAXOUT                            19320000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 19330000
         ST    R1,#MAXOUT             SAVE RESULT                       19340000
         SPACE 1                                                        19350000
         LA    R1,LSKIPRC             SKIPREC                           19360000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 19370000
         ST    R1,#SKIPREC            SAVE RESULT                       19380000
         SPACE 1                                                        19390000
         LA    R1,LSKIPCC             SKIPCOL                           19400000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 19410000
         STH   R1,#SKIPCOL            SAVE RESULT                       19420000
         SPACE 1                                                        19430000
         TM    LISTOFF+6,X'80'        OFFSET CODED?                     19440000
         BNO   ZLISCHK3               NO, DONE                          19450000
         L     R5,LISTOFF             OFFSET ADDRESS                    19460000
         LH    R1,LISTOFF+4           LENGTH OF OFFSET                  19470000
         LTR   R1,R1                  NULL STRING CODED?                19480000
         BNP   ZLISCHK3               YES, DONE                         19490000
         MVI   MSGTEXT2+1,3           MAXIMUM OF 3 DIGITS               19500000
         MVC   MSGTEXT1,PDS384A       OFFSET INVALID MESSAGE            19510000
         BAS   R2,HEXC                CONVERT TO BINARY                 19520000
         B     PARSATTN               ATTENTION -- IGNORE THE REST      19530000
         STCM  R0,B'0111',#LISTOFF+1  SAVE THE RESULTING OFFSET         19540000
         SPACE 1                                                        19550000
ZLISCHK3 LH    R15,LDUMPCS+4          LENGTH OF BLOCK/DUMP STRING       19560000
         STC   R15,#MODLEN                                              19570000
         S     R15,=F'1'              ANY STRING?                       19580000
         BM    PARSPOST               NO, BRANCH                        19590000
         L     R1,LDUMPCS             ADDRESS OF BLOCK/DUMP STRING      19600000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        19610000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      19620000
         EX    R15,*-6                SAVE THE STRING FOR LATER         19630000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       19640000
         BNE   *+16                   NO, BRANCH                        19650000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  19660000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  19670000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     19680000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    19690000
         MVC   #LISTMFF(4),#LISTOFF   SAVE MODULE OFFSET                19700000
         XC    #LISTOFF(4),#LISTOFF   CLEAR LIST OFFSET                 19710000
         B     PARSPOST                                                 19720000
         SPACE 2                                                        19730000
         USING PDLLMA,R6                                      DRK SEP06 19740000
         USING *,R4                                                     19750000
ZLMA     MVC   #LMAALI(1),LMAALIAS+1  SAVE ALIAS/NOALIAS                19760000
         MVC   #LMAFPRS(1),LMAFPRS+1  SAVE CKVOLFPRS                    19770000
         MVC   #LMASHOW(1),LMASHOWL+1 SAVE SHOWLIB                      19780000
         MVC   #LMALOUD(1),LMALOUD+1  SAVE LOUD                         19790000
         MVC   #LMAOSVS(1),LMAOSVS+1  SAVE OSVSONLY                     19800000
         MVC   #LMAINFO(1),LMAINFO+1  SAVE LEINFO                       19810000
         MVC   #LMASCAN(1),LMASCAN+1  SAVE LESCAN                       19820000
         MVC   #LMALD(1),LMALD+1      SAVE LISTLD                       19830000
         MVC   #LMADATE(8),BLANKS     CLEAR DATEFMT                     19840000
         MVC   #LMASORT(8),BLANKS     CLEAR SORTBY                      19850000
         SPACE 1                                                        19860000
         LH    R2,LMADATET+4          LENGTH OF STRING                  19870000
         S     R2,=F'1'               ANY DATA?                         19880000
         BM    ZLMA0010               NO, BRANCH                        19890000
         L     R1,LMADATET                                              19900000
         MVC   #LMADATE(*-*),0(R1)    <<EXECUTED>>                      19910000
         EX    R2,*-6                 MOVE IN THE STRING                19920000
ZLMA0010 DS    0H                                                       19930000
         LH    R2,LMASORTT+4          LENGTH OF STRING                  19940000
         STH   R2,#LMASRTL            SAVE LENGTH USED                  19950000
         S     R2,=F'1'               ANY DATA?                         19960000
         BM    ZLMA0020               NO, BRANCH                        19970000
         L     R1,LMASORTT                                              19980000
         MVC   #LMASORT(*-*),0(R1)    <<EXECUTED>>                      19990000
         EX    R2,*-6                 MOVE IN THE STRING                20000000
ZLMA0020 DS    0H                                                       20010000
         B     PARSPOST                                                 20020000
         SPACE 2                                                        20030000
         USING PDLMAP,R6                                                20040000
         USING *,R4                                                     20050000
ZMAP     MVC   #MAPOPT(1),PCLMAPOP+1  SAVE ANY PROCESSING OPTIONS       20060000
         MVC   #MAPMCS(1),PCLMCS+1    SAVE MCS OPTION         DRK MAR16 20070099
         TM    PCLMMOD+6,X'80'        ANY MODULE NAME FILTERING?        20080000
         BNO   PARSPOST               NO, BRANCH                        20090000
         LH    R15,PCLMMOD+4          LENGTH OF MODULE NAME             20100000
         STC   R15,#MODLEN            SAVE FOR LATER                    20110000
         S     R15,=F'1'              MACHINE LENGTH VALID?             20120000
         BM    PARSPOST               NO, BRANCH                        20130000
         L     R1,PCLMMOD             PARTIAL MODULE NAME               20140000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        20150000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      20160000
         EX    R15,*-6                SAVE THE STRING FOR LATER         20170000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       20180000
         BNE   *+16                   NO, BRANCH                        20190000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  20200000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  20210000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     20220000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    20230000
         B     PARSPOST                                                 20240000
         SPACE 2                                                        20250000
         USING PDLMATCH,R6                                    DRK MAY10 20260099
         USING *,R4                                                     20270099
ZMATCH   MVC   #MATONLY(1),MATONLY+1  SAVE NEONLY/EQONLY                20280099
         MVC   #MATCOMP(1),MATCOMP+1  SAVE DATA/USER                    20290099
         MVC   #MATCHG(1),MATCHG+1    SAVE CHANGED/DIRCHANGE/NO...      20300099
         MVC   #MATSAML(1),MATSAML+1  SAVE SAMLIST                      20310099
         MVC   MSGDS2(64),BLANK128  CLEAR THE DATA SET NAME AREA        20320099
         LH    R2,MATDSN2+4         LENGTH OF STRING                    20330099
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    20340099
         BCTR  R2,0                 MACHINE LENGTH                      20350099
         L     R1,MATDSN2           NEW STRING ADDRESS                  20360099
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        20370099
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          20380099
ZMAT10   TM    MATVOL+6,X'80'       ANY NAME REQUESTED?                 20390099
         BNO   ZMAT20               NO, BRANCH                          20400099
         LH    R15,MATVOL+4         LENGTH OF NAME                      20410099
         S     R15,=F'1'            VALID?                              20420099
         BM    ZMAT20               NO, BRANCH                          20430099
         MVC   #MATVOL(6),BLANKS    INITIALIZE VOLUME NAME              20440099
         L     R1,MATVOL            ADDRESS OF NAME                     20450099
         MVC   #MATVOL(*-*),0(R1)   <<EXECUTED>>                        20460099
         EX    R15,*-6              MOVE IN THE NAME                    20470099
ZMAT20   DS    0H                                                       20480099
         SPACE 1                                                        20490099
         B     PARSPOST                                                 20500099
         SPACE 2                                                        20510099
         USING PDLMEMB,R6                                               20520000
         USING *,R4                                                     20530000
ZMEMBERS MVC   #MEMCNTK(1),MEMBERC+1     SAVE COUNT KEYWORD             20540000
         B     PARSPOST                                                 20550000
         SPACE 2                                                        20560000
         USING PDLMEML,R6                                               20570000
         USING *,R4                                                     20580000
ZMEMLIST DS    0H                                                       20590000
*        AIF ('&MLRESET' NE 'RESET').NORESET                  DRK OCT07 20600099
*        CLI   MEMLRES+1,0              RESET/NORESET OPERND? DRK OCT07 20610099
*        BE    ZML100                   NO, USE DEFAULT       DRK OCT07 20620099
*.NORESET ANOP                                                DRK OCT07 20630099
         CLI   MEMLRES+1,0              RESET/NORESET OPERND? DRK JAN18 20640099
         BNE   ZML050                   YES                   DRK JAN18 20650099
         TM    FLAGSZZ,ML#RES           NO, RESET TOGGLE ON?  DRK JAN18 20660099
         BO    ZML100                       YES               DRK JAN18 20670099
ZML050   DS    0H                                             DRK JAN18 20680099
         CLI   MEMLRES+1,1              RESET?                          20690000
         BNE   ZML200                   NO, BRANCH            DRK OCT07 20700000
ZML100   DS    0H                                             DRK OCT07 20710000
         OI    SPFLAG3,SPFCHN           YES, SIGNAL ISPMODE             20720000
ZML200   DS    0H                                             DRK OCT07 20730000
         XC    ##ANSWER,##ANSWER        NO FILTERING YET                20740000
         MVC   #ALIAOPT(1),MLLKALIA+1   ALIAS/NOALIAS                   20750000
         MVC   #SSIOPT(1),MLLKSSI+1     SSI/NOSSI/PARTSSI               20760000
         MVC   #AUTHOPT(1),MLLKAUTH+1   AUTH/NOAUTH                     20770000
         MVC   #PAGEOPT(1),MLLKPAGE+1   PAGE/NOPAGE                     20780000
         MVC   #VSLKED(1),MLLKVSLE+1    VSLKED/NOVSLKED                 20790000
         MVC   #RMODE(1),MLRMODE+1      RMODE24/RMODEANY                20800000
         MVC   #AMODE(1),MLAMODE+1      AMODE24/AMODE31/AMODEANY/NOA... 20810000
         MVC   #USERIDO(1),MLTUSERK+1   USERID/NOUSERID/NOTUSERID       20820000
         MVC   #AALIAS(1),MLAALIAS+1    APPARENTALIAS/NOAPPARENTALIAS   20830000
         MVC   #ORPHAN(1),MLORPHAN+1    ORPHAN/NOORPHAN                 20840000
         MVC   #HASALIA(1),MLHASALI+1   HASALIAS/NOHASALIAS             20850000
         MVC   #XSTATS(1),MLXSTATS+1    XSTATS/NOXSTATS       DRK OCT09 20860099
         MVC   #ATTRHI(3),=F'-1'        INITIALIZE THE SECOND TTR VALUE 20870000
         SPACE 1                                                        20880000
ZML380   CLI   MLLKREUS+1,X'01'       REUSABLE ATTRIBUTE STATUS:        20890000
         BL    ZML384                   NONE, BRANCH                    20900000
         BH    ZML382                   "NO" FORM, BRANCH               20910000
         OI    #ATTRYES,ATTRREUS        "REUS"                          20920000
         B     ZML384                                                   20930000
ZML382   OI    #ATTRNO,ATTRREUS         "NOREUS"                        20940000
         SPACE 1                                                        20950000
ZML384   CLI   MLLKREFR+1,X'01'       REFRESHABLE ATTRIBUTE STATUS:     20960000
         BL    ZML400                   NONE, BRANCH                    20970000
         BH    ZML386                   "NO" FORM, BRANCH               20980000
         OI    #ATTRYES+1,ATTRREFR      "REFR"                          20990000
         B     ZML400                                                   21000000
ZML386   OI    #ATTRNO+1,ATTRREFR       "NOREFR"                        21010000
         SPACE 1                                                        21020000
ZML400   CLI   MLLKRENT+1,X'01'       REENTRANT ATTRIBUTE STATUS:       21030000
         BL    ZML404                   NONE, BRANCH                    21040000
         BH    ZML402                   "NO" FORM, BRANCH               21050000
         OI    #ATTRYES,ATTRRENT        "RENT"                          21060000
         B     ZML404                                                   21070000
ZML402   OI    #ATTRNO,ATTRRENT         "NORENT"                        21080000
         SPACE 1                                                        21090000
ZML404   CLI   MLLKEXEC+1,X'01'       EXECUTABLE ATTRIBUTE STATUS:      21100000
         BL    ZML420                   NONE, BRANCH                    21110000
         BH    ZML406                   "NO" FORM, BRANCH               21120000
         OI    #ATTRYES,ATTREXEC        "EXEC"                          21130000
         B     ZML420                                                   21140000
ZML406   OI    #ATTRNO,ATTREXEC         "NOEXEC"                        21150000
         SPACE 1                                                        21160000
ZML420   CLI   MLLKLOAD+1,X'01'       LOADABLE ATTRIBUTE STATUS:        21170000
         BL    ZML424                   NONE, BRANCH                    21180000
         BH    ZML422                   "NO" FORM, BRANCH               21190000
         OI    #ATTRYES,ATTRLOAD        "LOAD"                          21200000
         B     ZML424                                                   21210000
ZML422   OI    #ATTRNO,ATTRLOAD         "NOLOAD"                        21220000
         SPACE 1                                                        21230000
ZML424   CLI   MLLKEDIT+1,X'01'       NOT EDITABLE ATTRIBUTE STATUS:    21240000
         BL    ZML440                   NONE, BRANCH                    21250000
         BH    ZML426                   "NO" FORM, BRANCH               21260000
         OI    #ATTRNO+1,ATTRNE        "EDIT"  -- BIT MUST BE REVERSED  21270000
         B     ZML440                                                   21280000
ZML426   OI    #ATTRYES+1,ATTRNE        "NOEDIT"                        21290000
         SPACE 1                                                        21300000
ZML440   CLI   MLLKLKED+1,X'01'       LINKAGE EDITOR ATTRIBUTE:         21310000
         BL    ZML444                   NEITHER, BRANCH                 21320000
         BH    ZML442                   NULL FORM, BRANCH               21330000
         OI    #ATTRYES+1,ATTRFLEV      "FLEVEL"                        21340000
         B     ZML444                                                   21350000
ZML442   OI    #ATTRNO+1,ATTRFLEV       "NOFLEVEL"                      21360000
         SPACE 1                                                        21370000
ZML444   CLI   MLLKOVER+1,X'01'       OVERLAY ATTRIBUTE STATUS:         21380000
         BL    ZML460                   NONE, BRANCH                    21390000
         BH    ZML446                   "NO" FORM, BRANCH               21400000
         OI    #ATTRYES,ATTROVLY        "OVERLAY"                       21410000
         B     ZML460                                                   21420000
ZML446   OI    #ATTRNO,ATTROVLY         "NOOVERLAY"                     21430000
         SPACE 1                                                        21440000
ZML460   CLI   MLLKTEST+1,X'01'       TEST ATTRIBUTE STATUS:            21450000
         BL    ZML464                   NONE, BRANCH                    21460000
         BH    ZML462                   "NO" FORM, BRANCH               21470000
         OI    #ATTRYES,ATTRTEST        "TEST"                          21480000
         B     ZML464                                                   21490000
ZML462   OI    #ATTRNO,ATTRTEST         "NOTEST"                        21500000
         SPACE 1                                                        21510000
ZML464   CLI   MLLKSCTR+1,X'01'       SCATTER ATTRIBUTE STATUS:         21520000
         BL    ZML480                   NONE, BRANCH                    21530000
         BH    ZML466                   "NO" FORM, BRANCH               21540000
         OI    #ATTRYES,ATTRSCTR        "SCTR"                          21550000
         B     ZML480                                                   21560000
ZML466   OI    #ATTRNO,ATTRSCTR         "NOSCTR"                        21570000
         SPACE 1                                                        21580000
ZML480   CLI   MLLKDC+1,X'01'         DOWNWARD COMPATIBLE ATTRIBUTE:    21590000
         BL    ZML484                   NONE, BRANCH                    21600000
         BH    ZML482                   "NO" FORM, BRANCH               21610000
         OI    #ATTRNO+1,ATTRNODC       "DC" -- BIT IS REVERSED         21620000
         B     ZML484                                                   21630000
ZML482   OI    #ATTRYES+1,ATTRNODC      "NODC"                          21640000
         SPACE 1                                                        21650000
ZML484   TM    MLTUSER+6,X'80'        ANY USERID NAME FILTERING?        21660000
         BNO   ZML500                 NO, BRANCH                        21670000
         LH    R15,MLTUSER+4          LENGTH OF USERID NAME             21680000
         STC   R15,#USERIDL           SAVE FOR LATER                    21690000
         S     R15,=F'1'              MACHINE LENGTH VALID?             21700000
         BM    ZML500                 NO, BRANCH                        21710000
         L     R1,MLTUSER             PARTIAL USERID NAME               21720000
         MVC   #USERTXT(*-*),0(R1)    <<EXECUTED>>                      21730000
         EX    R15,*-6                MOVE INTO STORAGE                 21740000
         SPACE 1                                                        21750000
ZML500   MVC   #ZAPOPT(1),MLTLZAPK+1   SAVE ZAP/NOZAP                   21760000
         MVC   #USEROPT(1),MLTLUSRK+1  SAVE USERDATA/SYSMOD             21770000
         MVC   #TRANOPT(1),MLTLTRNK+1  SAVE TRAN/NOTRAN                 21780000
         MVC   #LKEDOPT(1),MLTLKEDK+1  SAVE LKED/NOLKED                 21790000
         SPACE 1                                                        21800000
         TM    MLTLKED+6,X'80'        ANY LINKAGE EDITOR FILTERING?     21810000
         BNO   ZML502                 NO, BRANCH                        21820000
         LH    R15,MLTLKED+4          LENGTH OF LKED NAME               21830000
         STC   R15,#LKEDLEN           SAVE FOR LATER                    21840000
         S     R15,=F'1'              MACHINE LENGTH VALID?             21850000
         BM    ZML502                 NO, BRANCH                        21860000
         L     R1,MLTLKED             PARTIAL MODULE NAME               21870000
         MVC   #LKEDTXT(*-*),0(R1)    <<EXECUTED>>                      21880000
         EX    R15,*-6                MOVE INTO STORAGE                 21890000
         SPACE 1                                                        21900000
ZML502   TM    MLTLMOD+6,X'80'        ANY MODULE NAME FILTERING?        21910000
         BNO   ZML504                 NO, BRANCH                        21920000
         LH    R15,MLTLMOD+4          LENGTH OF MODULE NAME             21930000
         STC   R15,#MODLEN            SAVE FOR LATER                    21940000
         S     R15,=F'1'              MACHINE LENGTH VALID?             21950000
         BM    ZML504                 NO, BRANCH                        21960000
         L     R1,MLTLMOD             PARTIAL MODULE NAME               21970000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        21980000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      21990000
         EX    R15,*-6                SAVE THE STRING FOR LATER         22000000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       22010000
         BNE   *+16                   NO, BRANCH                        22020000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  22030000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  22040000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     22050000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    22060000
         SPACE 1                                                        22070000
ZML504   TM    MLTLTRN+6,X'80'        ANY TRANSLATOR NAME FILTERING?    22080000
         BNO   ZML506                 NO, BRANCH                        22090000
         LH    R15,MLTLTRN+4          LENGTH OF NAME                    22100000
         STC   R15,#TRANLEN           SAVE FOR LATER                    22110000
         S     R15,=F'1'              MACHINE LENGTH VALID?             22120000
         BM    ZML506                 NO, BRANCH                        22130000
         L     R1,MLTLTRN             PARTIAL TRANSLATOR NAME           22140000
         MVC   #TRANTXT(*-*),0(R1)    <<EXECUTED>>                      22150000
         EX    R15,*-6                MOVE INTO STORAGE                 22160000
         SPACE 1                                                        22170000
ZML506   TM    MLTLZAP+6,X'80'        ANY ZAP IDRDATA NAME FILTERING?   22180000
         BNO   ZML508                 NO, BRANCH                        22190000
         LH    R15,MLTLZAP+4          LENGTH OF NAME                    22200000
         STC   R15,#ZAPLEN            SAVE FOR LATER                    22210000
         S     R15,=F'1'              MACHINE LENGTH VALID?             22220000
         BM    ZML508                 NO, BRANCH                        22230000
         L     R1,MLTLZAP             PARTIAL IDRDATA DATA              22240000
         MVC   #ZAPTXT(*-*),0(R1)     <<EXECUTED>>                      22250000
         EX    R15,*-6                MOVE INTO STORAGE                 22260000
         SPACE 1                                                        22270000
ZML508   TM    MLTLUSR+6,X'80'        ANY USER IDRDATA FILTERING?       22280000
         BNO   ZML540                 NO, BRANCH                        22290000
         LH    R15,MLTLUSR+4          LENGTH OF NAME                    22300000
         STC   R15,#USERLEN           SAVE FOR LATER                    22310000
         S     R15,=F'1'              MACHINE LENGTH VALID?             22320000
         BM    ZML540                 NO, BRANCH                        22330000
         L     R1,MLTLUSR             PARTIAL IDRDATA DATA              22340000
         MVC   #USERTXT(*-*),0(R1)    <<EXECUTED>>                      22350000
         EX    R15,*-6                MOVE INTO STORAGE                 22360000
         SPACE 3                                                        22370000
ZML540   TM    MLTTTR+6,X'80'       STRING CODED?                       22380000
         BNO   ZML560               NO, DONE                            22390000
         L     R5,MLTTTR            NEW STRING ADDRESS                  22400000
         LH    R1,MLTTTR+4          LENGTH OF STRING                    22410000
         LTR   R1,R1                NULL STRING CODED?                  22420000
         BNP   ZML560               YES, DONE                           22430000
         MVI   MSGTEXT2+1,3         MAXIMUM OF 3 DIGITS                 22440000
         MVC   MSGTEXT1,PDS382A     FIRST TTR MESSAGE                   22450000
         BAS   R2,HEXC              CONVERT TO BINARY                   22460000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        22470000
         STCM  R0,B'0111',#ATTRLO   SAVE THE RESULTING TTR              22480000
         SPACE 2                                                        22490000
         TM    MLTTTR+8+6,X'80'     STRING CODED?                       22500000
         BNO   ZML560               NO, DONE                            22510000
         L     R5,MLTTTR+8          NEW STRING ADDRESS                  22520000
         LH    R1,MLTTTR+8+4        LENGTH OF STRING                    22530000
         LTR   R1,R1                NULL STRING CODED?                  22540000
         BNP   ZML560               YES, DONE                           22550000
         MVC   MSGTEXT1,PDS383A     SECOND TTR MESSAGE                  22560000
         BAS   R2,HEXC              CONVERT TO BINARY                   22570000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        22580000
         STCM  R0,B'0111',#ATTRHI   SAVE THE RESULTING TTR              22590000
         SPACE 2                                                        22600000
ZML560   LA    R1,MLABOSUB            ABOVE(COUNT)                      22610000
         BAS   R14,PACKMAX            ANY RESULT?                       22620000
         B     ZML600                 YES, BRANCH                       22630000
         B     ZML620                 NO, BRANCH                        22640000
ZML600   ST    R1,#IFABOVE            SAVE RESULT                       22650000
         OI    #IFABOVE,X'80'         MARK AS ENTERED                   22660000
         SPACE 1                                                        22670000
ZML620   LA    R1,MLBELSUB            BELOW(COUNT)                      22680000
         BAS   R14,PACKMAX            ANY RESULT?                       22690000
         B     ZML640                 YES, BRANCH                       22700000
         B     ZML660                 NO, BRANCH                        22710000
ZML640   ST    R1,#IFBELOW            SAVE RESULT                       22720000
         OI    #IFBELOW,X'80'         MARK AS ENTERED                   22730000
         SPACE 1                                                        22740000
ZML660   LA    R1,MLMODSUB              CHANGED(DATE:                   22750000
         BAS   R14,PACKMAX              ANY RESULT?                     22760000
         B     ZML662                   YES, BRANCH                     22770000
         B     ZML670                   NO, BRANCH                      22780000
ZML662   MVC   #IFMODIF(3),DOUBLE+5     SAVE RESULT                     22790000
         MVC   #IFMODIF+3(3),DOUBLE+5   IF SECOND IS MISSING, USE FIRST 22800000
         SPACE 1                                                        22810000
ZML670   LA    R1,MLMODSUB+8            CHANGED(:DATE                   22820000
         BAS   R14,PACKMAX              ANY RESULT?                     22830000
         B     ZML672                   YES, BRANCH                     22840000
         B     ZML680                   NO, BRANCH                      22850000
ZML672   MVC   #IFMODIF+3(3),DOUBLE+5   SAVE RESULT                     22860000
         OI    #IFMODIF+2,X'0F'         IF FIRST IS MISSING, USE 00000F 22870000
         SPACE 1                                                        22880000
ZML680   LA    R1,MLCRESUB              CREATED(DATE:                   22890000
         BAS   R14,PACKMAX              ANY RESULT?                     22900000
         B     ZML682                   YES, BRANCH                     22910000
         B     ZML690                   NO, BRANCH                      22920000
ZML682   MVC   #IFCREIF(3),DOUBLE+5     SAVE RESULT                     22930000
         MVC   #IFCREIF+3(3),DOUBLE+5   IF SECOND IS MISSING, USE FIRST 22940000
         SPACE 1                                                        22950000
ZML690   LA    R1,MLCRESUB+8            CREATED(:DATE                   22960000
         BAS   R14,PACKMAX              ANY RESULT?                     22970000
         B     ZML692                   YES, BRANCH                     22980000
         B     ZML696                   NO, BRANCH                      22990000
ZML692   MVC   #IFCREIF+3(3),DOUBLE+5   SAVE RESULT                     23000000
         OI    #IFCREIF+2,X'0F'         IF FIRST IS MISSING, USE 00000F 23010000
         SPACE 1                                                        23020000
ZML696   XC    FULLWORD,FULLWORD        CLEAR THE INCREMENT AMOUNT      23030000
         CLI   MLDATEKY+1,0             ANY DATE KEYWORD?               23040000
         BE    ZML900                   NO, BRANCH                      23050000
         CLI   MLDATEKY+1,10            PREV0 THROUGH PREV9?            23060000
         BH    ZML700                   NO, BRANCH                      23070000
         LH    R0,MLDATEKY              LOAD DATE                       23080000
         BCTR  R0,0                     LESS ONE                        23090000
         SLL   R0,4                     SHIFT FOR SIGN                  23100000
         STC   R0,FULLWORD+3            STORE NUMERIC VALUE             23110000
         OI    FULLWORD+3,X'0F'         ADD PACKED SIGN                 23120000
         B     ZML790                                                   23130000
         SPACE 1                                                        23140000
ZML700   MVI   FULLWORD+2,01            1X TYPE DATE                    23150000
         CLI   MLDATEKY+1,11            PREV10?                         23160000
         BNE   ZML702                   NO, BRANCH                      23170000
         MVI   FULLWORD+3,X'0F'         PREV10                          23180000
         B     ZML790                                                   23190000
         SPACE 1                                                        23200000
ZML702   CLI   MLDATEKY+1,12            PREV11?                         23210000
         BNE   ZML704                   NO, BRANCH                      23220000
         MVI   FULLWORD+3,X'1F'         PREV11                          23230000
         B     ZML790                                                   23240000
         SPACE 1                                                        23250000
ZML704   CLI   MLDATEKY+1,13            PREV12?                         23260000
         BNE   ZML706                   NO, BRANCH                      23270000
         MVI   FULLWORD+3,X'2F'         PREV12                          23280000
         B     ZML790                                                   23290000
         SPACE 1                                                        23300000
ZML706   CLI   MLDATEKY+1,14            PREV13?                         23310000
         BNE   ZML708                   NO, BRANCH                      23320000
         MVI   FULLWORD+3,X'3F'         PREV13                          23330000
         B     ZML790                                                   23340000
         SPACE 1                                                        23350000
ZML708   CLI   MLDATEKY+1,15            BIWEEK?                         23360000
         BNE   ZML710                   NO, BRANCH                      23370000
         MVI   FULLWORD+3,X'4F'         PREV14                          23380000
         B     ZML790                                                   23390000
         SPACE 1                                                        23400000
ZML710   CLI   MLDATEKY+1,16            MONTH                           23410000
         BNE   ZML712                   NO, BRANCH                      23420000
         MVI   FULLWORD+2,03            3X TYPE DATE                    23430000
         MVI   FULLWORD+3,X'0F'         MONTH                           23440000
         B     ZML790                                                   23450000
         SPACE 1                                                        23460000
ZML712   CLI   MLDATEKY+1,17            QUARTER?                        23470000
         BNE   ZML714                   NO, BRANCH                      23480000
         MVI   FULLWORD+2,X'09'         9X TYPE DATE          DRK FEB00 23490000
         MVI   FULLWORD+3,X'0F'         QUARTER                         23500000
         B     ZML790                                                   23510000
         SPACE 1                                                        23520000
ZML714   CLI   MLDATEKY+1,18            HALFYEAR                        23530000
         BNE   ZML716                   NO, BRANCH                      23540000
         MVI   FULLWORD+2,X'18'         18X TYPE DATE                   23550000
         MVI   FULLWORD+3,X'3F'         HALFYEAR                        23560000
         B     ZML790                                                   23570000
         SPACE 1                                                        23580000
ZML716   CLI   MLDATEKY+1,19            YEAR?                           23590000
         BNE   ZML718                   NO, BRANCH                      23600000
         MVC   FULLWORD+1(3),=PL3'1000' ONE YEAR                        23610000
         B     ZML790                                                   23620000
         SPACE 1                                                        23630000
ZML718   CLI   MLDATEKY+1,20            BIYEAR?                         23640000
         BNE   ZML720                   NO, BRANCH                      23650000
         MVC   FULLWORD+1(3),=PL3'2000' TWO YEARS                       23660000
         B     ZML790                                                   23670000
         SPACE 1                                                        23680000
ZML720   CLI   MLDATEKY+1,21            LAST(NNN)?                      23690000
         BNE   ZML740                   NO, BRANCH                      23700000
         LA    R1,MLLASTSU              NNN                             23710000
         BAS   R14,PACKMAX              ANY RESULT?                     23720000
         B     ZML730                   YES, BRANCH                     23730000
         B     ZML740                   NO, BRANCH                      23740000
ZML730   SR    R0,R0                                                    23750000
         D     R0,=F'365'               DAYS IN ONE YEAR                23760000
         MH    R1,=H'1000'              NUMBER OF YEARS                 23770000
         AR    R1,R0                    IN YYDDD FORMAT                 23780000
         CVD   R1,DOUBLE                IN DECIMAL                      23790000
         MVC   FULLWORD(4),DOUBLE+4     PLACE IN FULLWORD               23800000
         B     ZML790                                                   23810000
         SPACE 1                                                        23820000
ZML740   CLI   MLDATEKY+1,22            DATE(YYDDD)                     23830000
         BNE   ZML752                   NO, BRANCH                      23840000
         LA    R1,MLDATESU              YYDDD                           23850000
         BAS   R14,PACKMAX              ANY RESULT?                     23860000
         B     ZML750                   YES, BRANCH                     23870000
         B     ZML789                   NO, BRANCH                      23880000
ZML750   MVC   DOUBLE+1(3),DOUBLE+5     SAVE RESULT                     23890000
         B     ZML792                                                   23900000
         SPACE 1                                                        23910000
ZML752   CLI   MLDATEKY+1,23            BIMONTH?              DRK MAR05 23920000
         BNE   ZML789                   NO, BRANCH            DRK MAR05 23930000
         MVI   FULLWORD+2,X'06'         6X TYPE DATE          DRK MAR05 23940000
         MVI   FULLWORD+3,X'0F'         TWO MONTHS            DRK MAR05 23950000
         B     ZML790                                         DRK MAR05 23960000
         SPACE 1                                                        23970000
ZML789   DS    0H                                                       23980000
         B     ZML900                   NONE OF THE ABOVE, BRANCH       23990000
         SPACE 1                                                        24000000
ZML790   TIME  DEC                      CURRENT TIME AND DATE           24010000
         ST    R1,DOUBLE                CURRENT DATE                    24020000
         OI    FULLWORD+3,X'0F'         INSURE STANDARD SIGN            24030000
         CLC   FULLWORD+2(2),DOUBLE+2   ROTATE A YEAR?                  24040000
         BL    ZML791                   NO, BRANCH                      24050000
         SP    DOUBLE(4),=PL3'1000'     LESS ONE YEAR                   24060000
         AP    DOUBLE(4),=PL2'365'      ADD THE DAYS                    24070000
ZML791   SP    DOUBLE(4),FULLWORD(4)    LESS INCREMENT                  24080000
         OI    DOUBLE+3,X'0F'           INSURE STANDARD SIGN            24090000
ZML792   CLI   MLFROMKY+1,1             FROM/SINCE?                     24100000
         BH    ZML795                   NO, TO/BEFORE                   24110000
         TIME  DEC                      CURRENT TIME AND DATE           24120000
         TM    FLAGSCC,RECFMU           LOAD MODULE?                    24130000
         BO    ZML794                   YES, BRANCH                     24140000
         MVC   #IFMODIF(3),DOUBLE+1     FIRST DATE                      24150000
         STCM  R1,B'0111',#IFMODIF+3    SECOND DATE                     24160000
         B     ZML799                                                   24170000
ZML794   MVC   #IFCREIF(3),DOUBLE+1     FIRST DATE                      24180000
         STCM  R1,B'0111',#IFCREIF+3    SECOND DATE                     24190000
         B     ZML799                                                   24200000
ZML795   DS    0H                                                       24210000
         SP    DOUBLE(4),=PL1'1'        LESS ANOTHER DAY                24220000
         OI    DOUBLE+3,X'0F'           INSURE STANDARD SIGN            24230000
         TM    FLAGSCC,RECFMU           LOAD MODULE?                    24240000
         BO    ZML797                   YES, BRANCH                     24250000
         MVC   #IFMODIF(3),=X'00000F'   FIRST DATE                      24260000
         MVC   #IFMODIF+3(3),DOUBLE+1   SECOND DATE                     24270000
         B     ZML799                                                   24280000
ZML797   MVC   #IFCREIF(3),=X'00000F'   FIRST DATE                      24290000
         MVC   #IFCREIF+3(3),DOUBLE+1   SECOND DATE                     24300000
ZML799   DS    0H                                                       24310000
         SPACE 1                                                        24320000
ZML900   TM    MLTSSI+6,X'80'       STRING CODED?                       24330000
         BNO   ZML980               NO, DONE                            24340000
         L     R5,MLTSSI            NEW STRING ADDRESS                  24350000
         LH    R1,MLTSSI+4          LENGTH OF STRING                    24360000
         LTR   R1,R1                NULL STRING CODED?                  24370000
         BNP   ZML980               YES, DONE                           24380000
         MVI   MSGTEXT2+1,4         MAXIMUM OF 4 DIGITS                 24390000
         MVC   MSGTEXT1,PDS385A     SSI MESSAGE                         24400000
         BAS   R2,HEXC              CONVERT TO BINARY                   24410000
         B     PARSATTN             ATTENTION -- IGNORE THE REST        24420000
         OI    #SSIOPT,X'04'        A SSI VALUE HAS BEEN REQUESTED      24430000
         LA    R15,8                                                    24440000
         SR    R1,R1                                                    24450000
         IC    R1,MSGTEXT2+2        GET ORIGINAL TEXT LENGTH            24460000
         SR    R15,R1               8-LENGTH                            24470000
         STC   R15,SHIFTSSI         SAVE NUMBER OF DIGITS               24480000
         SLL   R15,2                (8-LENGTH)*4                        24490000
         SLL   R0,0(R15)            SHIFT LEFT BY 0, 4, 8, ... OR 28    24500000
         STCM  R0,B'1111',#SSITEXT  SAVE THE RESULTING PARTIAL SSI      24510000
         SR    R0,R0                                                    24520000
         BCTR  R0,0                 FFFFFFFF                            24530000
         SLL   R0,0(R15)            SHIFT LEFT BY 0, 4, 8, ... OR 28    24540000
         STCM  R0,B'1111',SSIMASK   SAVE THE RESULTING SSI MASK         24550000
         SPACE 2                                                        24560000
ZML980   TM    FLAGSCC,RECFMU         LOAD MODULE?                      24570000
         BNO   ZML990                 NO, BRANCH                        24580000
         OC    #IFCREIF(6),#IFCREIF   ANY CREATION DATE CHECK?          24590000
         BZ    ZML984                 NO, BRANCH                        24600000
         OI    #OPTOPT,X'02'          YES, SET A FLAG FOR LATER         24610000
         MVC   FULLWORD(3),#IFCREIF   FIRST FIELD                       24620000
         LA    R1,FULLWORD                                              24630000
         LA    R15,#IFCREIF                                             24640000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          24650000
         ICM   R1,B'0100',#IFCREIF+2  GET YY                            24660000
         ICM   R1,B'0011',#IFCREIF    GET MMDD                          24670000
         STCM  R1,B'0111',#IFCREIF    SAVE AS YYMMDD                    24680000
         MVC   FULLWORD(3),#IFCREIF+3 GET SECOND FIELD                  24690000
         LA    R1,FULLWORD                                              24700000
         LA    R15,#IFCREIF+3                                           24710000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          24720000
         ICM   R1,B'0100',#IFCREIF+5  GET YY                            24730000
         ICM   R1,B'0011',#IFCREIF+3  GET MMDD                          24740000
         STCM  R1,B'0111',#IFCREIF+3  SAVE AS YYMMDD                    24750000
         SPACE 1                                                        24760000
ZML984   OC    #IFMODIF(6),#IFMODIF   ANY MODIFICATION DATE CHECK?      24770000
         BZ    ZML990                 NO, BRANCH                        24780000
         OI    #OPTOPT,X'02'          YES, SET A FLAG FOR LATER         24790000
         MVC   FULLWORD(3),#IFMODIF   FIRST FIELD                       24800000
         LA    R1,FULLWORD                                              24810000
         LA    R15,#IFMODIF                                             24820000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          24830000
         ICM   R1,B'0100',#IFMODIF+2  GET YY                            24840000
         ICM   R1,B'0011',#IFMODIF    GET MMDD                          24850000
         STCM  R1,B'0111',#IFMODIF    SAVE AS YYMMDD                    24860000
         MVC   FULLWORD(3),#IFMODIF+3 SECOND FIELD                      24870000
         LA    R1,FULLWORD                                              24880000
         LA    R15,#IFMODIF+3                                           24890000
         BAS   R14,CONVDATE           CONVERT YYDDDF TO MMDDYY          24900000
         ICM   R1,B'0100',#IFMODIF+5  GET YY                            24910000
         ICM   R1,B'0011',#IFMODIF+3  GET MMDD                          24920000
         STCM  R1,B'0111',#IFMODIF+3  SAVE AS YYMMDD                    24930000
         SPACE 1                                                        24940000
ZML990   L     R6,ADDRANSR            RESET THE PDL BASE ADDRESS        24950000
         OC    #ATTRYES(13),#ATTRYES  ANY LINKAGE EDITOR ATTRIBUTES?    24960000
         BZ    *+8                    NO, BRANCH                        24970000
         OI    #OPTOPT,X'01'          YES, SET A FLAG FOR LATER         24980000
         OC    #ZAPOPT(6),#ZAPOPT     ZAP/USER/TRAN/LKED/MODULE/RLDERR? 24990000
         BZ    *+8                    NO, BRANCH                        25000000
         OI    #OPTOPT,X'02'+X'01'    YES, SET A FLAG FOR LATER         25010000
         OC    #IOERROR(4),#IOERROR   IOERROR/BLOCKERR/LRECLERR/NULL?   25020000
         BZ    *+8                    NO, BRANCH                        25030000
         OI    #OPTOPT,X'04'          YES, SET A FLAG FOR LATER         25040000
         SPACE 1                                                        25050000
         OC    #ZAPOPT(#ATTRLO+3-#ZAPOPT),#ZAPOPT   ANY FILTERING?      25060000
         BNZ   ZML996                               YES, BRANCH         25070000
         OC    #ZAPLEN(#USERTXT+8-#ZAPLEN),#ZAPLEN  ANY FILTERING?      25080000
         BNZ   ZML996                               YES, BRANCH         25090000
         CLC   #ATTRHI(3),=XL3'FFFFFF'              ANY FILTERING?      25100000
         BE    ZML999                               NO, BRANCH          25110000
         SPACE 1                                                        25120000
ZML996   L     R1,=A($IFX)            START OF IF SUBCOMMAND            25130000
***TEST  MVC   ##SUBCOM(8),0(R1)      CHANGE TO IF SUBCOMMAND           25140000
         MVC   ##ADRCMD+1(3),9(R1)    CHANGE START ADDRESS              25150000
         L     R1,ZMLTMML             THEN ACTION POINTER               25160000
         ST    R1,#ACTIONT            NOTE FOR LATER                    25170000
         OC    FLAGSII(1),#ACTIONT    SET POSSIBLE FSINGLE              25180000
***TEST  OC    SPFLAG3(1),#ACTIONT    SET POSSIBLE INVALID              25190000
         SPACE 2                                                        25200000
ZML999   DS    0H                                                       25210000
         OI    #OPTOPT,X'80'          PARSE WAS CALLED FOR MEMLIST      25220000
         CLI   MEMLLKD+1,1            LKEDDATE?                         25230000
         BNE   *+8                    NO, BRANCH                        25240000
         OI    FLAGSHH,FLKEDYES       YES, SET A FLAG                   25250000
         CLI   MEMLLKD+1,2            NOLKEDDATE?                       25260000
         BNE   *+8                    NO, BRANCH                        25270000
         OI    FLAGSHH,FLKEDNO        YES, SET A FLAG                   25280000
         B     PARSPOST                                                 25290000
         SPACE 1                                                        25300000
ZMLTMML  DC    0F'0',AL1(FMEMLIST),AL3($MML)     MEMLIST                25310000
         SPACE 2                                                        25320000
         USING PDLOFFL,R6                                     DRK APR06 25330000
         USING *,R4                                                     25340000
ZOFFLOAD MVC   #OFLALI(1),OFLALIAS+1  SAVE ALIAS/NOALIAS                25350000
         MVC   #OFLDISP(1),OFLDISP+1  SAVE OLD/SHR/MOD/NEW    DRK MAR18 25360099
         MVC   #OFLSEP(1),OFLSEP+1    SAVE IEBUPDTE/NOSEP     DRK DEC15 25370099
         MVC   #OFLTRCY(1),OFLTRCYL+1 SAVE TRK/CYL            DRK MAR18 25380099
         MVC   MSGDS2(64),BLANK128  CLEAR THE DATA SET NAME AREA        25390000
         LH    R2,OFLDSN2+4         LENGTH OF STRING                    25400000
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    25410000
         BCTR  R2,0                 MACHINE LENGTH                      25420000
         L     R1,OFLDSN2           NEW STRING ADDRESS                  25430000
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        25440000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          25450000
         SPACE 1                                                        25460099
ZOFFL10  TM    OFLVOL+6,X'80'       ANY NAME REQUESTED?                 25470099
         BNO   ZOFFL20              NO, BRANCH                          25480099
         LH    R15,OFLVOL+4         LENGTH OF NAME                      25490099
         S     R15,=F'1'            VALID?                              25500099
         BM    ZOFFL20              NO, BRANCH                          25510099
         MVC   #OFLVOL(6),BLANKS    INITIALIZE VOLUME NAME              25520099
         L     R1,OFLVOL            ADDRESS OF NAME                     25530099
         MVC   #OFLVOL(*-*),0(R1)   <<EXECUTED>>                        25540099
         EX    R15,*-6              MOVE IN THE NAME                    25550099
ZOFFL20  LA    R1,OFLSPACE          SPACE(PRIMARY)                      25560099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   25570099
         STH   R1,#OFLSPAC          SAVE RESULT                         25580099
         ICM   R1,B'0111',OFLSPACE+9  NEXT LIST ITEM PRESENT?           25590099
         BZ    ZOFFL30                NO, BRANCH                        25600099
*        LR    R1,R1                SPACE(,SECONDARY)                   25610099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   25620099
         STH   R1,#OFLSPAC+2        SAVE RESULT                         25630099
         SPACE 1                                                        25640099
ZOFFL30  DS    0H                                                       25650099
         B     PARSPOST                                                 25660000
         SPACE 2                                                        25670000
         USING PDLOUT,R6                                                25680000
         USING *,R4                                                     25690000
ZOUTCOPY MVC   #OUTOPTN(1),OUTOPTN+1     SAVE TEXT/NOTEXT               25700099
         CLI   OUTCLOS+1,1               CLOSE REQUESTED?               25710000
         BNE   *+8                       NO, BRANCH                     25720000
         MVI   #OUT,1                    YES, FLAG FOR LATER            25730000
         CLI   OUTECHO+1,1               ECHO/NOECHO?                   25740000
         BL    ZOUT010                   NO, BRANCH                     25750000
         OI    FLAGSFF,FNOECHO           ASSUME NO ECHO IS DESIRED      25760000
         CLI   OUTECHO+1,2               CORRECT?                       25770000
         BE    ZOUT010                   YES, BRANCH                    25780000
         NI    FLAGSFF,FF-FNOECHO        NO, ECHO IS DESIRED            25790000
         SPACE 1                                                        25800000
ZOUT010  CLI   #OUTOPTN,1                TEXT('STRING')?                25810000
         BNE   ZOUT020                   NO, BRANCH                     25820000
         MVC   MSGLINE(40),BLANK128      CLEAR INITIALLY                25830000
         LH    R2,OUTTEXT+4              LENGTH OF STRING               25840000
         LTR   R2,R2                     NULL STRING CODED?             25850000
         BZ    ZOUT020                   YES, DONE                      25860000
         CH    R2,=H'40'                 LENGTH(STRING)>=40?            25870000
         BL    *+8                       NO, BRANCH                     25880000
         LH    R2,=H'40'                 YES, USE 40 INSTEAD            25890000
         L     R1,OUTTEXT                NEW STRING ADDRESS             25900000
         S     R2,=F'1'                  GOOD STRING TO MOVE?           25910000
         BM    ZOUT020                   NO, SKIP THE MOVE              25920000
         MVC   MSGLINE(*-*),0(R1)        <<EXECUTED>>                   25930000
         EX    R2,*-6                    MOVE IN THE TEXT               25940000
         SPACE 1                                                        25950000
ZOUT020  CLI   OUTASS+1,1                ALIAS/NOALIAS?                 25960000
         BL    ZOUT030                   NO, BRANCH                     25970000
         OI    FLAGSEE,FOUTASS           ASSUME ALIAS IS DESIRED        25980000
         CLI   OUTASS+1,1                CORRECT?                       25990000
         BE    ZOUT030                   YES, BRANCH                    26000000
         NI    FLAGSEE,FF-FOUTASS        NO, NOALIAS IS DESIRED         26010000
         SPACE 1                                                        26020000
ZOUT030  CLI   OUTIEB+1,1                IEBUPDAT/NOIEBUPDAT            26030000
         BL    PARSPOST                  NO, BRANCH                     26040000
         OI    FLAGSFF,FIEBUPDT          ASSUME IEBUPDAT IS DESIRED     26050000
         CLI   OUTIEB+1,1                CORRECT?                       26060000
         BE    PARSPOST                  YES, BRANCH                    26070000
         NI    FLAGSFF,FF-FIEBUPDT       NO, NOIEBUPDAT IS DESIRED      26080000
         B     PARSPOST                                                 26090000
         SPACE 2                                                        26100000
         USING PDLPRINT,R6                                              26110000
         USING *,R4                                                     26120000
ZPRINTOF TM    PCLPRSTR+6,X'80'     STRING CODED?                       26130000
         BNO   PARSPOST             NO, DONE                            26140000
         LH    R2,PCLPRSTR+4        LENGTH OF STRING                    26150000
         LTR   R2,R2                NULL STRING CODED?                  26160000
         BZ    PARSPOST             YES, DONE                           26170000
         CH    R2,=H'120'           LENGTH(STRING)>=120?                26180000
         BL    *+8                  NO, BRANCH                          26190000
         LH    R2,=H'120'           YES, USE 120 AS A MAXIMUM LENGTH    26200000
         STH   R2,#COMMDSZ          SAVE ACTUAL LENGTH                  26210000
         MVC   MSGLINE(120),BLANK128  CLEAR INITIALLY                   26220000
         L     R1,PCLPRSTR          NEW STRING ADDRESS                  26230000
         BCTR  R2,0                 MACHINE LENGTH                      26240000
         MVC   MSGLINE(*-*),0(R1)   <<EXECUTED>>                        26250000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          26260000
         B     PARSPOST                                                 26270000
         SPACE 2                                                        26280000
         USING PDLPTSE,R6                                     DRK APR06 26290000
         USING *,R4                                                     26300000
ZPTSEXP  MVC   #PTSDISP(1),PTSDISP+1  SAVE OLD/SHR/MOD/NEW    DRK MAR18 26310099
         MVC   #PTSLIST(1),PTSLIST+1  SAVE LIST/NOLIST        DRK MAY14 26320099
         MVC   #PTSTRCY(1),PTSTRCYL+1 SAVE TRK/CYL                      26330099
         CLC   =CL8'ALL',MEMBER1      ALL MEMBERS             DRK AUG18 26340099
         BNE   ZPTS05                 NO                              " 26350099
         NI    ##ADRPC#,FF-@B         YES, NO BLDL REQUIRED           " 26360099
ZPTS05   DS    0H                                                       26370099
         MVC   MSGDS2(64),BLANK128  CLEAR THE DATA SET NAME AREA        26380099
         LH    R2,PTSDSN2+4         LENGTH OF STRING                    26390099
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    26400000
         BCTR  R2,0                 MACHINE LENGTH                      26410000
         L     R1,PTSDSN2           NEW STRING ADDRESS                  26420099
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        26430000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          26440000
         SPACE 1                                                        26450099
ZPTS10   TM    PTSVOL+6,X'80'       ANY NAME REQUESTED?                 26460099
         BNO   ZPTS20               NO, BRANCH                          26470099
         LH    R15,PTSVOL+4         LENGTH OF NAME                      26480099
         S     R15,=F'1'            VALID?                              26490099
         BM    ZPTS20               NO, BRANCH                          26500099
         MVC   #PTSVOL(6),BLANKS    INITIALIZE VOLUME NAME              26510099
         L     R1,PTSVOL            ADDRESS OF NAME                     26520099
         MVC   #PTSVOL(*-*),0(R1)   <<EXECUTED>>                        26530099
         EX    R15,*-6              MOVE IN THE NAME                    26540099
ZPTS20   LA    R1,PTSSPACE          SPACE(PRIMARY)                      26550099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   26560099
         STH   R1,#PTSSPAC          SAVE RESULT                         26570099
         ICM   R1,B'0111',PTSSPACE+9  NEXT LIST ITEM PRESENT?           26580099
         BZ    ZPTS30                 NO, BRANCH                        26590099
*        LR    R1,R1                SPACE(,SECONDARY)                   26600099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   26610099
         STH   R1,#PTSSPAC+2        SAVE RESULT                         26620099
         SPACE 1                                                        26630099
ZPTS30   DS    0H                                                       26640099
         B     PARSPOST                                                 26650000
         SPACE 2                                                        26660000
         USING PDLRENAM,R6                                              26670000
         USING *,R4                                                     26680000
ZRENAME  MVC   #RENSWAP(1),PCLRENSW+1    SAVE SWAP/NOSWAP               26690000
         MVC   #RENRANG(1),PCLRENGP+1    SAVE GROUP/NOGROUP             26700000
         CLI   #RENRANG,1                GROUP OPTION?                  26710000
         BNE   ZRENAM10                  NO, BRANCH                     26720000
         NI    ##ADRPC#,FF-@B            YES, NO BLDL REQUIRED          26730000
         SPACE 1                                                        26740000
ZRENAM10 TM    PCLREPBY+6,X'80'          ANY RENAME REPBY OPERAND?      26750000
         BNO   PARSPOST                  NO, BRANCH                     26760000
         LH    R15,PCLREPBY+4            LENGTH OF NAME                 26770000
         S     R15,=F'1'                 MACHINE LENGTH VALID?          26780000
         BM    PARSPOST                  NO, BRANCH                     26790000
         MVC   #RENREP,BLANKS            INITIALIZE THE MEMBER NAME     26800000
         L     R1,PCLREPBY               REPBY NAME                     26810000
         MVC   #RENREP(*-*),0(R1)        <<EXECUTED>>                   26820000
         EX    R15,*-6                   MOVE INTO STORAGE              26830000
         B     PARSPOST                                                 26840000
         SPACE 2                                                        26850000
         USING PDLREPL,R6                                               26860000
         USING *,R4                                                     26870000
ZREPLACE TM    REPLSTR1+6,X'80'     STRING CODED?                       26880000
         BNO   PARSPOST             NO, ASSUME OK                       26890000
         MVC   #REPFLAG(1),REPLREP+1  SAVE WRITE/NOWRITE OPTION         26900000
         CLI   REPLSTAT+1,2         NOSTATS?                            26910000
         BNE   *+8                  NO, BRANCH                          26920000
         OI    #REPFLAG,X'10'       YES, SET A FLAG                     26930000
         CLI   REPLINC+1,2          INC1?                               26940000
         BL    ZREPLINC             YES, BRANCH                         26950000
         MVI   #REPINCR+1,1         ASSUME INC2                         26960000
         CLI   REPLINC+1,2          INC2?                               26970000
         BE    ZREPLINC             YES, BRANCH                         26980000
         MVI   #REPINCR+1,3         ASSUME INC4                         26990000
         CLI   REPLINC+1,3          INC4?                               27000000
         BE    ZREPLINC             YES, BRANCH                         27010000
         MVI   #REPINCR+1,7         ASSUME INC8                         27020000
         CLI   REPLINC+1,4          INC8?                               27030000
         BE    ZREPLINC             YES, BRANCH                         27040000
         MVI   #REPINCR+1,15        ASSUME INC16                        27050000
         CLI   REPLINC+1,5          INC16?                              27060000
         BE    ZREPLINC             YES, BRANCH                         27070000
         MVI   #REPINCR+1,79        ASSUME INC80                        27080000
ZREPLINC DS    0H                                                       27090000
         L     R5,REPLSTR1          NEW STRING ADDRESS                  27100000
         LH    R2,REPLSTR1+4        LENGTH OF STRING                    27110000
         LA    R1,FINDLTH           FIRST STRING ADDRESS                27120000
         ST    R1,#LFSAVE4          SAVE FOR LATER                      27130000
         LA    R1,PDS380A           GENERAL PROMPT MESSAGE              27140000
         ST    R1,#LFSAVE4+4        SAVE FOR LATER                      27150000
ZREPTEST LTR   R2,R2                NULL STRING CODED?                  27160000
         BNP   ZREPCHK              YES, CHECK FORMAT                   27170000
         BCTR  R5,0                 BACK UP ONE                         27180000
         OI    0(R5),X'40'          UPPER CASE THE DELIMITER            27190000
         CLI   0(R5),C'X'           POSSIBLE HEX STRING?                27200000
         BNE   ZREPCHAR             NO, BRANCH                          27210000
         MVC   MSGTEXT1(3),L841     BAD HEX STRING MESSAGE              27220000
         LA    R3,1(,R2)            STRING LENGTH +1                    27230000
         N     R3,=F'-2'            NEXT EVEN NUMBER                    27240000
         SR    R15,R15              ZERO                                27250000
         LA    R1,MSGTEXT2+4        WHERE OUTPUT GOES                   27260000
         LA    R0,2                 PAIRWISE COUNTER                    27270000
         CR    R2,R3                EVEN LENGTH ORIGINALLY?             27280000
         SRL   R3,1                 (STRING LENGTH +1)/2                27290000
         ST    R3,MSGTEXT2          (STRING LENGTH +1)/2                27300000
         BNE   ZREPHEX2             NO, BRANCH                          27310000
         SPACE 1                                                        27320000
ZREPHEX1 LA    R5,1(,R5)            NEXT CHARACTER                      27330000
         OI    0(R5),X'40'          UPPER CASE THE HEX CHARACTER        27340000
         IC    R15,0(,R5)           GET A BYTE TO CONVERT               27350000
         CLI   0(R5),C'0'                                               27360000
         BL    *+12                 0-9?                                27370000
         CLI   0(R5),C'9'                                               27380000
         BNH   ZREPHEX2             YES, BRANCH                         27390000
         LA    R15,9(,R15)          NO, ADJUST LOW DIGIT 1-5 TO A-F     27400000
         CLI   0(R5),C'A'           BELOW AN A?                         27410000
         BL    ZREPNEWS             YES, INVALID                        27420000
         CLI   0(R5),C'F'           ABOVE AN F?                         27430000
         BH    ZREPNEWS             YES, INVALID                        27440000
         SPACE 1                                                        27450000
ZREPHEX2 SLL   R15,28               SHIFT                               27460000
         SLDL  R14,4                GET A GOOD DIGIT                    27470000
         BCT   R0,ZREPHEX1          DO THE NEXT DIGIT OF A PAIR         27480000
         LA    R0,2                 PAIRWISE COUNTER                    27490000
         STC   R14,0(,R1)           SAVE AN OUTPUT CHARACTER            27500000
         LA    R1,1(,R1)            ANOTHER OUTPUT CHARACTER            27510000
         BCT   R3,ZREPHEX1          DO ALL DIGITS                       27520000
         SPACE 1                                                        27530000
         LA    R5,MSGTEXT2+4-1      START OF CONVERTED STRING -1        27540000
         L     R2,MSGTEXT2          LENGTH OF CONVERTED STRING          27550000
         CH    R2,=H'32'            VALID LENGTH?                       27560000
         BH    ZREPNEWS             NO, BRANCH                          27570000
         L     R3,#LFSAVE4          STRING POINTER                      27580000
         STH   R2,0(,R3)            SAVE ACTUAL LENGTH                  27590000
         BCTR  R2,0                 MACHINE LENGTH                      27600000
         MVC   2(*-*,R3),1(R5)      <<EXECUTED>>                        27610000
         EX    R2,*-6               SAVE THE NEW STRING                 27620000
         B     ZREPCHK                                                  27630000
         SPACE 2                                                        27640000
ZREPCHAR MVC   MSGTEXT1(3),L842     INVALID LENGTH MESSAGE              27650000
         CH    R2,=H'32'            VALID LENGTH?                       27660000
         BH    ZREPNEWS             NO, BRANCH                          27670000
         L     R3,#LFSAVE4          STRING POINTER                      27680000
         STH   R2,0(,R3)            SAVE ACTUAL LENGTH                  27690000
         BCTR  R2,0                 MACHINE LENGTH                      27700000
         MVC   2(*-*,R3),1(R5)      <<EXECUTED>>                        27710000
         EX    R2,*-6               SAVE THE NEW STRING                 27720000
         CLI   REPLASIS+1,1         ASIS REQUESTED?                     27730000
         BE    ZREPCHK              YES, BRANCH                         27740000
         CLI   REPLASIS+1,2         CAPS REQUESTED?           DRK DEC02 27750000
         BE    ZREPCAP3             YES                       DRK DEC02 27760000
         CLI   REPLASIS+1,3         IGNORE REQUESTED?         DRK DEC02 27770000
         BNE   *+4+4+4              NO                        DRK JUN03 27780000
         MVI   #IGNCASE,1           YES, IGNORE CASE          DRK DEC02 27790000
         B     ZREPIGN1                                       DRK JUN03 27800000
         AIF   ('&FNDCASE' EQ 'CAPS').CAPS3                   DRK DEC02 27810000
         MVI   #IGNCASE,1           DEFAULT TO IGNORE CASE    DRK DEC02 27820000
         AGO   .IGNORE1                                       DRK DEC02 27830000
.CAPS3   ANOP                                                 DRK DEC02 27840000
         B     ZREPCAP3                                       DRK DEC02 27850000
.IGNORE1 ANOP                                                 DRK DEC02 27860000
ZREPIGN1 DS    0H                                             DRK JUN03 27870000
         TM    #LFSAVE4,X'80'       SECOND PASS?              DRK DEC02 27880000
         BO    ZREPCHK              YES, DON'T FOLD REPL STR  DRK DEC02 27890000
ZREPCAP3 DS    0H                                             DRK DEC02 27900000
         OC    2(32,R3),BLANK128    UPPER CASE THE DATA                 27910000
         B     ZREPCHK                                                  27920000
         SPACE 2                                                        27930000
ZREPNEWS M$MSG MSGTEXT1             INVALID LENGTH STRING -- REENTER    27940000
         TM    FLAGSEE,FBKGRND      BACKGROUND EXECUTION?     DRK APR08 27950000
         BO    NEWCMD               YES, BRANCH               DRK APR08 27960000
ZREPNEW0 LA    R2,NEWCMD            EXIT ADDRESS FOR ATTENTION          27970000
         L     R1,#LFSAVE4+4        GENERAL PROMPT MESSAGE              27980000
        M$PUTGT (1),ATTN=PARSATTN   SECOND PART OF MESSAGE              27990000
         L     R5,ADDRCBUF          ENTERED DATA                        28000000
         LH    R2,0(,R5)            LENGTH OF STRING                    28010000
         SH    R2,=H'5'             VALID MACHINE LENGTH?               28020000
         LA    R1,4(R5,R2)          LAST BYTE OF INPUT STRING           28030000
         BZ    ZREPNEW3             MAYBE, CHECK FURTHER                28040000
         BNP   ZREPNEW0             NO, NULL STRING -- PROMPT AGAIN     28050000
         SPACE 1                                                        28060000
ZREPNEW1 CLI   0(R1),X'40'          SCAN                                28070000
         BNE   ZREPNEW2                 BACKWARDS                       28080000
         BCTR  R1,0                              FOR A                  28090000
         BCT   R2,ZREPNEW1                             NON-BLANK        28100000
         B     ZREPNEW3             POSSIBLE STRING -- CHECK            28110000
         SPACE 1                                                        28120000
ZREPNEW2 CLI   4(R5),X'40'          SCAN                                28130000
         BNE   ZREPNEW3                 FORWARDS                        28140000
         LA    R5,1(,R5)                        FOR A                   28150000
         BCT   R2,ZREPNEW2                            NON-BLANK         28160000
         SPACE 1                                                        28170000
ZREPNEW3 CLI   4(R5),X'40'          REAL STRING?                        28180000
         BE    ZREPNEW0             NO, PROMPT AGAIN                    28190000
         CLI   REPLASIS+1,1         ASIS REQUESTED?                     28200000
         BE    ZREPNEW4             YES, BRANCH                         28210000
         CLI   REPLASIS+1,2         CAPS REQUESTED?           DRK DEC02 28220000
         BE    ZREPCAP4             YES, BRANCH               DRK DEC02 28230000
         CLI   REPLASIS+1,3         IGNORE REQUESTED?         DRK DEC02 28240000
         BNE   *+4+4+4              NO                        DRK JUN03 28250000
         MVI   #IGNCASE,1           YES, IGNORE CASE          DRK DEC02 28260000
         B     ZREPIGN2                                       DRK JUN03 28270000
         AIF   ('&FNDCASE' EQ 'CAPS').CAPS4                   DRK DEC02 28280000
         MVI   #IGNCASE,1           DEFAULT TO IGNORE CASE    DRK DEC02 28290000
         AGO   .IGNORE2                                       DRK DEC02 28300000
.CAPS4   ANOP                                                 DRK DEC02 28310000
         B     ZREPCAP4                                       DRK DEC02 28320000
.IGNORE2 ANOP                                                 DRK DEC02 28330000
ZREPIGN2 DS    0H                                             DRK JUN03 28340000
         TM    #LFSAVE4,X'80'       SECOND PASS?              DRK DEC02 28350000
         BO    ZREPNEW4             YES, DON'T FOLD REPL STR  DRK DEC02 28360000
ZREPCAP4 DS    0H                                             DRK DEC02 28370000
         OC    4(*-*,R5),BLANK128   <<EXECUTED>>                        28380000
         EX    R2,*-6               UPPER-CASE DATA AND DELIMITERS      28390000
         SPACE 1                                                        28400000
ZREPNEW4 OI    4(R5),X'40'          UPPER-CASE THE FIRST DELIMITER      28410000
         MVC   0(1,R5),0(R1)        ENDING CHARACTER                    28420000
         OI    0(R5),X'40'          UPPER-CASE THE LAST DELIMITER       28430000
         CLC   0(1,R5),4(R5)        SAME DELIMITERS?                    28440000
         BNE   *+6                  NO, BRANCH                          28450000
         BCTR  R2,0                 YES, ALLOW FOR LAST DELIMITER       28460000
         LA    R5,5(,R5)            FIRST CHARACTER OF STRING           28470000
         B     ZREPTEST             PARSE THIS NEW STRING               28480000
         SPACE 2                                                        28490000
ZREPCHK  TM    #LFSAVE4,X'80'         SECOND PASS?                      28500000
         BO    ZREPCHK1               YES, BRANCH                       28510000
         TM    REPLSTR2+6,X'80'       STRING CODED?                     28520000
         BNO   PARSPOST               NO, ASSUME OK                     28530000
         L     R5,REPLSTR2            NEW STRING ADDRESS                28540000
         LH    R2,REPLSTR2+4          LENGTH OF STRING                  28550000
         LA    R1,REPLTH              SECOND STRING ADDRESS             28560000
         MVI   REPLTH+1,0             CLEAR REPLTH HISTORY              28570000
         ST    R1,#LFSAVE4            SAVE FOR LATER                    28580000
         LA    R1,PDS386A             GENERAL PROMPT MESSAGE            28590000
         ST    R1,#LFSAVE4+4          SAVE FOR LATER                    28600000
         OI    #LFSAVE4,X'80'         MARK AS SECOND PASS               28610000
         B     ZREPTEST                                                 28620000
         SPACE 1                                                        28630000
ZREPCHK1 CLI   REPLFMT+1,0            WAS A FORMAT SPECIFIED?           28640000
         BE    ZREPCHK2               NO, BRANCH                        28650000
         NI    HFLAGSDD,FF-NONUM-SNUM-BLOCK-DUMP-LBLOCK-LDUMP           28660000
         LH    R15,REPLFMT            FORMAT REQUESTED                  28670000
         A     R15,=F'-2'             LESS 2 -- NEGATIVE?               28680000
         BM    ZREPCHK2               YES, BRANCH                       28690000
         LA    R1,1                   SHIFT VALUE                       28700000
         SLL   R1,0(R15)              SHIFT INTO POSITION               28710000
         OI    HFLAGSDD,*-*           <<EXECUTED>>                      28720000
         EX    R1,*-4                 MOVE INTO FLAG BYTE               28730000
         SPACE 1                                                        28740000
ZREPCHK2 LA    R1,RMAXLENC            MAXLEN                            28750000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28760000
         ST    R1,#MAXLEN             SAVE RESULT                       28770000
         SPACE 1                                                        28780000
         LA    R1,RMAXINC             MAXIN                             28790000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28800000
         ST    R1,#MAXIN              SAVE RESULT                       28810000
         SPACE 1                                                        28820000
         LA    R1,RMAXOUTC            MAXOUT                            28830000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28840000
         ST    R1,#MAXOUT             SAVE RESULT                       28850000
         SPACE 1                                                        28860000
         LA    R1,RMAXFIND            MAXFIND                           28870000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28880000
         ST    R1,#MAXFIND            SAVE RESULT                       28890000
         SPACE 1                                                        28900000
         LA    R1,RSKIPRC             SKIPREC                           28910000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28920000
         ST    R1,#SKIPREC            SAVE RESULT                       28930000
         SPACE 1                                                        28940000
         LA    R1,RSKIPCC             SKIPCOL                           28950000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 28960000
         STH   R1,#SKIPCOL            SAVE RESULT                       28970000
         SPACE 1                                                        28980000
         TM    REPLOFF+6,X'80'        OFFSET CODED?                     28990000
         BNO   ZREPCHK4               NO, DONE                          29000000
         L     R5,REPLOFF             OFFSET ADDRESS                    29010000
         LH    R1,REPLOFF+4           LENGTH OF OFFSET                  29020000
         LTR   R1,R1                  NULL STRING CODED?                29030000
         BNP   ZREPCHK4               YES, DONE                         29040000
         MVI   MSGTEXT2+1,3           MAXIMUM OF 3 DIGITS               29050000
         MVC   MSGTEXT1,PDS384A       OFFSET INVALID MESSAGE            29060000
         BAS   R2,HEXC                CONVERT TO BINARY                 29070000
         B     PARSATTN               ATTENTION -- IGNORE THE REST      29080000
         STCM  R0,B'0111',#LISTOFF+1  SAVE THE RESULTING OFFSET         29090000
         SPACE 1                                                        29100000
ZREPCHK4 LH    R15,RDUMPCS+4          LENGTH OF BLOCK/DUMP STRING       29110000
         STC   R15,#MODLEN                                              29120000
         S     R15,=F'1'              ANY STRING?                       29130000
         BM    PARSPOST               NO, BRANCH                        29140000
         L     R1,RDUMPCS             ADDRESS OF BLOCK/DUMP STRING      29150000
         MVC   #MODTXT(8),BLANKS      INITIALIZE                        29160000
         MVC   #MODTXT(*-*),0(R1)     <<EXECUTED>>                      29170000
         EX    R15,*-6                SAVE THE STRING FOR LATER         29180000
         CLC   #MODTXT(2),=C'* '      * NOTATION?                       29190000
         BNE   *+16                   NO, BRANCH                        29200000
         MVC   #MODTXT(8),LASTMOD     YES, USE DEFAULT                  29210000
         MVC   #MODLEN(1),LASTMOD#    YES, USE DEFAULT                  29220000
         MVC   LASTMOD(8),#MODTXT     RESET LASTMOD                     29230000
         MVC   LASTMOD#(1),#MODLEN    RESET LASTMOD#                    29240000
         MVC   #LISTMFF(4),#LISTOFF   SAVE MODULE OFFSET                29250000
         XC    #LISTOFF(4),#LISTOFF   CLEAR LIST OFFSET                 29260000
         B     PARSPOST                                                 29270000
         SPACE 2                                                        29280000
         USING PDLREPRO,R6                                              29290000
         USING *,R4                                                     29300000
ZREPRO   MVC   #COPREP(1),RPRREPL+1   SAVE REPLACE/NOREPLACE            29310000
         MVC   #COPALI(1),RPRALIAS+1  SAVE ALIAS/NOALIAS                29320000
         MVC   #REPADD(1),RPRADDZ+1   SAVE ADDZAP/NOADDZAP              29330000
         SPACE 1                                                        29340000
         LA    R1,RPRMAX              MAXBLK(COUNT)                     29350000
         BAS   R14,PACKMAX            ANY RESULT?                       29360000
         ST    R1,#REPRBLK            SAVE RESULT                       29370000
         SPACE 1                                                        29380000
         TM    RPRTO+6,X'80'        ANY NAME REQUESTED?                 29390000
         BNO   ZREPR30              NO, BRANCH                          29400000
         LH    R15,RPRTO+4          LENGTH OF NAME                      29410000
         STC   R15,#COPTO#          SAVE STRING LENGTH                  29420000
         S     R15,=F'1'            VALID?                              29430000
         BM    ZREPR30              NO, BRANCH                          29440000
         MVC   #COPTON(8),BLANKS    INITIALIZE TO BLANKS                29450000
         L     R1,RPRTO             ADDRESS OF NAME                     29460000
         MVC   #COPTON(*-*),0(R1)   <<EXECUTED>>                        29470000
         EX    R15,*-6              MOVE IN THE NAME                    29480000
         SPACE 1                                                        29490000
ZREPR30  B     PARSPOST                                                 29500000
         SPACE 2                                                        29510000
         USING PDLRESTO,R6                                              29520000
         USING *,R4                                                     29530000
ZRESTORE OI    #RESFLAG,#RESFDIS+#RESFPRO  DEFAULT OPERANDS             29540000
         MVC   #RESTTST(1),PCLRSTST+1      SAVE TEST OPTION   DRK MAY06 29550000
         TM    FLAGSGG,FPROMCON            PROMPTING OFF?               29560000
         BNO   *+8                         NO, BRANCH                   29570000
         OI    #RESFLAG,#RESFPRO*4         YES, SET A FLAG              29580000
         CLI   PCLRSREP+1,X'01'            REPEAT?                      29590000
         BNE   *+8                         NO, BRANCH                   29600000
         OI    #RESFLAG,#RESFREP           YES, SET REPEAT FLAG         29610000
         SPACE 1                                                        29620000
         CLI   PCLRSDIS+1,X'02'            NODISPLAY?                   29630000
         BNE   *+8                         NO, BRANCH                   29640000
         NI    #RESFLAG,FF-#RESFDIS        YES, TURN IT OFF             29650000
         CLI   PCLRSPRO+1,X'02'            NOPROMPT?                    29660000
         BNE   *+8                         NO, BRANCH                   29670000
         XI    #RESFLAG,#RESFPRO*2+#RESFPRO  YES, SET FLAGS             29680000
         SPACE 1                                                        29690000
         LH    R2,PCLRFIND+4             LENGTH OF STRING               29700000
         LTR   R2,R2                     NULL STRING CODED?             29710000
         BZ    ZREST010                  YES, DONE                      29720000
         CH    R2,=H'32'                 LENGTH(STRING)>32?             29730099
         BE    ZREST005                  NO, BRANCH           DRK OCT11 29740099
         BL    ZREST005                  NO, BRANCH           DRK OCT11 29750099
         LH    R2,=H'32'                 YES, USE 32 INSTEAD            29760000
         M$MSG L277                                           DRK OCT11 29770099
ZREST005 DS    0H                                                       29780099
         STH   R2,#RESTSTR               SAVE STRING LENGTH             29790000
         L     R1,PCLRFIND               NEW STRING ADDRESS             29800000
         S     R2,=F'1'                  GOOD STRING TO MOVE?           29810000
         BM    ZREST010                  NO, SKIP THE MOVE              29820000
         MVC   #RESTSTR+2(*-*),0(R1)     <<EXECUTED>>                   29830000
         EX    R2,*-6                    MOVE IN THE TEXT               29840000
         SPACE ,                                              EDS MAY06 29850000
         LH    R15,PCLRCAPS              GET CAPS|ASIS KEYWORDEDS MAY06 29860000
         BCT   R15,ZREST010              SKIP IF ASIS (>1)    EDS MAY06 29870000
         TR    #RESTSTR+2(*-*),UCASE     EXECUTED             EDS MAY06 29880000
         EX    R2,*-6                    CONVERT TO UPPER CASEEDS MAY06 29890000
         B     ZREST010                  BYPASS XLATE TABLE   EDS MAY06 29900000
         SPACE ,                                              EDS MAY06 29910000
UCASE    DC    256AL1(*-UCASE)           CONVERT LOWER CASE   EDS MAY06 29920000
         ORG   UCASE+C'A'-X'40'          A-Z TO UPPER CASE A-ZEDS MAY06 29930000
         DC    C'ABCDEFGHI'                                   EDS MAY06 29940000
         ORG   UCASE+C'J'-X'40'                               EDS MAY06 29950000
         DC    C'JKLMNOPQR'                                   EDS MAY06 29960000
         ORG   UCASE+C'S'-X'40'                               EDS MAY06 29970000
         DC    C'STUVWXYZ'                                    EDS MAY06 29980000
         ORG   ,                                              EDS MAY06 29990000
         SPACE 1                                                        30000000
ZREST010 TM    PCLRMOD+6,X'80'             ANY RESTORE MODULE OPERAND?  30010000
         BNO   ZREST020                    NO, BRANCH                   30020000
         LH    R15,PCLRMOD+4               LENGTH OF NAME               30030000
         STC   R15,#RESTNA#                SAVE ACTUAL LENGTH           30040000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        30050000
         BM    ZREST020                    NO, BRANCH                   30060000
         MVC   #RESTNAM,BLANKS             INITIALIZE THE MEMBER NAME   30070000
         L     R1,PCLRMOD                  START OF NAME                30080000
         MVC   #RESTNAM(8),BLANKS     INITIALIZE                        30090000
         MVC   #RESTNAM(*-*),0(R1)    <<EXECUTED>>                      30100000
         EX    R15,*-6                SAVE THE STRING FOR LATER         30110000
         CLC   #RESTNAM(2),=C'* '     * NOTATION?                       30120000
         BNE   *+16                   NO, BRANCH                        30130000
         MVC   #RESTNAM(8),LASTMOD    YES, USE DEFAULT                  30140000
         MVC   #RESTNA#(1),LASTMOD#   YES, USE DEFAULT                  30150000
         MVC   LASTMOD(8),#RESTNAM    RESET LASTMOD                     30160000
         MVC   LASTMOD#(1),#RESTNA#   RESET LASTMOD#                    30170000
         SPACE 1                                                        30180000
ZREST020 TM    PCLREST+6,X'80'             ANY RESTORE LIKE OPERAND?    30190000
         BNO   ZREST030                    NO, BRANCH                   30200000
         LH    R15,PCLREST+4               LENGTH OF NAME               30210000
         S     R15,=F'1'                   MACHINE LENGTH VALID?        30220000
         BM    ZREST030                    NO, BRANCH                   30230000
         MVC   #RESTLIK,BLANKS             INITIALIZE THE MEMBER NAME   30240000
         L     R1,PCLREST                  START OF NAME                30250000
         MVC   #RESTLIK(*-*),0(R1)         <<EXECUTED>>                 30260000
         EX    R15,*-6                     MOVE INTO STORAGE            30270000
         SPACE 1                                                        30280000
ZREST030 MVI   #RESTNUM+3,5           DEFAULT LINE COUNT                30290000
         LA    R1,PCLRNUM             COUNT(NUMBER)                     30300000
         BAS   R14,PACKMAX            CONVERT TO BINARY                 30310000
         ST    R1,#RESTNUM            SAVE RESULT                       30320000
         B     PARSPOST                                                 30330000
         SPACE 2                                                        30340000
         USING PDLSEPAR,R6                                    DRK MAY09 30350000
         USING *,R4                                                     30360000
ZSEPAR   MVC   #SEPDISP(1),SEPDISP+1  SAVE SHR/OLD/NEW        DRK MAR18 30370099
         MVC   #SEPLIST(1),SEPLIST+1  SAVE LIST/NOLIST                  30380000
         MVC   #SEPTRCY(1),SEPTRCYL+1 SAVE TRK/CYL            DRK MAR18 30390099
         MVC   MSGDS2(64),BLANK128  CLEAR THE DATA SET NAME AREA        30400000
         LH    R2,SEPDSN2+4         LENGTH OF STRING                    30410000
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    30420000
         BCTR  R2,0                 MACHINE LENGTH                      30430000
         L     R1,SEPDSN2           NEW STRING ADDRESS                  30440000
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        30450000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          30460000
         SPACE 1                                                        30470099
ZSEP10   TM    SEPVOL+6,X'80'       ANY NAME REQUESTED?                 30480099
         BNO   ZSEP20               NO, BRANCH                          30490099
         LH    R15,SEPVOL+4         LENGTH OF NAME                      30500099
         S     R15,=F'1'            VALID?                              30510099
         BM    ZSEP20               NO, BRANCH                          30520099
         MVC   #SEPVOL(6),BLANKS    INITIALIZE VOLUME NAME              30530099
         L     R1,SEPVOL            ADDRESS OF NAME                     30540099
         MVC   #SEPVOL(*-*),0(R1)   <<EXECUTED>>                        30550099
         EX    R15,*-6              MOVE IN THE NAME                    30560099
ZSEP20   LA    R1,SEPSPACE          SPACE(PRIMARY)                      30570099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   30580099
         STH   R1,#SEPSPAC          SAVE RESULT                         30590099
         ICM   R1,B'0111',SEPSPACE+9  NEXT LIST ITEM PRESENT?           30600099
         BZ    ZSEP30                 NO, BRANCH                        30610099
*        LR    R1,R1                SPACE(,SECONDARY)                   30620099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   30630099
         STH   R1,#SEPSPAC+2        SAVE RESULT                         30640099
         SPACE 1                                                        30650099
ZSEP30   LA    R1,SEPDIRCO          DIR(COUNT)                          30660099
         BAS   R14,PACKMAX          CONVERT TO BINARY                   30670099
         ST    R1,#SEPDIR#          SAVE RESULT                         30680099
         SPACE 1                                                        30690099
         B     PARSPOST                                                 30700000
         SPACE 2                                                        30710000
         USING PDLSMPG,R6                                     DRK JUN06 30720000
         USING *,R4                                                     30730000
ZSMPG    MVC   #SMPALI(1),SMPALIAS+1  SAVE ALIAS/NOALIAS                30740000
         MVC   #SMPDISP(1),SMPDISP+1  SAVE OLD/SHR            DRK FEB14 30750099
         MVC   #SMPMAC(1),SMPMAC+1    SAVE MAC                          30760000
         MVC   #SMPSRC(1),SMPSRC+1    SAVE SRC                          30770000
         MVC   #SMPMACU(1),SMPMACU+1  SAVE MACUPD                       30780000
         MVC   #SMPSRCU(1),SMPSRCU+1  SAVE SRCUPD                       30790000
         MVC   #SMPINLN(1),SMPINLN+1  SAVE INLINE                       30800000
         MVC   #SMPDIST(8+48),BLANK128  CLEAR ANSWER AREA               30810000
*        MVC   #SMPSYSL(8),BLANK128   CLEAR ANSWER AREA                 30820000
*        MVC   #SMPTXL(8),BLANK128    CLEAR ANSWER AREA                 30830000
*        MVC   #SMPDMOD(8),BLANK128   CLEAR ANSWER AREA                 30840000
*        MVC   #SMPREL(8),BLANK128    CLEAR ANSWER AREA                 30850000
*        MVC   #SMPTYPE(8),BLANK128   CLEAR ANSWER AREA                 30860000
*        MVC   #SMPINLN(8),BLANK128   CLEAR ANSWER AREA                 30870000
         MVC   MSGDS2(64),BLANK128    CLEAR THE DATA SET NAME AREA      30880000
         SPACE 1                                                        30890000
         LH    R2,SMPDSNOT+4        LENGTH OF STRING                    30900000
         STH   R2,MSGDS2+62         SAVE LENGTH USED                    30910000
         S     R2,=F'1'             ANY DATA?                           30920000
         BM    ZSMPG005             NO, BRANCH                          30930000
         L     R1,SMPDSNOT          NEW STRING ADDRESS                  30940000
         MVC   MSGDS2(*-*),0(R1)    <<EXECUTED>>                        30950000
         EX    R2,*-6               MOVE IN ANY OTHER OPERANDS          30960000
ZSMPG005 DS    0H                                                       30970000
         LH    R2,SMPDISTT+4          LENGTH OF STRING                  30980000
         S     R2,=F'1'               ANY DATA?                         30990000
         BM    ZSMPG010               NO, BRANCH                        31000000
         L     R1,SMPDISTT                                              31010000
         MVC   #SMPDIST(*-*),0(R1)    <<EXECUTED>>                      31020000
         EX    R2,*-6                 MOVE IN THE STRING                31030000
ZSMPG010 DS    0H                                                       31040000
         LH    R2,SMPSYSOT+4          LENGTH OF STRING                  31050000
         S     R2,=F'1'               ANY DATA?                         31060000
         BM    ZSMPG020               NO, BRANCH                        31070000
         L     R1,SMPSYSOT                                              31080000
         MVC   #SMPSYSL(*-*),0(R1)    <<EXECUTED>>                      31090000
         EX    R2,*-6                 MOVE IN THE STRING                31100000
ZSMPG020 DS    0H                                                       31110000
         LH    R2,SMPTXOT+4           LENGTH OF STRING                  31120000
         S     R2,=F'1'               ANY DATA?                         31130000
         BM    ZSMPG030               NO, BRANCH                        31140000
         L     R1,SMPTXOT                                               31150000
         MVC   #SMPTXL(*-*),0(R1)     <<EXECUTED>>                      31160000
         EX    R2,*-6                 MOVE IN THE STRING                31170000
ZSMPG030 DS    0H                                                       31180000
         LH    R2,SMPDMOT+4           LENGTH OF STRING                  31190000
         S     R2,=F'1'               ANY DATA?                         31200000
         BM    ZSMPG040               NO, BRANCH                        31210000
         L     R1,SMPDMOT                                               31220000
         MVC   #SMPDMOD(*-*),0(R1)    <<EXECUTED>>                      31230000
         EX    R2,*-6                 MOVE IN THE STRING                31240000
ZSMPG040 DS    0H                                                       31250000
         LH    R2,SMPRELOT+4          LENGTH OF STRING                  31260000
         S     R2,=F'1'               ANY DATA?                         31270000
         BM    ZSMPG050               NO, BRANCH                        31280000
         L     R1,SMPRELOT                                              31290000
         MVC   #SMPREL(*-*),0(R1)     <<EXECUTED>>                      31300000
         EX    R2,*-6                 MOVE IN THE STRING                31310000
ZSMPG050 DS    0H                                                       31320000
         LH    R2,SMPTYPOT+4          LENGTH OF STRING                  31330000
         S     R2,=F'1'               ANY DATA?                         31340000
         BM    ZSMPG060               NO, BRANCH                        31350000
         L     R1,SMPTYPOT                                              31360000
         MVC   #SMPTYPE(*-*),0(R1)    <<EXECUTED>>                      31370000
         EX    R2,*-6                 MOVE IN THE STRING                31380000
ZSMPG060 DS    0H                                                       31390000
         LH    R2,SMPSSIOT+4          LENGTH OF STRING                  31400000
         S     R2,=F'1'               ANY DATA?                         31410000
         BM    ZSMPG070               NO, BRANCH                        31420000
         L     R1,SMPSSIOT                                              31430000
         MVC   #SMPSSI(*-*),0(R1)     <<EXECUTED>>                      31440000
         EX    R2,*-6                 MOVE IN THE STRING                31450000
ZSMPG070 DS    0H                                                       31460000
         B     PARSPOST                                                 31470000
         SPACE 2                                                        31480000
         USING PDLSRCH,R6                                     DRK APR06 31490000
         USING *,R4                                                     31500000
ZSRCH    MVC   #SRCALI(1),SRCALIAS+1  SAVE ALIAS/NOALIAS                31510000
         MVC   #SRCTYP(1),SRCTYPE+1   SAVE PREFIX/SUFFIX/WORD           31520000
         MVC   #SRCHEX(1),SRCMODE+1   SAVE HEX                          31530000
         MVC   #SRCLST(1),SRCLIST+1   SAVE SLIST/NOSLIST                31540000
         MVC   #SRCPAK(1),SRCPACK+1   SAVE CKPACKL            DRK OCT08 31550000
         MVC   #SRCCOB(1),SRCCOB+1    SAVE COBOL              DRK OCT08 31560000
         MVC   #SRCSEQ(1),SRCSEQ+1    SAVE SEQ/NOSEQ          DRK OCT08 31570000
         MVC   #SRCSTR(50),BLANK128   CLEAR ANSWER AREA                 31580000
         MVC   #SRCCOL(7),BLANK128    CLEAR ANSWER AREA                 31590000
         SPACE 1                                                        31600000
         LH    R2,SRCSTR+4            LENGTH OF STRING                  31610000
         CH    R2,=H'50'              VALID LENGTH?                     31620000
         BNH   ZSRCH010               YES, BRANCH                       31630000
         LH    R2,=H'50'              NO, SET LENGTH 50                 31640000
ZSRCH010 DS    0H                                                       31650000
         STH   R2,#SRCSTRL            SAVE LENGTH USED                  31660000
         S     R2,=F'1'               ANY DATA?                         31670000
         BM    ZSRCH020               NO, BRANCH                        31680000
         L     R1,SRCSTR              SEARCH STRING                     31690000
         MVC   #SRCSTR(*-*),0(R1)     <<EXECUTED>>                      31700000
         EX    R2,*-6                 MOVE IN THE STRING                31710000
ZSRCH020 DS    0H                                                       31720000
         SPACE 1                                                        31730000
         LH    R2,SRCCOLOT+4          LENGTH OF STRING                  31740000
         STH   R2,#SRCCOLL            SAVE LENGTH USED                  31750000
         S     R2,=F'1'               ANY DATA?                         31760000
         BM    ZSRCH030               NO, BRANCH                        31770000
         L     R1,SRCCOLOT            NEW STRING ADDRESS                31780000
         MVC   #SRCCOL(*-*),0(R1)     <<EXECUTED>>                      31790000
         EX    R2,*-6                 MOVE IN THE STRING                31800000
ZSRCH030 DS    0H                                                       31810000
         LA    R1,SRCLPSFV              LPSF(NUMBER)          DRK DEC21 31820099
         BAS   R14,PACKMAX              ANY RESULT?           DRK DEC21 31830099
         B     *+8                      YES, BRANCH           DRK DEC21 31840099
         B     ZSRCH040                 NO, BRANCH            DRK DEC21 31850099
         STC   R1,#SRCLPF               SAVE RESULT           DRK DEC21 31860099
         SPACE 2                                                        31870099
ZSRCH040 DS    0H                                                       31880099
         B     PARSPOST                                                 31890000
         SPACE 2                                                        31900000
         USING PDLSUBL,R6                                               31910000
         USING *,R4                                                     31920000
ZSUBLIST MVC   #ALIAOPT(1),PCLSUBAL+1  SAVE ALIAS/NOALIAS               31930000
         MVC   #SULREV(1),PCLSUBRV+1   SAVE REVERSE           DRK MAY16 31940099
         B     PARSPOST                                                 31950000
         SPACE 2                                                        31960000
         USING PDLTSOED,R6                                              31970000
         USING *,R4                                                     31980000
ZTSOEDIT MVC   #EDITOLD(1),PCLEDOP+1   SAVE SPECIFIED OLD/NEW OPTION    31990000
         CLI   PCLEDOP+1,X'02'         "OLD"?                           32000000
         BNE   ZTSOEDI2                NO, BRANCH                       32010000
         OI    ##ADRPC#,@B             YES, MUST EXIST                  32020000
ZTSOEDI2 MVC   #EDITNON(1),PCLNON+1    NONUM OPTION                     32030000
         MVC   #EDITASI(1),PCLASIS+1   ASIS OPTION                      32040000
         MVC   #EDITTYP+2(2),PCLTYPE   EDIT TYPE FIELD                  32050000
         B     PARSPOST                                                 32060000
         SPACE 2                                                        32070000
         USING PDLVERIF,R6                                              32080000
         USING *,R4                                                     32090000
ZVERIFY  MVC   #VERLOAD(1),VERLOAD+1    SAVE LOAD/NOLOAD OPTION         32100000
         MVC   #VERSTND(1),VERNAME+1    SAVE NAME/NONAME OPTION         32110000
         MVC   #VERREAD(1),VERINPUT+1   SAVE INPUT/NOINPUT OPTION       32120000
         MVC   #VERUPDT(1),VERUPDT+1    SAVE UPDATE/NOUPDATE OPTION     32130000
         MVC   #VERSTAT(1),VERSTATS+1   SAVE STATS/NOSTATS OPTION       32140000
         MVC   #VERNLKD(1),VERNLKD+1    SAVE LKED/NOLKED OPTION         32150000
         MVC   #VERSIZE(1),VERSIZE+1    SAVE SUMMARY/NOSUMMARY          32160000
         LA    R1,VERMAXBL              MAXBLK(COUNT)                   32170000
         BAS   R14,PACKMAX              ANY RESULT?                     32180000
         B     ZVER10                   YES, BRANCH                     32190000
         B     PARSPOST                 NO, BRANCH                      32200000
ZVER10   STH   R1,#MAXBLKV              SAVE RESULT                     32210000
         SPACE 1                                                        32220000
         B     PARSPOST                                                 32230000
         SPACE 2                                                        32240099
         USING PDLVPDSE,R6                                    DRK FEB11 32250099
         USING *,R4                                                     32260099
ZVPDSE   MVC   #VPELIST(1),VPELIST+1  SAVE LIST/NOLIST                  32270099
         MVC   #VPEPPD(1),VPEPPD+1    SAVE PPD                          32280099
         B     PARSPOST                                                 32290099
         SPACE 2                                                        32300099
         USING PDLXMIT,R6                                     DRK APR06 32310000
         USING *,R4                                                     32320000
ZXMIT    MVC   #XMIALI(1),XMIALIAS+1  SAVE ALIAS/NOALIAS                32330000
         MVC   #XMINOT(1),XMINOTFY+1  SAVE NOTIFY/NONOTIFY              32340000
         MVC   #XMILOG(1),XMILOG+1    SAVE LOG/NOLOG                    32350000
         MVC   #XMIWARN(1),XMIWARN+1  SAVE WARN/NOWARN        DRK APR09 32360000
         MVC   #XMIMSG(1),XMIMSG+1    SAVE MESSAGE            DRK AUG19 32370099
         MVC   #XMIADD(20),BLANK128   CLEAR ANSWER AREA                 32380099
         MVC   #XMIDSN(46),BLANK128   CLEAR ANSWER AREA                 32390099
         MVC   #XMIDDN(08),BLANK128   CLEAR ANSWER AREA                 32400099
         MVC   #XMIOUT(01),BLANK128   CLEAR ANSWER AREA                 32410099
         SPACE 1                                                        32420099
         LH    R2,XMIADDR+4           LENGTH OF STRING                  32430099
         S     R2,=F'1'               ANY DATA?                         32440099
         BM    ZXMIT010               NO, BRANCH                        32450099
         L     R1,XMIADDR             ADDRESSEE LIST                    32460099
         MVC   #XMIADD(*-*),0(R1)     <<EXECUTED>>                      32470099
         EX    R2,*-6                 MOVE IN THE STRING                32480099
ZXMIT010 DS    0H                                                       32490099
         SPACE 1                                                        32500099
         LH    R2,XMIDSNOT+4          LENGTH OF STRING                  32510099
         STH   R2,#XMIDSNL            SAVE LENGTH USED                  32520099
         S     R2,=F'1'               ANY DATA?                         32530099
         BM    ZXMIT020               NO, BRANCH                        32540099
         L     R1,XMIDSNOT            NEW STRING ADDRESS                32550099
         MVC   #XMIDSN(*-*),0(R1)     <<EXECUTED>>                      32560099
         EX    R2,*-6                 MOVE IN THE STRING                32570099
ZXMIT020 DS    0H                                                       32580099
         SPACE 1                                                        32590099
         LH    R2,XMIFILOT+4          LENGTH OF STRING                  32600099
         S     R2,=F'1'               ANY DATA?                         32610099
         BM    ZXMIT030               NO, BRANCH                        32620099
         L     R1,XMIFILOT                                              32630099
         MVC   #XMIDDN(*-*),0(R1)     <<EXECUTED>>                      32640099
         EX    R2,*-6                 MOVE IN THE STRING                32650099
ZXMIT030 DS    0H                                                       32660099
         SPACE 1                                                        32670099
         LH    R15,XMISYSOT+4         LENGTH OF SYSOUT STRING           32680099
         S     R15,=F'1'              ANY DATA?                         32690099
         BM    ZXMIT040               NO, BRANCH                        32700099
         L     R1,XMISYSOT                                              32710099
         MVC   #XMIOUT(1),0(R1)       MOVE IN THE STRING                32720099
ZXMIT040 DS    0H                                                       32730099
         B     PARSPOST                                                 32740000
         SPACE 2                                                        32750000
         USING MAINPDL,R6                                               32760000
         USING *,R4                                                     32770000
ZMAINPDL TM    VOLSETID+6,X'80'     ANY NAME REQUESTED?                 32780000
         BNO   MAINPDL0             NO, BRANCH                          32790000
         LH    R15,VOLSETID+4       LENGTH OF NAME                      32800000
         S     R15,=F'1'            VALID?                              32810000
         BM    MAINPDL0             NO, BRANCH                          32820000
         MVC   VOLSET,BLANKS        INITIALIZE VOLUME NAME              32830000
         L     R1,VOLSETID          ADDRESS OF NAME                     32840000
         MVC   VOLSET(*-*),0(R1)    <<EXECUTED>>                        32850000
         EX    R15,*-6              MOVE IN THE NAME                    32860000
         SPACE 1                                                        32870000
MAINPDL0 TM    FLAGSHH,FOPTIONS     ASTERISK FORM?                      32880000
         BO    MAINPDL1             NO, BRANCH                          32890000
         TM    VOLNAME+6,X'80'      ANY VOLSER REQUESTED?               32900000
         BO    MAINPDL1             YES, BRANCH                         32910000
         TM    VOLSETID+6,X'80'     ANY VOLSET REQUESTED?               32920000
         BNO   MAINPDL2             NO, BRANCH                          32930000
         SPACE 1                                                        32940000
MAINPDL1 MVC   VOLUME,VOLSET        INITIALIZE VOLUME NAME              32950000
         TM    VOLNAME+6,X'80'      ANY NAME REQUESTED?                 32960000
         BNO   MAINPDL2             NO, BRANCH                          32970000
         LH    R15,VOLNAME+4        LENGTH OF NAME                      32980000
         S     R15,=F'1'            VALID?                              32990000
         BM    MAINPDL2             NO, BRANCH                          33000000
         MVC   VOLUME,BLANKS        INITIALIZE VOLUME NAME              33010000
         L     R1,VOLNAME           ADDRESS OF NAME                     33020000
         MVC   VOLUME(*-*),0(R1)    <<EXECUTED>>                        33030000
         EX    R15,*-6              MOVE IN THE NAME                    33040000
         SPACE 1                                                        33050000
MAINPDL2 CLI   VOLUME,C'*'          NULLIFY VALUE?                      33060000
         BNE   *+10                 NO, BRANCH                          33070000
         MVC   VOLUME,BLANKS        YES, CLEAR VOLUME NAME              33080000
         TM    FLAGSHH,FOPTIONS     ASTERISK FORM?                      33090000
         BNO   MAINPDL3             YES, BRANCH                         33100000
         MVI   DSPALLOC,ALLOSHR     ASSUME DISP=SHR                     33110000
         MVI   DSPREQST,ALLOSHR     ASSUME DISP=SHR                     33120000
         CLI   OPTDISP+1,1          CORRECT?                            33130000
         BNE   MAINPDL3             NO, BRANCH                          33140000
         MVI   DSPALLOC,ALLOOLD     DISP=OLD                            33150000
         MVI   DSPREQST,ALLOOLD     DISP=OLD                            33160000
         SPACE 1                                                        33170000
MAINPDL3 OI    FLAGSHH,FOPTIONS     NORMAL DSNAME FORM NOW              33180000
         MVI   CONCATNM+1,0         RESET NUMBER COUNT TO ZERO          33190000
         LA    R1,OPTCONCC          NUMBER(COUNT)                       33200000
         BAS   R14,PACKMAX          ANY RESULT?                         33210000
         B     MAINPDL4             YES, BRANCH                         33220000
         B     MAINPDL5             NO, BRANCH                          33230000
MAINPDL4 STC   R1,CONCATNM+1        SAVE RESULT                         33240000
         DROP  R6                                                       33250000
         SPACE 1                                                        33260000
MAINPDL5 TM    FLAGSBB,FQUOTE       QUOTED DATA SET NAME?               33270000
         BO    PARSPOST             YES, BRANCH                         33280000
         CLI   VOLUME,X'40'         ANY VOLUME NAME SPECIFIED?          33290000
         BNE   PARSPOST             YES, ASSUME NO CATALOG USE          33300000
*  NEED TO FULLY QUALIFY THE DATA SET NAME                              33310000
         USING DFPL,R6                                                  33320000
         LA    R6,PARMLIST          START OF DFPL PARAMETER LIST        33330000
         L     R0,ADDRUPT                                               33340000
         L     R1,ADDRECT                                               33350000
         LA    R2,ATTNECB                                               33360000
         LA    R3,PARMLIST+16                                           33370000
         STM   R0,R3,DFPLUPT        INITIALIZE DFPLUPT, DFPLECT,        33380000
*                                              DFPLECB AND DFPLDFPB     33390000
         USING DFPB,R3                                                  33400000
         LA    R14,DSNLEN           DSNAME LENGTH, DSNAME               33410000
         L     R15,ADDRPSCB         PSCB                                33420000
         LA    R0,DOUBLE            BLANK DEFAULT QUALIFIER             33430000
         SR    R1,R1                NO USER CATALOG                     33440000
         LA    R2,PASSWORD                                              33450000
         STM   R14,R2,DFPBDSN       INITIALIZE DFPBDSN, DFPBPSCB,       33460000
*                                     DFPBQUAL, DFBCAT AND DFPBPSWD     33470000
         MVI   DFPBCNTL,DFPBRET     ADD LOW-LEVEL QUALIFIER             33480000
         MVI   DFPBCODE,DFPB04      ENTRY CODE X'04' -- CAN PROMPT      33490000
         TM    SPFLAG0,SPFDON       ISPMODE ACTIVE?                     33500000
         BNO   *+8                  NO, BRANCH                          33510000
         MVI   DFPBCODE,DFPB08      ENTRY CODE X'08' -- NO PROMPTING    33520000
         MVC   DOUBLE(8),BLANKS     BLANK DEFAULT QUALIFIER             33530000
         DROP  R6                                                       33540000
         SPACE 1                                                        33550000
         LA    R1,PARMLIST          ADDRESS OF PARM LIST                33560000
         L     R15,ADDRDEFT         DEFAULT ROUTINE ADDRESS             33570000
         BASR  R14,R15                                                  33580000
         B     PARSPOST                                                 33590000
PARSE    CSECT                                                          33600000
         LTORG                                                          33610000
         SPACE 2                                                        33620000
MSGBL132 M$TX  '                                                       X33630000
                                                                       X33640000
                                    '  -- 132 BYTES                     33650000
BLANK128 EQU   MSGBL132+4,128                                           33660000
BLANKS   EQU   MSGBL132+4,8                                             33670000
PDS380A  M$TX  'PDS380A REENTER THE SEARCH STRING WITH DELIMITERS:'     33680000
PDS381A  M$TX  'PDS381A REENTER THE DATA SET NAME, VOLUME AND DISPOSITIX33690000
               ON'                                                      33700000
PDS382A  M$TX  'PDS382A REENTER THE FIRST TTR:'                         33710000
PDS383A  M$TX  'PDS383A REENTER THE SECOND TTR:'                        33720000
PDS384A  M$TX  'PDS384A REENTER THE HEX OFFSET:'                        33730000
PDS385A  M$TX  'PDS385A REENTER THE SSI DATA:'                          33740000
PDS386A  M$TX 'PDS386A REENTER THE REPLACEMENT STRING WITH DELIMITERS:' 33750000
#RESFREP EQU     X'01'            RESTORE: REPEAT                       33760000
#RESFDIS EQU     X'02'            RESTORE: DISPLAY                      33770000
#RESFPRO EQU     X'04'            RESTORE: PROMPT                       33780000
ALLOOLD  EQU   X'01'                                                    33790000
ALLOMOD  EQU   X'02'                                                    33800000
ALLOSHR  EQU   X'08'                                                    33810000
         SPACE 1                                                        33820000
***BITS FOR DIRATTR+0:                                                  33830000
ATTRRENT EQU   X'80'          REENTRANT                                 33840000
ATTRREUS EQU   X'40'          REUSABLE                                  33850000
ATTROVLY EQU   X'20'          OVERLAY STRUCTURE                         33860000
ATTRTEST EQU   X'10'          TEST SYMBOLS ARE AVAILABLE                33870000
ATTRLOAD EQU   X'08'          ONLY LOADABLE                             33880000
ATTRSCTR EQU   X'04'          SCATTER LOADED                            33890000
ATTREXEC EQU   X'02'          EXECUTABLE                                33900000
ATTR1TXT EQU   X'01'          ONE TEXT RECORD ONLY AND NO RLD ITEMS     33910000
         SPACE 1                                                        33920000
***BITS FOR DIRATTR+1:                                                  33930000
ATTRNODC EQU   X'80'          NOT DOWNWARD-COMPATIBLE                   33940000
ATTRZORG EQU   X'40'          FIRST TEXT BLOCK HAS A ZERO ORIGIN        33950000
ATTREP0  EQU   X'20'          ENTRY POINT IS AT OFFSET ZERO             33960000
ATTRNRLD EQU   X'10'          NO RLD ITEMS                              33970000
ATTRNE   EQU   X'08'          CANNOT BE REPROCESSED BY LINKAGE-EDITOR   33980000
ATTRSYMS EQU   X'04'          CONTAINS TEST SYMBOLS                     33990000
ATTRFLEV EQU   X'02'          CREATED BY F LEVEL LINKAGE-EDITOR         34000000
ATTRREFR EQU   X'01'          REFRESHABLE                               34010000
L834$1   DC    C'834'                                                   34020000
L840     DC    C'840'                                                   34030000
L841     DC    C'841'                                                   34040000
L842     DC    C'842'                                                   34050000
L277     DC    C'277'                                         DRK OCT11 34060099
L195$1   DC    C'195'                                         DRK MAY16 34070099
SCLOGON  DC    C'ON '                                         DRK MAY16 34080099
SCLOGOFF DC    C'OFF'                                         DRK MAY16 34090099
L196$1   DC    C'196'                                         DRK NOV16 34100099
MVALON   DC    C'ON '                                         DRK NOV16 34110099
MVALOFF  DC    C'OFF'                                         DRK NOV16 34120099
L197$1   DC    C'197'                                         DRK JAN18 34130099
MLRESON  DC    C'ON '                                         DRK JAN18 34140099
MLRESOFF DC    C'OFF'                                         DRK JAN18 34150099
         TITLE 'P D S  --  PDS OPTIONS                       09/28/88'  34160000
*********************************************************************** 34170000
***      OPTIONS SUBCOMMAND                                         *** 34180000
*********************************************************************** 34190000
*                                                                       34200000
         SPACE 1                                                        34210000
OPTIONS  CSECT                                                          34220000
         USING *,R8                                                     34230000
ONIX     LTR   R2,R2                  RETURN=0?                         34240000
         BZ    OPT200                 YES, BRANCH                       34250000
         M$MSG L071                                                     34260000
         SPACE 1                                                        34270000
         LA    R3,$TBL-PTW            POINT TO FIRST TABLE ENTRY -WIDTH 34280000
         LA    R4,ONIX                START OF THIS CSECT               34290000
         SPACE 1                                                        34300000
OPT120   LA    R3,PTW(,R3)            NEXT TABLE ENTRY                  34310000
         CLI   0(R3),X'FF'            END OF TABLE?                     34320000
         BE    OPT300                 YES, EXIT                         34330000
         CLI   0(R3),X'40'            DISABLED ENTRY?                   34340000
         BE    OPT120                 YES, BRANCH                       34350000
         SR    R1,R1                                                    34360000
         ICM   R1,B'0011',28(R3)      ANY OPTION ENTRY?                 34370000
         BZ    OPT120                 NO, BRANCH                        34380000
         TM    12(R3),@S              DEFINED FOR SEQUENTIAL DATA SET?  34390000
         BO    OPT140                 YES, BRANCH                       34400000
         TM    DSORG,DS1DSGPO         DSORG=PO?                         34410000
         BNO   OPT120                 NO, BRANCH                        34420000
         SPACE 1                                                        34430000
OPT140   AR    R1,R4                  ADDRESS OF OPTION DATA            34440000
         MVC   MSGTEXT1(80),0(R1)     OPTION LINE                       34450000
         MVC   MSGTEXT1+4(8),0(R3)    CHANGE TO SUBCOMMAND NAME USED    34460000
         M$ERRST MSGTEXT1             OUTPUT THIS MESSAGE               34470000
         B     OPT120                                                   34480000
         SPACE 1                                                        34490000
OPT200   L     R2,0(,R15)             START OF SUBCOMMAND               34500000
         MVC   INSERT#1(8),0(R2)      NO, BRANCH                        34510000
         LA    R3,1(,R3)              ACTUAL LENGTH OF SUBCOMMAND       34520000
         STC   R3,MTLEN               SAVE LENGTH                       34530000
         TM    FLAGSBB,FONESHOT       ONE SUBCOMMAND ONLY?              34540000
         BNO   OPT201                 NO, BRANCH                        34550000
         L     R1,=A($ML)             ML SUBCOMMAND                     34560000
         CLC   0(2,R1),0(R2)          ML SUBCOMMAND?                    34570000
         BE    OPT200B                YES, BRANCH                       34580000
         L     R1,=A($MML)            MEMLIST SUBCOMMAND                34590000
         CLC   0(4,R1),0(R2)          MEMLIST SUBCOMMAND?               34600000
         BNE   OPT201                 NO, BRANCH                        34610000
OPT200B  TM    DSORG,DS1DSGPO         PARTITIONED?                      34620000
         BO    OPT201                 YES, BRANCH                       34630000
         L     R6,ADDRCBUF            BUFFER ADDRESS                    34640000
         L     R1,=A($ISM)            ISPMODE                           34650000
         MVC   4(8,R6),0(R1)          SUBCOMMAND CHANGED TO ISPMODE     34660000
         LA    R1,8+4                 LENGTH IS 8                       34670000
         SLL   R1,16                  SHIFT CORRECTLY                   34680000
         ST    R1,0(,R6)              UPDATE LENGTH TOO                 34690000
         XI    FLAGSBB,FONESHOT       TURN OFF ONESHOT                  34700000
         OI    FLAGSBB,FCMD           INDICATE SUBCOMMAND AVAILABLE     34710000
         B     NEWCMD                                                   34720000
         SPACE 1                                                        34730000
OPT201   M$MSG L771$1                 INVALID COMMAND                   34740000
         TM    FLAGSEE,FBKGRND        BACKGROUND EXECUTION?             34750000
         BO    *+8                    YES, BRANCH                       34760000
         NI    FLAGSBB,FF-FONESHOT    NO, ERROR -- DO NOT TERMINATE     34770000
         LA    R1,80                  ASSUME AN ACTIVE MODE             34780000
         TM    SPFLAG0,SPFDON         ISPMODE ACTIVE?                   34790000
         BO    OPT202                 YES, BRANCH                       34800000
         TM    CONTOPTN,1             ANY LOG RECORDING?                34810000
         BO    OPT202                 YES, BRANCH                       34820000
*        GTSIZE ,                     TERMINAL SIZE            SS MAY89 34830000
         GTSIZE                                                         34840000
         CH    R1,=H'120'             120 OR LESS BYTES?                34850000
         BL    *+8                    YES, BRANCH                       34860000
         LH    R1,=H'120'             NO, USE 120 BYTES                 34870000
OPT202   MVC   MSGTEXT1(136),OPTBL132                                   34880000
         MVC   MSGTEXT1+4(12),OPTLSUB                                   34890000
         LA    R3,$TBL-PTW            POINT TO FIRST TABLE ENTRY -WIDTH 34900000
         LA    R4,MSGTEXT1+4(R1)      END OF LINE ADDRESS               34910000
         LA    R5,MSGTEXT1+4+13       START OF LINE                     34920000
         SPACE 1                                                        34930000
OPT220   LA    R3,PTW(,R3)            NEXT TABLE ENTRY                  34940000
         CLI   0(R3),X'FF'            END OF TABLE?                     34950000
         BE    OPT280                 YES, EXIT                         34960000
         CLI   0(R3),X'40'            DISABLED ENTRY?                   34970000
         BE    OPT220                 YES, BRANCH                       34980000
         CLC   28(2,R3),=F'0'         ANY OPTION ENTRY?                 34990000
         BZ    OPT220                 NO, BRANCH                        35000000
         TM    12(R3),@S              DEFINED FOR SEQUENTIAL DATA SET?  35010000
         BO    OPT240                 YES, BRANCH                       35020000
         TM    DSORG,DS1DSGPO         DSORG=PO?                         35030000
         BNO   OPT220                 NO, BRANCH                        35040000
         SPACE 1                                                        35050000
OPT240   LA    R1,9(,R5)              POTENTIAL ENTRY POSITION          35060000
         CR    R1,R4                  LINE FULL?                        35070000
         BL    OPT260                 NO, CONTINUE                      35080000
         M$ERRST MSGTEXT1             OUTPUT THIS PART OF THE MESSAGE   35090000
         LA    R5,MSGTEXT1+4+13       START OF LINE                     35100000
         MVC   MSGTEXT1(136),OPTBL132                                   35110000
         SPACE 1                                                        35120000
OPT260   MVC   0(8,R5),0(R3)          ADD THE SUBCOMMAND NAME           35130000
         LA    R5,9(,R5)              POSITION FOR NEXT ENTRY           35140000
         B     OPT220                                                   35150000
         SPACE 1                                                        35160000
OPT280   M$ERRST MSGTEXT1                                               35170000
         SPACE 2                                                        35180000
OPT300   M$ERRST OPTBLANK                                               35190000
         B     NEWCMD                                                   35200000
OPTLSUB  DC    C'SUBCOMMANDS:'                                          35210000
         SPACE 1                                                        35220000
         PRINT NOGEN                                                    35230099
OATT     M$TX  'ATTRIB   - LIST ATTRIBUTES OF A MEMBER'                 35240000
OALI     M$TX  'ALIAS    - ASSIGN AN ALIAS TO A MEMBER'                 35250000
OABE     M$TX  'ABE      - EDIT USING ABE'                              35260000
OAMB     M$TX  'AMBLIST  - LIST MODULE XREF AND IDR INFORMATION'        35270000
OBRO     M$TX  'BROWSE   - BROWSE USING ISPF'                 DRK JUL02 35280000
OCHA     M$TX  'CHANGE   - SELECT A NEW DATA SET'                       35290000
OCOB     M$TX  'COBANAL  - COBOL LOAD MODULE ANALYSIS INFO'             35300000
OCAR     M$TX  'COMPARE  - COMPARE TWO MEMBERS FROM THE DATA SET'       35310000
OCMX     M$TX  'COMPRESS - COMPRESS IN PLACE OF THE DATA SET'           35320000
OCND     M$TX  'CONDEND  - END PDS IF WARNING OR ERROR MESSAGES'  APR08 35330000
OCON     M$TX  'CONTROL  - SET PROGRAM CONTROLS'                        35340000
OCOP     M$TX  'COPY     - COPY MEMBERS TO ANOTHER DATA SET'            35350000
*CPK     M$TX  'CPKMAP   - VOLUME TRACK MAP COMPAKTOR/DISKMAP'          35360099
ODIS     M$TX  'DISPLAY  - DISPLAY DIRECTORY MEMBER NAMES'              35370000
ODCF     M$TX  'DCF      - SCRIPT AN OUTPUT COPY'                       35380000
ODIR     M$TX  'DIRENTRY - DUMP A DIRECTORY ENTRY'                      35390000
ODEL     M$TX  'DELETE   - DELETE A MEMBER'                             35400000
ODSM     M$TX  'DISASM   - DISASSEMBLE LOAD MODULE'           DRK APR07 35410000
ODLN     M$TX  'DLINK    - RECONSTRUCT OBJECT CODE FOR MODULE'        " 35420000
ODSN     M$TX  'DSNAME   - DISPLAY THE CURRENT ALLOCATION'              35430000
ODSP     M$TX  'DSPRINT  - PRINT A HARDCOPY WITH DSPRINT'               35440000
OEDI     M$TX  'EDIT     - EDIT USING ISPF'                   DRK JUL02 35450000
OEDR     M$TX  'EDREC    - ISPF EDIT RECOVERY REQUEST'         SS JUL87 35460000
OEND     M$TX  'END      - STOP THE PROGRAM'                            35470000
OEXE     M$TX  'EXEC     - EXECUTE PDS SUBCOMMANDS FROM A CLIST'        35480000
OFIN     M$TX  'FIND     - LIST LINES CONTAINING A STRING'              35490000
OFIX     M$TX  'FIXPDS   - MODIFY DATA SET ATTRIBUTES'                  35500000
OFSE     M$TX  'FSE      - EDIT USING FSE'                              35510000
OHEL     M$TX  'HELP     - DISPLAY PDS SUBCOMMAND HELP'                 35520000
OHIS     M$TX  'HISTORY  - LIST HISTORY OF A LOAD MODULE'               35530000
OIFX     M$TX  'IF       - CONDITIONALLY EXECUTE A PDS SUBCOMMAND'      35540000
OISP     M$TX  'ISPF     - INVOKE ISPF PRIMARY PANEL'                   35550000
OISX     M$TX  'ISPXEQ   - EXECUTE ISPF PDS DIALOG COMMAND'    SS JUL87 35560000
OISM     M$TX  'ISPMODE  - SWITCH TO FULL SCREEN DISPLAY MODE' JK MAY16 35570099
*LCS     M$TX  'LCS      - LIST LIBRARY CONTROL INFORMATION FOR MODULE' 35580099
*                                                             THG MAR06 35590000
OLIS     M$TX  'LIST     - DISPLAY A MEMBER'                            35600000
OLMA     M$TX  'LMA      - LIST DEBUG TOOL LOAD MODULE ANALYSIS INFO'   35610000
OLOD     M$TX  'LOAD     - LOAD PDS FROM AN IEBUPDTE MEMBER STREAM'     35620000
OMAP     M$TX  'MAP      - MAP A LOAD MODULE'                           35630000
OMAT     M$TX  'MATCH    - MATCH TWO PDS DIRECTORIES AND DATA'          35640099
OMEM     M$TX  'MEMBERS  - DISPLAY A MEMBER GROUP'                      35650000
OMML     M$TX  'MEMLIST  - DISPLAY A MEMBER GROUP IN ISPF TABLE'        35660000
OOPT     M$TX  'OPTIONS  - DISPLAY THIS LIST OF SUBCOMMANDS'            35670000
OOFF     M$TX  'OFFLOAD  - OFFLOAD MEMBERS TO A SEQUENTIAL FILE'        35680000
OOUT     M$TX  'OUTCOPY  - OUTPUT IEBCOPY MEMBER SELECT STATEMENTS'     35690000
OPAT     M$TX  'PATTERN  - DISPLAY DIRECTORY NAMES MATCHING A PATTERN'  35700000
OPRI     M$TX  'PRINTOFF - PRINT A HARDCOPY'                            35710000
OPTS     M$TX  'PTSEXP   - EXPAND SYSMOD COMPACTED DATA TO A SEQ FILE'  35720099
OREC     M$TX  'RECALL   - DISPLAY THE PREVIOUS SUBCOMMAND'             35730099
OREN     M$TX  'RENAME   - RENAME A MEMBER'                             35740000
OREP     M$TX  'REPLACE  - CHANGE LINES CONTAINING A STRING'            35750000
ORPR     M$TX  'REPRO    - RECOPY A MEMBER IN THIS DATA SET'            35760000
ORES     M$TX  'RESTORE  - RESURRECT A PREVIOUSLY DELETED MEMBER'       35770000
OREV     M$TX  'REVIEW   - BROWSE DATA'                                 35780000
OSMP     M$TX  'SMPGEN   - CREATE SMP/E CONTROLS FOR MEMBERS' DRK JUL06 35790000
OSRC     M$TX  'SRCHFOR  - SEARCH MEMBERS WITH ISPF SEARCH-FOR'         35800000
OSUB     M$TX  'SUBMIT   - SUBMIT JCL'                                  35810000
OSUL     M$TX  'SUBLIST  - DEFINE A MEMBER LIST SUBGROUP'               35820000
OTIM     M$TX  'TIME     - DISPLAY THE CURRENT TIME AND DATE' DRK NOV03 35830000
*TRK     M$TX  'TRKMAP   - VOLUME TRACK MAP WITH DISKMAP'     DRK MAR14 35840099
OTSO     M$TX  'TSO      - INVOKE A TSO COMMAND'                        35850000
OTSE     M$TX  'TSOEDIT  - EDIT USING TSO EDIT'                         35860000
OTSL     M$TX  'TSOLIST  - LIST DATA WITH TSO LIST'                     35870000
OUSA     M$TX  'USAGE    - LIST DATA SET STATISTICS'                    35880000
*UT1     M$TX  'UT1      - UTILITY PANEL #1 (NON-MEMBER)'      SS NOV84 35890099
*UT2     M$TX  'UT2      - UTILITY PANEL #2 (WITH MEMBERS)'    SS NOV84 35900099
OVIE     M$TX  'VIEW     - VIEW USING ISPF'                   DRK JUL02 35910000
OVER     M$TX  'VERIFY   - VALIDITY CHECK THE DATA SET'                 35920000
OVPS     M$TX  'VPSPRINT - PRINT A HARDCOPY WITH VPSPRINT'              35930000
OVPE     M$TX  'VPDSE    - VERIFY A PDSE DIRECTORY STRUCTURE' DRK FEB11 35940099
*XIS     M$TX  'XISPMODE - SWITCH TO LINE DISPLAY MODE'       DRK MAY16 35950099
OXMI     M$TX  'XMIT     - XMIT MEMBERS WITH TSO TRANSMIT'    DRK APR06 35960099
OPTBL132 M$TX  '                                                       X35970000
                                                                       X35980000
                                    '  -- 132 BYTES                     35990000
OPTBLANK EQU   OPTBL132,132                                             36000000
         PRINT NOGEN                                                    36010099
L071     DC    C'071'                                                   36020000
L771$1   DC    C'771'                                                   36030000
         DC    X'FF'                                                    36040000
         LTORG                                                          36050000
         TITLE 'P D S  --  PDS SUBCOMMAND TABLE              09/28/88'  36060000
         PRINT GEN                                                      36070000
         COPY  #PDSTBL                                                  36080000
         PRINT GEN                                                      36090000
         TITLE 'P D S  --  PDS PARSE VALIDITY CHECKING       09/28/88'  36100000
*                                                                       36110000
*        CREATED/CHANGED VALIDITY CHECK SUBROUTINE                      36120000
*                                                                       36130000
         SPACE 1                                                        36140000
VRTDATE  M$ENTER VALCHECK                                               36150000
         SPACE 1                                                        36160000
         TM    8+6(R6),X'80'      SECOND PARAMETER PRESENT?             36170000
         BO    VRTDCHK0           YES, CONTINUE                         36180000
         L     R1,0(,R6)          ADDR OF FIRST PARAMETER               36190000
         LH    R0,4(,R6)          LENGTH OF FIRST PARAMETER             36200000
VRTDATE2 CLI   0(R1),C':'         SEPARATOR CHARACTER?                  36210000
         BE    VRTDATE4           YES, FOUND                            36220000
         LA    R1,1(,R1)          NEXT CHARACTER                        36230000
         BCT   R0,VRTDATE2        CHECK ALL CHARACTERS                  36240000
         B     VRTDCHK0 '         ADDR OF FIRST PARAMETER               36250000
VRTDATE4 LH    R14,4(,R6)         LENGTH OF FIRST PARAMETER             36260000
         SR    R14,R0             LENGTH OF FIRST PART OF RANGE VALID?  36270000
         BZ    VRTDCHK0           NO, BRANCH                            36280000
         STH   R14,4(,R6)         UPDATE THE FIRST FIELD LENGTH         36290000
         LA    R1,1(,R1)          POINT AFTER THE :                     36300000
         ST    R1,8(,R6)          START OF SECOND PARAMETER             36310000
         S     R0,=F'1'           LENGTH VALID?                         36320000
         BNP   VRTDCHK0           NO, BRANCH                            36330000
         STH   R0,8+4(,R6)        UPDATE THE SECOND FIELD LENGTH        36340000
         OI    8+6(R6),X'80'      SECOND PARAMETER IS PRESENT           36350000
VRTDCHK0 L     R1,0(,R6)          ADDR OF FIRST PARAMETER               36360000
         CLI   5(R6),5            NUMBER OF DIGITS:                     36370000
         BL    VRTDBAD              0-4, ERROR                          36380000
         BE    VRTDCHK1             5, YYDDD                            36390000
         CLI   5(R6),8                                                  36400000
         BH    VRTDBAD              6-8, MM/DD/YY                       36410000
         SR    R0,R0                                                    36420000
         IC    R0,5(R6)           NUMBER OF CHARACTERS                  36430000
         BAS   R3,VRTDRTN         CONVERT TO YYDDD                      36440000
         LA    R1,DELAYMSG        TEMPORARY FIRST ADDRESS               36450000
         MVC   0(5,R1),DAYTABLE+3 MOVE IN YYDDD                         36460000
         SPACE 1                                                        36470000
VRTDCHK1 LR    R5,R1              SAVE R1 POINTER FOR LATER             36480000
         CLC   2(3,R5),VRTDL366   >366?                                 36490000
         BH    VRTDBAD            YES, ERROR                            36500000
         CLC   2(3,R5),VRTDL000   ZEROR DAYS?                           36510000
         BE    VRTDBAD            YES, ERROR                            36520000
         TM    8+6(R6),X'80'      SECOND PARAMETER PRESENT?             36530000
         BNO   VRTDOK             NO, BRANCH                            36540000
         L     R1,8(,R6)          ADDR OF SECOND PARAMETER              36550000
         CLI   8+5(R6),5          NUMBER OF DIGITS:                     36560000
         BL    VRTDBAD              0-4, ERROR                          36570000
         BE    VRTDCHK2             5, YYDDD                            36580000
         CLI   8+5(R6),8                                                36590000
         BH    VRTDBAD              6-8, MM/DD/YY                       36600000
         SR    R0,R0                                                    36610000
         IC    R0,8+5(R6)         NUMBER OF CHARACTERS                  36620000
         BAS   R3,VRTDRTN         CONVERT TO YYDDD                      36630000
         LA    R1,DELAYMSG+5      TEMPORARY SECOND ADDRESS              36640000
         MVC   0(5,R1),DAYTABLE+3 MOVE IN YYDDD                         36650000
         SPACE 1                                                        36660000
VRTDCHK2 CLC   2(3,R1),VRTDL366   >366?                                 36670000
         BH    VRTDBAD            YES, ERROR                            36680000
         CLC   2(3,R1),VRTDL000   ZEROR DAYS?                           36690000
         BE    VRTDBAD            YES, ERROR                            36700000
*        CLC   0(5,R5),0(R1)      1ST:2ND RELATIONSHIP VALID? Y2K AUG97 36710000
*        BH    VRTDBAD            NO, ERROR                   Y2K AUG97 36720000
         SPACE 1                                                        36730000
VRTDOK   SR    R15,R15            VALID -- RESET TRANSLATED RESULTS     36740000
         L     R2,0(,R6)          FIRST PARAMETER ADDRESS               36750000
         MVC   0(5,R2),0(R5)      SUBSTITUTE THE TRANSLATED RESULT      36760000
         MVI   5(R6),5            SET THE LENGTH FOR LATER              36770000
         TM    8+6(R6),X'80'      SECOND PARAMETER PRESENT?             36780000
         BNO   VRTDTERM           NO, BRANCH                            36790000
         L     R2,8(,R6)          SECOND PARAMETER ADDRESS              36800000
         MVC   0(5,R2),0(R1)      SUBSTITUTE THE TRANSLATED RESULT      36810000
         MVI   8+5(R6),5          SET THE LENGTH FOR LATER              36820000
         B     VRTDTERM                                                 36830000
VRTDL000 DC    C'000'                                                   36840000
VRTDL366 DC    C'366'                                                   36850000
         SPACE 2                                                        36860000
* SUBROUTINE TO CONVERT MM/DD/YY TO YYDDD                               36870000
*                    OR YY/MM/DD TO YYDDD                               36880000
VRTDRTN  BAS   R2,VRTDNUM         CONVERT MM TO BINARY                  36890000
         LTR   R4,R14             MM ZERO?                              36900000
         AIF   ('&ISODT'  EQ 'YES').ISODT1                    DRK NOV01 36910000
         BZ    VRTDBAD            YES, ERROR                            36920000
.ISODT1  ANOP                                                 DRK NOV01 36930000
         BAS   R2,VRTDSLA         CONVERT /DD TO BINARY                 36940000
         ST    R14,DOUBLE         SAVE DAYS FOR LATER                   36950000
         BAS   R2,VRTDSLA         CONVERT /YY TO BINARY                 36960000
         LTR   R0,R0              ALL DIGITS USED?                      36970000
         BNZ   VRTDBAD            NO, ERROR                             36980000
         L     R15,DOUBLE         LOAD DD AGAIN                         36990000
         AIF   ('&ISODT'  EQ 'YES').ISODT2                    DRK NOV01 37000000
         CH    R4,=H'60'          YEAR FIRST?                           37010000
         BL    VRTDRT2            NO, BRANCH                            37020000
.ISODT2  ANOP                                                 DRK NOV01 37030000
         ST    R14,DOUBLE         SAVE NUMBER OF DAYS                   37040000
         LR    R14,R4             LOAD ACTUAL YY                        37050000
         LR    R4,R15             LOAD ACTUAL MM                        37060000
         L     R15,DOUBLE         LOAD ACTUAL DD                        37070000
VRTDRT2  CH    R4,=H'12'          MONTH>12?                             37080000
         BH    VRTDBAD            YES, ERROR                            37090000
         LTR   R15,R15            DD ZERO?                              37100000
         BZ    VRTDBAD            YES, ERROR                            37110000
         MVC   DAYTABLE,DAYMONTH  DAYS/MONTH                            37120000
         LR    R15,R14                                                  37130000
         SRL   R15,2                                                    37140000
         SLL   R15,2                                                    37150000
         CR    R15,R14            LEAP YEAR?                            37160000
         BNE   *+8                NO, BRANCH                            37170000
         MVI   DAYTABLE+1,29      YES, FEBRUARY HAS 29 DAYS             37180000
         SR    R0,R0                                                    37190000
         SR    R15,R15                                                  37200000
         LA    R1,DAYTABLE                                              37210000
         SPACE 1                                                        37220000
VRTDLOOP IC    R0,0(,R1)          NUMBER OF DAYS FOR A MONTH            37230000
         S     R4,=F'1'           ANY MORE MONTHS?                      37240000
         BNP   VRTDOUT            NO, BRANCH                            37250000
         AR    R15,R0             ADD THIS MONTH                        37260000
         LA    R1,1(,R1)          NEXT MONTH                            37270000
         B     VRTDLOOP                                                 37280000
         SPACE 1                                                        37290000
VRTDOUT  L     R1,DOUBLE          DAYS IN THE FINAL MONTH               37300000
         CR    R1,R0              TOO MANY?                             37310000
         BH    VRTDBAD            YES, BRANCH                           37320000
         AR    R15,R1             JULIAN DAYS                           37330000
         MH    R14,=H'1000'       YY000                                 37340000
         AR    R15,R14            YYDDD                                 37350000
         CVD   R15,DOUBLE                                               37360000
         MVC   DAYTABLE(8),VRTDLEDI                                     37370000
         ED    DAYTABLE(8),DOUBLE+4                                     37380000
         BR    R3                                                       37390000
VRTDLEDI DC    X'4020212020202020'                                      37400000
         SPACE 1                                                        37410000
* SUBROUTINE TO CONVERT /NN TO BINARY                                   37420000
VRTDSLA  CLI   0(R1),C'/'         SLASH DIVIDER?                        37430000
         BNE   VRTDBAD            NO, ERROR                             37440000
         LA    R1,1(,R1)          YES, SKIP IT                          37450000
         BCTR  R0,0               REDUCE STRING LENGTH                  37460000
         SPACE 1                                                        37470000
* SUBROUTINE TO CONVERT NN TO BINARY                                    37480000
VRTDNUM  TM    0(R1),X'F0'        A NUMERIC DIGIT?                      37490000
         BNO   VRTDBAD            NO, ERROR                             37500000
         IC    R14,0(,R1)         FIRST DIGIT                           37510000
         BCTR  R0,0                                                     37520000
         LA    R1,1(,R1)                                                37530000
         N     R14,=F'15'         FIRST DIGIT IN BINARY                 37540000
         CLI   0(R1),C'/'         SLASH DIVIDER?                        37550000
         BER   R2                 YES, RETURN                           37560000
         AIF   ('&ISODT'  NE 'YES').ISODT3                    DRK NOV01 37570000
         LTR   R0,R0              1 DIGIT DAY?     YY/MM/D    DRK NOV01 37580000
         BER   R2                 YES, RETURN                 DRK NOV01 37590000
.ISODT3  ANOP                                                 DRK NOV01 37600000
         MH    R14,=H'10'                                               37610000
         TM    0(R1),X'F0'        A NUMERIC DIGIT?                      37620000
         BNO   VRTDBAD            NO, ERROR                             37630000
         IC    R15,0(,R1)         FIRST DIGIT                           37640000
         BCTR  R0,0                                                     37650000
         LA    R1,1(,R1)                                                37660000
         N     R15,=F'15'         SECOND DIGIT IN BINARY                37670000
         AR    R14,R15            RESULT IN BINARY                      37680000
         BR    R2                                                       37690000
VRTDBAD  LA    R15,4              INVALID, PROMPT FOR ANOTHER DATE      37700000
VRTDTERM M$EXIT                                                         37710000
DAYMONTH DC    AL1(31,28,31,30,31,30,31,31,30,31,30,31)                 37720000
         LTORG                                                          37730000
         EJECT                                                          37740000
*                                                                       37750000
*        INPUT DATA SET VALIDITY CHECK EXIT                             37760000
*                                                                       37770000
         SPACE 3                                                        37780000
VRTDSN   M$ENTER VALCHECK                                               37790000
         OI    FLAGSBB,FQUOTE+FNOTFILE  ASSUME QUOTED AND NOT FILE(...  37800000
         OI    FLAGSHH,FOPTIONS         ASSUME NOT ASTERISK FORM        37810000
         L     R15,0(R6)                ADDR OF DSNAME                  37820000
         CLI   0(R15),C'*'              ASTERISK DSNAME?                37830000
         BE    PREVDSN                  YES, BRANCH                     37840000
         MVC   SAVDSN+1(SAVLEN),DSNLEN  SAVE PREVIOUS DSNAME            37850000
         MVC   SAVDSN(1),DSPREQST       SAVE DISPOSITION FOR LATER      37860000
         MVC   PASSWORD,=CL8' '                                         37870000
         SPACE 1                                                        37880000
         MVC   DSNAME(L'DSNAME),=CL44' '                                37890000
         LH    R14,4(R6)                LENGTH OF DSNAME                37900000
         STH   R14,DSNLEN                                               37910000
         BCTR  R14,0                                                    37920000
         MVC   DSNAME(*-*),0(R15)       <<EXECUTED>>                    37930000
         EX    R14,*-6                  MOVE DSNAME TO AREA             37940000
         SPACE 1                                                        37950099
         L     R1,CVTPTR(,R0)              CVT                DRK JUL17 37960099
         L     R14,CVTTVT-CVTMAP(,R1)      TSVT                       " 37970099
         CLI   TSVTUMXL-TSVT(R14),X'08'    8-CHAR USERID?             " 37980099
         BL    VRTDSNT7                    NO                         " 37990099
         B     VRTDSNT8                    YES                        " 38000099
VRTDSNT8 DS    0H                                                     " 38010099
         L     R1,ADDRUPT               ADDRESS OF THE UPT            " 38020099
         SR    R14,R14                                                " 38030099
         IC    R14,UPTPRF8L-UPT(R1)     LENGTH OF USERID              " 38040099
         MVC   DSNAMEH(4),DSNAME        FIRST FOUR BYTES OF DSNAME    " 38050099
         LTR   R14,R14                  VALID LENGTH?                 " 38060099
         BZ    *+6                      NO, BRANCH                    " 38070099
         BCTR  R14,0                    MACHINE LENGTH                " 38080099
         CLC   DSNAME(*-*),UPTPREF8-UPT(R1) <<EXECUTED>>              " 38090099
         EX    R14,*-6                      START WITH USERID?        " 38100099
         LR    R1,R15                       ADDRESS OF DSNAME         " 38110099
         BNE   *+14                         NO, BRANCH                " 38120099
         LA    R1,2(R14,R15)                DATA AFTER PERIOD         " 38130099
         MVC   DSNAMEH(4),0(R1)         FIRST FOUR BYTES OF DSNAME    " 38140099
         SPACE 1                                                      " 38150099
         B     VRTDSNC                                                " 38160099
VRTDSNT7 DS    0H                                                     " 38170099
         L     R1,ADDRUPT               ADDRESS OF THE UPT              38180099
         SR    R14,R14                                                  38190099
         IC    R14,UPTPREFL-UPT(R1)     LENGTH OF USERID                38200099
         MVC   DSNAMEH(4),DSNAME        FIRST FOUR BYTES OF DSNAME      38210099
         LTR   R14,R14                  VALID LENGTH?                   38220099
         BZ    *+6                      NO, BRANCH                      38230099
         BCTR  R14,0                    MACHINE LENGTH                  38240099
         CLC   DSNAME(*-*),UPTPREFX-UPT(R1) <<EXECUTED>>                38250099
         EX    R14,*-6                      START WITH USERID?          38260099
         LR    R1,R15                       ADDRESS OF DSNAME           38270099
         BNE   *+14                         NO, BRANCH                  38280099
         LA    R1,2(R14,R15)                DATA AFTER PERIOD           38290099
         MVC   DSNAMEH(4),0(R1)         FIRST FOUR BYTES OF DSNAME      38300099
         SPACE 1                                                        38310099
VRTDSNC  DS    0H                                             DRK JUL17 38320099
         SPACE 1                                                        38330000
         OI    FLAGSBB,FQUOTE+FNOTFILE  ASSUME QUOTED AND NOT FILE(...  38340000
         TM    6(R6),X'40'              QUOTED?                         38350000
         BO    NOFILE                   YES, BRANCH                     38360000
         XI    FLAGSBB,FQUOTE           NO, RESET THE BIT               38370000
         TM    14(R6),X'80'             FILE(FILENAME) SUPPLIED?        38380000
         BZ    NOMEMB                   NO, BRANCH                      38390000
         CLC   0(1,R1),VRTDSFIL         CORRECT FILE IDENTIFIER?        38400000
         BNE   NOFILE                   NO, BRANCH                      38410000
         CLI   1(R1),C'('               AND A (?                        38420000
         BE    GOTFILE                  YES, BRANCH                     38430000
         TM    1(R1),FF-X'40'           AND A BLANK OR NULL?            38440000
         BZ    GOTFILE                  YES, BRANCH                     38450000
         CLC   0(2,R1),VRTDSFIL         CORRECT FILE IDENTIFIER?        38460000
         BNE   NOFILE                   NO, BRANCH                      38470000
         CLI   2(R1),C'('               AND A (?                        38480000
         BE    GOTFILE                  YES, BRANCH                     38490000
         TM    2(R1),FF-X'40'           AND A BLANK OR NULL?            38500000
         BZ    GOTFILE                  YES, BRANCH                     38510000
         CLC   0(3,R1),VRTDSFIL         CORRECT FILE IDENTIFIER?        38520000
         BNE   NOFILE                   NO, BRANCH                      38530000
         CLI   3(R1),C'('               AND A (?                        38540000
         BE    GOTFILE                  YES, BRANCH                     38550000
         TM    3(R1),FF-X'40'           AND A BLANK OR NULL?            38560000
         BZ    GOTFILE                  YES, BRANCH                     38570000
         CLC   0(4,R1),VRTDSFIL         CORRECT FILE IDENTIFIER?        38580000
         BNE   NOFILE                   NO, BRANCH                      38590000
         CLI   4(R1),C'('               AND A (?                        38600000
         BE    GOTFILE                  YES, BRANCH                     38610000
         TM    4(R1),FF-X'40'           AND A BLANK OR NULL?            38620000
         BNZ   NOFILE                   NO, BRANCH                      38630000
GOTFILE  XI    FLAGSBB,FNOTFILE         FILE(FILENAME) SUPPLIED         38640000
         L     R15,8(,R6)               POINT TO FILENAME               38650000
         LH    R14,12(,R6)              LENGTH OF MEMBER NAME           38660000
         BCTR  R14,0                                                    38670000
         MVC   DDNAMEH(8),=CL8' '       FILENAME AREA                   38680000
         MVC   DDNAMEH(*-*),0(R15)      <<EXECUTED>>                    38690000
         EX    R14,*-6                  MOVE FILENAME                   38700000
         B     NOMEMB                                                   38710000
         SPACE 2                                                        38720000
*   CHANGE * FORM OF DSNAME                                             38730000
PREVDSN  NI    FLAGSHH,255-FOPTIONS     ASTERISK FORM                   38740000
         CLI   SAVDSN+1+2,0             ANY OTHER DSNAME?               38750000
         BE    NOFILE                   NO, CAN NOT SWITCH              38760000
         SPACE 2                                                        38770000
         XC    SAVDSN+1(SAVLEN),DSNLEN  EXCHANGE                        38780000
         XC    DSNLEN(SAVLEN),SAVDSN+1          OLD AND NEW             38790000
         XC    SAVDSN+1(SAVLEN),DSNLEN                     DSNAMES      38800000
         MVC   DSPALLOC,SAVDSN          GET PREVIOUS DISPOSITION        38810000
         MVC   SAVDSN(1),DSPREQST       SAVE REQUESTED DISPOSITION      38820000
         MVC   DSPREQST,DSPALLOC        GET PREVIOUS DISPOSITION        38830000
*                                                                       38840000
         SPACE 2                                                        38850000
NOFILE   TM    14(R6),X'80'             MEMBER SUPPLIED?                38860000
         BZ    NOMEMB                   NO, BRANCH                      38870000
         SPACE 1                                                        38880000
         L     R15,8(,R6)               POINTER TO MEMBER NAME          38890000
         LH    R14,12(,R6)              LENGTH OF MEMBER NAME           38900000
         BCTR  R14,0                                                    38910000
         MVC   MEMBERD+3(8),=CL8' '     MEMBER NAME DEFAULT AREA        38920000
         MVC   MEMBERD+3(*-*),0(R15)    <<EXECUTED>>                    38930000
         EX    R14,*-6                  MOVE MEMBER TO AREA             38940000
         STCM  R14,B'0011',MEMBERD+1    MACHINE LENGTH OF MEMBER NAME   38950000
         MVI   MEMBERD,FMEMBER1         JUST ONE MEMBER NAME DEFAULT    38960000
         SPACE 2                                                        38970000
NOMEMB   TM    22(R6),X'80'             PASSWORD SUPPLIED?              38980000
         BZ    VRTDSN99                 NO, BRANCH                      38990000
         SPACE 1                                                        39000000
         L     R15,16(,R6)              POINTER TO PASSWORD             39010000
         LH    R14,20(,R6)              PASSWORD LENGTH                 39020000
         BCTR  R14,0                                                    39030000
         MVC   PASSWORD(*-*),0(R15)     <<EXECUTED>>                    39040000
         EX    R14,*-6                  MOVE PASSWORD TO AREA           39050000
         SPACE 2                                                        39060000
VRTDSN99 SR    R15,R15                                                  39070000
         M$EXIT                                                         39080000
VRTDSFIL DC    C'FILE'                                                  39090000
         LTORG                                                          39100000
         EJECT                                                          39110000
*                                                                       39120000
*        MEMBER NAME VALIDITY CHECKING                                  39130000
*                                                                       39140000
         SPACE 3                                                        39150000
VRTMEMBR M$ENTER VALCHECK                                               39160000
         SR    R15,R15            ASSUME NOT PARTITIONED                39170000
         TM    ##ADRPC#,@S        CORRECT?                              39180000
         BO    VRTMEMX            YES, EXIT                             39190000
         L     R15,0(R6)          ADDR OF MEMBER NAME                   39200000
         LH    R14,4(R6)          LENGTH OF NAME                        39210000
         TM    ##ADRPC#,@G        NEW DEFAULT MEMBER NAME?              39220000
         BNO   VRTMEMS            NO, BRANCH                            39230000
         MVI   FLAGSAA,0          CLEAR THE MEMBER FLAGS                39240000
         MVI   FLAGSHH,FOPTIONS   SET THE OPTIONS FLAG                  39250000
         SPACE 1                                                        39260000
VRTMEMS  BCTR  R14,0              EXECUTE LENGTH                        39270000
         OI    FLAGSAA,FMEMBER2                                         39280000
         TM    FLAGSAA,FMEMBER1   FIRST MEMBER PROCESSED?               39290000
         LA    R6,MEMBER2                                               39300000
         LA    R2,LMEMBER2                                              39310000
         BO    MEM2ND             YES, DO THE SECOND MEMBER NAME        39320000
         XC    0(10,R6),0(R6)     NO, CLEAR MEMBER2, LMEMBER2           39330000
         XI    FLAGSAA,FMEMBER1+FMEMBER2                                39340000
         LA    R6,MEMBER1                                               39350000
         LA    R2,LMEMBER1                                              39360000
MEM2ND   MVC   0(8,R6),=CL8' '    BLANK THE MEMBER NAME                 39370000
         SPACE 1                                                        39380000
         TM    SPFLAG2,SPFLNCD    LINE COMMAND?                         39390000
         BO    VRTSOUT            YES, NO PARTIAL MEMBER NAMES          39400000
         TM    FLAGSAA,FMEMBER2   SECOND MEMBER NAME?                   39410000
         BO    VRTSOUT            YES, BRANCH                           39420000
         TM    ##ADRPC#,@G        DEFAULT AND MEMBER GROUPS ALLOWED?    39430000
         BO    VRTM190            YES, BRANCH                           39440000
         TM    ##ADRPA#,$M        PATTERN OR DISPLAY SUBCOMMAND?        39450000
         BNO   VRTSOUT            NO, BRANCH                            39460000
VRTM190  LA    R0,1(,R14)         ACTUAL MEMBER NAME LENGTH             39470000
         LR    R5,R15             START OF MEMBER NAME                  39480000
         LTR   R14,R14            SINGLE CHARACTER NAME?                39490000
         BNZ   VRTM210            NO, BRANCH                            39500000
         CLI   0(R5),C'/'         MEMBER PATTERN REQUEST?               39510000
         BE    VRTBAD             YES, INVALID                          39520000
         CLI   0(R5),C'*'         MEMBER PLACE-HOLDER?                  39530000
         BE    VRTM200            YES, BRANCH                           39540000
         CLI   0(R5),C':'         MEMBER RANGE REQUEST?                 39550000
         BNE   VRTSOUT            NO, BRANCH                            39560000
         NI    FLAGSAA,FF-FMEMBER1        ENTIRE DIRECTORY DESIRED      39570000
         OI    FLAGSAA,FMEM#MEM+FMEMRANG  MEMBER RANGE GROUP DESIRED    39580000
         B     VRTGOOD                                                  39590000
         SPACE 2                                                        39600000
VRTM200  OI    FLAGSHH,FMEMSTAR   MEMBER NAME STAR (*) NOTATION         39610000
         CLI   MEMBERD,X'00'      ANY MEMBER DEFAULT YET?               39620000
         BE    VRTSOUT            NO, JUST USE *                        39630000
         NI    FLAGSHH,FF-FOPTIONS    SET FLAGS FOR NO OPERAND          39640000
         MVC   LMEMBER1(2+8+8+2),MEMBERD+1                              39650000
         MVC   FLAGSAA,MEMBERD    RESET THE FLAG BITS                   39660000
         B     VRTGOOD                                                  39670000
         SPACE 1                                                        39680000
VRTM210  CLI   0(R5),C'*'         MEMBER PART DESIRED?                  39690000
         BE    VRTM220            YES, BRANCH                           39700000
         CLI   0(R5),C':'         MEMBER RANGE DESIRED?                 39710000
         BE    VRTM221            YES, BRANCH                           39720000
         CLI   0(R5),C'/'         MEMBER PATTERN DESIRED?               39730000
         BE    VRTM222            YES, BRANCH                           39740000
         LA    R5,1(,R5)          NEXT MEMBER CHARACTER                 39750000
         BCT   R0,VRTM210         CHECK ALL MEMBER CHARACTERS           39760000
         B     VRTSOUT            NOT FOUND -- NORMAL MEMBER NAME       39770000
         SPACE 1                                                        39780000
VRTM220  OI    FLAGSAA,FMEMASTR   MEMBER PART DESIRED                   39790000
         B     VRTM222                                                  39800000
VRTM221  OI    FLAGSAA,FMEMRANG   MEMBER RANGE DESIRED                  39810000
VRTM222  OI    FLAGSAA,FMEM#MEM   MEMBER GROUP DESIRED                  39820000
         CR    R15,R5             FIRST CHARACTER OF NAME?              39830000
         BNE   VRTM230            NO, BRANCH                            39840000
         LA    R15,1(,R15)        SKIP OVER : OR /                      39850000
         XC    LMEMBER2,LMEMBER2  NO MEMBER 2 YET                       39860000
         TM    FLAGSAA,FMEMRANG+FMEMASTR  RANGE OR MEMBER PART?         39870000
         BZ    VRTM240                    NO, BRANCH                    39880000
         MVI   LMEMBER1+1,0       MACHINE LENGTH IS ZERO                39890000
         MVI   MEMBER1,X'00'      DATA IS X'00'                         39900000
         B     VRTMEMS            CONTINUE WITH MEMBER2                 39910099
         SPACE 1                                                        39920000
VRTM230  S     R0,=F'1'           ACTUAL LENGTH OF MEMBER2              39930000
         STH   R0,LMEMBER2        SAVE FOR LATER                        39940000
         SR    R14,R0             ACTUAL LENGTH OF MEMBER1              39950000
         LA    R5,1(,R5)          SKIP OVER : OR +                      39960000
         ST    R5,FULLWORD        SAVE FOR LATTER                       39970000
         SPACE 1                                                        39980000
VRTM240  BCTR  R14,0              REDUCE MACHINE LENGTH BY ONE          39990000
         SPACE 2                                                        40000000
VRTSOUT  STH   R14,0(,R2)         STASH LENGTH                          40010000
         SPACE 1                                                        40020000
         LA    R5,0(R14,R15)      POINT TO LAST CHARACTER OF MEMBER     40030000
         LM    R0,R1,=CL8' '      HEX MEMBER NAME PADDING               40040000
         SPACE 1                                                        40050000
         CLC   =C'X''',0(R15)     BEGINS WITH X'?                       40060000
         BE    VRTHEX             YES, MUST BE A HEX MEMBER NAME        40070000
         SPACE 1                                                        40080000
         TM    FLAGSAA,FMEMBER2   SECOND MEMBER?                        40090000
         BNO   MEMLEN             NO, BRANCH                            40100000
         L     R3,=A($RES)        RESTORE SUBCOMMAND                    40110000
         CLC   ##SUBCOM(8),0(R3)  RESTORE SUBCOMMAND?                   40120000
         BNE   MEMLEN             NO, BRANCH                            40130000
         BCTR  R15,0              BACK UP R15                           40140000
         SR    R0,R0              ZERO MEMBER NAME PADDING              40150000
         SR    R1,R1              ZERO MEMBER NAME PADDING              40160000
         B     VRTNULL            CHECK FOR A NULL                      40170000
         SPACE 2                                                        40180000
MEMLEN   CLI   1(R2),7            COMPARE LENGTH > 7?                   40190000
         BNH   VRTCHAR            NO, BRANCH                            40200000
         B     VRTBAD             YES, INVALID MEMBER NAME              40210000
         SPACE 2                                                        40220000
VRTHEX   CLI   0(R5),C''''        A FINAL QUOTE?                        40230000
         BNE   VRTBAD             NO, INVALID HEXADECIMAL               40240000
         BCTR  R5,0               POINT TO PRECEDING CHARACTER          40250000
         LA    R15,1(,R15)        POINT TO FIRST QUOTE                  40260000
         SPACE 1                                                        40270000
VRTNULL  CR    R5,R15             NULL HEX STRING?                      40280000
         BNH   VRTBAD             YES, INVALID SYNTAX                   40290000
         SR    R4,R4              COUNT OF DIGITS                       40300000
         L     R14,=F'-1'         BXH INCREMENT                         40310000
         SPACE 1                                                        40320000
VRTHLOOP IC    R3,0(,R5)          NEXT CHARACTER (REVERSE SCAN)         40330000
         CLI   0(R5),C'0'                                               40340000
         BL    *+12               0-9?                                  40350000
         CLI   0(R5),C'9'                                               40360000
         BNH   VRT0TOF            YES, BRANCH                           40370000
         LA    R3,9(,R3)          NO, ADJUST LOW DIGIT 1-5 TO A-F       40380000
         CLI   0(R5),C'A'                                               40390000
         BL    VRTBAD             A-F?                                  40400000
         CLI   0(R5),C'F'                                               40410000
         BH    VRTBAD             NO, BRANCH                            40420000
         SPACE 1                                                        40430000
VRT0TOF  SLL   R3,28              GET DIGIT IN TOP DIGIT                40440000
         SRDL  R0,4               CREATE ROOM IN R0,R1                  40450000
         OR    R0,R3              ADD TO R0,R1                          40460000
         LA    R4,1(,R4)          ANOTHER DIGIT                         40470000
         BXH   R5,R14,VRTHLOOP    DO ALL DIGITS                         40480000
         SPACE 1                                                        40490000
         LA    R14,1(,R4)         DIGITS+1                              40500000
         SRL   R14,1              (DIGITS+1)/2    -- TRUNCATED          40510000
         BCTR  R14,0              MACHINE COMPARE LENGTH                40520000
         STH   R14,0(,R2)         MACHINE LENGTH AFTER CONVERSION       40530000
         LA    R14,2(R14,R14)     (COMPARE LENGTH+1)*2                  40540000
         CR    R14,R4             EVEN NUMBER OF DIGITS?                40550000
         BE    *+8                YES, BRANCH                           40560000
         SRDL  R0,4               NO, ADJUST BY ONE MORE DIGIT          40570000
         SPACE 1                                                        40580000
         STM   R0,R1,DOUBLE       SAVE CREATED MEMBER NAME              40590000
         LA    R14,7              FULL LENGTH MEMBER NAME               40600000
         LA    R15,DOUBLE         START OF MOVE ADDRESS                 40610000
         MVC   0(*-*,R6),0(R15)   <<EXECUTED>>                          40620000
         EX    R14,*-6            MOVE IN MEMBER NAME                   40630000
         B     VRTMNAME                                                 40640000
         SPACE 2                                                        40650000
VRTCHAR  MVC   0(*-*,R6),0(R15)   <<EXECUTED>>                          40660000
         EX    R14,*-6            MOVE IN MEMBER NAME                   40670000
         SPACE 3                                                        40680000
         TM    SPFLAG2,SPFLNCD    LINE COMMAND?               ABL NOV86 40690000
         BNO   VRTCHK0            NO, BRANCH                  ABL NOV86 40700000
         CLI   SPFSAVM2,X'40'     SECOND MEMBER NAME?         ABL NOV86 40710000
         BE    VRTMNAME           YES, BRANCH                 ABL NOV86 40720000
         MVC   MEMBER1(8),SPFSAVM2  RESET REAL MEMBER NAME    ABL NOV86 40730000
         MVC   SPFSAVM2(8),=CL8' '  RESET PASSED MEMBER NAME  ABL NOV86 40740000
         B     VRTMNAME                                                 40750000
         SPACE 2                                                        40760000
VRTCHK0  LA    R0,1(,R14)         ACTUAL MEMBER NAME LENGTH             40770000
         LR    R1,R6              START OF MEMBER NAME                  40780000
VRTCHK2  CLI   0(R1),C':'         RANGE TYPE NAME?                      40790000
         BE    VRTBAD             YES, ERROR                            40800000
         CLI   0(R1),C'/'         PATTERN TYPE NAME?                    40810000
         BE    VRTBAD             YES, ERROR                            40820000
         CLI   0(R1),C'*'         MEMBER PART NAME?                     40830000
         BNE   VRTCHK4            NO, BRANCH                            40840000
         TM    ##ADRPC#,@G        DEFAULT AND MEMBER GROUPS ALLOWED?    40850000
         BNO   VRTBAD             NO, ERROR                             40860000
         TM    FLAGSAA,FMEMBER2   PROCESSING SECOND PART OF NAME?       40870000
         BO    VRTBAD             YES, ERROR                            40880000
         CLI   1(R2),0            SINGLE *?                             40890000
         BNE   VRTBAD             NO, ERROR                             40900000
VRTCHK4  LA    R1,1(,R1)          NEXT MEMBER NAME CHARACTER            40910000
         BCT   R0,VRTCHK2         LOOP FOR ALL 1-8 CHARACTERS           40920000
         SPACE 2                                                        40930000
VRTMNAME TM    FLAGSAA,FMEM#MEM   MEMBER GROUP PROCESSING?              40940000
         BNO   VRTGOOD            NO, BRANCH                            40950000
         TM    FLAGSAA,FMEMBER2   SECOND MEMBER PROCESSED?              40960000
         BO    VRTGOOD            YES, BRANCH                           40970000
         LH    R14,LMEMBER2       ACTUAL LENGTH OF MEMBER2              40980000
         L     R15,FULLWORD       START OF MEMBER2                      40990000
         LTR   R14,R14            ANY MEMBER2?                          41000000
         BP    VRTMEMS            YES, BRANCH                           41010000
         SPACE 1                                                        41020000
         AIF   ('&CONDRNG' EQ 'N').NMRNG  OPTION TO MAKE AA: = AA:AA    41030000
         TM    FLAGSAA,FMEMRANG   MEMBER RANGE?                         41040000
         BZ    VRTGOOD            NO, BRANCH                            41050000
         OI    FLAGSAA,FMEMBER2   INDICATE SECOND MEMBER NAME PROVIDED  41060000
         MVC   MEMBER2,MEMBER1    MEMBER NAMES ARE THE SAME             41070000
         MVC   LMEMBER2,LMEMBER1  MEMBER NAME LENGTHS ARE THE SAME      41080000
.NMRNG   ANOP                                                           41090000
         SPACE 1                                                        41100000
VRTGOOD  TM    FLAGSAA,FMEMASTR   MEMBER PART?                          41110000
         BZ    VRTADD0            NO, BRANCH                            41120000
         LH    R15,LMEMBER1       FIRST PART OF NAME                    41130000
         AH    R15,LMEMBER2       SECOND PART OF NAME                   41140000
         CH    R15,=H'7'          MACHINE LENGTH:MAXIMUM                41150000
         BL    VRTADD0              BELOW - VALID                       41160000
         BH    VRTBAD               ABOVE - INVALID                     41170000
         CLI   MEMBER1,0          NULL FIRST STRING?                    41180000
         BE    VRTADD0            YES, BRANCH                           41190000
         TM    FLAGSAA,FMEMBER2   SECOND MEMBER PROVIDED?               41200000
         BO    VRTBAD             YES, BRANCH                           41210000
         SPACE 1                                                        41220000
VRTADD0  SR    R15,R15                                                  41230000
         TM    ##ADRPC#,@G        NEW DEFAULT MEMBER NAME?              41240000
         BNO   VRTGOOD2           NO, BRANCH                            41250000
         TM    FLAGSII,FMEMFRST   FIRST MEMBER OF A LIST?               41260000
         BZ    VRTGOOD0           YES, BRANCH                           41270000
         L     R1,PMEMMAX                 LAST ACTIVE POINTER           41280000
         OC    1(3,R1),1(R1)              ANY SLOT ENTRIES?             41290000
         BNZ   VRTADD80                   YES, BRANCH                   41300000
         LA    R0,36*28                   36 MEMBERS, 28 WIDE EACH      41310000
         ICM   R0,B'1000',=AL1(24)        ASSUME SPF IS INITIALIZED     41320000
         STCM  R0,B'1000',SUBLIST2        MARK FOR LATER RELEASE        41330000
         TM    FLAGSFF,FSPFCALL+FSPFDIAL  SPF INITIALIZED?              41340000
         BM    VRTADD10                   YES, BRANCH                   41350000
         AIF   ('&CISP' NE 'ISPFV2').NSPFVRT                            41360000
         TM    FLAGSFF,FSPFOPT6           CALLED FROM OPTION 6?         41370000
         BO    VRTADD10                   YES, BRANCH                   41380000
.NSPFVRT ANOP                                                           41390000
         ICM   R0,B'1000',=AL1(23)        SPF IS NOT INITIALIZED        41400000
         STCM  R0,B'1000',SUBLIST1        MARK FOR LATER RELEASE        41410000
         MVI   SUBLIST2,0                 CLEAR THE EARLIER MARK        41420000
VRTADD10 GETMAIN R,LV=(0)                 GET MORE ELEMENT STORAGE      41430000
         LR    R15,R1                     START OF TABLE                41440000
         L     R1,PMEMMAX                 CURRENT ELEMENT               41450000
         LA    R0,36-1                    NUMBER OF ELEMENTS -1         41460000
VRTADD41 LA    R15,28(,R15)               NEXT ELEMENT POINTER          41470000
         ST    R15,0(,R1)                 POINT TO THE NEXT ELEMENT     41480000
         LR    R1,R15                     NEXT ELEMENT                  41490000
         BCT   R0,VRTADD41                DO 41 ELEMENTS                41500000
         XC    0(4,R1),0(R1)              CLEAR THE LAST POINTER        41510000
         SPACE 2                                                        41520000
VRTADD80 L     R1,PMEMMAX                 CURRENT ADDED ELEMENT         41530000
         L     R15,0(,R1)                 NEXT POINTER                  41540000
         NI    0(R15),FF-X'80'            NOT AN ACTIVE ELEMENT         41550000
         ST    R15,PMEMMAX                NEXT ELEMENT TO ADD           41560000
         OI    0(R1),X'80'                ACTIVE ELEMENT                41570000
         OI    PMEMMIN,X'80'              MEMBER LIST IS ACTIVE         41580000
         SR    R15,R15                                                  41590000
         MVC   4(20,R1),LMEMBER1  LMEMBER1,MEMBER1,MEMBER2,LMEMBER2     41600000
         MVC   4(1,R1),FLAGSAA    SAVE FLAGSAA TOO                      41610000
         MVC   LMEMBER1(20),MEMBERD+1  RESTORE THE FIRST ELEMENT        41620000
         MVC   FLAGSAA(1),MEMBERD                                       41630000
         BAS   R14,DEFGROUP                    ADD DEFAULT GROUP        41640000
         B     VRTMEMX                                                  41650000
         SPACE 1                                                        41660000
VRTGOOD0 OI    FLAGSII,FMEMFRST   FIRST LIST ELEMENT                    41670000
         TM    FLAGSHH,FMEMSTAR   ASTERISK NOTATION?                    41680000
         BO    VRTGOOD1           YES, BRANCH                           41690000
         TM    SPFLAG2,SPFLNCD    LINE COMMAND?   ***TEST               41700000
         BO    VRTGOOD1           YES, BRANCH     ***TEST               41710000
         MVC   PMEMMAX(4),PMEMMIN NO, POINT TO THE FIRST ELEMENT        41720000
         NI    PMEMMIN,FF-X'80'           MEMBER LIST IS INACTIVE       41730000
         SPACE 1                                                        41740000
VRTGOOD1 TM    SPFLAG2,SPFLNCD            LINE COMMAND?        SS AUG85 41750000
         BO    VRTMEMX                    YES, TERMINATE                41760000
         MVC   MEMBERD+1(2+8+8+2),LMEMBER1  SAVE CURRENT MEMBER NAMES   41770000
         MVC   MEMBERD(1),FLAGSAA           SAVE CURRENT FLAGS          41780000
         BAS   R14,DEFGROUP                    ADD DEFAULT GROUP        41790000
         B     VRTMEMX            TERMINATE                             41800000
         SPACE 2                                                        41810000
VRTGOOD2 TM    ##ADRPA#,$M        DISPLAY OR PATTERN SUBCOMMAND?        41820000
         BNO   VRTGOOD4           NO, BRANCH                            41830000
         TM    FLAGSAA,FMEM#MEM   MEMBER GROUP TO DISPLAY?              41840000
         BNO   VRTGOOD4           NO, BRANCH                            41850000
         XI    FLAGSAA,FMEM#MEM   TURN OFF THE MEMBER GROUP FLAG        41860000
         L     R1,=A($DIS)                                              41870000
         L     R0,8(,R1)          ASSUME DISPLAY                        41880000
         L     R1,=A($PAT)                                              41890000
         TM    FLAGSAA,FMEMRANG   CORRECT?                              41900000
         BO    *+8                YES, BRANCH                           41910000
         L     R0,8(,R1)          NO, PATTERN                           41920000
         ST    R0,##ADRCMD        UPDATE THE PROCESSING ADDRESS         41930000
         SPACE 2                                                        41940000
VRTGOOD4 L     R1,=A($PAT)        PATTERN                               41950000
         CLC   ##SUBCOM(8),0(R1)  NEW DEFAULT PATTERN?                  41960000
         BNE   VRTMEMX            NO, BRANCH                            41970000
         MVC   MEMBERP+1(2+8+8+2),LMEMBER1  SAVE CURRENT MEMBER NAMES   41980000
         MVC   MEMBERP(1),FLAGSAA           SAVE CURRENT FLAGS          41990000
         B     VRTMEMX            TERMINATE                             42000000
         SPACE 2                                                        42010000
VRTBAD   LA    R15,4               INVALID MEMBER NAME -- TRY AGAIN     42020000
         TM    FLAGSAA,FMEMBER2    PROCESSING MEMBER2?                  42030000
         BO    *+8                 YES, BRANCH                          42040000
         NI    FLAGSAA,FF-FMEMBER1 NO, SAY NO MEMBER1 YET               42050000
         NI    FLAGSAA,FF-FMEMBER2 ALWAYS SAY NOT MEMBER2 NOW           42060000
         TM    FLAGSAA,FMEM#MEM    MEMBER GROUP REQUEST?                42070000
         BNO   VRTMEMX             NO, BRANCH                           42080000
         NI    FLAGSAA,FF-FMEM#MEM-FMEMBER1-FMEMBER2-FMEMRANG-FMEMASTR  42090000
VRTMEMX  M$EXIT                                                         42100000
         LTORG                                                          42110000
         SPACE 2                                                        42120000
*                                                             DRK FEB01 42130000
*        TIME VALIDITY CHECKING                               DRK FEB01 42140000
*                                                             DRK FEB01 42150000
         SPACE 3                                              DRK FEB01 42160000
VRTTIME  M$ENTER VALCHECK                                     DRK FEB01 42170000
         SR    R15,R15                ZERO                    DRK FEB01 42180000
         TM    FLAGSCC,RECFMU         LOAD MODULE LIBRARY?    DRK FEB01 42190000
         BO    VRTTIMEX               YES, NO CHECK           DRK FEB01 42200000
         L     R1,0(,R6)              ADDR OF TIME            DRK FEB01 42210000
         LH    R14,4(,R6)             LENGTH OF TIME          DRK FEB01 42220000
         BCTR  R14,0                  MACHINE LENGTH          DRK FEB01 42230000
         PACK  DOUBLE(8),0(*-*,R1)    <<EXECUTED>>            DRK FEB01 42240000
         EX    R14,*-6                PACK ALL THE DIGITS     DRK FEB01 42250000
         MVO   DOUBLE+5(3),DOUBLE+5(3)  SHIFT LEFT            DRK FEB01 42260000
         CLI   DOUBLE+5,X'24'           HH < 24?              DRK FEB01 42270000
         BNL   VRTTBAD                  NO, ERROR             DRK FEB01 42280000
         CLI   DOUBLE+6,X'60'           MM < 60?              DRK FEB01 42290000
         BNL   VRTTBAD                  NO, ERROR             DRK FEB01 42300000
         B     VRTTIMEX                                       DRK FEB01 42310000
VRTTBAD  LA    R15,4              INVALID TIME -- TRY AGAIN   DRK FEB01 42320000
VRTTIMEX M$EXIT                                               DRK FEB01 42330000
         LTORG                                                DRK FEB01 42340000
         SPACE 2                                              DRK FEB01 42350000
*                                                             DRK SEP06 42360000
*        LMA DATEFMT VALIDITY CHECKING                        DRK SEP06 42370000
*                                                             DRK SEP06 42380000
         SPACE 3                                              DRK SEP06 42390000
VRTLMADT M$ENTER VALCHECK                                     DRK SEP06 42400000
         SR    R15,R15                ZERO                    DRK SEP06 42410000
         L     R1,0(,R6)              ADDR OF DATEFMT         DRK SEP06 42420000
         LH    R14,4(,R6)             LENGTH OF DATEFMT       DRK SEP06 42430000
         CH    R14,=H'8'              EIGHT BYTES?            DRK SEP06 42440000
         BNE   VRTDTBAD               NO                      DRK SEP06 42450000
         CLC   0(8,R1),DATEFMT1       YYYYMMDD?               DRK SEP06 42460000
         BE    VRTLMADX               YES, OK                 DRK SEP06 42470000
         CLC   0(8,R1),DATEFMT2       MMDDYYYY                DRK SEP06 42480000
         BE    VRTLMADX               YES, OK                 DRK SEP06 42490000
         CLC   0(8,R1),DATEFMT3       DDMMYYYY                DRK SEP06 42500000
         BE    VRTLMADX               YES, OK                 DRK SEP06 42510000
         B     VRTDTBAD               NO, BAD                 DRK SEP06 42520000
VRTDTBAD LA    R15,4              INVALID DATE -- TRY AGAIN   DRK SEP06 42530000
VRTLMADX M$EXIT                                               DRK SEP06 42540000
DATEFMT1 DC    CL8'YYYYMMDD'                                  DRK SEP06 42550000
DATEFMT2 DC    CL8'MMDDYYYY'                                  DRK SEP06 42560000
DATEFMT3 DC    CL8'DDMMYYYY'                                  DRK SEP06 42570000
         LTORG                                                DRK SEP06 42580000
         SPACE 2                                              DRK SEP06 42590000
*                                                             DRK SEP06 42600000
*        LMA SORTBY VALIDITY CHECKING                         DRK SEP06 42610000
*                                                             DRK SEP06 42620000
         SPACE 3                                              DRK SEP06 42630000
VRTLMAST M$ENTER VALCHECK                                     DRK SEP06 42640000
         SR    R15,R15                ZERO                    DRK SEP06 42650000
         L     R1,0(,R6)              ADDR OF SORTBY          DRK SEP06 42660000
         LH    R14,4(,R6)             LENGTH OF SORTBY        DRK SEP06 42670000
         MVC   DOUBLE(8),=CL8' '      CLEAR FIELD             DRK SEP06 42680000
         BCTR  R14,0                  MACHINE LENGTH          DRK SEP06 42690000
         MVC   DOUBLE(*-*),0(R1)      <<EXECUTED>>            DRK SEP06 42700000
         EX    R14,*-6                MOVE VALUE FIELD        DRK SEP06 42710000
         CLC   DOUBLE(8),SORTBY1      OFFSET?                 DRK SEP06 42720000
         BE    VRTLMASX               YES, OK                 DRK SEP06 42730000
         CLC   DOUBLE(8),SORTBY2      NAME?                   DRK SEP06 42740000
         BE    VRTLMASX               YES, OK                 DRK SEP06 42750000
         CLC   DOUBLE(8),SORTBY3      PROGRAM?                DRK SEP06 42760000
         BE    VRTLMASX               YES, OK                 DRK SEP06 42770000
         CLC   DOUBLE(8),SORTBY4      LANGUAGE?               DRK SEP06 42780000
         BE    VRTLMASX               YES, OK                 DRK SEP06 42790000
         CLC   DOUBLE(8),SORTBY5      DATE?                   DRK SEP06 42800000
         BE    VRTLMASX               YES, OK                 DRK SEP06 42810000
         B     VRTSTBAD               NO, BAD                 DRK SEP06 42820000
VRTSTBAD LA    R15,4              INVALID SORTBY -- TRY AGAIN DRK SEP06 42830000
VRTLMASX M$EXIT                                               DRK SEP06 42840000
SORTBY1  DC    CL8'OFFSET'                                    DRK SEP06 42850000
SORTBY2  DC    CL8'NAME'                                      DRK SEP06 42860000
SORTBY3  DC    CL8'PROGRAM'                                   DRK SEP06 42870000
SORTBY4  DC    CL8'LANGUAGE'                                  DRK SEP06 42880000
SORTBY5  DC    CL8'DATE'                                      DRK SEP06 42890000
         LTORG                                                DRK SEP06 42900000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV1                 DRK JAN13 42910099
C_DCBE   DCBE  EADSCB=OK                                       JH DEC12 42920099
C_DCBEL  EQU   *-C_DCBE                                        JH DEC12 42930099
.NOEAV1  ANOP                                                 DRK JAN13 42940099
         SPACE 2                                              DRK SEP06 42950000
         TITLE 'P D S  --  PDS PARSE DEFINITIONS             09/28/88'  42960000
*                                                                       42970000
*        P A R S E   C O N T R O L   L I S T                            42980000
*                                                                       42990000
         PRINT NOGEN                                                    43000000
         SPACE 3                                                        43010000
PCLMAIN  IKJPARM DSECT=MAINPDL                                          43020000
INPUTDSN IKJPOSIT DSTHING,USID,VALIDCK=VRTDSN,                         $43030000
               PROMPT='NAME OF DATA SET',                              $43040000
               HELP=('NAME OF THE DATA SET TO BE PROCESSED')            43050000
OPTVOL   IKJKEYWD                                                       43060000
         IKJNAME 'V',ALIAS=('VO','VOL','VOLUME'),SUBFLD=VOLNAM          43070000
OPTSET   IKJKEYWD                                                       43080000
         IKJNAME 'VOLSET',SUBFLD=VOLSETS                                43090000
OPTDISP  IKJKEYWD                                                       43100000
         IKJNAME 'OLD'                                                  43110000
         IKJNAME 'SHR'                                                  43120000
OPTXISPM IKJKEYWD                                                       43130000
         IKJNAME 'XISPMODE'                                             43140000
OPTCONC  IKJKEYWD                                                       43150000
         IKJNAME  'NUMBER',SUBFLD=OPTCONCO                              43160000
OPTCONCO IKJSUBF                                                        43170000
OPTCONCC IKJIDENT 'CONCATENATION NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,  $43180000
               PROMPT='CONCATENATION NUMBER',MAXLNTH=2,                $43190000
               HELP=('CONCATENATION NUMBER OF THE FILE NAME ENTERED')   43200000
VOLNAM   IKJSUBF                                                        43210000
VOLNAME  IKJIDENT 'VOLUME NAME',ASTERISK,MAXLNTH=6,                    $43220000
               FIRST=ALPHANUM,OTHER=ALPHANUM,PROMPT='VOLUME NAME',     $43230000
               HELP=('NAME OF THE VOLUME WHERE THE DATA SET RESIDES')   43240000
VOLSETS  IKJSUBF                                                        43250000
VOLSETID IKJIDENT 'DEFAULT VOLUME NAME',ASTERISK,MAXLNTH=6,            $43260000
               FIRST=ALPHANUM,OTHER=ALPHANUM,                          $43270000
               PROMPT='DEFAULT VOLUME NAME',                           $43280000
               HELP=('DEFAULT NAME FOR THE VOLUME PARAMETER')           43290000
         IKJENDP                                                        43300000
         SPACE 2                                                        43310000
PCLALIAS IKJPARM DSECT=PDLALIAS                                         43320000
PCLAL1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $43330000
               PROMPT='CURRENT MEMBER NAME',VALIDCK=VRTMEMBR,          $43340000
               HELP=('NAME OF THE MEMBER TO BE ASSIGNED AN ALIAS')      43350000
PCLAL2   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $43360000
               PROMPT='ALIAS NAME',VALIDCK=VRTMEMBR,                   $43370000
               HELP=('NAME TO BE ASSIGNED AS AN ALIAS')                 43380000
         IKJENDP                                                        43390000
         SPACE 2                                                        43400000
PCLAMB   IKJPARM DSECT=PDLAMB                                           43410000
PCLAM1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $43420000
               PROMPT='NAME OF MEMBER',                                $43430000
               HELP=('NAME OF THE MEMBER WHOSE MODULE MAP AND CROSS-REF$43440000
               ERENCE LISTING ARE TO BE PRODUCED'),VALIDCK=VRTMEMBR     43450000
AMBLOUT  IKJKEYWD                                                       43460099
         IKJNAME  'XREF'      LISTLOAD OUTPUT=XREF            DRK OCT12 43470099
         IKJNAME  'BOTH',ALIAS=('MODLIST') LISTLOAD OUTPUT=BOTH       " 43480099
         IKJENDP                                                        43490000
         SPACE 2                                                        43500000
PCLATTR  IKJPARM DSECT=PDLATTR                                          43510000
PCLAT1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $43520000
               PROMPT='NAME OF MEMBER',                                $43530000
               HELP=('NAME OF THE MEMBER WHOSE ATTRIBUTES ARE TO BE LIS$43540000
               TED'),VALIDCK=VRTMEMBR                                   43550000
LKEDNONE IKJKEYWD                                                       43560000
         IKJNAME  'NONE'                                                43570000
         IKJNAME  'ADDSTATS'                                            43580000
LKEDEXT  IKJKEYWD                                                       43590000
         IKJNAME  'NOEXTEND'                                  DRK AUG09 43600000
         IKJNAME  'EXTEND',ALIAS=('XTEND')                    DRK JUN16 43610099
SPFLONG  IKJKEYWD                                                       43620000
         IKJNAME  'LONG',ALIAS=('BIG')                        DRK JUN16 43630099
LKEDREUS IKJKEYWD                                                       43640000
         IKJNAME  'REUS'                                                43650000
         IKJNAME  'NOREUS'                                              43660000
LKEDREFR IKJKEYWD                                                       43670000
         IKJNAME  'REFR'                                                43680000
         IKJNAME  'NOREFR'                                              43690000
LKEDRENT IKJKEYWD                                                       43700000
         IKJNAME  'RENT'                                                43710000
         IKJNAME  'NORENT'                                              43720000
LKEDEXEC IKJKEYWD                                                       43730000
         IKJNAME  'EXEC'                                                43740000
         IKJNAME  'NOEXEC'                                              43750000
LKEDLOAD IKJKEYWD                                                       43760000
         IKJNAME  'LOADONLY'                                            43770000
         IKJNAME  'NOLOADONLY'                                          43780000
LKEDEDIT IKJKEYWD                                                       43790000
         IKJNAME  'EDIT'                                                43800000
         IKJNAME  'NOEDIT'                                              43810000
LKEDDC   IKJKEYWD                                                       43820000
         IKJNAME  'DC'                                                  43830000
         IKJNAME  'NODC'                                                43840000
LKEDAUTH IKJKEYWD                                                       43850000
         IKJNAME  'AUTH',ALIAS=('APF')                                  43860000
         IKJNAME  'NOAUTH',ALIAS=('NOAPF')                              43870000
LKEDPAGE IKJKEYWD                                                       43880000
         IKJNAME  'PAGE'                                                43890000
         IKJNAME  'NOPAGE'                                              43900000
LKEDRLDF IKJKEYWD                                                       43910000
         IKJNAME  'RLDFIX'                                              43920000
         IKJNAME  'NORLDFIX'                                            43930000
LKEDUNAL IKJKEYWD                                                       43940000
         IKJNAME  'UNALIAS'                                             43950000
LKEDRMOD IKJKEYWD                                                       43960000
         IKJNAME  'RMODE24'                                             43970000
         IKJNAME  'RMODEANY'                                            43980000
         IKJNAME  'RMODE64'                                   DRK MAR18 43990099
LKEDAMOD IKJKEYWD                                                       44000000
         IKJNAME  'AMODE24',ALIAS=('AMODE00','AMODEZAP')                44010000
         IKJNAME  'AMODE31'                                             44020000
         IKJNAME  'AMODEANY'                                            44030000
         IKJNAME  'AMODE64'                                             44040000
LKEDSSIK IKJKEYWD                                                       44050000
         IKJNAME  'SSI',SUBFLD=LKEDSSIS                                 44060000
         IKJNAME  'NOSSI'                                               44070000
ATTRUS   IKJKEYWD                                                       44080000
         IKJNAME  'USERID',ALIAS=('ID'),SUBFLD=ATTRUSE                  44090000
ATTRV    IKJKEYWD                                                       44100000
         IKJNAME  'VER',SUBFLD=ATTRVE                                   44110000
ATTRM    IKJKEYWD                                                       44120000
         IKJNAME  'MOD',SUBFLD=ATTRMO                                   44130000
ATTRC    IKJKEYWD                                                       44140000
         IKJNAME  'CREATED',SUBFLD=ATTRCR                               44150000
ATTRH    IKJKEYWD                                                       44160000
         IKJNAME  'MODIFIED',ALIAS=('LAST'),SUBFLD=ATTRCH               44170000
ATTRT    IKJKEYWD                                                       44180000
         IKJNAME  'TIME',SUBFLD=ATTRTI                                  44190000
ATTRS    IKJKEYWD                                                       44200000
         IKJNAME  'SECS',ALIAS=('SS'),SUBFLD=ATTRSE                     44210000
LKEDENTR IKJKEYWD                                                       44220000
         IKJNAME  'ENTRY',SUBFLD=AENTRY                                 44230000
INFOALIA IKJKEYWD                                                       44240000
         IKJNAME  'A',ALIAS=('ALIASINFO')                               44250000
         IKJNAME  'NOA',ALIAS=('NOALIASINFO')                           44260000
         IKJNAME  'SHORT'                                               44270000
INFOLKED IKJKEYWD                                                       44280000
         IKJNAME  'LKEDDATE'                                            44290000
         IKJNAME  'NOLKEDDATE'                                          44300000
AENTRY   IKJSUBF                                                        44310000
AENTRYS  IKJIDENT 'EXTERNAL NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,       $44320000
               PROMPT='THE EXTERNAL NAME OF THE NEW ENTRY POINT',      $44330000
               HELP=('ONE TO EIGHT BYTES EXTERNAL ENTRY POINT NAME')    44340000
ATTRUSE  IKJSUBF                                                        44350000
* 8-CHARACTER USERID                                          DRK JAN17 44360099
ATTRUSER IKJIDENT 'USER IDENTIFICATION',MAXLNTH=8,FIRST=ANY,OTHER=ANY, $44370099
               PROMPT='THE NAME OF THE LAST MODIFYING USER',           $44380000
               HELP=('ONE TO EIGHT CHARACTER USERID NAME')              44390099
ATTRVE   IKJSUBF                                                        44400000
ATTRVER  IKJIDENT 'VERSION NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,        $44410000
               PROMPT='VERSION NUMBER',MAXLNTH=2,                      $44420000
               HELP=('THE NEW MODIFICATION VERSION NUMBER')             44430000
ATTRMO   IKJSUBF                                                        44440000
ATTRMOD  IKJIDENT 'MODIFICATION NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,   $44450000
               PROMPT='MODIFICATION NUMBER',MAXLNTH=2,                 $44460000
               HELP=('THE NEW MODIFICATION LEVEL NUMBER')               44470000
ATTRCR   IKJSUBF                                                        44480000
         AIF   ('&ISODT'  EQ 'YES').ISOH1                     DRK NOV01 44490000
ATTRCRE  IKJIDENT 'DATE CREATED',                                      $44500000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $44510000
               PROMPT='DATE CREATED',MAXLNTH=08,VALIDCK=VRTDATE,       $44520000
               HELP=('THE NEW CREATION DATE -- LIKE 12/15/86 OR 86349') 44530000
         AGO   .ISOH1X                                        DRK NOV01 44540000
.ISOH1   ANOP                                                 DRK NOV01 44550000
ATTRCRE  IKJIDENT 'DATE CREATED',                                      $44560000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $44570000
               PROMPT='DATE CREATED',MAXLNTH=08,VALIDCK=VRTDATE,       $44580000
               HELP=('THE NEW CREATION DATE -- LIKE 86/12/15 OR 86349') 44590000
.ISOH1X  ANOP                                                 DRK NOV01 44600000
ATTRCH   IKJSUBF                                                        44610000
         AIF   ('&ISODT'  EQ 'YES').ISOH2                     DRK NOV01 44620000
ATTRCHG  IKJIDENT 'DATE MODIFIED',                                     $44630000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $44640000
               PROMPT='DATE MODIFIED',MAXLNTH=08,VALIDCK=VRTDATE,      $44650000
               HELP=('THE NEW MODIFICATION DATE -- LIKE 12/15/86 OR 863$44660000
               49')                                                     44670000
         AGO   .ISOH2X                                        DRK NOV01 44680000
.ISOH2   ANOP                                                 DRK NOV01 44690000
ATTRCHG  IKJIDENT 'DATE MODIFIED',                                     $44700000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $44710000
               PROMPT='DATE MODIFIED',MAXLNTH=08,VALIDCK=VRTDATE,      $44720000
               HELP=('THE NEW MODIFICATION DATE -- LIKE 86/12/15 OR 863$44730000
               49')                                                     44740000
.ISOH2X  ANOP                                                 DRK NOV01 44750000
ATTRTI   IKJSUBF                                                        44760000
ATTRTIM  IKJIDENT 'TIME MODIFIED',FIRST=NUMERIC,OTHER=NUMERIC,         $44770000
               PROMPT='TIME MODIFIED',MAXLNTH=4,VALIDCK=VRTTIME,       $44780000
               HELP=('THE NEW MODIFICATION TIME')                       44790000
ATTRSE   IKJSUBF                                                        44800000
ATTRSEC  IKJIDENT 'SECONDS MODIFIED',FIRST=NUMERIC,OTHER=NUMERIC,      $44810000
               PROMPT='SECONDS MODIFIED',MAXLNTH=2,                    $44820000
               HELP=('THE NEW MODIFICATION TIME SECONDS (SS)')          44830000
LKEDSSIS IKJSUBF                                                        44840000
LKEDSSI  IKJIDENT 'SSI DATA',FIRST=ALPHANUM,OTHER=ALPHANUM,MAXLNTH=8,  $44850000
               PROMPT='THE NEW OR CHANGED SSI INFORMATION',            $44860000
               HELP=('ONE TO EIGHT BYTES OF HEXADECIMAL SSI DATA')      44870000
         IKJENDP                                                        44880000
         SPACE 2                                                        44890000
PCLBROWS IKJPARM DSECT=PDLBROWS                                         44900000
PCLBR1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $44910000
               PROMPT='NAME OF MEMBER TO BE BROWSED',VALIDCK=VRTMEMBR, $44920000
               HELP=('NAME OF THE MEMBER FOR THE SPF BROWSE COMMAND')   44930000
         IKJENDP                                                        44940000
         SPACE 2                                                        44950000
PCLCOB   IKJPARM DSECT=PDLCOB                                           44960000
PCLCOB1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $44970000
               PROMPT='NAME OF MEMBER FOR ANALYSIS',VALIDCK=VRTMEMBR,  $44980000
               HELP=('NAME OF THE LOAD MODULE TO BE ANALYZED')          44990000
COBALIAS IKJKEYWD                                                       45000000
         IKJNAME  'ALIAS'                                               45010000
         IKJNAME  'NOALIAS'                                             45020000
COBLIST  IKJKEYWD                                                       45030000
         IKJNAME  'LIST'                                                45040000
         IKJNAME  'NOLIST'                                              45050000
COBSUMM  IKJKEYWD                                                       45060000
         IKJNAME  'SUMMARY'                                             45070000
         IKJNAME  'NOSUMMARY'                                           45080000
         IKJENDP                                                        45090000
         SPACE 2                                                        45100000
PCLCOMPA IKJPARM DSECT=PDLCOMPA                                         45110000
PCLCAR1  IKJIDENT 'DSNAME OR MEMBER NAME',FIRST=ANY,OTHER=ANY,         $45120000
               MAXLNTH=56,                                             $45130000
               PROMPT='NAME OF THE ORIGINAL DATA SET OR MEMBER',       $45140000
               HELP=('NAME OF THE ORIGINAL DATA SET OR MEMBER')         45150000
PCLCAR2  IKJIDENT 'DSNAME OR MEMBER NAME',FIRST=ANY,OTHER=ANY,         $45160000
               MAXLNTH=56,                                             $45170000
               PROMPT='NAME OF THE CHANGED DATA SET OR MEMBER',        $45180000
               HELP=('NAME OF THE CHANGED DATA SET OR MEMBER')          45190000
PCLCO2   IKJPOSIT SPACE                                                 45200000
PCLCOSTR IKJPOSIT STRING                                                45210000
         IKJENDP                                                        45220000
         SPACE 2                                                        45230000
PCLCOMPR IKJPARM DSECT=PDLCOMPR                                         45240000
CMXLIST  IKJKEYWD                                                       45250000
         IKJNAME  'S',ALIAS=('SUMMARY')                                 45260000
         IKJNAME  'LIST'                                                45270000
         IKJNAME  'NOLIST'                                              45280000
CMXSHARE IKJKEYWD                                                       45290000
         IKJNAME  'SHR'                                                 45300000
         IKJENDP                                                        45310000
         SPACE 2                                                        45320000
PCLCONDE IKJPARM DSECT=PDLCONDE                                         45330000
CONDLVL  IKJKEYWD                                                       45340000
         IKJNAME  'W',ALIAS=('WARNINGS')                                45350000
         IKJNAME  'ER',ALIAS=('ERRORS')                                 45360000
         IKJNAME  'OFF'                                                 45370000
CONDRC   IKJKEYWD                                                       45380000
         IKJNAME  'RC'                                                  45390000
         IKJENDP                                                        45400000
         SPACE 2                                                        45410000
PCLCONT  IKJPARM DSECT=PDLCONT                                          45420000
PALINCON IKJKEYWD                                                       45430000
         IKJNAME  'ALIASINFO'                                           45440000
         IKJNAME  'NOALIASINFO'                                         45450000
PLKEDCON IKJKEYWD                                                       45460000
         IKJNAME  'LKEDDATE'                                            45470000
         IKJNAME  'NOLKEDDATE'                                          45480000
PTRANCON IKJKEYWD                                                       45490000
         IKJNAME  'T',ALIAS=('TRANSLATOR')                              45500000
         IKJNAME  'NOTRANSLATOR'                                        45510000
PPROMCON IKJKEYWD                                                       45520000
         IKJNAME  'PROMPT'                                              45530000
         IKJNAME  'NOPROMPT'                                            45540000
PRECVCON IKJKEYWD                                                       45550000
         IKJNAME  'RECOVER'                                             45560000
         IKJNAME  'NORECOVER'                                           45570000
PDOUBCON IKJKEYWD                                                       45580000
         IKJNAME  'D',ALIAS=('DOUBLE')                                  45590000
         IKJNAME  'S',ALIAS=('SINGLE')                                  45600000
         IKJNAME  'M',ALIAS=('MULTIPLE')                                45610000
         IKJNAME  'R',ALIAS=('RETAIN'),SUBFLD=CRETAIN                   45620000
CLOGTYPE IKJKEYWD                                                       45630000
         IKJNAME  'SYSOUT',SUBFLD=CSYSOUTO                              45640000
         IKJNAME  'NOS',ALIAS=('NOSYSOUT')                              45650000
         IKJNAME  'DSNAME',SUBFLD=CDSNAMEO                              45660000
         IKJNAME  'NODSNAME'                                            45670000
CLOGDISP IKJKEYWD                                                       45680000
         IKJNAME  'OLD'                                                 45690000
         IKJNAME  'SHR'                                                 45700000
         IKJNAME  'MOD'                                                 45710000
         IKJNAME  'NEW'                                                 45720000
CLOGFORM IKJKEYWD                                                       45730000
         IKJNAME  'FORMS',SUBFLD=CFORMO                                 45740000
         IKJNAME  'NOFORMS'                                             45750000
CLOGDEST IKJKEYWD                                                       45760000
         IKJNAME  'DEST',SUBFLD=CDESTO                                  45770000
         IKJNAME  'NODEST'                                              45780000
PIMMCON  IKJKEYWD                                                       45790000
         IKJNAME  'TESTCPULOOP'  1                                      45800000
         IKJNAME  'TESTABEND'    2                                      45810000
         IKJNAME  'TESTOUTLOOP'  3                                      45820000
         IKJNAME  'TESTMSGS'     4                                      45830000
         IKJNAME  'IOSTATS'      5                                      45840000
         IKJNAME  'TESTREAD'     6                                      45850000
         IKJNAME  'ALLGLOBALS',ALIAS=('DEFAULTS')   7                   45860000
         IKJNAME  'GLOBALMODS'   8                                      45870000
         IKJNAME  'PDSMAIN'      9                                      45880000
         IKJNAME  'MODS',ALIAS=('DRK')  10                              45890000
         IKJNAME  'GEO',ALIAS=('DASD')  11                              45900000
         IKJNAME  'LISTENV',ALIAS=('MVS','SCP','CPU')   12              45910000
         IKJNAME  'COMPILERS',ALIAS=('COBOL','ASM','IBM')  13           45920099
         IKJNAME  'TSU',ALIAS=('TSO')  14                               45930099
         IKJNAME  'ISPLOG',ALIAS=('LOGALL','DEBUG')  15                 45940099
         IKJNAME  'MBRVAL',ALIAS=('VALIDATE')  16                       45950099
         IKJNAME  'RESET',ALIAS=('MEMLIST')  17                         45960099
         IKJNAME  'STATE',ALIAS=('TOGGLES')  18                         45970099
         IKJNAME  'ZVOL',ALIAS=('ZAPVOL','ZAP300A')  19                 45980099
CRETAIN  IKJSUBF                                                        45990000
CRETAINA IKJIDENT 'BUFFERS TO RETAIN',FIRST=NUMERIC,OTHER=NUMERIC,     $46000000
               MAXLNTH=2,                                              $46010000
               HELP=('THE NUMBER OF TRACK BUFFERS TO RETAIN')           46020000
CDESTO   IKJSUBF                                                        46030000
CDESTT   IKJIDENT 'DESTINATION',FIRST=ALPHANUM,OTHER=ALPHANUM,         $46040000
               MAXLNTH=8,PROMPT='DESTINATION NAME',                    $46050000
               HELP=('ONE TO EIGHT CHARACTER SYSOUT DESTINATION')       46060000
CFORMO   IKJSUBF                                                        46070000
CFORMT   IKJIDENT 'FORMS NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,          $46080000
               MAXLNTH=4,PROMPT='FORMS NAME',                          $46090000
               HELP=('ONE TO FOUR CHARACTER FORMS NAME')                46100000
CDSNAMEO IKJSUBF                                                        46110000
CDSNAMET IKJPOSIT DSNAME,USID,PROMPT='OUTPUT DATA SET NAME',           $46120000
               HELP=('THE NAME OF THE SESSION OUTPUT DATA SET')         46130000
CSYSOUTO IKJSUBF                                                        46140000
CSYSOUTT IKJIDENT 'SYSOUT CLASS',FIRST=ALPHANUM,                       $46150000
               MAXLNTH=1,PROMPT='SYSOUT CLASS NAME',                   $46160000
               HELP=('ONE CHARACTER SYSOUT CLASS NAME')                 46170000
         IKJENDP                                                        46180000
         SPACE 2                                                        46190000
PCLCOPY  IKJPARM DSECT=PDLCOPY                                          46200000
PCLCOP   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $46210000
               PROMPT='NAME OF MEMBERS TO BE COPIED',VALIDCK=VRTMEMBR, $46220000
               HELP=('NAME OF THE MEMBERS TO BE COPIED')                46230000
COPDSN2  IKJIDENT 'DSNAME OR MEMBER NAME',FIRST=ANY,OTHER=ANY,         $46240000
               MAXLNTH=56,                                             $46250000
               PROMPT='NAME OF THE TARGET DATA SET OR MEMBER',         $46260000
               HELP=('NAME OF THE TARGET DATA SET OR MEMBER')           46270000
COPTRCYL IKJKEYWD                                                       46280000
         IKJNAME  'TRACKS',ALIAS=('TRKS')                               46290000
         IKJNAME  'CYLINDER'                                            46300000
COPEXIST IKJKEYWD                                                       46310000
         IKJNAME  'EXIST'                                               46320000
         IKJNAME  'NOEXIST'                                             46330000
         IKJNAME  'NOBLDL'                                              46340000
         IKJNAME  'EXCLUDE'                                             46350000
COPLIST  IKJKEYWD                                                       46360000
         IKJNAME  'SUMMARY'                                             46370000
         IKJNAME  'LIST'                                                46380000
         IKJNAME  'NOLIST'                                              46390000
COPDISP  IKJKEYWD                                                       46400000
         IKJNAME  'OLD'                                                 46410000
         IKJNAME  'SHR'                                                 46420000
         IKJNAME  'NEW'                                                 46430000
COPREPL  IKJKEYWD                                                       46440000
         IKJNAME  'REPLACE'                                             46450000
         IKJNAME  'NOREPLACE'                                           46460000
COPCALL  IKJKEYWD                                                       46470000
         IKJNAME  'CALL'                                                46480000
         IKJNAME  'NOCALL'                                              46490000
COPALIAS IKJKEYWD                                                       46500000
         IKJNAME  'ALIAS'                                               46510000
         IKJNAME  'NOALIAS'                                             46520000
COPGENS  IKJKEYWD                                                       46530099
         IKJNAME  'GENS'                COPY MBR GENERATIONS (PDSE V2)  46540099
COPVOLUM IKJKEYWD                                                       46550000
         IKJNAME  'VOLUME',SUBFLD=COPVOLU                               46560000
COPASSS  IKJKEYWD                                                       46570000
         IKJNAME  'AS',SUBFLD=COPASS                                    46580000
         IKJNAME  'TO',SUBFLD=COPASS                                    46590000
COPDIRKY IKJKEYWD                                                       46600000
         IKJNAME  'DIR',SUBFLD=COPDIRK                                  46610000
COPSPAKY IKJKEYWD                                                       46620000
         IKJNAME  'SPACE',SUBFLD=COPSPAK                                46630000
COPCONKY IKJKEYWD                                                       46640000
         IKJNAME  'N',SUBFLD=COPCONK,ALIAS=('NUMBER')                   46650000
COPMAXBL IKJKEYWD                                                       46660000
         IKJNAME  'MAXBLK',SUBFLD=COPMAXB                               46670000
COPTYPE  IKJKEYWD                                                       46680000
         IKJNAME  'DSNTYPE',ALIAS=('TYPE'),                            $46690099
               SUBFLD=COPTYPEO                                          46700000
COPMAXG  IKJKEYWD                                                       46710099
         IKJNAME  'MAXGENS',ALIAS=('MG'),                              $46720099
               SUBFLD=COPMAXGO                                          46730099
COPMAXB  IKJSUBF                                                        46740000
COPMAX   IKJIDENT 'MAXIMUM BLOCKSIZE',FIRST=NUMERIC,OTHER=NUMERIC,     $46750000
               PROMPT='MAXIMUM BLOCKSIZE',MAXLNTH=5,                   $46760000
               HELP=('MAXIMUM ACCEPTABLE BLOCKSIZE')                    46770000
COPCONK  IKJSUBF                                                        46780000
COPCONCA IKJIDENT 'CONCATENATION NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,  $46790000
               PROMPT='CONCATENATION NUMBER',MAXLNTH=2,                $46800000
               HELP=('THE CONCATENATION NUMBER FOR USE WITH FILE()')    46810000
COPSPAK  IKJSUBF                                                        46820000
COPSPACE IKJIDENT 'DATA SET SIZE',LIST,FIRST=NUMERIC,OTHER=NUMERIC,    $46830000
               PROMPT='DATA SET SIZE',MAXLNTH=5,                       $46840000
               HELP=('THE ALLOCATION SIZES FOR PRIMARY AND SECONDARY')  46850000
COPDIRK  IKJSUBF                                                        46860000
COPDIRCO IKJIDENT 'DIRECTORY BLOCKS',FIRST=NUMERIC,OTHER=NUMERIC,      $46870000
               PROMPT='DIRECTORY BLOCKS',MAXLNTH=5,                    $46880000
               HELP=('NUMBER OF DIRECTORY BLOCKS DESIRED')              46890000
COPASS   IKJSUBF                                                        46900000
COPAS    IKJIDENT 'PARTIAL MEMBER NAME',FIRST=ALPHANUM,OTHER=ALPHANUM, $46910000
               PROMPT='THE PARTIAL OUTPUT MEMBER NAME',MAXLNTH=8,      $46920000
               HELP=('PATTERN NAME FOR THE OUTPUT MEMBERS')             46930000
COPVOLU  IKJSUBF                                                        46940000
COPVOL   IKJIDENT 'VOLUME NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,         $46950000
               PROMPT='THE VOLUME NAME FOR THE OUTPUT DATA',MAXLNTH=6, $46960000
               HELP=('THE VOLUME SERIAL FOR THE OUTPUT DATA SET')       46970000
COPTYPEO IKJSUBF                                                        46980000
COPTYPET IKJIDENT 'DSN TYPE',FIRST=ALPHA,OTHER=ALPHA,                  $46990000
               MAXLNTH=8,                                              $47000000
               PROMPT='THE DSNTYPE FOR THE OUTPUT DATA SET',           $47010000
               HELP=('THE DSNTYPE -- LIBRARY OR PDS')                   47020000
COPMAXGO IKJSUBF                                                        47030099
COPMAX2  IKJIDENT 'MAXIMUM GENERATIONS',FIRST=NUMERIC,OTHER=NUMERIC,   $47040099
               PROMPT='MAXIMUM GENERATIONS',MAXLNTH=10,                $47050099
               HELP=('MAXIMUM NUMBER OF MEMBER GENERATIONS TO BE RETAIN$47060099
               ED BY THE SYSTEM')                                       47070099
         IKJENDP                                                        47080000
         SPACE 2                                                        47090000
PCLCPK   IKJPARM DSECT=PDLCPK                                           47100000
CPKVOL   IKJIDENT 'VOLUME NAME',MAXLNTH=6,ASTERISK,                    $47110000
               FIRST=ALPHANUM,OTHER=ALPHANUM,PROMPT='VOLUME NAME',     $47120000
               HELP=('NAME OF THE VOLUME TO BE MAPPED')                 47130000
         IKJENDP                                                        47140000
         SPACE 2                                                        47150000
PCLDELET IKJPARM DSECT=PDLDELET                                         47160000
PCLS1    IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $47170000
               PROMPT='NAME OF MEMBER TO BE DELETED',VALIDCK=VRTMEMBR, $47180000
               HELP=('NAME OF THE MEMBER TO BE SCRATCHED')              47190000
PCLDELAL IKJKEYWD                                                       47200000
         IKJNAME  'ALIAS'                                               47210000
         IKJNAME  'NOALIAS'                                             47220000
         IKJENDP                                                        47230000
         SPACE 2                                                        47240000
PCLDIR   IKJPARM DSECT=PDLDIR                                           47250000
PCLDIR1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $47260000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,HELP=('NAME OF $47270000
               THE MEMBER WHOSE DIRECTORY ENTRY IS TO BE DUMPED')       47280000
PCLSHOR  IKJKEYWD                                                       47290000
         IKJNAME  'SHORT'                                               47300000
         IKJNAME  'LONG'                                                47310000
PCLSTAT  IKJKEYWD                                                       47320099
         IKJNAME  'ISPF'         SPF STATS: ISPF LABELS                 47330099
         IKJNAME  'DEBUG'        SPF STATS: DEBUGGING HANDBOOK LABELS   47340099
         IKJENDP                                                        47350000
         SPACE 2                                                        47360000
PCLDSNA  IKJPARM DSECT=PDLDSNA                                          47370000
PCLDSN   IKJKEYWD                                                       47380000
         IKJNAME   'JCL',ALIAS=('BATCH')                                47390000
         IKJNAME   'T',ALIAS=('TSO')                                    47400000
         IKJNAME   'MSG',ALIAS=('TABLE','TBL')                          47410000
         IKJENDP                                                        47420000
         SPACE 2                                                        47430000
PCLDSPLY IKJPARM DSECT=PDL1MEM                                          47440000
PCLD1    IKJIDENT 'MEMBER NAME',MAXLNTH=39,                            $47450000
               FIRST=ANY,OTHER=ANY,VALIDCK=VRTMEMBR                     47460000
PCLD2    IKJIDENT 'MEMBER NAME',MAXLNTH=19,                            $47470000
               FIRST=ANY,OTHER=ANY,VALIDCK=VRTMEMBR                     47480000
         IKJENDP                                                        47490000
         SPACE 2                                                        47500000
PCLEDIT  IKJPARM DSECT=PDLEDIT                                          47510000
PCLED1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $47520000
               PROMPT='NAME OF MEMBER TO BE EDITED',VALIDCK=VRTMEMBR,  $47530000
               HELP=('NAME OF THE MEMBER FOR THE SPF EDIT COMMAND')     47540000
SPFNEWOP IKJKEYWD                                                       47550000
         IKJNAME  'NEW'                                                 47560000
         IKJNAME  'OLD'                                                 47570000
SPFMAC   IKJKEYWD                                                       47580000
         IKJNAME  'MACRO',SUBFLD=SPFMACR                                47590000
SPFPRO   IKJKEYWD                                                       47600000
         IKJNAME  'PROFILE',SUBFLD=SPFPROF                              47610000
SPFPRS   IKJKEYWD                                                       47620000
         IKJNAME  'SETPROF',ALIAS=('SP'),SUBFLD=SPFPRSE                 47630000
SPFMCS   IKJKEYWD                                                       47640000
         IKJNAME  'SETMACRO',ALIAS=('SM'),SUBFLD=SPFMACS                47650000
SPFMACR  IKJSUBF                                                        47660000
SPFMACRO IKJIDENT 'MACRO NAME',FIRST=ANY,OTHER=ALPHANUM,MAXLNTH=8,     $47670000
               PROMPT='MACRO NAME',HELP=('NAME OF A EDIT MACRO')        47680000
SPFPROF  IKJSUBF                                                        47690000
SPFPROFL IKJIDENT 'PROFILE NAME',FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8, $47700000
               PROMPT='PROFILE NAME',HELP=('NAME OF A EDIT PROFILE')    47710000
SPFPRSE  IKJSUBF                                                        47720000
SPFPRSET IKJIDENT 'DEFAULT PROFILE',ASTERISK,MAXLNTH=8,                $47730000
               FIRST=ALPHANUM,OTHER=ALPHANUM,PROMPT='DEFAULT PROFILE', $47740000
               HELP=('NAME OF A DEFAULT EDIT PROFILE')                  47750000
SPFMACS  IKJSUBF                                                        47760000
SPFMCSET IKJIDENT 'DEFAULT INITIAL MACRO',ASTERISK,MAXLNTH=8,          $47770000
               FIRST=ANY,OTHER=ALPHANUM,PROMPT='DEFAULT MACRO',        $47780000
               HELP=('NAME OF A DEFAULT INITIAL EDIT MACRO')            47790000
         IKJENDP                                                        47800000
         SPACE 2                                                        47810000
PCLFIND  IKJPARM DSECT=PDLFIND                                          47820000
PCLFIND1 IKJIDENT 'MEMBER NAME',MAXLNTH=39,FIRST=ANY,OTHER=ANY,LIST,   $47830000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,               $47840000
               HELP=('NAME OF THE MEMBER TO BE SEARCHED')               47850000
FINDDLM1 IKJPOSIT DELIMITER                                             47860000
FINDSTRG IKJPOSIT STRING,SQSTRING,ASIS                                  47870000
FINDFMT  IKJKEYWD                                                       47880000
         IKJNAME  'NUM'                   FLAGSDD=X'00'                 47890000
         IKJNAME  'NONUM'                 FLAGSDD=X'01'                 47900000
         IKJNAME  'SNUM'                  FLAGSDD=X'02'                 47910000
         IKJNAME  'LBLOCK'                FLAGSDD=X'04'                 47920000
         IKJNAME  'LDUMP'                 FLAGSDD=X'08'                 47930000
         IKJNAME  'BLOCK'                 FLAGSDD=X'10'                 47940000
         IKJNAME  'DUMP'                  FLAGSDD=X'20'                 47950000
FINDINC  IKJKEYWD                                                       47960000
         IKJNAME  'INC1'                                                47970000
         IKJNAME  'INC2'                                                47980000
         IKJNAME  'INC4'                                                47990000
         IKJNAME  'INC8'                                                48000000
         IKJNAME  'INC16'                                               48010000
         IKJNAME  'INC80'                                               48020000
FINDSEC  IKJKEYWD                                                       48030000
         IKJNAME  'MODULE',SUBFLD=FDUMPC                                48040000
FINDOFFT IKJKEYWD                                                       48050000
         IKJNAME  'OFFSET',SUBFLD=FINDOFFS                              48060000
FINDLIST IKJKEYWD                                                       48070000
         IKJNAME  'FIRST'                                               48080000
         IKJNAME  'NOFIRST'                                             48090000
FINDASIS IKJKEYWD                                                       48100000
         IKJNAME  'ASIS'                                                48110000
         IKJNAME  'CAPS'                                                48120000
         IKJNAME  'IGNORE'                                              48130000
FMAXLEN  IKJKEYWD                                                       48140000
         IKJNAME  'MAXLEN',SUBFLD=FMAXLENS                              48150000
FMAXIN   IKJKEYWD                                                       48160000
         IKJNAME  'MAXIN',SUBFLD=FMAXINS                                48170000
FMAXOUT  IKJKEYWD                                                       48180000
         IKJNAME  'MAXOUT',SUBFLD=FMAXOUTS                              48190000
FMAXFIN  IKJKEYWD                                                       48200000
         IKJNAME  'MAXFIND',SUBFLD=FMAXFINS                             48210000
FSKIPR   IKJKEYWD                                                       48220000
         IKJNAME  'SKIPREC',SUBFLD=FSKIPRS                              48230000
FSKIPC   IKJKEYWD                                                       48240000
         IKJNAME  'SKIPCOL',SUBFLD=FSKIPCS                              48250000
FTHENC   IKJKEYWD                                                       48260000
         IKJNAME  'THEN',SUBFLD=FTHENCS                                 48270000
FELSEC   IKJKEYWD                                                       48280000
         IKJNAME  'ELSE',SUBFLD=FELSECS                                 48290000
FDUMPC   IKJSUBF                                                        48300000
FDUMPCS  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $48310000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  48320000
FINDOFFS IKJSUBF                                                        48330000
FINDOFF  IKJIDENT 'MODULE OFFSET',FIRST=ALPHANUM,OTHER=ALPHANUM,       $48340000
               MAXLNTH=6,PROMPT='HEXADECIMAL OFFSET',HELP=('A ONE TO SI$48350000
               X DIGIT HEXADECIMAL OFFSET INTO THE LOAD MODULE')        48360000
FMAXLENS IKJSUBF                                                        48370000
FMAXLENC IKJIDENT 'MAXIMUM LENGTH',FIRST=NUMERIC,OTHER=NUMERIC,        $48380000
               PROMPT='MAXIMUM LENGTH',MAXLNTH=5,                      $48390000
               HELP=('MAXIMUM LENGTH OF EACH INPUT RECORD')             48400000
FMAXINS  IKJSUBF                                                        48410000
FMAXINC  IKJIDENT 'MAXIMUM INPUT',FIRST=NUMERIC,OTHER=NUMERIC,         $48420000
               PROMPT='MAXIMUM INPUT COUNT',MAXLNTH=7,                 $48430000
               HELP=('MAXIMUM NUMBER OF RECORDS TO INPUT')              48440000
FMAXOUTS IKJSUBF                                                        48450000
FMAXOUTC IKJIDENT 'MAXIMUM OUTPUT',FIRST=NUMERIC,OTHER=NUMERIC,        $48460000
               PROMPT='MAXIMUM OUTPUT RECORDS',MAXLNTH=7,              $48470000
               HELP=('MAXIMUM NUMBER OF LINES OR PARTIAL RECORDS TO DIS$48480000
               PLAY')                                                   48490000
FMAXFINS IKJSUBF                                                        48500000
FMAXFIND IKJIDENT 'MAXIMUM FIND STRINGS',FIRST=NUMERIC,OTHER=NUMERIC,  $48510000
               PROMPT='MAXIMUM FIND STRINGS',MAXLNTH=7,                $48520000
               HELP=('MAXIMUM NUMBER OF STRINGS TO FIND BEFORE TERMINAT$48530000
               ING')                                                    48540000
FSKIPRS  IKJSUBF                                                        48550000
FSKIPRC  IKJIDENT 'SKIP COUNT',FIRST=NUMERIC,OTHER=NUMERIC,            $48560000
               PROMPT='RECORDS TO SKIP',MAXLNTH=7,                     $48570000
               HELP=('NUMBER OF INPUT RECORDS TO IGNORE')               48580000
FSKIPCS  IKJSUBF                                                        48590000
FSKIPCC  IKJIDENT 'SKIP COLUMNS',FIRST=NUMERIC,OTHER=NUMERIC,          $48600000
               PROMPT='COLUMNS TO SKIP',MAXLNTH=5,                     $48610000
               HELP=('THE NUMBER OF BEGINNING COLUMNS TO IGNORE')       48620000
FTHENCS  IKJSUBF                                                        48630000
FTHENCC  IKJKEYWD                                                       48640000
&NATT    CONDIKJ '&NATT'                                                48650000
&NBRO    CONDIKJ '&NBRO'                                                48660000
&NDIR    CONDIKJ '&NDIR'                                                48670000
&NDEL    CONDIKJ '&NDEL'                                                48680000
&NDSP    CONDIKJ '&NDSP'                                                48690000
&NEDI    CONDIKJ '&NEDI'                                                48700000
&NEND    CONDIKJ '&NEND'                                                48710000
&NFIN    CONDIKJ '&NFIN'                                                48720000
&NFSE    CONDIKJ '&NFSE'                                                48730000
&NHIS    CONDIKJ '&NHIS'                                                48740000
&NLIS    CONDIKJ '&NLIS'                                                48750000
&NMAP    CONDIKJ '&NMAP'                                                48760000
&NMEM    CONDIKJ '&NMEM'                                                48770000
&NMML    CONDIKJ '&NMML'                                                48780000
&IMLX    CONDIKJ '&IMLX'                                                48790000
NEWML    CONDIKJ 'NEWML'                                      DRK JAN18 48800099
&NOUT    CONDIKJ '&NOUT'                                                48810000
&NPRI    CONDIKJ '&NPRI'                                                48820000
&NREV    CONDIKJ '&NREV'                                                48830000
&NSPF    CONDIKJ '&NSPF'                                                48840000
&NSUB    CONDIKJ '&NSUB'                                                48850000
&NSUL    CONDIKJ '&NSUL'                                                48860000
&NTSE    CONDIKJ '&NTSE'                                                48870000
&NTSL    CONDIKJ '&NTSL'                                                48880000
&NVIE    CONDIKJ '&NVIE'                                                48890000
&NVER    CONDIKJ '&NVER'                                                48900000
         SPACE 1                                                        48910000
FELSECS  IKJSUBF                                                        48920000
FELSECC  IKJKEYWD                                                       48930000
&NATT    CONDIKJ '&NATT'                                                48940000
&NBRO    CONDIKJ '&NBRO'                                                48950000
&NDIR    CONDIKJ '&NDIR'                                                48960000
&NDEL    CONDIKJ '&NDEL'                                                48970000
&NDSP    CONDIKJ '&NDSP'                                                48980000
&NEDI    CONDIKJ '&NEDI'                                                48990000
&NEND    CONDIKJ '&NEND'                                                49000000
&NFIN    CONDIKJ '&NFIN'                                                49010000
&NFSE    CONDIKJ '&NFSE'                                                49020000
&NHIS    CONDIKJ '&NHIS'                                                49030000
&NLIS    CONDIKJ '&NLIS'                                                49040000
&NMAP    CONDIKJ '&NMAP'                                                49050000
&NMEM    CONDIKJ '&NMEM'                                                49060000
&NMML    CONDIKJ '&NMML'                                                49070000
&IMLX    CONDIKJ '&IMLX'                                                49080000
NEWML    CONDIKJ 'NEWML'                                      DRK JAN18 49090099
&NOUT    CONDIKJ '&NOUT'                                                49100000
&NPRI    CONDIKJ '&NPRI'                                                49110000
&NREV    CONDIKJ '&NREV'                                                49120000
&NSPF    CONDIKJ '&NSPF'                                                49130000
&NSUB    CONDIKJ '&NSUB'                                                49140000
&NSUL    CONDIKJ '&NSUL'                                                49150000
&NTSE    CONDIKJ '&NTSE'                                                49160000
&NTSL    CONDIKJ '&NTSL'                                                49170000
&NVIE    CONDIKJ '&NVIE'                                                49180000
&NVER    CONDIKJ '&NVER'                                                49190000
         IKJENDP                                                        49200000
         SPACE 2                                                        49210000
PCLFIX   IKJPARM DSECT=PDLFIX                                           49220000
PCLFIXOP IKJKEYWD                                                       49230000
         IKJNAME  'DCB'                                                 49240000
         IKJNAME  'RESETDIR',SUBFLD=RDIRZ,ALIAS=('EMPTY')     DRK NOV18 49250099
         IKJNAME  'INITDIR',SUBFLD=RDIRZ                                49260000
         IKJNAME  'EXPANDDIR',SUBFLD=RDIRZ                              49270000
         IKJNAME  'FREEDIR',SUBFLD=RDIRZ                                49280000
         IKJNAME  'STOWINIT'                                  DRK JUN08 49290000
PCLRELOP IKJKEYWD                                                       49300000
         IKJNAME  'RELEASE'                                             49310000
         IKJNAME  'RELSAVE',SUBFLD=RRES                                 49320000
         IKJNAME  'RELEXTENT'                                           49330000
         IKJNAME  'MAXSPACE'                                            49340000
PCLADDOP IKJKEYWD                                                       49350000
         IKJNAME  'ADDTRK',SUBFLD=RTRKS                                 49360000
         IKJNAME  'ADDCYL',SUBFLD=RTRKS                                 49370000
PCLFIXCK IKJKEYWD                                                       49380000
         IKJNAME  'CHECK'                                               49390000
         IKJNAME  'NOCHECK'                                             49400000
RTYPE    IKJKEYWD                                                       49410000
         IKJNAME  'LOAD'                                                49420000
         IKJNAME  'OBJECT'                                              49430000
         IKJNAME  'CLIST'                                               49440000
         IKJNAME  'CNTL'                                                49450000
         IKJNAME  'ASM'                                                 49460000
         IKJNAME  'SOURCE'                                              49470000
RLRECL   IKJKEYWD                                                       49480000
         IKJNAME  'LRECL',SUBFLD=RLRECLZ                                49490000
RBLKSI   IKJKEYWD                                                       49500000
         IKJNAME  'BLKSIZE',SUBFLD=RBLKSIZ,                            $49510000
               ALIAS=('BLOCKSIZE','B','BL')                             49520000
RRECFM   IKJKEYWD                                                       49530000
         IKJNAME  'RECFM',SUBFLD=RRECFMZ                                49540000
ROPTCD   IKJKEYWD                                                       49550000
         IKJNAME  'OPTCD',SUBFLD=ROPTCDZ                                49560000
         IKJNAME  'NOOPTCD'                                             49570000
RTRKS    IKJSUBF                                                        49580000
RTRKSI   IKJIDENT 'NUMBER OF UNITS',FIRST=NUMERIC,OTHER=NUMERIC,       $49590000
               HELP=('NUMBER OF TRACKS OR CYLINDERS TO ADD'),MAXLNTH=5  49600000
RDIRZ    IKJSUBF                                                        49610000
RDIRZI   IKJIDENT 'DIRECTORY BLOCKS',FIRST=NUMERIC,OTHER=NUMERIC,      $49620000
               HELP=('NUMBER OF DIRECTORY BLOCKS'),MAXLNTH=5            49630000
RRES     IKJSUBF                                                        49640000
RRESV    IKJIDENT 'RESERVE TRACKS',FIRST=NUMERIC,OTHER=NUMERIC,        $49650000
               MAXLNTH=5,PROMPT='NUMBER OF TRACKS',                    $49660000
               HELP=('NUMBER OF TRACKS TO SAVE FOR LATER USE')          49670000
RLRECLZ  IKJSUBF                                                        49680000
RLRECLZI IKJIDENT 'LOGICAL RECORD LENGTH',FIRST=NUMERIC,OTHER=NUMERIC, $49690000
               PROMPT='LOGICAL RECORD LENGTH',MAXLNTH=5,               $49700000
               HELP=('DATA SET LOGICAL RECORD LENGTH DESIRED')          49710000
RBLKSIZ  IKJSUBF                                                        49720000
RBLKSIZI IKJIDENT 'BLOCK SIZE',FIRST=NUMERIC,OTHER=NUMERIC,            $49730000
               PROMPT='BLOCK SIZE',MAXLNTH=5,                          $49740000
               HELP=('DATA SET BLOCKSIZE DESIRED')                      49750000
RRECFMZ  IKJSUBF                                                        49760000
RRECFMZI IKJKEYWD                                                       49770000
         IKJNAME  'F'       X'80'     B'1000 0000'                      49780000
         IKJNAME  'FB'      X'90'     B'1001 0000'                      49790000
         IKJNAME  'FT'      X'A0'     B'1010 0000'                      49800000
         IKJNAME  'FBT'     X'B0'     B'1011 0000'                      49810000
         IKJNAME  'FA'      X'84'     B'1000 0100'                      49820000
         IKJNAME  'FBA'     X'94'     B'1001 0100'                      49830000
         IKJNAME  'FTA'     X'A4'     B'1010 0100'                      49840000
         IKJNAME  'FBTA'    X'B4'     B'1011 0100'                      49850000
         IKJNAME  'FM'      X'82'     B'1000 0010'                      49860000
         IKJNAME  'FBM'     X'92'     B'1001 0010'                      49870000
         IKJNAME  'FTM'     X'A2'     B'1010 0010'                      49880000
         IKJNAME  'FBTM'    X'B2'     B'1011 0010'                      49890000
         IKJNAME  'V'       X'40'     B'0100 0000'                      49900000
         IKJNAME  'VB'      X'50'     B'0101 0000'                      49910000
         IKJNAME  'VT'      X'60'     B'0110 0000'                      49920000
         IKJNAME  'VBT'     X'70'     B'0111 0000'                      49930000
         IKJNAME  'VA'      X'44'     B'0100 0100'                      49940000
         IKJNAME  'VBA'     X'54'     B'0101 0100'                      49950000
         IKJNAME  'VTA'     X'64'     B'0110 0100'                      49960000
         IKJNAME  'VBTA'    X'74'     B'0111 0100'                      49970000
         IKJNAME  'VM'      X'42'     B'0100 0010'                      49980000
         IKJNAME  'VBM'     X'52'     B'0101 0010'                      49990000
         IKJNAME  'VTM'     X'62'     B'0110 0010'                      50000000
         IKJNAME  'VBTM'    X'72'     B'0111 0010'                      50010000
         IKJNAME  'U'       X'C0'     B'1100 0000'                      50020000
         IKJNAME  'UT'      X'E0'     B'1110 0000'                      50030000
         IKJNAME  'UA'      X'C4'     B'1100 0100'                      50040000
         IKJNAME  'UM'      X'C2'     B'1100 0010'                      50050000
         IKJNAME  'UTA'     X'E4'     B'1110 0100'                      50060000
         IKJNAME  'UTM'     X'E2'     B'1110 0010'                      50070000
ROPTCDZ  IKJSUBF                                                        50080000
ROPTCDZI IKJKEYWD                                                       50090000
         IKJNAME  'W'       X'80'                                       50100000
         IKJNAME  'WC'      X'A0'                                       50110000
         IKJNAME  'WS'      X'84'                                       50120000
         IKJNAME  'WCZ'     X'A4'                                       50130000
         IKJNAME  'WZC'     X'A4'                                       50140000
         IKJNAME  'C'       X'20'                                       50150000
         IKJNAME  'CS'      X'24'                                       50160000
         IKJNAME  'CW'      X'A0'                                       50170000
         IKJNAME  'CWZ'     X'A4'                                       50180000
         IKJNAME  'CZW'     X'A4'                                       50190000
         IKJNAME  'Z'       X'04'                                       50200000
         IKJNAME  'ZC'      X'24'                                       50210000
         IKJNAME  'ZW'      X'84'                                       50220000
         IKJNAME  'ZWC'     X'A4'                                       50230000
         IKJNAME  'ZCW'     X'A4'                                       50240000
         IKJENDP                                                        50250000
         SPACE 2                                                        50260000
PCLHIST  IKJPARM DSECT=PDLHIST                                          50270000
PCLH1    IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $50280000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,HELP=('NAME OF $50290000
               THE LOAD MODULE WHOSE HISTORY IS TO BE LISTED')          50300000
PCLHTRNK IKJKEYWD                                                       50310000
         IKJNAME  'TRANS',SUBFLD=PCLHTRNS                               50320000
PCLHZAPK IKJKEYWD                                                       50330000
         IKJNAME  'ZAP',SUBFLD=PCLHZAPS                                 50340000
PCLHUSRK IKJKEYWD                                                       50350000
         IKJNAME  'USERDATA',SUBFLD=PCLHUSRS                            50360000
         IKJNAME  'SYSMOD',SUBFLD=PCLHUSRS                              50370000
PCLHLKDK IKJKEYWD                                                       50380000
         IKJNAME  'LKED',SUBFLD=PCLHLKDS                                50390000
PCLHMODK IKJKEYWD                                                       50400000
         IKJNAME  'MODULE',SUBFLD=PCLHMODS                              50410000
SPFLONGH IKJKEYWD                                                       50420000
         IKJNAME  'LONG',ALIAS=('BIG','XTEND')                DRK SEP09 50430000
PCLHMODS IKJSUBF                                                        50440000
PCLHMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $50450000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  50460000
PCLHUSRS IKJSUBF                                                        50470000
PCLHUSR  IKJIDENT 'IDR USER DATA',FIRST=ANY,OTHER=ANY,MAXLNTH=8,       $50480000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF IDR USER DATA')  50490000
PCLHLKDS IKJSUBF                                                        50500000
PCLHLKD  IKJIDENT 'LINKAGE EDITOR',FIRST=ANY,OTHER=ANY,                $50510000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A LINKA$50520000
               GE EDITOR NAME')                                         50530000
PCLHZAPS IKJSUBF                                                        50540000
PCLHZAP  IKJIDENT 'ZAP IDRDATA NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=8,    $50550000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF ZAP IDRDATA')    50560000
PCLHTRNS IKJSUBF                                                        50570000
PCLHTRN  IKJIDENT 'TRANSLATOR NAME',FIRST=ANY,OTHER=ANY,               $50580000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A TRANS$50590000
               LATOR (ASSEMBLER OR COMPILER) NAME')                     50600000
         IKJENDP                                                        50610000
         SPACE 2                                                        50620000
PCLIFTTR IKJPARM DSECT=PDLIFTTR                                         50630000
PCLIFT1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $50640000
               PROMPT='NAME OF MEMBER',                                $50650000
               HELP=('NAME OF THE MEMBER WHOSE ATTRIBUTES ARE TO BE CHE$50660000
               CKED'),VALIDCK=VRTMEMBR                                  50670000
IFLKREUS IKJKEYWD                                                       50680000
         IKJNAME  'REUS'                                                50690000
         IKJNAME  'NOREUS'                                              50700000
IFLKREFR IKJKEYWD                                                       50710000
         IKJNAME  'REFR'                                                50720000
         IKJNAME  'NOREFR'                                              50730000
IFLKRENT IKJKEYWD                                                       50740000
         IKJNAME  'RENT'                                                50750000
         IKJNAME  'NORENT'                                              50760000
IFLKEXEC IKJKEYWD                                                       50770000
         IKJNAME  'EXEC'                                                50780000
         IKJNAME  'NOEXEC'                                              50790000
IFLKLOAD IKJKEYWD                                                       50800000
         IKJNAME  'LOADONLY'                                            50810000
         IKJNAME  'NOLOADONLY'                                          50820000
IFLKEDIT IKJKEYWD                                                       50830000
         IKJNAME  'EDIT'                                                50840000
         IKJNAME  'NOEDIT'                                              50850000
IFLKAUTH IKJKEYWD                                                       50860000
         IKJNAME  'AUTH',ALIAS=('APF')                                  50870000
         IKJNAME  'NOAUTH',ALIAS=('NOAPF')                              50880000
IFLKPAGE IKJKEYWD                                                       50890000
         IKJNAME  'PAGE'                                                50900000
         IKJNAME  'NOPAGE'                                              50910000
IFLKOVER IKJKEYWD                                                       50920000
         IKJNAME  'OVERLAY'                                             50930000
         IKJNAME  'NOOVERLAY'                                           50940000
IFLKTEST IKJKEYWD                                                       50950000
         IKJNAME  'TEST'                                                50960000
         IKJNAME  'NOTEST'                                              50970000
IFRLD0   IKJKEYWD                                                       50980000
         IKJNAME  'RLDZERO'                                             50990000
         IKJNAME  'NORLDZERO'                                           51000000
IFAPFERR IKJKEYWD                                                       51010000
         IKJNAME  'APFERR'                                              51020000
         IKJNAME  'NOAPFERR'                                            51030000
IFRLDERR IKJKEYWD                                                       51040000
         IKJNAME  'RLDERR'                                              51050000
         IKJNAME  'NORLDERR'                                            51060000
IFLKSCTR IKJKEYWD                                                       51070000
         IKJNAME  'SCTR'                                                51080000
         IKJNAME  'NOSCTR'                                              51090000
IFLKLKED IKJKEYWD                                                       51100000
         IKJNAME  'FLEVEL'                                              51110000
         IKJNAME  'NOFLEVEL'                                            51120000
IFLKVSLE IKJKEYWD                                                       51130000
         IKJNAME  'VSLKED'                                              51140000
         IKJNAME  'NOVSLKED'                                            51150000
IFLKDC   IKJKEYWD                                                       51160000
         IKJNAME  'DC'                                                  51170000
         IKJNAME  'NODC'                                                51180000
IFLKALIA IKJKEYWD                                                       51190000
         IKJNAME  'ALIAS'                                               51200000
         IKJNAME  'NOALIAS'                                             51210000
IFLOADER IKJKEYWD                                                       51220000
         IKJNAME  'LOADERR'                                             51230000
         IKJNAME  'NOLOADERR'                                           51240000
IFLKEDER IKJKEYWD                                                       51250000
         IKJNAME  'LKEDERR'                                             51260000
         IKJNAME  'NOLKEDERR'                                           51270000
IFIOERR  IKJKEYWD                                                       51280000
         IKJNAME  'IOERR'                                               51290000
         IKJNAME  'NOIOERR'                                             51300000
IFBLKERR IKJKEYWD                                                       51310000
         IKJNAME  'BLOCKERR'                                            51320000
         IKJNAME  'MAXBLK',SUBFLD=IFTMAXB                               51330000
         IKJNAME  'NOBLOCKERR'                                          51340000
IFLRECLE IKJKEYWD                                                       51350000
         IKJNAME  'LRECLERR'                                            51360000
         IKJNAME  'NOLRECLERR'                                          51370000
IFNULL   IKJKEYWD                                                       51380000
         IKJNAME  'NULL'                                                51390000
         IKJNAME  'NONULL'                                              51400000
IFAALIAS IKJKEYWD                                                       51410000
         IKJNAME  'APPARENTALIAS'                                       51420000
         IKJNAME  'NOAPPARENTALIAS'                                     51430000
IFORPHAN IKJKEYWD                                                       51440000
         IKJNAME  'ORPHAN'                                              51450000
         IKJNAME  'NOORPHAN'                                            51460000
IFHASALI IKJKEYWD                                                       51470000
         IKJNAME  'HASALIAS'                                            51480000
         IKJNAME  'NOHASALIAS'                                          51490000
IFXSTATS IKJKEYWD                                                       51500099
         IKJNAME  'XSTATS'                                    DRK OCT09 51510099
         IKJNAME  'NOXSTATS'                                  DRK OCT09 51520099
IFPACKED IKJKEYWD                                                       51530099
         IKJNAME  'PACKED'                                    DRK APR18 51540099
         IKJNAME  'NOPACKED'                                  DRK APR18 51550099
IFSPFEDT IKJKEYWD                                                       51560000
         IKJNAME  'SPFEDIT'                                             51570000
         IKJNAME  'NOSPFEDIT'                                           51580000
IFNAMERR IKJKEYWD                                                       51590000
         IKJNAME  'NAMEERR'                                             51600000
         IKJNAME  'NONAMEERR'                                           51610000
IFRLDF   IKJKEYWD                                                       51620000
         IKJNAME  'RLDFIX'                                              51630000
         IKJNAME  'NORLDFIX'                                            51640000
IFRMODE  IKJKEYWD                                                       51650000
         IKJNAME  'RMODE24'                                             51660000
         IKJNAME  'RMODEANY'                                            51670000
         IKJNAME  'NORMODE24'                                           51680000
         IKJNAME  'NORMODEANY'                                          51690000
IFAMODE  IKJKEYWD                                                       51700000
         IKJNAME  'AMODE24'                                             51710000
         IKJNAME  'AMODE31'                                             51720000
         IKJNAME  'AMODE64'                                             51730000
         IKJNAME  'AMODEANY'                                            51740000
         IKJNAME  'NOAMODE24'                                           51750000
         IKJNAME  'NOAMODE31'                                           51760000
         IKJNAME  'NOAMODE64'                                           51770000
         IKJNAME  'NOAMODEANY'                                          51780000
IFEXTERN IKJKEYWD                                                       51790000
         IKJNAME  'WKEXTERN'                                            51800000
         IKJNAME  'EXTERN'                                              51810000
IFLKSSI  IKJKEYWD                                                       51820000
         IKJNAME  'SSI',SUBFLD=IFTSSIS                                  51830000
         IKJNAME  'NOSSI'                                               51840000
         IKJNAME  'PARTSSI',SUBFLD=IFTSSIS                              51850000
IFTUSERK IKJKEYWD                                                       51860000
         IKJNAME  'USERID',ALIAS=('ID'),SUBFLD=IFTUSERS                 51870000
         IKJNAME  'NOUSERID',ALIAS=('NOID')                             51880000
         IKJNAME  'NOTUSERID',ALIAS=('NOTID'),SUBFLD=IFTUSERS           51890000
IFTHENC  IKJKEYWD                                                       51900000
         IKJNAME  'THEN',SUBFLD=IFTHENCS                                51910000
IFELSEC  IKJKEYWD                                                       51920000
         IKJNAME  'ELSE',SUBFLD=IFELSECS                                51930000
IFTLTRNK IKJKEYWD                                                       51940000
         IKJNAME  'TRANS',SUBFLD=IFTLTRNS                               51950000
IFTLZAPK IKJKEYWD                                                       51960000
         IKJNAME  'ZAP',SUBFLD=IFTLZAPS                                 51970000
IFTLUSRK IKJKEYWD                                                       51980000
         IKJNAME  'USERDATA',SUBFLD=IFTLUSRS                            51990000
         IKJNAME  'SYSMOD',SUBFLD=IFTLUSRS                              52000000
IFTLMODK IKJKEYWD                                                       52010000
         IKJNAME  'MODULE',SUBFLD=IFTLMODS                              52020000
IFTLKEDK IKJKEYWD                                                       52030000
         IKJNAME  'LKED',SUBFLD=IFTLKEDS                                52040000
IFTTTRK  IKJKEYWD                                                       52050000
         IKJNAME  'TTR',SUBFLD=IFTTTRS                                  52060000
IFABOKY  IKJKEYWD                                                       52070000
         IKJNAME  'ABOVE',SUBFLD=IFABOSB                                52080000
IFBELKY  IKJKEYWD                                                       52090000
         IKJNAME  'BELOW',SUBFLD=IFBELSB                                52100000
IFCREKY  IKJKEYWD                                                       52110000
         IKJNAME  'CREATED',SUBFLD=IFCRESB                              52120000
IFMODKY  IKJKEYWD                                                       52130000
         IKJNAME  'CHANGED',SUBFLD=IFMODSB                              52140000
IFFROMKY IKJKEYWD                                                       52150000
         IKJNAME  'FROM',ALIAS=('SINCE') FROM (DATE) TO CURRENT         52160000
         IKJNAME  'TO'         FROM FIRST TO SPECIFICATION              52170000
         IKJNAME  'BEFORE'     FROM FIRST TO SPECIFICATION              52180000
IFDATEKY IKJKEYWD                                                       52190000
         IKJNAME  'TODAY',ALIAS=('PREV0')         1                     52200000
         IKJNAME  'YESTERDAY',ALIAS=('PREV1')     2                     52210000
         IKJNAME  'PREV2'      LAST   2 DAYS      3                     52220000
         IKJNAME  'PREV3'      LAST   3 DAYS      4                     52230000
         IKJNAME  'PREV4'      LAST   4 DAYS      5                     52240000
         IKJNAME  'PREV5'      LAST   5 DAYS      6                     52250000
         IKJNAME  'PREV6'      LAST   6 DAYS      7                     52260000
         IKJNAME  'WEEK',ALIAS=('PREV7')          8                     52270000
         IKJNAME  'PREV8'      LAST   8 DAYS      9                     52280000
         IKJNAME  'PREV9'      LAST   9 DAYS     10                     52290000
         IKJNAME  'CURRENT',ALIAS=('PREV10')     11                     52300000
         IKJNAME  'PREV11'     LAST  11 DAYS     12                     52310000
         IKJNAME  'PREV12'     LAST  12 DAYS     13                     52320000
         IKJNAME  'PREV13'     LAST  13 DAYS     14                     52330000
         IKJNAME  'BIWEEK',ALIAS=('PREV14','FORTNIGHT')   15  DRK SEP13 52340099
         IKJNAME  'MONTH'      LAST  30 DAYS     16                     52350000
         IKJNAME  'QUARTER'    LAST  90 DAYS     17                     52360000
         IKJNAME  'HALFYEAR'   LAST 183 DAYS     18                     52370000
         IKJNAME  'YEAR'       LAST 365 DAYS     19                     52380000
         IKJNAME  'BIYEAR'     LAST 730 DAYS     20                     52390000
         IKJNAME  'LAST',ALIAS=('LASTA'),SUBFLD=IFLASTSB  21            52400000
         IKJNAME  'DATE',SUBFLD=IFDATESB         22                     52410000
         IKJNAME  'BIMONTH'    LAST  60 DAYS     23                     52420000
IFDATESB IKJSUBF                                                        52430000
         AIF   ('&ISODT'  EQ 'YES').ISOH3                     DRK NOV01 52440000
IFDATESU IKJIDENT 'DATE',                                              $52450000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $52460000
               PROMPT='DATE CHANGED',MAXLNTH=08,VALIDCK=VRTDATE,       $52470000
               HELP=('THE DATE TO USE -- LIKE 12/15/86 OR 86349')       52480000
         AGO   .ISOH3X                                        DRK NOV01 52490000
.ISOH3   ANOP                                                 DRK NOV01 52500000
IFDATESU IKJIDENT 'DATE',                                              $52510000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $52520000
               PROMPT='DATE CHANGED',MAXLNTH=08,VALIDCK=VRTDATE,       $52530000
               HELP=('THE DATE TO USE -- LIKE 86/12/15 OR 86349')       52540000
.ISOH3X  ANOP                                                 DRK NOV01 52550000
IFLASTSB IKJSUBF                                                        52560000
IFLASTSU IKJIDENT 'LAST NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,           $52570000
               PROMPT='NUMBER OF DAYS',MAXLNTH=5,                      $52580000
               HELP=('NUMBER OF PREVIOUS DAYS')                         52590000
IFMODSB  IKJSUBF                                                        52600000
         AIF   ('&ISODT'  EQ 'YES').ISOH4                     DRK NOV01 52610000
IFMODSUB IKJIDENT 'MODIFICATION DATE RANGE',                           $52620000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $52630000
               PROMPT='DATE CHANGED',MAXLNTH=17,VALIDCK=VRTDATE,       $52640000
               HELP=('THE MODIFICATION DATE RANGE TO SEARCH --11/14/84:$52650000
               3/15/85')                                                52660000
         AGO   .ISOH4X                                        DRK NOV01 52670000
.ISOH4   ANOP                                                 DRK NOV01 52680000
IFMODSUB IKJIDENT 'MODIFICATION DATE RANGE',                           $52690000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $52700000
               PROMPT='DATE CHANGED',MAXLNTH=17,VALIDCK=VRTDATE,       $52710000
               HELP=('THE MODIFICATION DATE RANGE TO SEARCH --84/11/14:$52720000
               85/3/15')                                                52730000
.ISOH4X  ANOP                                                 DRK NOV01 52740000
IFCRESB  IKJSUBF                                                        52750000
         AIF   ('&ISODT'  EQ 'YES').ISOH5                     DRK NOV01 52760000
IFCRESUB IKJIDENT 'CREATION DATE RANGE',                               $52770000
               RANGE,FIRST=ALPHANUM,OTHER=ANY,                         $52780000
               PROMPT='DATE CREATED',MAXLNTH=17,VALIDCK=VRTDATE,       $52790000
               HELP=('THE CREATION DATE RANGE TO SEARCH --11/14/84:3/15$52800000
               /85')                                                    52810000
         AGO   .ISOH5X                                        DRK NOV01 52820000
.ISOH5   ANOP                                                 DRK NOV01 52830000
IFCRESUB IKJIDENT 'CREATION DATE RANGE',                               $52840000
               RANGE,FIRST=ALPHANUM,OTHER=ANY,                         $52850000
               PROMPT='DATE CREATED',MAXLNTH=17,VALIDCK=VRTDATE,       $52860000
               HELP=('THE CREATION DATE RANGE TO SEARCH --84/11/14:85/3$52870000
               /15')                                                    52880000
.ISOH5X  ANOP                                                 DRK NOV01 52890000
IFABOSB  IKJSUBF                                                        52900000
IFABOSUB IKJIDENT 'MINIMUM SIZE',FIRST=NUMERIC,OTHER=NUMERIC,          $52910000
               PROMPT='MINIMUM SIZE',MAXLNTH=9,                        $52920000
               HELP=('MINIMUM SIZE OF A DESIRED MEMBER')                52930000
IFBELSB  IKJSUBF                                                        52940000
IFBELSUB IKJIDENT 'MAXIMUM SIZE',FIRST=NUMERIC,OTHER=NUMERIC,          $52950000
               PROMPT='MAXIMUM SIZE',MAXLNTH=9,                        $52960000
               HELP=('MAXIMUM SIZE OF A DESIRED MEMBER')                52970000
IFTTTRS  IKJSUBF                                                        52980000
IFTTTR   IKJIDENT 'TTR RANGE',RANGE,FIRST=ALPHANUM,OTHER=ALPHANUM,     $52990000
               MAXLNTH=6,PROMPT='HEXADECIMAL TTR',HELP=('THE LOW:HIGH H$53000000
               ADECIMAL TTR ADDRESS RANGE OF THE MEMBER ENTRIES')       53010000
IFTLKEDS IKJSUBF                                                        53020000
IFTLKED  IKJIDENT 'LINKAGE EDITOR',FIRST=ANY,OTHER=ANY,                $53030000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A LINKA$53040000
               GE EDITOR NAME')                                         53050000
IFTLMODS IKJSUBF                                                        53060000
IFTLMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $53070000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  53080000
IFTLUSRS IKJSUBF                                                        53090000
IFTLUSR  IKJIDENT 'IDR USER DATA',FIRST=ANY,OTHER=ANY,MAXLNTH=8,       $53100000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF IDR USER DATA')  53110000
IFTLZAPS IKJSUBF                                                        53120000
IFTLZAP  IKJIDENT 'ZAP IDRDATA NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=8,    $53130000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF ZAP IDRDATA')    53140000
IFTLTRNS IKJSUBF                                                        53150000
IFTLTRN  IKJIDENT 'TRANSLATOR NAME',FIRST=ANY,OTHER=ANY,               $53160000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A TRANS$53170000
               LATOR (ASSEMBLER OR COMPILER) NAME')                     53180000
IFTUSERS IKJSUBF                                                        53190000
* 8-CHARACTER USERID                                          DRK JAN17 53200099
IFTUSER  IKJIDENT 'TSO USERID',FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,   $53210099
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A TSO USERID')   53220099
IFTSSIS  IKJSUBF                                                        53230000
IFTSSI   IKJIDENT 'SSI DATA',FIRST=ALPHANUM,OTHER=ALPHANUM,MAXLNTH=8,  $53240000
               HELP=('ONE TO EIGHT BYTES OF HEXADECIMAL SSI DATA')      53250000
IFTMAXB  IKJSUBF                                                        53260000
IFTMAXBL IKJIDENT 'MAXIMUM BLOCKSIZE',FIRST=NUMERIC,OTHER=NUMERIC,     $53270000
               PROMPT='MAXIMUM BLOCKSIZE',MAXLNTH=5,                   $53280000
               HELP=('MAXIMUM ACCEPTABLE BLOCKSIZE')                    53290000
IFTHENCS IKJSUBF                                                        53300000
IFTHENCC IKJKEYWD                                                       53310000
&NATT    CONDIKJ '&NATT'                                                53320000
&NBRO    CONDIKJ '&NBRO'                                                53330000
&NDIR    CONDIKJ '&NDIR'                                                53340000
&NDEL    CONDIKJ '&NDEL'                                                53350000
&NDSP    CONDIKJ '&NDSP'                                                53360000
&NEDI    CONDIKJ '&NEDI'                                                53370000
&NEND    CONDIKJ '&NEND'                                                53380000
&NFIN    CONDIKJ '&NFIN'                                                53390000
&NFSE    CONDIKJ '&NFSE'                                                53400000
&NHIS    CONDIKJ '&NHIS'                                                53410000
&NLIS    CONDIKJ '&NLIS'                                                53420000
&NMAP    CONDIKJ '&NMAP'                                                53430000
&NMEM    CONDIKJ '&NMEM'                                                53440000
&NMML    CONDIKJ '&NMML'                                                53450000
&IMLX    CONDIKJ '&IMLX'                                                53460000
NEWML    CONDIKJ 'NEWML'                                      DRK JAN18 53470099
&NOUT    CONDIKJ '&NOUT'                                                53480000
&NPRI    CONDIKJ '&NPRI'                                                53490000
&NREV    CONDIKJ '&NREV'                                                53500000
&NSPF    CONDIKJ '&NSPF'                                                53510000
&NSUB    CONDIKJ '&NSUB'                                                53520000
&NSUL    CONDIKJ '&NSUL'                                                53530000
&NTSE    CONDIKJ '&NTSE'                                                53540000
&NTSL    CONDIKJ '&NTSL'                                                53550000
&NVIE    CONDIKJ '&NVIE'                                                53560000
&NVER    CONDIKJ '&NVER'                                                53570000
         SPACE 1                                                        53580000
IFELSECS IKJSUBF                                                        53590000
IFELSECC IKJKEYWD                                                       53600000
&NATT    CONDIKJ '&NATT'                                                53610000
&NBRO    CONDIKJ '&NBRO'                                                53620000
&NDIR    CONDIKJ '&NDIR'                                                53630000
&NDEL    CONDIKJ '&NDEL'                                                53640000
&NDSP    CONDIKJ '&NDSP'                                                53650000
&NEDI    CONDIKJ '&NEDI'                                                53660000
&NEND    CONDIKJ '&NEND'                                                53670000
&NFIN    CONDIKJ '&NFIN'                                                53680000
&NFSE    CONDIKJ '&NFSE'                                                53690000
&NHIS    CONDIKJ '&NHIS'                                                53700000
&NLIS    CONDIKJ '&NLIS'                                                53710000
&NMAP    CONDIKJ '&NMAP'                                                53720000
&NMEM    CONDIKJ '&NMEM'                                                53730000
&NMML    CONDIKJ '&NMML'                                                53740000
&IMLX    CONDIKJ '&IMLX'                                                53750000
NEWML    CONDIKJ 'NEWML'                                      DRK JAN18 53760099
&NOUT    CONDIKJ '&NOUT'                                                53770000
&NPRI    CONDIKJ '&NPRI'                                                53780000
&NREV    CONDIKJ '&NREV'                                                53790000
&NSPF    CONDIKJ '&NSPF'                                                53800000
&NSUB    CONDIKJ '&NSUB'                                                53810000
&NSUL    CONDIKJ '&NSUL'                                                53820000
&NTSE    CONDIKJ '&NTSE'                                                53830000
&NTSL    CONDIKJ '&NTSL'                                                53840000
&NVIE    CONDIKJ '&NVIE'                                                53850000
&NVER    CONDIKJ '&NVER'                                                53860000
         IKJENDP                                                        53870000
         SPACE 2                                                        53880000
PCLISPF  IKJPARM DSECT=PDLISPF                                          53890000
PCLISSTR IKJPOSIT STRING                                                53900000
         IKJENDP                                                        53910000
         SPACE 2                                                        53920000
PCLLCS   IKJPARM DSECT=PDLLCS                                 THG MAR06 53930000
PCLC1    IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,        $53940000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,HELP=('NAME OF $53950000
               THE LOAD MODULE WHOSE LCS IS TO BE LISTED')              53960000
PCLCMODK IKJKEYWD                                                       53970000
         IKJNAME  'MODULE',SUBFLD=PCLCMODS                              53980000
PCLCMODS IKJSUBF                                                        53990000
PCLCMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $54000000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  54010000
         IKJENDP                                                        54020000
         SPACE 2                                                        54030000
PCLLIST  IKJPARM DSECT=PDLLIST                                          54040000
PCLL1    IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $54050000
               PROMPT='NAME OF MEMBER',                                $54060000
               HELP=('NAME OF THE MEMBER TO BE LISTED'),               $54070000
               VALIDCK=VRTMEMBR                                         54080000
LISTFMT  IKJKEYWD                                                       54090000
         IKJNAME  'NUM'                   FLAGSDD=X'00'                 54100000
         IKJNAME  'NONUM'                 FLAGSDD=X'01'                 54110000
         IKJNAME  'SNUM'                  FLAGSDD=X'02'                 54120000
         IKJNAME  'LBLOCK'                FLAGSDD=X'04'                 54130000
         IKJNAME  'LDUMP'                 FLAGSDD=X'08'                 54140000
         IKJNAME  'BLOCK'                 FLAGSDD=X'10'                 54150000
         IKJNAME  'DUMP'                  FLAGSDD=X'20'                 54160000
LISTSEC  IKJKEYWD                                                       54170000
         IKJNAME  'MODULE',SUBFLD=LDUMPC                                54180000
LISTOFFT IKJKEYWD                                                       54190000
         IKJNAME  'OFFSET',SUBFLD=LISTOFFS                              54200000
LMAXLEN  IKJKEYWD                                                       54210000
         IKJNAME  'MAXLEN',SUBFLD=LMAXLENS                              54220000
LMAXIN   IKJKEYWD                                                       54230000
         IKJNAME  'MAXIN',SUBFLD=LMAXINS                                54240000
LMAXOUT  IKJKEYWD                                                       54250000
         IKJNAME  'MAXOUT',SUBFLD=LMAXOUTS                              54260000
LSKIPR   IKJKEYWD                                                       54270000
         IKJNAME  'SKIPREC',SUBFLD=LSKIPRS                              54280000
LSKIPC   IKJKEYWD                                                       54290000
         IKJNAME  'SKIPCOL',SUBFLD=LSKIPCS                              54300000
LDUMPC   IKJSUBF                                                        54310000
LDUMPCS  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $54320000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  54330000
LISTOFFS IKJSUBF                                                        54340000
LISTOFF  IKJIDENT 'MODULE OFFSET',FIRST=ALPHANUM,OTHER=ALPHANUM,       $54350000
               MAXLNTH=6,PROMPT='HEXADECIMAL OFFSET',HELP=('A ONE TO SI$54360000
               X DIGIT HEXADECIMAL OFFSET INTO THE LOAD MODULE')        54370000
LMAXLENS IKJSUBF                                                        54380000
LMAXLENC IKJIDENT 'MAXIMUM LENGTH',FIRST=NUMERIC,OTHER=NUMERIC,        $54390000
               PROMPT='MAXIMUM LENGTH',MAXLNTH=5,                      $54400000
               HELP=('MAXIMUM LENGTH OF EACH INPUT RECORD')             54410000
LMAXINS  IKJSUBF                                                        54420000
LMAXINC  IKJIDENT 'MAXIMUM INPUT',FIRST=NUMERIC,OTHER=NUMERIC,         $54430000
               PROMPT='MAXIMUM INPUT COUNT',MAXLNTH=7,                 $54440000
               HELP=('MAXIMUM NUMBER OF RECORDS TO INPUT')              54450000
LMAXOUTS IKJSUBF                                                        54460000
LMAXOUTC IKJIDENT 'MAXIMUM OUTPUT',FIRST=NUMERIC,OTHER=NUMERIC,        $54470000
               PROMPT='MAXIMUM OUTPUT RECORDS',MAXLNTH=7,              $54480000
               HELP=('MAXIMUM NUMBER OF RECORDS TO DISPLAY')            54490000
LSKIPRS  IKJSUBF                                                        54500000
LSKIPRC  IKJIDENT 'SKIP COUNT',FIRST=NUMERIC,OTHER=NUMERIC,            $54510000
               PROMPT='RECORDS TO SKIP',MAXLNTH=7,                     $54520000
               HELP=('NUMBER OF INPUT RECORDS TO IGNORE')               54530000
LSKIPCS  IKJSUBF                                                        54540000
LSKIPCC  IKJIDENT 'SKIP COLUMNS',FIRST=NUMERIC,OTHER=NUMERIC,          $54550000
               PROMPT='COLUMNS TO SKIP',MAXLNTH=5,                     $54560000
               HELP=('THE NUMBER OF BEGINNING COLUMNS TO IGNORE')       54570000
         IKJENDP                                                        54580000
         SPACE 2                                                        54590000
PCLLMA   IKJPARM DSECT=PDLLMA                                           54600000
PCLLMA1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $54610000
               PROMPT='NAME OF MEMBER FOR ANALYSIS',VALIDCK=VRTMEMBR,  $54620000
               HELP=('NAME OF THE LOAD MODULE TO BE ANALYZED')          54630000
LMAALIAS IKJKEYWD                                                       54640000
         IKJNAME  'ALIAS'                                               54650000
         IKJNAME  'NOALIAS'                                             54660000
LMASHOWL IKJKEYWD                                                       54670000
         IKJNAME  'SHOWLIB'                                             54680000
LMALOUD  IKJKEYWD                                                       54690000
         IKJNAME  'LOUD'                                                54700000
LMAFPRS  IKJKEYWD                                                       54710000
         IKJNAME  'CKVOLFPRS'                                           54720000
LMAOSVS  IKJKEYWD                                                       54730000
         IKJNAME  'OSVSONLY'                                            54740000
LMAINFO  IKJKEYWD                                                       54750000
         IKJNAME  'LEINFO'                                              54760000
LMASCAN  IKJKEYWD                                                       54770000
         IKJNAME  'LESCAN'                                              54780000
LMALD    IKJKEYWD                                                       54790000
         IKJNAME  'LISTLD'                                              54800000
LMADATE  IKJKEYWD                                                       54810000
         IKJNAME  'DATEFMT',                                           $54820000
               SUBFLD=LMADATEO                                          54830000
LMASORT  IKJKEYWD                                                       54840000
         IKJNAME  'SORTBY',                                            $54850000
               SUBFLD=LMASORTO                                          54860000
LMADATEO IKJSUBF                                                        54870000
LMADATET IKJIDENT 'DATEFMT OPTION',FIRST=ALPHA,OTHER=ALPHA,            $54880000
               MAXLNTH=8,VALIDCK=VRTLMADT,                             $54890000
               PROMPT='YYYYMMDD/MMDDYYYY/DDMMYYYY',                    $54900000
               HELP=('FORMAT OF THE TRANSLATOR DATES')                  54910000
LMASORTO IKJSUBF                                                        54920000
LMASORTT IKJIDENT 'SORTBY OPTION',FIRST=ALPHA,OTHER=ALPHA,             $54930000
               MAXLNTH=8,VALIDCK=VRTLMAST,                             $54940000
               PROMPT='OFFSET/NAME/PROGRAM/LANGUAGE/DATE',             $54950000
               HELP=('SORTBY OUTPUT SEQUENCE')                          54960000
         IKJENDP                                                        54970000
         SPACE 2                                                        54980000
PCLMAP   IKJPARM DSECT=PDLMAP                                           54990000
PCLM1    IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $55000000
               PROMPT='NAME OF MEMBER TO BE MAPPED',                   $55010000
               HELP=('NAME OF THE MEMBER WHOSE LOAD MODULE MAP IS TO BE$55020000
                PRODUCED'),VALIDCK=VRTMEMBR                             55030000
PCLMAPOP IKJKEYWD                                                       55040000
         IKJNAME  'FULL'                                                55050000
         IKJNAME  'SHORT'                                               55060000
         IKJNAME  'ENTRYPOINT'                                          55070000
         IKJNAME  'RELINK',ALIAS=('JCL')                                55080000
PCLMCS   IKJKEYWD                                                       55090099
         IKJNAME  'IEBUPDTE',ALIAS=('SMP','MCS','SEP')        DRK MAR16 55100099
PCLMMODK IKJKEYWD                                                       55110000
         IKJNAME  'MODULE',SUBFLD=PCLMMODS                              55120000
PCLMMODS IKJSUBF                                                        55130000
PCLMMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $55140000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  55150000
         IKJENDP                                                        55160000
         SPACE 2                                                        55170000
PCLMATCH IKJPARM DSECT=PDLMATCH                                         55180099
MATDSN2  IKJIDENT 'DSNAME',FIRST=ANY,OTHER=ANY,                        $55190099
               MAXLNTH=56,                                             $55200099
               PROMPT='NAME OF THE 2ND PDS',                           $55210099
               HELP=('NAME OF THE 2ND PDS FOR MATCH')                   55220099
MATONLY  IKJKEYWD                                                       55230099
         IKJNAME  'NEONLY'  DISPLAY ONLY NOT EQUAL MEMBERS              55240099
         IKJNAME  'EQONLY'  DISPLAY ONLY EQUAL MEMBERS                  55250099
MATCOMP  IKJKEYWD                                                       55260099
         IKJNAME  'DATA'    COMPARE MEMBER DATA                         55270099
         IKJNAME  'USER'    COMPARE PDS DIRECTORY USER DATA             55280099
MATCHG   IKJKEYWD                                                       55290099
         IKJNAME  'CHANGED',ALIAS=('CHANGES')     NEONLY/DATA DRK JAN16 55300099
         IKJNAME  'NOCHANGED',ALIAS=('NOCHANGES') EQONLY/DATA DRK JAN16 55310099
         IKJNAME  'DIRCHANGE'                     NEONLY/USER DRK JAN16 55320099
         IKJNAME  'NODIRCHANGE'                   EQONLY/USER DRK JAN16 55330099
MATSAML  IKJKEYWD                                                       55340099
         IKJNAME  'SAMLIST',ALIAS=('SUBLIST')                           55350099
MATVOLUM IKJKEYWD                                                       55360099
         IKJNAME  'VOLUME',SUBFLD=MATVOLU                               55370099
MATVOLU  IKJSUBF                                                        55380099
MATVOL   IKJIDENT 'VOLUME NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,         $55390099
               PROMPT='THE VOLUME NAME FOR THE 2ND PDS',MAXLNTH=6,     $55400099
               HELP=('THE VOLUME SERIAL FOR THE 2ND PDS FOR MATCH')     55410099
         IKJENDP                                                        55420099
         SPACE 2                                                        55430099
PCLMEMB  IKJPARM DSECT=PDLMEMB                                          55440000
PCLMEM   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $55450000
               PROMPT='MEMBER GROUP',VALIDCK=VRTMEMBR,HELP=('THE MEMBER$55460000
                GROUP TO BE DISPLAYED')                                 55470000
MEMBERC  IKJKEYWD                                                       55480000
         IKJNAME  'COUNT'                                               55490000
         IKJNAME  'NOCOUNT'                                             55500000
         IKJENDP                                                        55510000
         SPACE 2                                                        55520000
PCLMEML  IKJPARM DSECT=PDLMEML                                          55530000
PCLMEMZ  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $55540000
               PROMPT='MEMBER GROUP',VALIDCK=VRTMEMBR,HELP=('THE MEMBER$55550000
                GROUP TO BE DISPLAYED')                                 55560000
MEMLRES  IKJKEYWD                                                       55570000
         IKJNAME  'RESET'                                               55580000
         IKJNAME  'NORESET'                                             55590000
MEMLLKD  IKJKEYWD                                                       55600000
         IKJNAME  'LKEDDATE'                                            55610000
         IKJNAME  'NOLKEDDATE'                                          55620000
MLLKREUS IKJKEYWD                                                       55630000
         IKJNAME  'REUS'                                                55640000
         IKJNAME  'NOREUS'                                              55650000
MLLKREFR IKJKEYWD                                                       55660000
         IKJNAME  'REFR'                                                55670000
         IKJNAME  'NOREFR'                                              55680000
MLLKRENT IKJKEYWD                                                       55690000
         IKJNAME  'RENT'                                                55700000
         IKJNAME  'NORENT'                                              55710000
MLLKEXEC IKJKEYWD                                                       55720000
         IKJNAME  'EXEC'                                                55730000
         IKJNAME  'NOEXEC'                                              55740000
MLLKLOAD IKJKEYWD                                                       55750000
         IKJNAME  'LOADONLY'                                            55760000
         IKJNAME  'NOLOADONLY'                                          55770000
MLLKEDIT IKJKEYWD                                                       55780000
         IKJNAME  'EDIT'                                                55790000
         IKJNAME  'NOEDIT'                                              55800000
MLLKAUTH IKJKEYWD                                                       55810000
         IKJNAME  'AUTH',ALIAS=('APF')                                  55820000
         IKJNAME  'NOAUTH',ALIAS=('NOAPF')                              55830000
MLLKPAGE IKJKEYWD                                                       55840000
         IKJNAME  'PAGE'                                                55850000
         IKJNAME  'NOPAGE'                                              55860000
MLLKOVER IKJKEYWD                                                       55870000
         IKJNAME  'OVERLAY'                                             55880000
         IKJNAME  'NOOVERLAY'                                           55890000
MLLKTEST IKJKEYWD                                                       55900000
         IKJNAME  'TEST'                                                55910000
         IKJNAME  'NOTEST'                                              55920000
MLLKSCTR IKJKEYWD                                                       55930000
         IKJNAME  'SCTR'                                                55940000
         IKJNAME  'NOSCTR'                                              55950000
MLLKLKED IKJKEYWD                                                       55960000
         IKJNAME  'FLEVEL'                                              55970000
         IKJNAME  'NOFLEVEL'                                            55980000
MLLKVSLE IKJKEYWD                                                       55990000
         IKJNAME  'VSLKED'                                              56000000
         IKJNAME  'NOVSLKED'                                            56010000
MLLKDC   IKJKEYWD                                                       56020000
         IKJNAME  'DC'                                                  56030000
         IKJNAME  'NODC'                                                56040000
MLLKALIA IKJKEYWD                                                       56050000
         IKJNAME  'ALIAS'                                               56060000
         IKJNAME  'NOALIAS'                                             56070000
MLAALIAS IKJKEYWD                                                       56080000
         IKJNAME  'APPARENTALIAS'                                       56090000
         IKJNAME  'NOAPPARENTALIAS'                                     56100000
MLORPHAN IKJKEYWD                                                       56110000
         IKJNAME  'ORPHAN'                                              56120000
         IKJNAME  'NOORPHAN'                                            56130000
MLHASALI IKJKEYWD                                                       56140000
         IKJNAME  'HASALIAS'                                            56150000
         IKJNAME  'NOHASALIAS'                                          56160000
MLXSTATS IKJKEYWD                                                       56170099
         IKJNAME  'XSTATS'                                    DRK OCT09 56180099
         IKJNAME  'NOXSTATS'                                  DRK OCT09 56190099
MLRMODE  IKJKEYWD                                                       56200000
         IKJNAME  'RMODE24'                                             56210000
         IKJNAME  'RMODEANY'                                            56220000
         IKJNAME  'NORMODE24'                                           56230000
         IKJNAME  'NORMODEANY'                                          56240000
MLAMODE  IKJKEYWD                                                       56250000
         IKJNAME  'AMODE24'                                             56260000
         IKJNAME  'AMODE31'                                             56270000
         IKJNAME  'AMODE64'                                             56280000
         IKJNAME  'AMODEANY'                                            56290000
         IKJNAME  'NOAMODE24'                                           56300000
         IKJNAME  'NOAMODE31'                                           56310000
         IKJNAME  'NOAMODE64'                                           56320000
         IKJNAME  'NOAMODEANY'                                          56330000
MLLKSSI  IKJKEYWD                                                       56340000
         IKJNAME  'SSI',SUBFLD=MLTSSIS                                  56350000
         IKJNAME  'NOSSI'                                               56360000
         IKJNAME  'PARTSSI',SUBFLD=MLTSSIS                              56370000
MLTUSERK IKJKEYWD                                                       56380000
         IKJNAME  'USERID',ALIAS=('ID'),SUBFLD=MLTUSERS                 56390000
         IKJNAME  'NOUSERID',ALIAS=('NOID')                             56400000
         IKJNAME  'NOTUSERID',ALIAS=('NOTID'),SUBFLD=MLTUSERS           56410000
MLTLTRNK IKJKEYWD                                                       56420000
         IKJNAME  'TRANS',SUBFLD=MLTLTRNS                               56430000
MLTLZAPK IKJKEYWD                                                       56440000
         IKJNAME  'ZAP',SUBFLD=MLTLZAPS                                 56450000
MLTLUSRK IKJKEYWD                                                       56460000
         IKJNAME  'USERDATA',SUBFLD=MLTLUSRS                            56470000
         IKJNAME  'SYSMOD',SUBFLD=MLTLUSRS                              56480000
MLTLMODK IKJKEYWD                                                       56490000
         IKJNAME  'MODULE',SUBFLD=MLTLMODS                              56500000
MLTLKEDK IKJKEYWD                                                       56510000
         IKJNAME  'LKED',SUBFLD=MLTLKEDS                                56520000
MLTTTRK  IKJKEYWD                                                       56530000
         IKJNAME  'TTR',SUBFLD=MLTTTRS                                  56540000
MLABOKY  IKJKEYWD                                                       56550000
         IKJNAME  'ABOVE',SUBFLD=MLABOSB                                56560000
MLBELKY  IKJKEYWD                                                       56570000
         IKJNAME  'BELOW',SUBFLD=MLBELSB                                56580000
MLCREKY  IKJKEYWD                                                       56590000
         IKJNAME  'CREATED',SUBFLD=MLCRESB                              56600000
MLMODKY  IKJKEYWD                                                       56610000
         IKJNAME  'CHANGED',SUBFLD=MLMODSB                              56620000
MLFROMKY IKJKEYWD                                                       56630000
         IKJNAME  'FROM',ALIAS=('SINCE') FROM (DATE) TO CURRENT         56640000
         IKJNAME  'TO'         FROM FIRST TO SPECIFICATION              56650000
         IKJNAME  'BEFORE'     FROM FIRST TO SPECIFICATION              56660000
MLDATEKY IKJKEYWD                                                       56670000
         IKJNAME  'TODAY',ALIAS=('PREV0')         1                     56680000
         IKJNAME  'YESTERDAY',ALIAS=('PREV1')     2                     56690000
         IKJNAME  'PREV2'      LAST   2 DAYS      3                     56700000
         IKJNAME  'PREV3'      LAST   3 DAYS      4                     56710000
         IKJNAME  'PREV4'      LAST   4 DAYS      5                     56720000
         IKJNAME  'PREV5'      LAST   5 DAYS      6                     56730000
         IKJNAME  'PREV6'      LAST   6 DAYS      7                     56740000
         IKJNAME  'WEEK',ALIAS=('PREV7')          8                     56750000
         IKJNAME  'PREV8'      LAST   8 DAYS      9                     56760000
         IKJNAME  'PREV9'      LAST   9 DAYS     10                     56770000
         IKJNAME  'CURRENT',ALIAS=('PREV10')     11                     56780000
         IKJNAME  'PREV11'     LAST  11 DAYS     12                     56790000
         IKJNAME  'PREV12'     LAST  12 DAYS     13                     56800000
         IKJNAME  'PREV13'     LAST  13 DAYS     14                     56810000
         IKJNAME  'BIWEEK',ALIAS=('PREV14','FORTNIGHT')   15            56820099
         IKJNAME  'MONTH'      LAST  30 DAYS     16                     56830000
         IKJNAME  'QUARTER'    LAST  90 DAYS     17                     56840000
         IKJNAME  'HALFYEAR'   LAST 183 DAYS     18                     56850000
         IKJNAME  'YEAR'       LAST 365 DAYS     19                     56860000
         IKJNAME  'BIYEAR'     LAST 730 DAYS     20                     56870000
         IKJNAME  'LAST',ALIAS=('LASTA'),SUBFLD=MLLASTSB  21            56880000
         IKJNAME  'DATE',SUBFLD=MLDATESB         22                     56890000
         IKJNAME  'BIMONTH'    LAST  60 DAYS     23                     56900000
MLDATESB IKJSUBF                                                        56910000
         AIF   ('&ISODT'  EQ 'YES').ISOH6                     DRK NOV01 56920000
MLDATESU IKJIDENT 'DATE',                                              $56930000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $56940000
               PROMPT='DATE CHANGED',MAXLNTH=08,VALIDCK=VRTDATE,       $56950000
               HELP=('THE DATE TO USE -- LIKE 12/15/86 OR 86349')       56960000
         AGO   .ISOH6X                                        DRK NOV01 56970000
.ISOH6   ANOP                                                 DRK NOV01 56980000
MLDATESU IKJIDENT 'DATE',                                              $56990000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $57000000
               PROMPT='DATE CHANGED',MAXLNTH=08,VALIDCK=VRTDATE,       $57010000
               HELP=('THE DATE TO USE -- LIKE 86/12/15 OR 86349')       57020000
.ISOH6X  ANOP                                                 DRK NOV01 57030000
MLLASTSB IKJSUBF                                                        57040000
MLLASTSU IKJIDENT 'LAST NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,           $57050000
               PROMPT='NUMBER OF DAYS',MAXLNTH=5,                      $57060000
               HELP=('NUMBER OF PREVIOUS DAYS')                         57070000
MLMODSB  IKJSUBF                                                        57080000
         AIF   ('&ISODT'  EQ 'YES').ISOH7                     DRK NOV01 57090000
MLMODSUB IKJIDENT 'MODIFICATION DATE RANGE',                           $57100000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $57110000
               PROMPT='DATE CHANGED',MAXLNTH=17,VALIDCK=VRTDATE,       $57120000
               HELP=('THE MODIFICATION DATE RANGE TO SEARCH --11/14/84:$57130000
               3/15/85')                                                57140000
         AGO   .ISOH7X                                        DRK NOV01 57150000
.ISOH7   ANOP                                                 DRK NOV01 57160000
MLMODSUB IKJIDENT 'MODIFICATION DATE RANGE',                           $57170000
               RANGE,FIRST=ANY,OTHER=ANY,CHAR,                         $57180000
               PROMPT='DATE CHANGED',MAXLNTH=17,VALIDCK=VRTDATE,       $57190000
               HELP=('THE MODIFICATION DATE RANGE TO SEARCH --84/11/14:$57200000
               85/3/15')                                                57210000
.ISOH7X  ANOP                                                 DRK NOV01 57220000
MLCRESB  IKJSUBF                                                        57230000
         AIF   ('&ISODT'  EQ 'YES').ISOH8                     DRK NOV01 57240000
MLCRESUB IKJIDENT 'CREATION DATE RANGE',                               $57250000
               RANGE,FIRST=ALPHANUM,OTHER=ANY,                         $57260000
               PROMPT='DATE CREATED',MAXLNTH=17,VALIDCK=VRTDATE,       $57270000
               HELP=('THE CREATION DATE RANGE TO SEARCH --11/14/84:3/15$57280000
               /85')                                                    57290000
         AGO   .ISOH8X                                        DRK NOV01 57300000
.ISOH8   ANOP                                                 DRK NOV01 57310000
MLCRESUB IKJIDENT 'CREATION DATE RANGE',                               $57320000
               RANGE,FIRST=ALPHANUM,OTHER=ANY,                         $57330000
               PROMPT='DATE CREATED',MAXLNTH=17,VALIDCK=VRTDATE,       $57340000
               HELP=('THE CREATION DATE RANGE TO SEARCH --84/11/14:85/3$57350000
               /15')                                                    57360000
.ISOH8X  ANOP                                                 DRK NOV01 57370000
MLABOSB  IKJSUBF                                                        57380000
MLABOSUB IKJIDENT 'MINIMUM SIZE',FIRST=NUMERIC,OTHER=NUMERIC,          $57390000
               PROMPT='MINIMUM SIZE',MAXLNTH=9,                        $57400000
               HELP=('MINIMUM SIZE OF A DESIRED MEMBER')                57410000
MLBELSB  IKJSUBF                                                        57420000
MLBELSUB IKJIDENT 'MAXIMUM SIZE',FIRST=NUMERIC,OTHER=NUMERIC,          $57430000
               PROMPT='MAXIMUM SIZE',MAXLNTH=9,                        $57440000
               HELP=('MAXIMUM SIZE OF A DESIRED MEMBER')                57450000
MLTTTRS  IKJSUBF                                                        57460000
MLTTTR   IKJIDENT 'TTR RANGE',RANGE,FIRST=ALPHANUM,OTHER=ALPHANUM,     $57470000
               MAXLNTH=6,PROMPT='HEXADECIMAL TTR',HELP=('THE LOW:HIGH H$57480000
               ADECIMAL TTR ADDRESS RANGE OF THE MEMBER ENTRIES')       57490000
MLTLKEDS IKJSUBF                                                        57500000
MLTLKED  IKJIDENT 'LINKAGE EDITOR',FIRST=ANY,OTHER=ANY,                $57510000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A LINKA$57520000
               GE EDITOR NAME')                                         57530000
MLTLMODS IKJSUBF                                                        57540000
MLTLMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $57550000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  57560000
MLTLUSRS IKJSUBF                                                        57570000
MLTLUSR  IKJIDENT 'IDR USER DATA',FIRST=ANY,OTHER=ANY,MAXLNTH=8,       $57580000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF IDR USER DATA')  57590000
MLTLZAPS IKJSUBF                                                        57600000
MLTLZAP  IKJIDENT 'ZAP IDRDATA NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=8,    $57610000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF ZAP IDRDATA')    57620000
MLTLTRNS IKJSUBF                                                        57630000
MLTLTRN  IKJIDENT 'TRANSLATOR NAME',FIRST=ANY,OTHER=ANY,               $57640000
               MAXLNTH=10,HELP=('FIRST ONE TO TEN CHARACTERS OF A TRANS$57650000
               LATOR (ASSEMBLER OR COMPILER) NAME')                     57660000
MLTUSERS IKJSUBF                                                        57670000
* 8-CHARACTER USERID                                          DRK JAN17 57680099
MLTUSER  IKJIDENT 'TSO USERID',FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,   $57690099
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A TSO USERID')   57700099
MLTSSIS  IKJSUBF                                                        57710000
MLTSSI   IKJIDENT 'SSI DATA',FIRST=ALPHANUM,OTHER=ALPHANUM,MAXLNTH=8,  $57720000
               HELP=('ONE TO EIGHT BYTES OF HEXADECIMAL SSI DATA')      57730000
MLTMAXB  IKJSUBF                                                        57740000
         IKJENDP                                                        57750000
         SPACE 2                                                        57760000
PCLOFFL  IKJPARM DSECT=PDLOFFL                                          57770099
PCLOFF1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $57780000
               PROMPT='NAME OF MEMBERS TO BE OFFLOADED',               $57790000
               HELP=('NAME OF THE MEMBERS TO BE OFFLOADED'),           $57800000
               VALIDCK=VRTMEMBR                                         57810000
OFLDSN2  IKJIDENT 'DSNAME',FIRST=ANY,OTHER=ANY,                        $57820000
               MAXLNTH=56,                                             $57830000
               PROMPT='NAME OF THE TARGET DATA SET',                   $57840000
               HELP=('NAME OF THE TARGET DATA SET')                     57850000
OFLALIAS IKJKEYWD                                                       57860000
         IKJNAME  'ALIAS'                                               57870000
         IKJNAME  'NOALIAS'                                             57880000
OFLDISP  IKJKEYWD                                                       57890099
         IKJNAME  'OLD'                                       DRK FEB14 57900099
         IKJNAME  'SHR'                                       DRK FEB14 57910099
         IKJNAME  'MOD',ALIAS=('APPEND','TACKON')             DRK FEB14 57920099
         IKJNAME  'NEW'                                       DRK MAR18 57930099
OFLSEP   IKJKEYWD                                                       57940099
         IKJNAME  'IEBUPDTE'                                  DRK DEC15 57950099
         IKJNAME  'NOSEP'                                     DRK DEC15 57960099
OFLTRCYL IKJKEYWD                                                       57970099
         IKJNAME  'TRACKS',ALIAS=('TRKS')                     DRK MAR18 57980099
         IKJNAME  'CYLINDER'                                  DRK MAR18 57990099
OFLVOLUM IKJKEYWD                                                       58000099
         IKJNAME  'VOLUME',SUBFLD=OFLVOLU                     DRK MAR18 58010099
OFLSPAKY IKJKEYWD                                                       58020099
         IKJNAME  'SPACE',SUBFLD=OFLSPAK                      DRK MAR18 58030099
OFLVOLU  IKJSUBF                                                        58040099
OFLVOL   IKJIDENT 'VOLUME NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,         $58050099
               PROMPT='THE VOLUME NAME FOR THE OUTPUT DATA',MAXLNTH=6, $58060099
               HELP=('THE VOLUME SERIAL FOR THE OUTPUT DATA SET')       58070099
OFLSPAK  IKJSUBF                                                        58080099
OFLSPACE IKJIDENT 'DATA SET SIZE',LIST,FIRST=NUMERIC,OTHER=NUMERIC,    $58090099
               PROMPT='DATA SET SIZE',MAXLNTH=5,                       $58100099
               HELP=('THE ALLOCATION SIZES FOR PRIMARY AND SECONDARY')  58110099
         IKJENDP                                                        58120099
         SPACE 2                                                        58130000
PCLOUT   IKJPARM DSECT=PDLOUT                                           58140000
PCLOUT1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $58150000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,HELP=('NAME OF $58160000
               THE MEMBER TO OUTPUT TO FILE(PDSOUT)')                   58170000
OUTCLOS  IKJKEYWD                                                       58180000
         IKJNAME  'CLOSE'                                               58190000
         IKJNAME  'NOCLOSE'                                             58200000
OUTECHO  IKJKEYWD                                                       58210000
         IKJNAME  'ECHO'                                                58220000
         IKJNAME  'NOECHO'                                              58230000
OUTASS   IKJKEYWD                                                       58240000
         IKJNAME  'ALIAS'                                               58250000
         IKJNAME  'NOALIAS'                                             58260000
OUTIEB   IKJKEYWD                                                       58270000
         IKJNAME  'IEBUPDTE'                                            58280000
         IKJNAME  'NOIEBUPDTE'                                          58290000
OUTOPTN  IKJKEYWD                                                       58300000
         IKJNAME  'TEXT',SUBFLD=OUTTEX                                  58310000
         IKJNAME  'NOTEXT'                                              58320000
OUTTEX   IKJSUBF                                                        58330000
OUTTEXT  IKJPOSIT QSTRING,PROMPT='OUTPUT IDENTIFIER',                  $58340000
               HELP=('AN IDENTIFICATION STRING FOR OUTPUT SELECT STATEM$58350000
               ENTS')                                                   58360000
         IKJENDP                                                        58370000
         SPACE 2                                                        58380000
PCLPATTR IKJPARM DSECT=PDL2MEM                                          58390000
PCLPAT1  IKJIDENT 'PATTERN NAME',MAXLNTH=39,VALIDCK=VRTMEMBR,LIST,     $58400000
               HELP=('PATTERN CHARACTERS FOR A DIRECTORY SEARCH'),     $58410000
               FIRST=ANY,OTHER=ANY,PROMPT='PATTERN NAME'                58420000
PCLPAT2  IKJIDENT 'PATTERN NAME',MAXLNTH=19,VALIDCK=VRTMEMBR,          $58430000
               FIRST=ANY,OTHER=ANY                                      58440000
         IKJENDP                                                        58450000
         SPACE 2                                                        58460000
PCLPRINT IKJPARM DSECT=PDLPRINT                                         58470000
PCLPR1   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $58480000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,               $58490000
               HELP=('NAME OF THE MEMBER FOR THE COMMAND')              58500000
PCLPR2   IKJPOSIT SPACE                                                 58510000
PCLPRSTR IKJPOSIT STRING                                                58520000
         IKJENDP                                                        58530000
         SPACE 2                                                        58540000
PCLPTSE  IKJPARM DSECT=PDLPTSE                                          58550099
PCLPTS1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $58560000
               PROMPT='NAME OF PTS MEMBER TO BE EXPANDED',             $58570000
               HELP=('NAME OF PTS MEMBER TO BE EXPANDED'),             $58580099
               VALIDCK=VRTMEMBR                                         58590099
PTSDSN2  IKJIDENT 'DSNAME',FIRST=ANY,OTHER=ANY,                        $58600000
               MAXLNTH=56,                                             $58610000
               PROMPT='NAME OF THE TARGET DATA SET',                   $58620000
               HELP=('NAME OF THE TARGET DATA SET')                     58630000
PTSDISP  IKJKEYWD                                                       58640099
         IKJNAME  'OLD'                                       DRK FEB14 58650099
         IKJNAME  'SHR'                                       DRK FEB14 58660099
         IKJNAME  'MOD',ALIAS=('APPEND','TACKON')             DRK DEC17 58670099
         IKJNAME  'NEW'                                       DRK MAR18 58680099
PTSLIST  IKJKEYWD                                                       58690099
         IKJNAME  'LIST'                                      DRK MAY14 58700099
         IKJNAME  'NOLIST'                                    DRK MAY14 58710099
PTSTRCYL IKJKEYWD                                                       58720099
         IKJNAME  'TRACKS',ALIAS=('TRKS')                     DRK MAR18 58730099
         IKJNAME  'CYLINDER'                                  DRK MAR18 58740099
PTSVOLUM IKJKEYWD                                                       58750099
         IKJNAME  'VOLUME',SUBFLD=PTSVOLU                     DRK MAR18 58760099
PTSSPAKY IKJKEYWD                                                       58770099
         IKJNAME  'SPACE',SUBFLD=PTSSPAK                      DRK MAR18 58780099
PTSVOLU  IKJSUBF                                                        58790099
PTSVOL   IKJIDENT 'VOLUME NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,         $58800099
               PROMPT='THE VOLUME NAME FOR THE OUTPUT DATA',MAXLNTH=6, $58810099
               HELP=('THE VOLUME SERIAL FOR THE OUTPUT DATA SET')       58820099
PTSSPAK  IKJSUBF                                                        58830099
PTSSPACE IKJIDENT 'DATA SET SIZE',LIST,FIRST=NUMERIC,OTHER=NUMERIC,    $58840099
               PROMPT='DATA SET SIZE',MAXLNTH=5,                       $58850099
               HELP=('THE ALLOCATION SIZES FOR PRIMARY AND SECONDARY')  58860099
         IKJENDP                                                        58870000
         SPACE 2                                                        58880000
PCLRENAM IKJPARM DSECT=PDLRENAM                                         58890000
PCLREN1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $58900000
               PROMPT='CURRENT MEMBER NAME',VALIDCK=VRTMEMBR,          $58910000
               HELP=('NAME OF THE MEMBER TO BE RENAMED')                58920000
PCLREN2  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $58930000
               PROMPT='NEW MEMBER NAME',VALIDCK=VRTMEMBR,              $58940000
               HELP=('A NEW NAME FOR THE MEMBER')                       58950000
PCLRENSW IKJKEYWD                                                       58960000
         IKJNAME  'SWAP'                                                58970000
         IKJNAME  'NOSWAP'                                              58980000
PCLRENGP IKJKEYWD                                                       58990000
         IKJNAME  'GROUP'                                               59000000
         IKJNAME  'NOGROUP'                                             59010000
PCLREP   IKJKEYWD                                                       59020000
         IKJNAME  'REPBY',SUBFLD=PCLREPB                                59030000
PCLREPB  IKJSUBF                                                        59040000
PCLREPBY IKJIDENT 'REPLACEMENT MEMBER',FIRST=ALPHA,OTHER=ALPHANUM,     $59050000
               MAXLNTH=8,PROMPT='REPLACEMENT MEMBER NAME',             $59060000
               HELP=('NAME OF REPLACEMENT MEMBER')                      59070000
         IKJENDP                                                        59080000
         SPACE 2                                                        59090000
PCLREPL  IKJPARM DSECT=PDLREPL                                          59100000
PCLREPLT IKJIDENT 'MEMBER NAME',MAXLNTH=39,FIRST=ANY,OTHER=ANY,LIST,   $59110000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,               $59120000
               HELP=('NAME OF THE MEMBER TO BE CHANGED')                59130000
REPLDLM1 IKJPOSIT DELIMITER                                             59140000
REPLSTR1 IKJPOSIT STRING,SQSTRING,ASIS                                  59150000
REPLSTR2 IKJPOSIT STRING,SQSTRING,ASIS                                  59160000
REPLFMT  IKJKEYWD                                                       59170000
         IKJNAME  'NUM'                   FLAGSDD=X'00'                 59180000
         IKJNAME  'NONUM'                 FLAGSDD=X'01'                 59190000
         IKJNAME  'SNUM'                  FLAGSDD=X'02'                 59200000
         IKJNAME  'LBLOCK'                FLAGSDD=X'04'                 59210000
         IKJNAME  'LDUMP'                 FLAGSDD=X'08'                 59220000
         IKJNAME  'BLOCK'                 FLAGSDD=X'10'                 59230000
         IKJNAME  'DUMP'                  FLAGSDD=X'20'                 59240000
REPLINC  IKJKEYWD                                                       59250000
         IKJNAME  'INC1'                                                59260000
         IKJNAME  'INC2'                                                59270000
         IKJNAME  'INC4'                                                59280000
         IKJNAME  'INC8'                                                59290000
         IKJNAME  'INC16'                                               59300000
         IKJNAME  'INC80'                                               59310000
REPLSEC  IKJKEYWD                                                       59320000
         IKJNAME  'MODULE',SUBFLD=RDUMPC                                59330000
REPLOFFT IKJKEYWD                                                       59340000
         IKJNAME  'OFFSET',SUBFLD=REPLOFFS                              59350000
REPLREP  IKJKEYWD                                                       59360000
         IKJNAME  'WRITE',ALIAS=('UPDATE')                              59370000
         IKJNAME  'NOWRITE'                                             59380000
REPLSTAT IKJKEYWD                                                       59390000
         IKJNAME  'STATS'                                               59400000
         IKJNAME  'NOSTATS'                                             59410000
REPLASIS IKJKEYWD                                                       59420000
         IKJNAME  'ASIS'                                                59430000
         IKJNAME  'CAPS'                                                59440000
         IKJNAME  'IGNORE'                                              59450000
RMAXLEN  IKJKEYWD                                                       59460000
         IKJNAME  'MAXLEN',SUBFLD=RMAXLENS                              59470000
RMAXIN   IKJKEYWD                                                       59480000
         IKJNAME  'MAXIN',SUBFLD=RMAXINS                                59490000
RMAXOUT  IKJKEYWD                                                       59500000
         IKJNAME  'MAXOUT',SUBFLD=RMAXOUTS                              59510000
RMAXFIN  IKJKEYWD                                                       59520000
         IKJNAME  'MAXFIND',SUBFLD=RMAXFINS                             59530000
RSKIPR   IKJKEYWD                                                       59540000
         IKJNAME  'SKIPREC',SUBFLD=RSKIPRS                              59550000
RSKIPC   IKJKEYWD                                                       59560000
         IKJNAME  'SKIPCOL',SUBFLD=RSKIPCS                              59570000
RDUMPC   IKJSUBF                                                        59580000
RDUMPCS  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $59590000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  59600000
REPLOFFS IKJSUBF                                                        59610000
REPLOFF  IKJIDENT 'MODULE OFFSET',FIRST=ALPHANUM,OTHER=ALPHANUM,       $59620000
               MAXLNTH=6,PROMPT='HEXADECIMAL OFFSET',HELP=('A ONE TO SI$59630000
               X DIGIT HEXADECIMAL OFFSET INTO THE LOAD MODULE')        59640000
RMAXLENS IKJSUBF                                                        59650000
RMAXLENC IKJIDENT 'MAXIMUM LENGTH',FIRST=NUMERIC,OTHER=NUMERIC,        $59660000
               PROMPT='MAXIMUM LENGTH',MAXLNTH=5,                      $59670000
               HELP=('MAXIMUM LENGTH OF EACH INPUT RECORD')             59680000
RMAXINS  IKJSUBF                                                        59690000
RMAXINC  IKJIDENT 'MAXIMUM INPUT',FIRST=NUMERIC,OTHER=NUMERIC,         $59700000
               PROMPT='MAXIMUM INPUT COUNT',MAXLNTH=7,                 $59710000
               HELP=('MAXIMUM NUMBER OF RECORDS TO INPUT')              59720000
RMAXOUTS IKJSUBF                                                        59730000
RMAXOUTC IKJIDENT 'MAXIMUM OUTPUT',FIRST=NUMERIC,OTHER=NUMERIC,        $59740000
               PROMPT='MAXIMUM OUTPUT RECORDS',MAXLNTH=7,              $59750000
               HELP=('MAXIMUM NUMBER OF LINES OR PARTIAL RECORDS TO DIS$59760000
               PLAY')                                                   59770000
RMAXFINS IKJSUBF                                                        59780000
RMAXFIND IKJIDENT 'MAXIMUM FIND STRINGS',FIRST=NUMERIC,OTHER=NUMERIC,  $59790000
               PROMPT='MAXIMUM FIND STRINGS',MAXLNTH=7,                $59800000
               HELP=('MAXIMUM NUMBER OF STRINGS TO FIND AND UPDATE')    59810000
RSKIPRS  IKJSUBF                                                        59820000
RSKIPRC  IKJIDENT 'SKIP COUNT',FIRST=NUMERIC,OTHER=NUMERIC,            $59830000
               PROMPT='RECORDS TO SKIP',MAXLNTH=7,                     $59840000
               HELP=('NUMBER OF INPUT RECORDS TO IGNORE')               59850000
RSKIPCS  IKJSUBF                                                        59860000
RSKIPCC  IKJIDENT 'SKIP COLUMNS',FIRST=NUMERIC,OTHER=NUMERIC,          $59870000
               PROMPT='COLUMNS TO SKIP',MAXLNTH=5,                     $59880000
               HELP=('THE NUMBER OF BEGINNING COLUMNS TO IGNORE')       59890000
         IKJENDP                                                        59900000
         SPACE 2                                                        59910000
PCLREPRO IKJPARM DSECT=PDLREPRO                                         59920000
PCLRPR   IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $59930000
               VALIDCK=VRTMEMBR,                                       $59940000
               PROMPT='NAME OF MEMBERS TO BE REPRODUCED',              $59950000
               HELP=('NAME OF THE MEMBERS TO BE REPRODUCED')            59960000
RPRADDZ  IKJKEYWD                                                       59970000
         IKJNAME  'ADDZAP'                                              59980000
         IKJNAME  'NOADDZAP'                                            59990000
RPRREPL  IKJKEYWD                                                       60000000
         IKJNAME  'REPLACE'                                             60010000
         IKJNAME  'NOREPLACE'                                           60020000
RPRALIAS IKJKEYWD                                                       60030000
         IKJNAME  'ALIAS'                                               60040000
         IKJNAME  'NOALIAS'                                             60050000
RPRMAXBL IKJKEYWD                                                       60060000
         IKJNAME  'MAXBLK',SUBFLD=RPRMAXB                               60070000
RPRTOSS  IKJKEYWD                                                       60080000
         IKJNAME  'AS',SUBFLD=RPRTOS                                    60090000
         IKJNAME  'TO',SUBFLD=RPRTOS                                    60100000
RPRTOS   IKJSUBF                                                        60110000
RPRTO    IKJIDENT 'PARTIAL MEMBER NAME',FIRST=ALPHANUM,OTHER=ALPHANUM, $60120000
               PROMPT='THE PARTIAL OUTPUT MEMBER NAME',MAXLNTH=8,      $60130000
               HELP=('PATTERN NAME FOR THE OUTPUT MEMBERS')             60140000
RPRMAXB  IKJSUBF                                                        60150000
RPRMAX   IKJIDENT 'MAXIMUM BLOCKSIZE',FIRST=NUMERIC,OTHER=NUMERIC,     $60160000
               PROMPT='MAXIMUM BLOCKSIZE',MAXLNTH=5,                   $60170000
               HELP=('MAXIMUM ACCEPTABLE BLOCKSIZE')                    60180000
         IKJENDP                                                        60190000
         SPACE 2                                                        60200000
PCLRESTO IKJPARM DSECT=PDLRESTO                                         60210000
PCLRSNAM IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $60220000
               PROMPT='NAME OF MEMBER TO RESTORE',VALIDCK=VRTMEMBR,    $60230000
               HELP=('NAME OF THE MEMBER TO BE RESURRECTED')            60240000
PCLRSREP IKJKEYWD                                                       60250000
         IKJNAME  'REPEAT'                                              60260000
         IKJNAME  'NOREPEAT'                                            60270000
PCLRSDIS IKJKEYWD                                                       60280000
         IKJNAME  'DISPLAY'                                             60290000
         IKJNAME  'NODISPLAY'                                           60300000
PCLRSPRO IKJKEYWD                                                       60310000
         IKJNAME  'PROMPT'                                              60320000
         IKJNAME  'NOPROMPT'                                            60330000
PCLRESTK IKJKEYWD                                                       60340000
         IKJNAME  'LIKE',SUBFLD=PCLRESTS                                60350000
PCLTTR   IKJKEYWD                                                       60360000
         IKJNAME  'TTR',SUBFLD=PCLTTRK                                  60370000
PCLRFI   IKJKEYWD                                                       60380000
         IKJNAME  'FIND',SUBFLD=PCLRFIN                                 60390000
PCLRCAPS IKJKEYWD DEFAULT='CAPS'                              EDS MAY06 60400000
         IKJNAME  'CAPS'                                      EDS MAY06 60410000
         IKJNAME  'ASIS'                                      EDS MAY06 60420000
PCLRSTST IKJKEYWD                                                       60430000
         IKJNAME  'TEST'                                      DRK MAY06 60440000
PCLRMODK IKJKEYWD                                                       60450000
         IKJNAME  'MODULE',SUBFLD=PCLRMODS                              60460000
PCLRN    IKJKEYWD                                                       60470000
         IKJNAME  'COUNT',SUBFLD=PCLRNU                                 60480000
PCLRNU   IKJSUBF                                                        60490000
PCLRNUM  IKJIDENT 'NUMBER OF LINES',FIRST=NUMERIC,OTHER=NUMERIC,       $60500000
               PROMPT='NUMBER OF DISPLAY LINES',MAXLNTH=3,             $60510000
               HELP=('MAXIMUM NUMBER OF LINES TO DISPLAY')              60520000
PCLRMODS IKJSUBF                                                        60530000
PCLRMOD  IKJIDENT 'MODULE NAME',MAXLNTH=8,FIRST=ANY,OTHER=ANY,         $60540000
               HELP=('FIRST ONE TO EIGHT CHARACTERS OF A MODULE NAME')  60550000
PCLRFIN  IKJSUBF                                                        60560000
PCLRFIND IKJPOSIT QSTRING,PROMPT='SEARCH STRING',                      $60570000
               ASIS,                                          EDS MAY06+60580000
               HELP=('A SEARCH STRING TO FIND IN RESTORE CANDIDATES')   60590000
PCLTTRK  IKJSUBF                                                        60600000
PCLTTRKY IKJIDENT 'TTR ADDRESS',FIRST=ALPHANUM,OTHER=ALPHANUM,         $60610000
               PROMPT='HEXADECIMAL TTR',MAXLNTH=6,VALIDCK=VRTMEMBR,    $60620000
               HELP=('THE START ADDRESS OF THE MEMBER TO BE RESTORED')  60630000
PCLRESTS IKJSUBF                                                        60640000
PCLREST  IKJIDENT 'MEMBER NAME',FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,  $60650000
               PROMPT='MEMBER NAME',HELP=('NAME OF A MODEL MEMBER')     60660000
         IKJENDP                                                        60670000
         SPACE 2                                                        60680000
PCLSEPAR IKJPARM DSECT=PDLSEPAR                                         60690099
PCLSEP1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=19,        $60700000
               PROMPT='NAME OF IEBUPDTE MEMBER TO BE LOADED',          $60710000
               HELP=('NAME OF THE IEBUPDTE MEMBER TO BE LOADED'),      $60720000
               VALIDCK=VRTMEMBR                                         60730000
SEPDSN2  IKJIDENT 'DSNAME',FIRST=ANY,OTHER=ANY,                        $60740000
               MAXLNTH=56,                                             $60750000
               PROMPT='NAME OF THE TARGET PDS',                        $60760000
               HELP=('NAME OF THE TARGET PDS')                          60770000
SEPDISP  IKJKEYWD                                                       60780000
         IKJNAME  'OLD'                                                 60790000
         IKJNAME  'SHR'                                                 60800000
         IKJNAME  'XXX'    DUMMY ENTRY (CODE REUSE)           DRK MAR18 60810099
         IKJNAME  'NEW'                                       DRK MAR18 60820099
SEPLIST  IKJKEYWD                                                       60830099
         IKJNAME  'LIST'                                                60840099
         IKJNAME  'NOLIST'                                              60850099
SEPTRCYL IKJKEYWD                                                       60860099
         IKJNAME  'TRACKS',ALIAS=('TRKS')                     DRK MAR18 60870099
         IKJNAME  'CYLINDER'                                  DRK MAR18 60880099
SEPVOLUM IKJKEYWD                                                       60890099
         IKJNAME  'VOLUME',SUBFLD=SEPVOLU                     DRK MAR18 60900099
SEPSPAKY IKJKEYWD                                                       60910099
         IKJNAME  'SPACE',SUBFLD=SEPSPAK                      DRK MAR18 60920099
SEPDIRKY IKJKEYWD                                                       60930099
         IKJNAME  'DIR',SUBFLD=SEPDIRK                        DRK MAR18 60940099
SEPVOLU  IKJSUBF                                                        60950099
SEPVOL   IKJIDENT 'VOLUME NAME',FIRST=ALPHANUM,OTHER=ALPHANUM,         $60960099
               PROMPT='THE VOLUME NAME FOR THE OUTPUT DATA',MAXLNTH=6, $60970099
               HELP=('THE VOLUME SERIAL FOR THE OUTPUT DATA SET')       60980099
SEPSPAK  IKJSUBF                                                        60990099
SEPSPACE IKJIDENT 'DATA SET SIZE',LIST,FIRST=NUMERIC,OTHER=NUMERIC,    $61000099
               PROMPT='DATA SET SIZE',MAXLNTH=5,                       $61010099
               HELP=('THE ALLOCATION SIZES FOR PRIMARY AND SECONDARY')  61020099
SEPDIRK  IKJSUBF                                                        61030099
SEPDIRCO IKJIDENT 'DIRECTORY BLOCKS',FIRST=NUMERIC,OTHER=NUMERIC,      $61040099
               PROMPT='DIRECTORY BLOCKS',MAXLNTH=5,                    $61050099
               HELP=('NUMBER OF DIRECTORY BLOCKS DESIRED')              61060099
         IKJENDP                                                        61070099
         SPACE 2                                                        61080099
PCLSMPG  IKJPARM DSECT=PDLSMPG                                          61090099
PCLSMP1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $61100099
               PROMPT='NAME OF MEMBER FOR SMPGEN',VALIDCK=VRTMEMBR,    $61110099
               HELP=('NAME OF THE MEMBER FOR SMP GENERATION')           61120099
SMPMAC   IKJKEYWD                                                       61130099
         IKJNAME  'MAC'                                                 61140099
SMPSRC   IKJKEYWD                                                       61150099
         IKJNAME  'SRC'                                                 61160099
SMPMACU  IKJKEYWD                                                       61170099
         IKJNAME  'MACUPD'                                              61180099
SMPSRCU  IKJKEYWD                                                       61190099
         IKJNAME  'SRCUPD'                                              61200099
SMPINLN  IKJKEYWD                                                       61210099
         IKJNAME  'INLINE'                                              61220099
SMPALIAS IKJKEYWD                                                       61230099
         IKJNAME  'ALIAS'                                               61240099
         IKJNAME  'NOALIAS'                                             61250099
SMPDIST  IKJKEYWD                                                       61260099
         IKJNAME  'DISTLIB',SUBFLD=SMPDISTO                             61270099
SMPSYSL  IKJKEYWD                                                       61280099
         IKJNAME  'SYSLIB',SUBFLD=SMPSYSO                               61290099
SMPTXL   IKJKEYWD                                                       61300099
         IKJNAME  'TXLIB',SUBFLD=SMPTXO                                 61310099
SMPDMOD  IKJKEYWD                                                       61320099
         IKJNAME  'DISTMOD',SUBFLD=SMPDMO                               61330099
SMPRELF  IKJKEYWD                                                       61340099
         IKJNAME  'RELFILE',SUBFLD=SMPRELO                              61350099
SMPTYPE  IKJKEYWD                                                       61360099
         IKJNAME  'TYPE',SUBFLD=SMPTYPO                                 61370099
SMPSSI   IKJKEYWD                                                       61380099
         IKJNAME  'SSI',SUBFLD=SMPSSIO                                  61390099
SMPDSN   IKJKEYWD                                                       61400099
         IKJNAME  'OUTDSN',ALIAS=('OUTDSNAME','OUTDS',                 $61410099
               'OUTDATASET','OUTDA'),                                  $61420099
               SUBFLD=SMPDSNO                                           61430099
SMPDISP  IKJKEYWD                                                       61440099
         IKJNAME  'OLD'                                       DRK FEB14 61450099
         IKJNAME  'SHR'                                       DRK FEB14 61460099
SMPDISTO IKJSUBF                                                        61470099
SMPDISTT IKJIDENT 'DISTLIB DDNAME',FIRST=ANY,OTHER=ANY,                $61480099
               MAXLNTH=8,                                              $61490099
               PROMPT='DISTLIB DDNAME',                                $61500099
               HELP=('NAME OF THE DISTLIB DDNAME')                      61510099
SMPSYSO  IKJSUBF                                                        61520099
SMPSYSOT IKJIDENT 'SYSLIB DDNAME',FIRST=ANY,OTHER=ANY,                 $61530099
               MAXLNTH=8,                                              $61540099
               PROMPT='SYSLIB DDNAME',                                 $61550099
               HELP=('NAME OF THE SYSLIB DDNAME')                       61560099
SMPTXO   IKJSUBF                                                        61570099
SMPTXOT  IKJIDENT 'TXLIB DDNAME',FIRST=ANY,OTHER=ANY,                  $61580099
               MAXLNTH=8,                                              $61590099
               PROMPT='TXLIB DDNAME',                                  $61600099
               HELP=('NAME OF THE TXLIB DDNAME')                        61610099
SMPDMO   IKJSUBF                                                        61620099
SMPDMOT  IKJIDENT 'DISTMOD DDNAME',FIRST=ANY,OTHER=ANY,                $61630099
               MAXLNTH=8,                                              $61640099
               PROMPT='DISTMOD DDNAME',                                $61650099
               HELP=('NAME OF THE DISTMOD DDNAME')                      61660099
SMPRELO  IKJSUBF                                                        61670099
SMPRELOT IKJIDENT 'RELATIVE FILE',FIRST=ANY,OTHER=ANY,                 $61680099
               MAXLNTH=8,                                              $61690099
               PROMPT='RELATIVE FILE NUMBER',                          $61700099
               HELP=('NUMBER OF THE RELATIVE FILE')                     61710099
SMPTYPO  IKJSUBF                                                        61720099
SMPTYPOT IKJIDENT 'TYPE',FIRST=ANY,OTHER=ANY,                          $61730099
               MAXLNTH=8,                                              $61740099
               PROMPT='ENTER TYPE OF SMP/E STATEMENT',                 $61750099
               HELP=('CHANGE ++MAC STATEMENTS TO ++TYPE')               61760099
SMPSSIO  IKJSUBF                                                        61770099
SMPSSIOT IKJIDENT 'SSI',FIRST=ANY,OTHER=ANY,                           $61780099
               MAXLNTH=8,                                              $61790099
               PROMPT='ENTER SSI INFORMATION',                         $61800099
               HELP=('IEBUPDTE ./ CHANGE SSI=HHHHHHHH')                 61810099
SMPDSNO  IKJSUBF                                                        61820099
SMPDSNOT IKJIDENT 'OUTPUT DSNAME',FIRST=ANY,OTHER=ANY,                 $61830099
               MAXLNTH=46,                                             $61840099
               PROMPT='SMPGEN OUTPUT DATA SET',                        $61850099
               HELP=('NAME OF THE SMPGEN OUTPUT DATA SET')              61860099
         IKJENDP                                                        61870099
         SPACE 2                                                        61880099
PCLSRCH  IKJPARM DSECT=PDLSRCH                                          61890099
PCLSRC1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $61900099
               PROMPT='NAME OF MEMBER TO BE SEARCHED',VALIDCK=VRTMEMBR,$61910099
               HELP=('NAME OF THE MEMBER TO BE SEARCHED')               61920099
SRCSTR   IKJPOSIT QSTRING,ASIS,PROMPT='SEARCH STRING',                 $61930099
               HELP=('A SEARCH STRING TO FIND')                         61940099
         AGO .NOSQSTR                                                   61950099
SRCSTR   IKJPOSIT STRING,SQSTRING,ASIS,PROMPT='SEARCH STRING',         $61960099
               HELP=('A SEARCH STRING TO FIND')               DRK APR20 61970099
.NOSQSTR  ANOP                                                          61980099
SRCALIAS IKJKEYWD                                                       61990099
         IKJNAME  'ALIAS'                                               62000099
         IKJNAME  'NOALIAS'                                             62010099
SRCMODE  IKJKEYWD                                                       62020099
         IKJNAME  'HEX'                                                 62030099
SRCTYPE  IKJKEYWD                                                       62040099
         IKJNAME  'PREFIX'                                              62050099
         IKJNAME  'SUFFIX'                                              62060099
         IKJNAME  'WORD'                                                62070099
SRCLIST  IKJKEYWD                                                       62080099
         IKJNAME  'SLIST'                                               62090099
         IKJNAME  'NOSLIST'                                             62100099
SRCPACK  IKJKEYWD                                                       62110099
         IKJNAME  'CKPACKL',ALIAS=('PACKED','UNPACK')                   62120099
SRCCOB   IKJKEYWD                                                       62130099
         IKJNAME  'COBOL'                                               62140099
SRCSEQ   IKJKEYWD                                                       62150099
         IKJNAME  'SEQ'                                                 62160099
         IKJNAME  'NOSEQ'                                               62170099
SRCCOL   IKJKEYWD                                                       62180099
         IKJNAME  'COLUMN',ALIAS=('COL','RANGE','FROMTO'),             $62190099
               SUBFLD=SRCCOLO                                           62200099
SRCLPF   IKJKEYWD                                                       62210099
         IKJNAME  'LPSF',ALIAS=('BEFORE','AFTER','PREV','NEXT',        $62220099
               'AROUND','WRAPPER','NEAR'),SUBFLD=SRCLPSF                62230099
SRCCOLO  IKJSUBF                                                        62240099
SRCCOLOT IKJIDENT 'SEARCH COLUMNS',FIRST=ANY,OTHER=ANY,                $62250099
               MAXLNTH=7,                                              $62260099
               PROMPT='SEARCH RANGE',                                  $62270099
               HELP=('SEARCH START COLUMN OR RANGE (START:END)')        62280099
SRCLPSF  IKJSUBF                                                        62290099
SRCLPSFV IKJIDENT 'LPSF NUMBER',FIRST=NUMERIC,OTHER=NUMERIC,           $62300099
               PROMPT='LPSF NUMBER OF LINES',MAXLNTH=2,                $62310099
               HELP=('THE NUMBER OF LINES PRIOR TO AND FOLLOWING')      62320099
         IKJENDP                                                        62330099
         SPACE 2                                                        62340000
PCLSUBL  IKJPARM DSECT=PDLSUBL                                          62350000
PCLSUBH  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $62360000
               PROMPT='MEMBER GROUP',VALIDCK=VRTMEMBR,HELP=('THE MEMBER$62370000
                GROUP TO BE DEFINED')                                   62380000
PCLSUBAL IKJKEYWD                                                       62390000
         IKJNAME  'ALIAS'                                               62400000
         IKJNAME  'NOALIAS'                                             62410000
PCLSUBRV IKJKEYWD                                                       62420099
         IKJNAME  'REVERSE',ALIAS=('INVERTED')                DRK MAY16 62430099
         IKJENDP                                                        62440000
         SPACE 2                                                        62450000
PCLTSOED IKJPARM DSECT=PDLTSOED                                         62460000
PCLTSOE1 IKJIDENT 'MEMBER NAME',MAXLNTH=39,FIRST=ANY,OTHER=ANY,LIST,   $62470000
               PROMPT='NAME OF MEMBER TO EDIT',VALIDCK=VRTMEMBR,       $62480000
               HELP=('NAME OF THE MEMBER FOR THE TSO EDIT COMMAND')     62490000
PCLNON   IKJKEYWD                                                       62500000
         IKJNAME  'NONUM'                                               62510000
PCLASIS  IKJKEYWD                                                       62520000
         IKJNAME  'ASIS'                                                62530000
PCLEDOP  IKJKEYWD                                                       62540000
         IKJNAME  'NEW'                                                 62550000
         IKJNAME  'OLD'                                                 62560000
         SPACE 1                                                        62570000
**    THE FOLLOWING ORDERED TABLE MUST CORRESPOND WITH "EDITTYPE"       62580000
**                                                                      62590000
**     DATA SET TYPE VS. EDIT DATA TYPE RULES ARE FROM "HELP EDIT S"    62600000
**                                                                      62610000
PCLTYPE  IKJKEYWD                                                       62620000
         IKJNAME  'DATA'                                                62630000
** INSERT INSTALLATION-ADDED DATA SET TYPES HERE AND IN "EDITTYPE"      62640000
         IKJNAME  'LIST'        ADDED LOCALLY AS A EDIT DATA SET TYPE   62650000
         IKJNAME  'VSBASIC'     NEW VS BASIC                            62660000
         IKJNAME  'BASIC'                                               62670000
         IKJNAME  'IPLI'                                                62680000
         IKJNAME  'TEXT'                                                62690000
         IKJNAME  'COBOL'                                               62700000
         IKJNAME  'ASM'                                                 62710000
         IKJNAME  'CLIST'                                               62720000
         IKJNAME  'CNTL'                                                62730000
         IKJNAME  'PLI'          $  -- DATA TYPE .PLI                   62740000
* END OF VALID DATA SET TYPES                                           62750000
         IKJNAME  'PLIF'         $        (DEFAULT EDIT TYPE IS PLI)    62760000
         IKJNAME  'FORTE'    *                                          62770000
         IKJNAME  'FORTG'    *                                          62780000
         IKJNAME  'FORTGI'   *  -- DATA TYPE .FORT                      62790000
         IKJNAME  'FORTH'    *        (DEFAULT EDIT TYPE IS GOFORT)     62800000
         IKJNAME  'GOFORT'   *                                          62810000
         IKJENDP                                                        62820000
         SPACE 2                                                        62830000
PCLVERIF IKJPARM DSECT=PDLVERIF                                         62840000
PCLVERMM IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $62850000
               PROMPT='NAME OF MEMBER',VALIDCK=VRTMEMBR,HELP=('NAME OF $62860000
               THE MEMBER TO VERIFIED')                                 62870000
VERLOAD  IKJKEYWD                                                       62880000
         IKJNAME  'LOAD'                                                62890000
         IKJNAME  'NOLOAD'                                              62900000
VERINPUT IKJKEYWD                                                       62910000
         IKJNAME  'INPUT',ALIAS=('READ')                                62920000
         IKJNAME  'NOINPUT',ALIAS=('NOREAD')                            62930000
VERNAME  IKJKEYWD                                                       62940000
         IKJNAME  'NAME'                                                62950000
         IKJNAME  'NONAME'                                              62960000
VERUPDT  IKJKEYWD                                                       62970000
         IKJNAME  'UPDATE'                                              62980000
         IKJNAME  'NOUPDATE'                                            62990000
VERSTATS IKJKEYWD                                                       63000000
         IKJNAME  'STATS'                                               63010000
         IKJNAME  'NOSTATS'                                             63020000
VERNLKD  IKJKEYWD                                                       63030000
         IKJNAME  'LKED'                                                63040000
         IKJNAME  'NOLKED'                                              63050000
VERSIZE  IKJKEYWD                                                       63060000
         IKJNAME  'SUMMARY'                                             63070000
         IKJNAME  'NOSUMMARY'                                           63080000
VERMAX   IKJKEYWD                                                       63090000
         IKJNAME  'MAXBLK',SUBFLD=VERMAXB                               63100000
VERMAXB  IKJSUBF                                                        63110000
VERMAXBL IKJIDENT 'MAXIMUM BLOCKSIZE',FIRST=NUMERIC,OTHER=NUMERIC,     $63120000
               PROMPT='MAXIMUM BLOCKSIZE',MAXLNTH=5,                   $63130000
               HELP=('MAXIMUM ACCEPTABLE BLOCKSIZE')                    63140000
         IKJENDP                                                        63150000
         SPACE 2                                                        63160000
PCLVPDSE IKJPARM DSECT=PDLVPDSE                                         63170099
VPELIST  IKJKEYWD                                                       63180099
         IKJNAME  'LIST'                                                63190099
         IKJNAME  'NOLIST'                                              63200099
VPEPPD   IKJKEYWD                                                       63210099
         IKJNAME  'PERFORMPENDINGDELETE',ALIAS=('PPD')                  63220099
         IKJENDP                                                        63230099
         SPACE 2                                                        63240099
PCLXMIT  IKJPARM DSECT=PDLXMIT                                          63250099
PCLXMI1  IKJIDENT 'MEMBER NAME',FIRST=ANY,OTHER=ANY,MAXLNTH=39,LIST,   $63260099
               PROMPT='NAME OF MEMBER TO BE XMITED',VALIDCK=VRTMEMBR,  $63270099
               HELP=('NAME OF THE MEMBER TO BE TRANSMITTED')            63280099
XMIADDR  IKJIDENT 'ADDRESSEE',FIRST=ANY,OTHER=ANY,                     $63290099
               MAXLNTH=20,                                             $63300099
               PROMPT='NAME OF ADDRESSEE',                             $63310099
               HELP=('NAME OF THE ADDRESSEE TO RECEIVE THE DATA')       63320099
XMIALIAS IKJKEYWD                                                       63330099
         IKJNAME  'ALIAS'                                               63340099
         IKJNAME  'NOALIAS'                                             63350099
XMINOTFY IKJKEYWD                                                       63360099
         IKJNAME  'NOTIFY'                                              63370099
         IKJNAME  'NONOTIFY'                                            63380099
XMILOG   IKJKEYWD                                                       63390099
         IKJNAME  'LOG'                                                 63400099
         IKJNAME  'NOLOG'                                               63410099
XMIWARN  IKJKEYWD                                                       63420099
         IKJNAME  'WARN'                                      DRK APR09 63430099
         IKJNAME  'NOWARN'                                    DRK APR09 63440099
XMIMSG   IKJKEYWD                                                       63450099
         IKJNAME  'MESSAGE'                                   DRK AUG19 63460099
XMIDSN   IKJKEYWD                                                       63470099
         IKJNAME  'OUTDSN',ALIAS=('OUTDSNAME','OUTDS',                 $63480099
               'OUTDATASET','OUTDA'),                                  $63490099
               SUBFLD=XMIDSNO                                           63500099
XMIFILE  IKJKEYWD                                                       63510099
         IKJNAME  'OUTFILE',ALIAS=('OUTDDNAME','OUTDD'),               $63520099
               SUBFLD=XMIFILO                                           63530099
XMISYS   IKJKEYWD                                                       63540099
         IKJNAME  'SYSOUT',                                            $63550099
               SUBFLD=XMISYSO                                           63560099
XMIDSNO  IKJSUBF                                                        63570099
XMIDSNOT IKJIDENT 'OUTPUT DSNAME',FIRST=ANY,OTHER=ANY,                 $63580099
               MAXLNTH=46,                                             $63590099
               PROMPT='XMIT OUTPUT DATA SET',                          $63600099
               HELP=('NAME OF THE XMIT OUTPUT DATA SET')                63610099
XMIFILO  IKJSUBF                                                        63620099
XMIFILOT IKJIDENT 'OUTPUT DDNAME',FIRST=ANY,OTHER=ANY,                 $63630099
               MAXLNTH=8,                                              $63640099
               PROMPT='XMIT OUTPUT DDNAME',                            $63650099
               HELP=('NAME OF THE XMIT OUTPUT DDNAME')                  63660099
XMISYSO  IKJSUBF                                                        63670099
XMISYSOT IKJIDENT 'SYSOUT CLASS',FIRST=ALPHANUM,                       $63680099
               MAXLNTH=1,PROMPT='SYSOUT CLASS NAME',                   $63690099
               HELP=('ONE CHARACTER SYSOUT CLASS NAME')                 63700099
         IKJENDP                                                        63710099
SYMDEL   DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09 63720099
         SPACE 5                                                        63730000
         TITLE 'P D S  --  PDS DYNAMIC AREA                          '  63740000
         COPY  #MDSECT                                                  63750000
SYMNODEL DSECT ,           Z/XDC DELETE SYMBOLS               DRK DEC09 63760099
         SPACE 5                                                        63770000
         TITLE 'P D S  --  THE DEFAULT PARAMETER LIST                '  63780000
         IKJDFPL                                                        63790000
         SPACE 5                                                        63800000
         TITLE 'P D S  --  THE DEFAULT PARAMETER BLOCK               '  63810000
         IKJDFPB                                                        63820000
         SPACE 5                                                        63830000
         TITLE 'P D S  --  PARSE PARAMETER LIST                      '  63840000
         IKJPPL                                                         63850000
         SPACE 5                                                        63860000
         TITLE 'P D S  --  THE USER PROFILE TABLE                    '  63870000
         IKJUPT                                                         63880000
         SPACE 5                                                        63890099
         TITLE 'P D S  --  COMMUNICATIONS VECTOR TABLE               '  63900099
         CVT   DSECT=YES                                                63910099
         SPACE 5                                                        63920099
         TITLE 'P D S  --  TSO/E VECTOR TABLE                        '  63930099
         IKJTSVT                                              DRK JUL17 63940099
         SPACE 5                                                        63950099
         AIF   (D'TSVTUMXL).Z23C                                        63960099
TSVTUMXL EQU   TSVT+X'06',1                                             63970099
*PSCBUID8 EQU   PSCB+X'54',8                                            63980099
*PSCBU8L  EQU   PSCB+X'20',1                                            63990099
         AIF   (D'UPTPREF8).Z23C                              DRK SEP17 64000099
UPTPREF8 EQU    UPT+X'21',8                                             64010099
UPTPRF8L EQU    UPT+X'29',1                                             64020099
.Z23C    ANOP                                                           64030099
.NOGEN   END                                                            64040000
