PDSMAIN  TITLE 'P D S  --  PDS COMMAND PROCESSOR                     '  00010099
*        IKJTSMSG ('PDS100I ',,' -- VERSION 8.6.18.14'),L100            00020099
*                                           . . .  .                    00030099
*                                           . . .  .                    00040099
*                                           . . .  REVISION             00050099
*                                           . . UPDATE                  00060099
*                                           . MINOR                     00070099
*                                           MAJOR                       00080099
         GBLC  &VERS                                                    00090099
&VERS    SETC  '8.6.18.14'                                              00100099
         GBLC  &FIXDATE                                                 00110000
&FIXDATE SETC  'MAY 29, 2022'       DATE OF LAST MAINTENANCE FOR PDS    00120099
         EJECT                                                          00130000
*   DATA SET PDS AT LEVEL 8.6 ON   5/29/22  (DRK/GP -- PDSE)          * 00140099
*   DATA SET PDS AT LEVEL 8.5 ON   6/23/05  (DRK -- Y2K, UCB SERVICES)* 00150099
*   DATA SET PDS AT LEVEL 8.4 ON   2/05/90  (ABL -- 3390)             * 00160099
*   DATA SET PDS AT LEVEL 8.3 ON   3/05/89  (SDS -- LISTC, TCT)       * 00170099
*   DATA SET PDS AT LEVEL 8.2 ON   9/27/88  (ABL -- SWA ABOVE 16 MEG) * 00180099
*   DATA SET PDS AT LEVEL 8.1 ON  12/17/87  (ABL -- XX LINE CMD)      * 00190000
*   DATA SET PDS AT LEVEL 8.0 ON   2/28/86  (ABL -- FOR ISPF V2)      * 00200000
*   DATA SET PDS AT LEVEL 7 AS OF  1/15/85  (SDS -- MEMLIST)          * 00210000
*   DATA SET PDS AT LEVEL 6 AS OF  7/16/83  (ABL -- MVS/XA VERSION)   * 00220000
*   DATA SET PDS AT LEVEL 5 AS OF  7/08/82  (ABL -- MEMBER GROUPS)    * 00230000
*   DATA SET PDS AT LEVEL 4 AS OF  9/30/80  (ABL -- MVS ONLY VERSION) * 00240000
*   DATA SET PDS AT LEVEL 3 AS OF  1/28/80  (ABL -- MVS VERSION)      * 00250000
*   DATA SET PDS AT LEVEL 2 AS OF 11/14/77  (ABL -- MVT VERSION)      * 00260000
*   DATA SET PDS AT LEVEL 1 AS OF  6/12/75  (UCLA VERSION)            * 00270000
*   DATA SET PDS AT LEVEL 0 AS OF  3/20/72  (FIREMAN'S FUND VERSION)  * 00280000
*                                                                     * 00290000
***                                                                   * 00300000
*** BEFORE ASSEMBLING, THE COPY CODE IN #PDSGEN SHOULD BE MODIFIED    * 00310000
*** TO REFLECT RESOURCES AVAILABLE AT YOUR INSTALLATION.              * 00320000
***                                                                   * 00330000
*** NOTE: PDS CAN BE LINKED INTO SYS1.LPALIB TO REDUCE EACH PDS       * 00340000
***       USER'S SWAP LOAD; HOWEVER, YOU SHOULD ALSO KEEP A COPY      * 00350000
***       OF PDS IN YOUR LINK LIST (WITH THE SAME OR A DIFFERENT      * 00360000
***       MEMBER NAME) AS A BACKUP IN CASE YOUR LPALIB IS REPLACED    * 00370000
***       IN A FUTURE SYSTEM.                                         * 00380000
***                                                                   * 00390000
         TITLE 'P D S  --  PDS SUPPORT REPRESENTATIVES       09/28/88'  00400000
*** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** 00410000
*                                                                     * 00420000
*                                                                     * 00430000
* PLEASE REPORT ANY PROBLEMS, ENHANCEMENTS, SUGGESTIONS OR COMMENTS   * 00440000
* CONCERNING THE PDS COMMAND TO:                                      * 00450000
*                                                                     * 00460000
*     JOHN KALINICH                       GREG PRICE                  * 00470000
*     ST LOUIS, MO                        PRYCROFT SIX PTY. LTD.      * 00480099
*     THE.PDS.COMMAND@GMAIL.COM           SERVICE2@PRYCROFT6.COM.AU   * 00490099
*                                                                     * 00500000
*     SAM GOLOB                                                       * 00510099
*     SAM GOLOB SYSTEMS PROGRAMMING LLC                               * 00520099
*     SBGOLOB@CBTTAPE.ORG                                             * 00530099
*                                                                     * 00540099
*                                                                     * 00550000
*  IF AN ERROR OR ABEND CONDITION PERSISTS IN PDS, TRY THE            * 00560000
*  FOLLOWING STEPS FOR PROBLEM RESOLUTION:                            * 00570000
*                                                                     * 00580000
*                                                                     * 00590000
*   1.  CONTACT THE IBM SUPPORT CENTER FOR KNOWN MVS PROBLEMS.        * 00600000
*                                                                     * 00610000
*   2.  REPORT THE PROBLEM (WHETHER RESOLVED OR NOT) TO JOHN KALINICH.* 00620000
*       PLEASE INCLUDE APPROPRIATE DOCUMENTATION FOR UNRESOLVED       * 00630000
*       PROBLEMS AS FOLLOWS:                                          * 00640000
*                                                                     * 00650000
*       A.  PLEASE EMAIL AS MANY FILES AS REQUIRED FOR DOCUMENTATION. * 00660000
*           PUT "PDS 8.6" IN THE SUBJECT: LINE OF YOUR EMAIL.         * 00670000
*                                                                     * 00680000
*       B.  INDICATE IF THE PROBLEM INVOLVES THE SPF INTERFACE        * 00690000
*           CODE IN PDS.                                              * 00700000
*                                                                     * 00710000
*       C.  IF POSSIBLE, DUPLICATE THE ERROR ON PAPER BY EXECUTING    * 00720000
*           PDS IN BACKGROUND MODE.                                   * 00730000
*                                                                     * 00740000
*       D.  NOTE YOUR MVS OPERATING SYSTEM AND PDS COMMAND LEVELS:    * 00750000
*           ISSUE THE "CONTROL LISTENV" SUBCOMMAND.                   * 00760000
*                                                                     * 00770000
*       E.  UNLOAD A COPY OF THE PDS LOAD MODULE USING TSO XMIT.      * 00780000
*                                                                     * 00790000
*       F.  UNLOAD THE DATA SET IN QUESTION WITH IEBCOPY OR AN        * 00800000
*           APPROPRIATE UTILITY.                                      * 00810000
*                                                                     * 00820000
*       G.  BE SURE TO INCLUDE YOUR NAME, PHONE, AND EMAIL ADDRESS    * 00830000
*           SO ANY RESULTS OR QUESTIONS CAN BE REFERRED BACK TO YOU.  * 00840000
*                                                                     * 00850000
*                                                                     * 00860000
*** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** 00870000
         TITLE 'P D S  --  PDS COMMAND PURPOSE               06/15/98'  00880000
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00890000
* TITLE      - P D S     --    TSO PDS COMMAND PROCESSOR              * 00900000
*                                                                     * 00910000
* FUNCTION   - PROVIDE A TSO USER WITH THE CAPABILITY                 * 00920000
*              TO MANIPULATE A PARTITIONED DATA SET                   * 00930000
*                                                                     * 00940000
* OPERATION  - ACCEPT FROM THE TSO USER THE NAME OF A PARTITIONED     * 00950000
*              DATA SET AND PERFORM ANY OF SEVERAL SUBCOMMANDS        * 00960000
*                                                                     * 00970000
* WRITTEN    - BY TOM SPRINGER, WILLIAM FINKELSTEIN, STEVEN SMITH,    * 00980099
*              WITH SECURITY PACIFIC NATIONAL BANK                      00990099
* MODIFIED   - BY STEVEN SMITH, WITH SECURITY PACIFIC NATIONAL BANK   * 01000000
* MODIFIED   - BY BRUCE LELAND, WITH COMPUTER ASSOCIATES              * 01010000
* MAINTAINED - BY JOHN KALINICH, WITH COMPUTER SCIENCES IN ST. LOUIS  * 01020000
*              AND GREG PRICE, PRYCROFT SIX PTY. LTD. IN MELBOURNE    * 01030000
*                                                                     * 01040092
* HISTORY    - THE FOLLOWING WAS DOCUMENTED BY WILLIAM FINKELSTEIN    * 01050092
*              ON 8/24/2010:                                          * 01060092
*                                                                     * 01070092
*             "TOM SPRINGER, STEVE SMITH AND I WERE ALL AT SECURITY   * 01080092
*              BANK WHEN WE DID THE BULK OF THE WORK ON PDS IN THE    * 01090092
*              IN THE '70S.                                           * 01100092
*                                                                     * 01110092
*              THE ISPF SUPPORT STARTED AT SECURITY IN THE '70S AND   * 01120092
*              AS I RECALL I WROTE THE FIRST VERSION OF IT AND STEVE  * 01130092
*              WROTE VERSION 2 AND BEYOND."                           * 01140092
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 01150092
*---+----1----+----2----+----3----+----4----+----5----+----6----+----7- 01160000
* CODE SIGNATURES:                                            SIG DATE  01170000
*              .----------------------------------------------.---.     01180000
*              |                                              |   |     01190000
*              V                                              V   V     01200000
*              ARNOLD BRUCE LELAND                            ABL NOV86 01210099
*              STEVE SMITH                                     SS NOV86 01220000
*              STEVEN D SMITH                                 SDS NOV86 01230099
*              JOHN KALINICH                                  Y2K AUG97 01240000
*              JANKO KALINIC                                  DRK JUL09 01250099
*              GREG PRICE                                      GP AUG05 01260099
*              SAM GOLOB                                      SBG NOV86 01270099
*              GUY ALBERTELLI                                 GLA JUN88 01280000
*              THE HARTFORD GROUP                             THG MAR06 01290000
*              GENE COLEY                                     EDS MAY06 01300099
*              AL FERGUSON                                    AJF MAR07 01310000
*              ROLAND SCHIRADIN                                  RS1199 01320099
*              JOHN HAMLET                                     JH DEC12 01330099
*              DON POITRAS                                     DP MAY08 01340099
*              SIMONETTI PIETRO                               PSI AUG16 01350099
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 01360000
         MNOTE *,'@COPYLEFT ALL WRONGS RESERVED'              DRK JUL09 01370000
         COPY  #PDSMODS                                                 01380000
         SPACE 2                                                        01390000
         COPY  #PDSGEN    ***  ESTABLISH THE PDS GLOBAL VALUES SS AUG84 01400000
         SPACE 2                                                        01410000
*&CBRO    SETC  'BROWSE'   ***  SPF BROWSE SERVICE NAME       DRK MAY09 01420000
*&CEDI    SETC  'EDIT'     ***  SPF EDIT SERVICE NAME         DRK MAY09 01430000
*&CVIE    SETC  'VIEW'     ***  SPF VIEW SERVICE NAME         DRK MAY09 01440000
         SPACE 1                                                        01450000
         AIF   ('&MVSLEV' EQ 'MVS038').MVSOK                            01460000
         AIF   ('&MVSLEV' EQ 'MVS12X').MVSOK                            01470000
         AIF   ('&MVSLEV' EQ 'MVS13X').MVSOK                            01480000
         AIF   ('&MVSLEV' EQ 'MVS220').MVSOK                   SS JUL88 01490000
         AIF   ('&MVSLEV' EQ 'MVS310').MVSOK                  DRK MAY98 01500000
         AIF   ('&MVSLEV' EQ 'MVS410').MVSOK                  DRK MAY98 01510000
         AIF   ('&MVSLEV' EQ 'MVS510').MVSOK                  DRK MAY98 01520000
         AIF   ('&MVSLEV' EQ 'MVS6XX').MVSOK                  DRK MAY98 01530000
         AIF   ('&MVSLEV' EQ 'MVS704').MVSOK                  DRK MAR16 01540099
         AIF   ('&MVSLEV' EQ 'MVS709').MVSOK                  DRK MAR16 01550099
         AIF   ('&MVSLEV' EQ 'MVS710').MVSOK                  DRK JAN13 01560099
         AIF   ('&MVSLEV' EQ 'MVS711').MVSOK                  DRK FEB15 01570099
         AIF   ('&MVSLEV' EQ 'MVS713').MVSOK                  DRK JAN13 01580099
         AIF   ('&MVSLEV' EQ 'MVS721').MVSOK                  DRK JUL14 01590099
         AIF   ('&MVSLEV' EQ 'MVS722').MVSOK                  DRK NOV15 01600099
         AIF   ('&MVSLEV' EQ 'MVS723').MVSOK                  DRK JUL17 01610099
         AIF   ('&MVSLEV' EQ 'MVS724').MVSOK                  DRK JUL19 01620099
         AIF   ('&MVSLEV' EQ 'MVS725').MVSOK                  DRK MAR21 01630099
         SPACE 3                                                        01640000
         MNOTE 12,'*** MVSLEV -- MVS LEVEL &MVSLEV IS INVALID ***'      01650000
         SPACE 2                                                        01660000
         AGO   .NOGEN                                                   01670000
.MVSOK   ANOP                                                           01680000
         AIF   ('&MVSLEV' EQ 'MVS038' AND '&CCOP' EQ 'IEBCOPY').APF     01690000
         AGO   .NOAPF                                         DRK JAN02 01700099
.APF     ANOP                                                 DRK JAN02 01710000
         MNOTE 0,'PDS - MVS 3.8 AND IEBCOPY:'                 DRK JAN02 01720000
         MNOTE 0,' LINKEDIT NORENT,NOREUS,NOREFR,AC=1'        DRK JAN02 01730000
         MNOTE 0,' FOR IEBCOPY USAGE'                         DRK JAN02 01740000
         MNOTE 0,' RE: DYNALLOC OVERLAY PROBLEM IN MVS 3.8'   DRK JAN02 01750099
         MNOTE 0,'     AND AUTHORIZATION FOR COPY'            DRK JAN07 01760000
.NOAPF   ANOP                                                 DRK JAN02 01770000
         AIF   ('&CISP' EQ '').NOSPF                                    01780000
         AIF   ('&CISP' EQ 'SPF').SMNOTE                                01790000
         AIF   ('&CISP' EQ 'ISPF').SMNOTE                               01800000
         AIF   ('&CISP' EQ 'ISPFV2').SMNOTE                             01810000
         SPACE 3                                                        01820000
         MNOTE 12,'*** CISP -- SPF CONTROL &CISP IS INVALID ***'        01830000
         SPACE 2                                                        01840000
         AGO   .NOGEN                                                   01850000
.NOSPF   ANOP                                                           01860000
&CISP    SETC  'NO SPF'                                                 01870000
&NBRO    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01880000
&NEDI    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01890000
&NVIE    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01900000
&NISP    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01910000
&NSPF    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01920000
&NMML    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01930000
&NISM    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01940000
&NISX    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01950000
&NEDR    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01960000
&IMLX    SETC  ''          *** NULLIFY THE SPF SUBCOMMANDS -- NO SPF    01970000
.SMNOTE  ANOP                                                           01980000
         SPACE 3                                                        01990000
         MNOTE *,'&CISP INTERFACE CODE WILL BE GENERATED'               02000000
         SPACE 2                                                        02010000
.NOERR   ANOP                                                           02020000
         TITLE 'P D S  --  PDS PROGRAM ENTRY                 06/15/98'  02030000
*** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** 02040000
***                                                                 *** 02050000
***    HISTORICAL SECTION:                                          *** 02060000
***                                                                 *** 02070000
***                                                                 *** 02080000
***     VERSION   LAST MOD   SIZE   IN K   # SUBS   SOURCE   HELP   *** 02090000
***     =======   ========   ====   ====   ======   ======   ====   *** 02100000
***                                                                 *** 02110000
***      PDS00    3/20/72    3E00    16K     15      3500     500   *** 02120000
***                                                                 *** 02130000
***      PDS10    6/12/75    4000    16K     15      4000     500   *** 02140000
***                                                                 *** 02150000
***      PDS20   11/14/77    4180    17K     18      4500     500   *** 02160000
***                                                                 *** 02170000
***      PDS30    1/28/80    47A0    18K     19      4851     512   *** 02180000
***                                                                 *** 02190000
***      PDS45    8/20/81    45A8    18K     22      5037     517   *** 02200000
***                                                                 *** 02210000
***      PDS52   11/08/82    6090    25K     25      6253    1123   *** 02220000
***                                                                 *** 02230000
***      PDS53    4/06/83    9610    38K     28      8978    1502   *** 02240000
***                                                                 *** 02250000
***      PDS60    9/30/83    CF28    52K     32     12068    1997   *** 02260000
***                                                                 *** 02270000
***      PDS61    2/06/84    E948    59K     34     13496    2270   *** 02280000
***                                                                 *** 02290000
***      PDS62    7/31/84   11F58    72K     39     16062    3676   *** 02300000
***                                                                 *** 02310000
***      PDS63   10/08/84   12DB0    76K     40     17124    3782   *** 02320000
***                                                                 *** 02330000
***      PDS70    1/20/85   16CD8    92K     41     20420    4112   *** 02340000
***                                                                 *** 02350000
***      PDS71    6/10/85   1B6E0   110K     44     24005    4675   *** 02360000
***                                                                 *** 02370000
***      PDS72   11/08/85   20E78   132K     46     28500    5140   *** 02380000
***                                                                 *** 02390000
***      PDS73    5/12/86   24718   146K     48     31260    5185   *** 02400000
***                                                                 *** 02410000
***      PDS80    3/09/87   29C50   168K     48     35088    5669   *** 02420000
***                                                                 *** 02430000
***      PDS81   12/18/88   2CA90   179K     50     37237    5834   *** 02440000
***                                                                 *** 02450000
***      PDS82    9/28/88   2D360   180K     52     37869    5943   *** 02460000
***                                                                 *** 02470000
***      PDS83    3/05/89   35E78   215K                            *** 02480000
***                                                                 *** 02490000
***      PDS84    2/05/90   36730   217K     55     43672    5972   *** 02500000
***                                                                 *** 02510000
***               8/27/97-                                          *** 02520000
***      PDS85    6/23/05   3C048   241K     57     46763    6233   *** 02530000
***                                                                 *** 02540000
***               8/05/05-                                          *** 02550000
***      PDS86    5/29/22   5B538   366K     76    [67482]  10459   *** 02560099
***                                                                 *** 02570099
***   [] #MDSECT, #PDSGEN/B, #PDSTBL, #SPWRKA, M$.. AND @.. MEMBERS *** 02580099
***         |                                                       *** 02590099
***         V                                                       *** 02600099
***      SUBLIST (#MDSECT, #PDSGEN, #PDSGENB, #PDSTBL, #SPWRKA, +   *** 02610099
***               #LSPACE, M$: @A:@PR @PT:@X)                       *** 02620099
***      ATTRIB *                                                   *** 02630099
***                                                                 *** 02640099
***     DIALOG                                                      *** 02650099
***     MEMBERS   DESCRIPTION                       SOURCE          *** 02660099
***     =======   =============                     ======          *** 02670099
***                                                                 *** 02680099
***      P86..... ISPF PANELS                       27933           *** 02690099
***      PDSM86   ISPF MESSAGES                       135           *** 02700099
*** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** *** 02710000
         SPACE 5                                                        02720000
PDSMAIN  M$ENTER                                                        02730000
         WXTRN GOVRFLB              MVT/SVS REDUX                       02740000
         WXTRN VSUBCMD,VTSOCMD      OPTIONAL PDS EXIT ROUTINES          02750000
         USING WORKAREA,R7          WORK AREA DSECT                     02760000
         SPACE 1                                                        02770000
         LA    R0,0                 POSSIBLE ZAP LOCATION               02780000
         L     R8,=A(PDSINIT)       ADDRESS OF INITIALIZATION CSECT     02790000
         BR    R8                                                       02800000
         SPACE 1                                                        02810000
ABEND0C1 SR    R0,R0                POSSIBLE ZAP LOCATION               02820000
         DC    H'0'                 ADDED FOR TEST FUNCTION             02830000
         SPACE 1                                                        02840000
KLEAR    LA    R2,NEWCMD            ADDED FOR TEST FUNCTION             02850000
         L     R8,=V(CLEAR)         ADDRESS OF SUBCOMMAND               02860000
         BR    R8                   EXECUTE THE CLEAR FUNCTION          02870000
         SPACE 2                                                        02880000
PDSINIT  CSECT                                                          02890000
         USING *,R8                                                     02900000
         LR    R6,R1                ADDRESS OF CPPL                     02910000
         L     R1,0(,R1)            POINT TO PASSED PARAMETER LIST      02920000
         CLC   2(2,R1),=C'++'       SPF ADDRESS MARKER FROM PDS?        02930000
         BNE   GETMAIN              NO, NOT AN ENTRY FROM SPF           02940000
         TR    4(8,R1),TRTABLE      CONVERT WORK AREA                   02950000
         MVC   3(8,R1),4(R1)          POINTER (R7) TO                   02960099
         PACK  7(5,R1),3(9,R1)          HEXADECIMAL                     02970099
         ICM   R7,B'1111',7(R1)     RESTORE A(WORKAREA)                 02980099
         ICM   R0,B'1100',PDSDATE   MM OF MM/DD/YY            ABL NOV86 02990000
         ICM   R0,B'0011',PDSDATE+3 DD OF MM/DD/YY            ABL NOV86 03000000
         ICM   R1,B'1100',PDSTIME   HH OF HH:MM               ABL NOV86 03010000
         ICM   R1,B'0011',PDSTIME+3 MM OF HH:MM               ABL NOV86 03020000
         AR    R0,R1                COMBINED                  ABL NOV86 03030000
         C     R0,0(,R7)            DATE/TIME STAMPS EQUAL?   ABL NOV86 03040000
         BE    SAMEPRGM             YES, BRANCH               ABL NOV86 03050000
         LA    R1,PDSCOMPT           ERROR MESSAGE            ABL NOV86 03060000
         LA    R0,L'PDSCOMPT         ERROR MESSAGE LENGTH     ABL NOV86 03070000
         TPUT  (1),(0),R             DIFFERENT VERSION MSG    ABL NOV86 03080099
         SPACE 2                                              ABL NOV86 03090000
         LM    R14,R12,12(R13)          SAVE REGISTERS        ABL NOV86 03100000
         LA    R15,4                    RC=4 FOR RETURN KEY   ABL NOV86 03110000
         BR    R14                      RETURN TO SPF         ABL NOV86 03120000
PDSCOMPT DC    C'PDS997E DIFFERENT VERSION OF PDS REINVOKED'  ABL NOV86 03130000
SAMEPRGM DS    0H                                             ABL NOV86 03140000
         LH    R0,PDSENTRY          NUMBER OF ENTRIES                   03150000
         A     R0,=F'1'                                                 03160000
         STH   R0,PDSENTRY                                              03170000
         C     R0,=F'1'             FIRST SPF ENTRY?                    03180000
         BH    RETURN2              NO, END STATEMENT                   03190000
         LA    R15,FIRST4K                                              03200000
         LA    R15,SPFMAIN-FIRST4K(,R15)  SPF REGISTER SAVE AREA        03210000
         ST    R15,8(,R13)                                              03220000
         ST    R13,4(,R15)          CHAIN TO SECONDARY SAVEAREA         03230000
         LR    R13,R15                                                  03240000
         LM    R9,R12,BASES         RESTORE BASE REGISTERS              03250000
         MVI   ISPFTEXT+1,12        LENGTH OF COUNT AND "ISPF    "      03260000
         NI    FLAGSFF,FF-FSPFERR   SPF ERROR OFF                       03270000
         OI    FLAGSFF,FSPFCALL     SPF CALL ACTIVE                     03280000
         MVC   STAEPARM(4),STAELIST   RESET THE ESTAE EXIT              03290000
         L     R2,=A(STAEEXIT)        ESTAE EXIT ADDRESS                03300000
         ESTAE (R2),CT,PARAM=(R7),TERM=YES,MF=(E,STAEPARM)              03310000
ESTAE1   DS    0H                       Z/XDC PROBE           DRK DEC08 03320000
         B     RESTART0                 REALLOCATE THE DATA FILES       03330000
         SPACE 3                                                        03340000
GETMAIN  L     R5,WORKSIZE                                              03350000
         LA    R0,0(,R5)                CLEAR THE TOP BYTE              03360000
         GETMAIN RU,LV=(0),SP=1,BNDRY=PAGE                              03370000
         LR    R7,R1                    WORK AREA ADDRESS               03380000
         LR    R4,R1                    CLEAR WORK AREA                 03390000
         SR    R1,R1                    NULL SOURCE                     03400000
         MVCL  R4,R0                    FILL WITH PAD 0 FROM R1(0:7)    03410000
         SPACE 1                                                        03420000
         L     R0,=A(DEVLISTL)          LENGTH OF WORK AREA   DRK JUN98 03430000
         ICM   R0,B'1000',=AL1(25)      SUBPOOL 25            DRK MAY04 03440000
         GETMAIN R,LV=(0)               GETMAIN EDT WORK AREA DRK JUN98 03450000
         ST    R1,DEVLISTP              EDT WORK AREA         DRK JUN98 03460000
         SPACE 1                                                        03470000
         L     R1,0(,R6)                POINT TO PASSED PARAMETER LIST  03480000
         CLI   2(R1),X'40'              INVOKED AS AN ISPF PGM()?       03490000
         BNH   INITADDR                 NO, BRANCH                      03500000
*                                                                       03510000
***   PDS HAS BEEN INVOKED AS AN ISPF PGM()  -- TO ALLOW THE USE OF     03520000
*     NORMAL TSO SERVICES, A CPPL MUST BE BUILT.                        03530000
*     A.  GETMAIN AN AREA FOR CREATED CONTROL BLOCKS IN SUBPOOL 78      03540000
*         (THE SUBPOOL TSO USES FOR ECT I/O SERVICE AND WORK AREAS)     03550000
*     B.  COPY IN THE SYSTEM UPT AND PSCB ADDRESSES                     03560000
*     C.  CREATE A TSO COMMAND BUFFER FROM THE INPUT PARAMETERS         03570000
*     D.  CREATE AN ECT AREA                                            03580000
*         1.  THE ECT POINTS TO AN I/O SERVICE AREA                     03590000
*         2.  THE I/O SERVICE AREA POINTS TO AN I/O WORK AREA WHICH     03600000
*             IS INITIALLY 32 BYTES LONG.                               03610000
*     E.  A METHOD OF LOCATING THE ACTUAL TSO ECT HAS BEEN DEVELOPED.   03620000
*         IN A FOLLOWING RELEASE OF PDS, THE CREATED ECT AREA WILL      03630000
*         BE DELETED; FOR NOW, THE LOCATED ECT IS ACTUALLY USED.        03640000
*     F.  AT PROGRAM END, CLEAN UP THE OBTAINED AREA                    03650000
*         1.  IF THE I/O WORK AREA WAS FREED AND EXPANDED, RELEASE      03660000
*             THE NEW I/O WORK AREA.                                    03670000
*         2.  RELEASE THE OBTAINED SUBPOOL 78 CONTROL BLOCK AREA.       03680000
         SPACE 1                                                        03690000
         OI    FLAGSFF,FSPFDIAL+FSPFOPT6  SET APPROPRIATE SPF FLAGS     03700000
         MVI   SUBPDIAL,78              GETMAIN SUBPOOL                 03710000
         LA    R0,16+96+64+16+32        GETMAIN AREA SIZE               03720000
         ICM   R0,B'1000',SUBPDIAL      GETMAIN SUBPOOL                 03730000
         GETMAIN R,LV=(0)                                               03740000
         XC    0(16+96+64+16+32,R1),0(R1)                               03750000
         STCM  R1,B'0111',SUBPDIAL+1    CREATED CPPL START              03760000
         LA    R2,16(,R1)               CREATED CBUF START              03770000
         LA    R3,96(,R2)               CREATED ECT START               03780000
         LA    R4,64(,R3)               CREATED I/O SERVICE AREA        03790000
         LA    R5,16(,R4)               CREATED I/O WORK AREA           03800000
         ST    R2,CPPLCBUF-CPPL(,R1)    START OF CBUF                   03810000
         ST    R3,CPPLECT-CPPL(,R1)     START OF ECT                    03820000
         MVI   0(R5),X'80'              MARK END OF THE LIST            03830000
         ST    R5,0(,R4)                FIRST I/O WORK ELEMENT          03840000
         ST    R5,4(,R4)                LAST USED I/O WORK ELEMENT      03850000
         MVC   8(2,R4),=H'32'           INITIAL I/O WORK AREA LENGTH    03860000
         L     R5,CVTPTR(,R0)           --> CVT                         03870000
         L     R5,0(,R5)                --> TCB WORDS                   03880000
         L     R5,4(,R5)                --> TCB                         03890000
         L     R5,180(,R5)              --> JSCB                        03900000
         L     R5,264(,R5)              --> PSCB                        03910000
         ST    R5,CPPLPSCB-CPPL(,R1)                                    03920000
         L     R5,52(,R5)               --> UPT                         03930000
         ST    R5,CPPLUPT-CPPL(,R1)                                     03940000
         MVC   ECTPCMD-ECT(8,R3),BLANKS CLEAR THE PRIMARY COMMAND       03950000
         MVC   ECTSCMD-ECT(8,R3),BLANKS CLEAR THE SECONDARY COMMAND     03960000
         ST    R4,ECTIOWA-ECT(,R3)      START OF THE I/O SERVICE AREA   03970000
         L     R15,0(,R6)               START OF THE PARM AREA          03980000
         LR    R6,R1                    POINT TO THE CREATED CPPL       03990000
         LH    R5,0(,R15)               PARM LENGTH                     04000000
         LA    R1,4(,R5)                                                04010000
         STH   R1,0(,R2)                CBUF STRING LENGTH              04020000
         MVC   4(92,R2),BLANK128        CLEAR THE CBUF AREA             04030000
         BCTR  R5,0                     MACHINE STRING LENGTH           04040000
         MVC   4(*-*,R2),2(R15)         <<EXECUTED>>                    04050000
         EX    R5,*-6                   MOVE IN THE PARM STRING         04060000
         LA    R15,4(,R2)               PREPARE FOR STRING SCAN         04070000
         LR    R14,R15                                                  04080000
         SPACE 1                                                        04090000
         LA    R15,1(,R15)              FIND                            04100000
         CLI   0(R15),X'40'                 FIRST                       04110000
         BNE   *-8                               BLANK                  04120000
         SPACE 1                                                        04130000
         LR    R5,R15                                                   04140000
         SR    R5,R14                   LENGTH OF PDS PROGRAM NAME      04150000
         BCTR  R5,0                     MACHINE LENGTH                  04160000
         MVC   ECTPCMD-ECT(*-*,R3),4(R2)  <<EXECUTED>>                  04170000
         EX    R5,*-6                   MOVE IN THE PDS PROGRAM NAME    04180000
         SPACE 1                                                        04190000
         LA    R15,1(,R15)              FIND                            04200000
         CLI   0(R15),X'40'                 NEXT                        04210000
         BE    *-8                              NON-BLANK               04220000
         SPACE 1                                                        04230000
         SR    R15,R14                                                  04240000
         STH   R15,2(,R2)               OFFSET TO OPERANDS              04250000
         MVI   ECTSWS2-ECT(R3),ECTDEFCS DEFAULT DELETE CHARACTERS USED  04260000
         LOAD  EP=ISPLINK,ERRET=NOISPF1 ADDRESS OF SPF INTERFACE MODULE 04270000
         ST    R0,ISPLINK               SAVE ADDRESS FOR LATER          04280000
NOISPF1  DS    0H                                             DRK APR01 04290000
         SPACE 3                                                        04300000
         NOP   INITADDR                   ZAP FOR TESTING               04310000
*        L     R2,PSATOLD-PSA(,R0)     ** SEARCH TCB'S METHOD           04320000
*        L     R2,X'7C'(,R2)              --> FIRST JSTCB               04330000
*        L     R2,X'88'(,R2)              --> DAUGHTER TCB              04340000
*        L     R2,X'50'(,R2)              --> IKJEFT01 REGISTER 8       04350000
*        L     R2,X'2C'(,R2)              --> ECT                       04360000
         L     R2,PSAAOLD-PSA(,R0)     ** SEARCH ASCB METHOD   SS SEP89 04370000
         L     R2,X'6C'(,R2)              AXCB                 SS SEP89 04380000
         L     R2,X'14'(,R2)              LWA                  SS SEP89 04390000
         L     R2,X'20'(,R2)              ECT                  SS SEP89 04400000
         B     FECTUPD                    ZAP FOR TESTING               04410000
         SPACE 1                                                        04420000
         L     R1,SUBPDIAL             ** USE THE PSCBRLGB AREA         04430000
         L     R2,CPPLPSCB-CPPL(,R1)       --> PSCB                     04440000
         L     R2,PSCBRLGB-PSCB(,R2)      --> RELOGON BUFFER            04450000
         L     R2,X'100'(,R2)             --> ECT                       04460000
         SPACE 1                                                        04470000
FECTUPD  L     R1,SUBPDIAL             ** UPDATE THE ECT ADDRESS        04480000
         ST    R2,CPPLECT-CPPL(,R1)       NEW ECT POINTER               04490000
         MVC   ECTPCMD-ECT(8+8,R2),ECTPCMD-ECT(R3)                      04500000
         SPACE 3                                                        04510000
INITADDR LM    R2,R4,CPPLUPT-CPPL(R6)   INITIALIZE ADDRUPT,             04520000
         L     R5,CPPLCBUF-CPPL(R6)       ADDRPSCB, ADDRECT,            04530000
         STM   R2,R6,ADDRUPT              ADDRCBUF AND ADDRCPPL         04540000
         ST    R5,ADDRCBU2              SAVE ORIGINAL CBUF ADDR         04550000
         MVC   PDSNAME,ECTPCMD-ECT(R4)  SAVE THE PDS COMMAND NAME       04560000
         CLI   ECTSCMD-ECT(R4),X'40'      IS PDS A SUBCOMMAND?          04570000
         BE    INITADD2                   NO, BRANCH                    04580000
         CLC   ECTSCMD-ECT(3,R4),=C'GO '  GO (UNDER TEST)?              04590000
         BE    INITADD2                   YES, BRANCH                   04600000
         CLC   ECTSCMD-ECT(4,R4),=C'END ' RUN (UNDER TEST)?             04610000
         BE    INITADD2                   YES, BRANCH                   04620000
         MVC   PDSNAME,ECTSCMD-ECT(R4)    SAVE THE PDS COMMAND NAME     04630000
         SPACE 1                                                        04640000
*  SET DEFAULTS FOR CONTROL --                                          04650000
INITADD2 OI    FLAGSGG,&CONGLBL         SET DEFAULT GLOBAL VARIABLES    04660000
         OI    FLAGSJJ,&CONADEF+FCHANGEB  ALLOCATION MSG & BUFFERING    04670000
         TM    ECTSWS-ECT(R4),ECTBKGRD  BACKGROUND MODE?                04680000
         BNO   INITADD3                 NO, BRANCH                      04690000
         OI    FLAGSEE,FBKGRND          YES, SET A FLAG FOR LATER       04700000
         OI    FLAGSGG,FRECVCON         YES, NO RECOVERY IS A DEFAULT   04710000
         SPACE 1                                                        04720000
INITADD3 L     R12,=V(PDSCOMM)          BASE FOR @SUBS                  04730000
         STM   R9,R12,BASES             SAVE BASE REGISTERS             04740000
         MVC   BLDLLIST,BLDLPARM        BLDL NUMBER OF MEMBERS & LENGTH 04750000
         ST    R7,8(,R13)               CHAIN                           04760000
         ST    R13,4(,R7)                    SAVE                       04770000
         LR    R13,R7                            AREAS                  04780000
         SPACE 1                                                        04790000
         L     R5,WORKBUFF                                              04800000
         LA    R0,0(,R5)                CLEAR THE TOP BYTE              04810000
         GETMAIN RU,LV=(0),SP=1,BNDRY=PAGE                              04820000
         L     R0,=F'32768'             MAXIMUM BLOCKSIZE               04830000
         ST    R1,IOBUFF1               INPUT BUFFER 1                  04840000
         LA    R15,FIRST4K                                              04850000
         LA    R15,IOBUFN-FIRST4K(,R15) FIRST BUFFER POINTER            04860000
         ST    R1,0(,R15)               INPUT BUFFER 1                  04870000
         AR    R1,R0                                                    04880000
         ST    R1,IOBUFF2               INPUT BUFFER 2                  04890000
         AR    R1,R0                                                    04900000
         ST    R1,IODIR1                FIRST DIR IOAREA                04910000
         AR    R1,R0                                                    04920000
         ST    R1,IODIR2                SECOND DIR IOAREA               04930000
         MVI   INUMSAV+1,1              NUMBER OF INPUT BUFFERS         04940000
         SPACE 1                                                        04950000
         LA    R1,2048(,R7)                                             04960000
         LA    R1,2048(,R1)             POINT TO DMEMAREA (MEMBER LIST) 04970000
         ST    R1,PMEMMIN               FIRST ELEMENT OF THE LIST       04980000
         ST    R1,PMEMMAX               LAST ELEMENT OF THE LIST        04990000
         LA    R0,$TMSGWRK-WORKAREA-4096(R1)  POINT TO $TMSGWRK         05000000
         ST    R0,MTEXTRCT              SAVE EXTRACT ADDRESS            05010000
         MVI   MTEXTRCT,124             MAXIMUM TEXT LENGTH             05020000
         LA    R1,28(,R1)               SECOND MEMBER LIST POINTER      05030000
         ST    R1,MMEMMIN               FIRST ELEMENT OF THE LIST       05040000
         ST    R1,MMEMCURR              CURRENT ELEMENT OF THE LIST     05050000
         ST    R1,MMEMMAX               LAST ELEMENT OF THE LIST        05060000
*        GTSIZE ,                       TERMINAL PAGESIZE/LINESIZE      05070000
         GTSIZE                                                         05080000
         STM   R0,R1,PAGESIZE           LINES/SCREEN                    05090000
*        ST    R1,LINESIZE              CHARACTERS/LINE                 05100000
         SPACE 1                                                        05110000
         MVC   STAEPARM(4),STAELIST     SET A ESTAE EXIT                05120000
         L     R2,=A(STAEEXIT)          ESTAE EXIT ADDRESS              05130000
         ESTAE (R2),CT,PARAM=(R7),TERM=YES,MF=(E,STAEPARM)              05140000
ESTAE2   DS    0H                       Z/XDC PROBE           DRK DEC08 05150000
         SPACE 1                                                        05160000
         LA    R14,MTCSECTP            START OF MESSAGE DESCRIPTOR      05170000
         L     R15,ADDRCPPL            START OF THE CPPL                05180000
         LA    R0,ATTNECB              ECB TO USE                       05190000
         STM   R14,R0,MTPLPTR          INITIALIZE IKJEFF02 FIELDS       05200000
         OI    MTHIGH,X'80'            STANDARD LINKAGE                 05210000
         OI    MTSW1,MTPUTLSW+MTJOBISW MESSAGE -- PUTLINE AND COMPRESS  05220000
         MVI   MTMSGID,C'L'            MESSAGE IDENTIFIER (FIRST BYTE)  05230000
         LA    R1,INSERT#1             ADDRESS OF INSERT 1              05240000
         ST    R1,MTADDR-1             START OF INSERT INFORMATION      05250000
         MVI   MTLEN,8                 LENGTH OF THE STANDARD INSERT    05260000
         LA    R1,INSERT#2             ADDRESS OF INSERT 2              05270000
         ST    R1,MTADDR+4-1           START OF INSERT INFORMATION      05280000
         MVI   MTLEN+4,8               LENGTH OF THE STANDARD INSERT    05290000
         MVI   VOLSET,C'*'             INITIALIZE VOLSET                05300000
         MVI   FIXPDSD+4,X'80'         INITIALIZE WRITE DECB            05310000
         MVI   LASTMOD,C'*'            SET INITIAL MODULE DEFAULT       05320000
         MVI   REPLTH+1,X'FF'          SET INITIAL REPLACE LENGTH       05330000
         MVC   COMMENTR(33*4),COMMBRAN SET MAINLINE BRANCH INSTRUCTIONS 05340000
         B     SERV00                                                   05350000
COMMBRAN B     $TMSGRT         1       ** KEEP IN SYNC WITH #MDSECT     05360000
         B     MESSAGE0        2       ** KEEP IN SYNC WITH #MDSECT     05370000
         B     MESSTXT1        3       ** KEEP IN SYNC WITH #MDSECT     05380000
         B     ATTACH          4       ** KEEP IN SYNC WITH #MDSECT     05390000
         B     READDIR         5       ** KEEP IN SYNC WITH #MDSECT     05400000
         B     NEWSTAX         6       ** KEEP IN SYNC WITH #MDSECT     05410000
         B     NEWCMD          7       ** KEEP IN SYNC WITH #MDSECT     05420000
         B     RESTART0        8       ** KEEP IN SYNC WITH #MDSECT     05430000
         B     DEFGROUP       19       ** KEEP IN SYNC WITH #MDSECT     05440000
         B     EXIT8N         10       ** KEEP IN SYNC WITH #MDSECT     05450000
         B     EXIT8M         11       ** KEEP IN SYNC WITH #MDSECT     05460000
         B     M$PUTGT        12       ** KEEP IN SYNC WITH #MDSECT     05470000
         B     CONVDATE       13       ** KEEP IN SYNC WITH #MDSECT     05480000
         B     SHUTSTW2       14       ** KEEP IN SYNC WITH #MDSECT     05490000
         B     SHUTSTOW       15       ** KEEP IN SYNC WITH #MDSECT     05500000
         B     OPENSTOW       16       ** KEEP IN SYNC WITH #MDSECT     05510000
         B     ENQMTEST       17       ** KEEP IN SYNC WITH #MDSECT     05520000
         B     SPFRECUR       18       ** KEEP IN SYNC WITH #MDSECT     05530000
         B     CLOSEIT        19       ** KEEP IN SYNC WITH #MDSECT     05540000
         B     RESTART2       20       ** KEEP IN SYNC WITH #MDSECT     05550000
         B     M$PUTLIN       21       ** KEEP IN SYNC WITH #MDSECT     05560000
         B     DEALLDCB       22       ** KEEP IN SYNC WITH #MDSECT     05570000
         B     RESERVE        23       ** KEEP IN SYNC WITH #MDSECT     05580000
         B     DEQ            24       ** KEEP IN SYNC WITH #MDSECT     05590000
         B     ABEND0C1       25       ** KEEP IN SYNC WITH #MDSECT     05600000
         B     YESNO          26       ** KEEP IN SYNC WITH #MDSECT     05610000
         B     MEMSNEXT       27       ** KEEP IN SYNC WITH #MDSECT     05620000
         B     EXIT12O        28       ** KEEP IN SYNC WITH #MDSECT     05630000
         B     DEALLOCZ       29       ** KEEP IN SYNC WITH #MDSECT     05640000
         B     CALLCMDZ       30       ** KEEP IN SYNC WITH #MDSECT     05650000
         B     YESNO1         31       ** KEEP IN SYNC WITH #MDSECT     05660000
         B     ATTACH2        32       ** KEEP IN SYNC WITH #MDSECT     05670000
         B     MFILTER        33       ** KEEP IN SYNC WITH #MDSECT     05680000
         TITLE 'P D S  --  PDS SERVICE ROUTINE ADDRESSES     09/28/88'  05690000
*                                                                       05700000
*    LOCATE THE TSO SERVICE ROUTINES AND THE DISK ADDRESS CONVERTERS    05710000
*                                                                       05720000
SERV00   LA    R2,ADDRPUTL              FIRST SERVICE ROUTINE ADDRESS   05730000
         LA    R3,MODULEN               FIRST LOAD ADDRESS              05740000
         SPACE 1                                                        05750000
SERVLOOP L     R1,CVTPTR(,R0)           CVT ADDRESS                     05760000
         AH    R1,0(,R3)                OFFSET IN THE CVT               05770000
         ICM   R0,B'1111',0(R1)         ANY PRELOADED ADDRESS?          05780000
         BNZ   SERVCVTA                 YES, BRANCH                     05790000
***      XC    PARMLIST(12),PARMLIST    CLEAR THE PARMLIST AREA         05800000
         LOAD  EPLOC=2(R3)  ***,SF=(E,PARMLIST)                         05810000
         MVI   0(R2),X'D6'              MARK TO DELETE LATER            05820000
         SPACE 1                                                        05830000
SERVCVTA STCM  R0,B'0111',1(R2)         UPDATE THE ADDRESS              05840000
         LA    R2,4(,R2)                NEXT SERVICE ADDRESS            05850000
         LA    R3,10(,R3)               NEXT MODULES ADDRESS            05860000
         CLI   0(R3),X'FF'              END OF MODULES?                 05870000
         BNE   SERVLOOP                 NO, BRANCH                      05880000
         SPACE 2                                                        05890000
*        L     R2,ADDRPSCB              ADDRESS OF THE PSCB             05900000
*        MVC   PARMLIST(4),ENQSTEP      SET OPTION BITS FOR ENQ         05910000
*        ENQ   (SPFUSER,PSCBUSER-PSCB(R2),E,7,STEP),RET=TEST,           05920000
*              MF=(E,PARMLIST)          CHECK FOR SPF ENQ               05930000
         SPACE 1                                                        05940000
         AIF   ('&CISP' EQ 'NO SPF').NOISPF                   DRK MAY01 05950000
         LINK  EP=ISPQRY,ERRET=PRIM00   ISPF SERVICES QUERY   DRK APR01 05960000
         LTR   R15,R15                  SPF ALREADY INITIALIZED?        05970000
         BNZ   PRIM00                   NO, BRANCH            DRK SEP99 05980000
.NOISPF  ANOP                                                           05990000
         SPACE 1                                                        06000000
         XI    FLAGSFF,FSPFOPT6         YES, INVERT THE OPTION 6 FLAG   06010000
         TM    FLAGSFF,FSPFDIAL         DIALOG ALREADY?                 06020000
         BO    PRIM00                   YES, BRANCH                     06030000
***      L     R8,=V(CLEAR)             ADDRESS OF SUBCOMMAND           06040000
***      BAS   R2,4(R8)                 ENTER AT CLEAR1                 06050000
***      L     R8,=A(PDSINIT)           RESET BASE REGISTER             06060000
         TITLE 'P D S  --  PDS PRIMARY SUBCOMMAND CHECK      09/28/88'  06070000
*                                                                       06080000
*     GET THE DATA SET NAME AND ANY SUBCOMMAND FROM THE COMMAND LINE    06090000
*                                                                       06100000
         SPACE 1                                                        06110000
PRIM00   L     R2,ADDRCBUF         COMMAND BUFFER                       06120000
         LH    R3,0(,R2)           TOTAL COMMAND LENGTH                 06130000
         LR    R1,R3               TOTAL COMMAND LENGTH                 06140000
         BCTR  R1,0                MACHINE LENGTH                       06150000
         LA    R14,FIRST4K         BASE FOR RECALLST                    06160000
         MVC   RECALLST-FIRST4K(*-*,R14),0(R2) <<EXECUTED>>             06170000
         EX    R1,*-6              SAVE PREVIOUS SUBCOMMAND             06180000
         XC    RECALLST-FIRST4K(2,R14),=F'0'                            06190000
         SPACE 1                                                        06200000
         LH    R4,2(,R2)           OFFSET TO OPERANDS                   06210000
         LA    R4,4(,R4)           PLUS COUNT BYTES                     06220000
         LA    R2,0(R2,R4)         START OF OPERANDS                    06230000
         SR    R3,R4               BYTES LEFT TO SCAN - ANY?            06240000
         BNP   PRIM90              NO, BRANCH                           06250000
         SPACE 1                                                        06260000
         CNOP  0,8                 ALIGN FOR LOOP                       06270000
PRIM10   OI    0(R2),X'40'         UPPER-CASE THE OPERANDS              06280000
         CLI   0(R2),X'40'         BLANK?                               06290000
         BE    PRIM20              YES, BRANCH                          06300000
         LA    R2,1(,R2)           NO, TRY THE NEXT ONE                 06310000
         BCT   R3,PRIM10                                                06320000
         B     PRIM90              NOT FOUND, BRANCH                    06330000
         SPACE 1                                                        06340000
         CNOP  0,8                 ALIGN FOR LOOP                       06350000
PRIM20   OI    0(R2),X'40'         UPPER-CASE THE OPERANDS              06360000
         LA    R5,PRIMOPTN-2       PDS VALID KEYWORD TABLE START -2     06370000
         CLI   0(R2),X'40'         BLANK?                               06380000
         BNE   PRIM30              NO, BRANCH                           06390000
         LA    R2,1(,R2)           YES, TRY THE NEXT ONE                06400000
         BCT   R3,PRIM20                                                06410000
         B     PRIM90              NOT FOUND, BRANCH                    06420000
         SPACE 1                                                        06430000
PRIM30   LA    R5,2(,R5)           NEXT VALID KEYWORD ENTRY             06440000
         CLI   0(R5),X'FF'         END OF KEYWORD TABLE?                06450000
         BE    PRIM40              YES, FOUND A SUBCOMMAND              06460000
         CLC   0(1,R2),0(R5)       FIRST CHARACTER MATCH?               06470000
         BNE   PRIM30              NO, CONTINUE LOOPING                 06480000
         SPACE 1                                                        06490000
         CLI   0(R2),C'X'          XISPMODE?                            06500000
         BNE   *+8                 NO, BRANCH                           06510000
         OI    FLAGSGG,FOUTSOME    MATCH ON XISPMODE                    06520000
         SPACE 1                                                        06530000
         C     R3,=F'1'            ANOTHER CHARACTER?                   06540000
         BNH   PRIM90              NO, NO SUBCOMMAND ADDED              06550000
         OI    1(R2),X'40'         UPPER-CASE THE NEXT CHARACTER        06560000
         CLC   1(1,R2),1(R5)       MATCH SECOND CHARACTER TOO?          06570000
         BE    PRIM10              YES, --NOT A SUBCOMMAND--            06580000
         CLI   1(R2),X'40'         SECOND CHARACTER A BLANK?            06590000
         BE    PRIM10              YES, --NOT A SUBCOMMAND--            06600000
         CLI   1(R2),C'('          PARENTHESIS FOLLOWING V (FOR VOL)?   06610000
         BE    PRIM10              YES, --NOT A SUBCOMMAND--            06620000
         EJECT                                                          06630000
PRIM40   LA    R0,256              COUNT OF SUBCOMMAND CHARACTERS       06640000
         ICM   R0,B'1000',=X'01'   SUBPOOL 1                            06650000
         GETMAIN R,LV=(0)                                               06660000
         MVI   0(R1),X'40'         BLANK THE                            06670000
         MVC   1(255,R1),0(R1)              SUBCOMMAND STORAGE          06680000
         XC    0(4,R1),0(R1)       CLEAR THE FIRST WORD                 06690000
         MVI   0(R1),1             LENGTH=1*256                         06700000
         ST    R1,SUBCMNDP         SAVE THE STORAGE POINTER             06710000
         SPACE 1                                                        06720000
         CNOP  0,8                 ALIGN FOR LOOP                       06730000
PRIM42   OC    4(1,R1),0(R2)       MOVE AND UPPER-CASE THE CHARACTER    06740000
         MVI   0(R2),X'40'         BLANK THE COMMAND LINE CHARACTER     06750000
         LA    R1,1(,R1)                                                06760000
         LA    R2,1(,R2)                                                06770000
         BCT   R3,PRIM42                                                06780000
         SPACE 3                                                        06790000
PRIM90   ICM   R1,B'1111',SUBCMNDP ADDRESS OF SUBCOMMAND?               06800000
         BZ    PRIM92              NO - ZERO, BRANCH                    06810000
         CLC   4(4,R1),$ISM        ISPMODE?                             06820000
         BE    PRIM98              YES, BRANCH                          06830000
         CLC   4(4,R1),$MML        MEMLIST?                             06840000
         BE    PRIM98              YES, BRANCH                          06850000
         CLC   4(2,R1),$ML         ML?                                  06860000
         BE    PRIM98              YES, BRANCH                          06870000
         B     PRIM96                                                   06880000
PRIM92   TM    FLAGSFF,FSPFDIAL    DIALOG ALREADY?                      06890000
         BNO   PRIM96              NO, DO PROGRAM IDENTIFIER            06900000
         LA    R0,=CL8'CONTROL'    FIRST PARAMETER                      06910000
         LA    R1,=CL8'DISPLAY'    SECOND PARAMETER                     06920000
         LA    R2,=CL8'SM     '    THIRD PARAMETER                      06930000
         LA    R3,=F'1'            FOURTH PARAMETER                     06940000
         STM   R0,R3,MSGTEXT2      SAVE ADDRESSES                       06950000
         OI    MSGTEXT2+12,X'80'   LAST                                 06960000
         LA    R1,MSGTEXT2             PARAMETER                        06970000
         L     R15,ISPLINK                                              06980000
         BASR  R14,R15             LET ISPF KNOW                        06990000
         SPACE 2                                                        07000000
PRIM96   DS    0H                  PROGRAM IDENTIFIER                   07010000
         AIF   ('&ISPOPT' NE 'ISPMODE').NNISPM1                         07020000
         OI    FLAGSGG,FISPMODE    SET A FLAG FOR LATER                 07030000
         TM    FLAGSGG,FOUTSOME    MATCH ON XISPMODE?                   07040000
         BO    PRIM97              YES, USE LINE MODE                   07050000
         TM    FLAGSFF,FSPFOPT6    INVOKED UNDER ISPF?                  07060000
         BNO   PRIM97              NO, BRANCH                           07070000
         ICM   R1,B'1111',SUBCMNDP ANY SUBCOMMAND?                      07080000
         BZ    PRIM98              NO, BRANCH                           07090000
PRIM97   NI    FLAGSGG,FF-FISPMODE YES, CANNOT GET AUTOMATIC ISPMODE    07100000
.NNISPM1 ANOP                                                           07110000
         ICM   R1,B'1111',SUBCMNDP    ADDRESS OF SUBCOMMAND?  ABL NOV86 07120000
         BNZ   PRIM98                 YES, BRANCH             ABL NOV86 07130000
         MVC   INSERT#1(8),PDSNAME                                      07140000
         M$MSG L100$1                                                   07150000
         M$ERRST MSGBLANK          ONE BLANK LINE                       07160000
         SPACE 2                                                        07170000
PRIM98   L     R1,=V($CHA)         PCL FOR DATA SET NAME                07180000
         MVC   ##SUBCOM(PTW),0(R1) PCL FOR DATA SET NAME                07190000
         L     R15,=V(PARSE)       PARSE ADDRESS                        07200000
         BASR  R14,R15             CALL PARSE                           07210000
         B     EXIT12N             ERROR EXIT                           07220000
         SPACE 2                                                        07230000
         ICM   R1,B'1111',SUBCMNDP    ADDRESS OF SUBCOMMAND?            07240000
         ST    R1,ADDRCBUF                                              07250000
         BZ    PRIM99                 NO - ZERO, BRANCH                 07260000
         OI    FLAGSBB,FCMD+FONESHOT  YES, INDICATE ONE SUBCOMMAND ONLY 07270000
         B     RESTART0                    SKIP THE PROGRAM MESSAGE     07280000
         SPACE 1                                                        07290000
PRIM99   L     R1,=V(DSNAMES)      ALLOCATION STATUS ROUTINE            07300000
         ST    R1,##ADRCMD         EXECUTED AFTER OPEN OF DATA SET      07310000
         MVI   ##ADRCM#,CONTINUE   FLAG TO CONTINUE                     07320000
         B     RESTART0                                                 07330000
         SPACE 2                                                        07340000
PRIMOPTN DC    CL2'OL'      "OLD"                                       07350000
         DC    CL2'SH'      "SHR"                                       07360000
         DC    CL2'NU'      "NUMBER"                                    07370000
         DC    CL2'VO'      "VOLUME" OR "VOLSET"                        07380000
         DC    CL2'XI'      "XISPMODE"                                  07390000
         DC    X'FF'        END OF MAIN COMMAND TABLE                   07400000
         DROP  R8                                                       07410000
PDSMAIN  CSECT                                                          07420000
         ENTRY KLEAR,OPENEXIT,NEWCMD,RETURN,CMDSCAN4                    07430000
         TITLE 'P D S  --  PDS DATA SET INITIALIZATION       09/28/88'  07440000
RESTART0 DS    0H                  ** ALLOCATE OR REALLOCATE DATA SET   07450000
         AIF ('&MLRESET' NE 'RESET').NORESET                  DRK JAN18 07460099
         OI    FLAGSZZ,ML#RES              MEMLIST RESET ON   DRK JAN18 07470099
.NORESET ANOP                                                 DRK JAN18 07480099
*                                                                       07490099
*     TEST FOR 8-CHARACTER TSO USERID                                   07500099
*                                                                       07510099
         L     R14,CVTPTR(,R0)             CVT                DRK JUL17 07520099
         L     R15,CVTTVT-CVTMAP(,R14)     TSVT               DRK JUL17 07530099
         CLI   TSVTUMXL-TSVT(R15),X'08'    8-CHAR USERID?     DRK JUL17 07540099
         BL    TSVT001                     NO                 DRK JUL17 07550099
         OI    FLAGSZZ,TSO#8               YES, SET FLAG      DRK JUL17 07560099
TSVT001  DS    0H                                                       07570099
         L     R1,ADDRPSCB                ADDRESS OF THE PSCB DRK JUL17 07580099
         LA    R14,@4K                    BASE FOR TSOUID     DRK JUL17 07590099
         LA    R15,TSOUID-@4K(,R14)       A(TSOUID)           DRK JUL17 07600099
         CLC   0(4,R15),ZERO              INITIALIZED?        DRK JUL17 07610099
         BNE   TSVT003                    YES, DONE           DRK JUL17 07620099
         TM    FLAGSZZ,TSO#8                                  DRK JUL17 07630099
         BNO   TSVT002                                        DRK JUL17 07640099
         MVC   0(8,R15),PSCBUID8-PSCB(R1)  LOGON USERID       DRK JUL17 07650099
         MVC   8(1,R15),PSCBU8L-PSCB(R1)   LOGON USERID LEN   DRK JUL17 07660099
         B     TSVT003                                        DRK JUL17 07670099
TSVT002  DS    0H                                                       07680099
         MVI   7(R15),C' '                CLEAR TSOUID+7      DRK JUL17 07690099
         MVC   0(7,R15),PSCBUSER-PSCB(R1) LOGON USERID        DRK JUL17 07700099
         MVC   8(1,R15),PSCBUSRL-PSCB(R1) LOGON USERID LEN    DRK JUL17 07710099
TSVT003  DS    0H                                                       07720099
         SPACE 1                                                        07730000
         L     R15,ADDRUPT                                    DRK MAY16 07740099
         NI    UPTSWS-UPT(R15),FF-UPTNPRM  PROMPTING          DRK MAY16 07750099
*        OI    UPTSWS-UPT(R15),UPTNPRM     NO PROMPTING       DRK MAY16 07760099
         SPACE 1                                                        07770099
         MVC   DSPALLOC,DSPREQST   SET INITIAL DISPOSITION SHR/OLD      07780000
         SPACE 2                                                        07790000
         L     R15,=A(ALLOCATE)    ALLOCATION ROUTINE ADDRESS           07800000
         XC    RECOVER,RECOVER     CANNOT RECOVER - NOT INITIALIZED YET 07810000
         BASR  R14,R15             ALLOCATE THE DATA SET                07820000
         B     EXIT12N             ALLOCATION UNSUCCESSFUL              07830000
         SPACE 1                                                        07840000
RESTART2 MVC   INDCB(LEXCPDCB),EXCPDCB MOVE PATTERN DCB                 07850000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV1                 DRK JAN13 07860099
         LA    R14,FIRST4K         BASE FOR INDCBE             JH DEC12 07870099
         MVC   INDCBE-FIRST4K(C_DCBEL,R14),C_DCBE              JH DEC12 07880099
         LA    R1,INDCBE-FIRST4K(,R14)                         JH DEC12 07890099
         ST    R1,DCBDCBE-IHADCB+INDCB                         JH DEC12 07900099
.NOEAV1  ANOP                                                 DRK JAN13 07910099
         MVC   STOWDCB(LSAMDCB),SAMDCB ALSO FOR STOW OPERATIONS         07920000
         L     R14,CVTPTR(,R0)         POINT TO THE CVT        GP AUG05 07930000
         USING CVT,R14                                         GP AUG05 07940000
         MVC   ADDRRLTV,CVTPRLTV       HANDLE CHANGE FROM PDSE GP AUG05 07950000
         DROP  R14                     CVT                     GP AUG05 07960000
         TM    DS1SMSFG,DS1PDSE        PDSE DATASET?           GP AUG05 07970000
         BNO   INDCBRDY                NO, PROCEED AS USUAL    GP AUG05 07980000
         MVC   INDCB(LSAMDCB),SAMDCB   YES, LOAD BPAM DCB      GP AUG05 07990000
         SR    R0,R0                                           GP AUG05 08000000
         BCTR  R0,0                    GET HIGH VALUES         GP AUG05 08010000
         STCM  R0,7,DS1LSTAR           SET DS1LSTAR HIGH       GP AUG05 08020000
         LA    R0,PDSERLTV             POINT TO PHONY CODE     GP AUG05 08030000
         ST    R0,ADDRRLTV             SET ADDRESS FOR USERS   GP AUG05 08040000
INDCBRDY EQU   *                                               GP AUG05 08050000
         MVC   DCBDDNAM-IHADCB+INDCB,DDNAME                             08060000
         MVC   DCBDDNAM-IHADCB+STOWDCB,DDNAME                           08070000
         LA    R14,@4K             BASE FOR PDSEDCB           DRK AUG05 08080000
         MVC   PDSEDCB-@4K(LDIREDCB,R14),DIREDCB              DRK AUG05 08090000
         MVC   DCBDDNAM-IHADCB+PDSEDCB-@4K(,R14),DDNAME       DRK AUG05 08100000
         MVC   DCBDSORG-IHADCB+STOWDCB(1),DSORG                         08110000
         TM    DSORG,DS1DSGPO                    DSORG=PO?              08120000
         BO    *+8                               YES, BRANCH            08130000
         MVI   DCBDSORG-IHADCB+STOWDCB,DS1DSGPS  NO, USE DSORG=PS       08140000
         SPACE 2                                                        08150000
RESTART4 MVI   OPENLIST,X'00'      ** REOPEN THE DATA SET          **   08160000
         MVI   OPENLIST+4,X'80'                                         08170000
         XC    RECOVER,RECOVER     CANNOT RECOVER - NOT INITIALIZED YET 08180000
         XC    BLKSI(2),BLKSI                                           08190000
         OPEN  (INDCB,INPUT,STOWDCB,INPUT),MF=(E,OPENLIST)    DRK JUN03 08200000
         SPACE 1                                                        08210000
         MVI   OPENLIST,X'80'                                           08220000
         CLOSE (STOWDCB),MF=(E,OPENLIST)       OPENED FOR DCB EXIT ONLY 08230000
         SPACE 1                                                        08240000
         TM    DCBOFLGS-IHADCB+INDCB,DCBOFOPN  DCB OPEN?                08250000
         BNO   EXIT12O                         NO, QUIT                 08260000
         EJECT                                                          08270000
         L     R1,DCBDEBAD-IHADCB+INDCB        DEB ADDRESS              08280000
         USING DEBBASIC,R1                                     GP AUG05 08290000
         MVC   NUMEXT+1(1),DEBNMEXT            NUMBER OF D.A. EXTENTS " 08300000
         L     R4,DEBSUCBA                     ADDRESS OF FIRST UCB   " 08310000
         ST    R4,UCBADDR                      ADDRESS OF FIRST UCB     08320000
         DROP  R1                              DEBBASIC        GP AUG05 08330000
         MVC   BYTEUCB+1(1),UCBTYP+3(R4)       SAVE THE UCB DEVICE TYPE 08340000
         ICM   R2,B'1110',DS1REFD              PRESERVE LREF  ABL JUN88 08350000
         CLI   VOLALLOC,X'40'                  ANY VOLUME DISCOVERED?   08360000
         BNE   RESTART7                        YES, OBTAIN IS DONE      08370000
         MVC   VOLALLOC,UCBVOLI(R4)            SAVE VOLUME NAME USED    08380000
         L     R14,OBTAIN                      OBTAIN FLAGS             08390000
         LA    R15,DSNAME                      ADDRESS OF DSNAME        08400000
         LA    R0,VOLALLOC                     VOLUME SERIAL            08410000
         LA    R1,DS1FMTID                     OUTPUT START ADDRESS     08420000
         STM   R14,R1,PARMLIST                 SAVE CAMLIST PARAMETERS  08430000
         OBTAIN PARMLIST                       GET THE FORMAT 1 DSCB    08440000
         LTR   R15,R15                         SUCCESSFUL OBTAIN?       08450000
         BZ    RESTART7                        YES, BRANCH              08460000
         SPACE 1                                                        08470000
*     IF THE DSNAME IS AN ALIAS ENTRY IN A VSAM CATALOG, A LOCATE       08480000
*     WILL PUT THE TRUE NAME IN THE DSNAME FIELD -- ISSUE A LOCATE,     08490000
*     AND TRY THE OBTAIN AGAIN.                                         08500000
         MVC   WORKTMP(44),DSNAME              COPY DSNAME              08510000
         L     R14,LOCATE                                               08520000
         LA    R15,WORKTMP                     ACTUAL DSNAME            08530000
         SR    R0,R0                           NO CVOL VALUE            08540000
         LA    R1,MSGTEXT1                     LOCATE WORK AREA         08550000
         STM   R14,R1,PARMLIST                 SAVE CAMLIST PARAMETERS  08560000
         LOCATE PARMLIST                                                08570000
         LTR   15,15                           SUCCESSFUL LOCATE?       08580000
         BNZ   RESTART5                        NO, ERROR                08590000
         SPACE 1                                                        08600000
         MVC   DSNAME(44),WORKTMP              COPY TRUE DSN  DRK OCT07 08610000
         LA    R0,44                                          DRK OCT07 08620000
         LA    R1,DSNAME+44                                   DRK OCT07 08630000
         CNOP  0,8                               ALIGN FOR LOOP       " 08640000
DSNLEN1A BCTR  R1,0                              BACK UP ONE BYTE     " 08650000
         CLI   0(R1),X'40'                       BLANK?               " 08660000
         BNE   DSNLEN2A                          NO, BRANCH           " 08670000
         BCT   R0,DSNLEN1A                       YES, FIND NONBLANK   " 08680000
DSNLEN2A STH   R0,DSNLEN                         UPDATE DSNAME LENGTH " 08690000
         SPACE 1                                                        08700000
         L     R14,OBTAIN                      OBTAIN FLAGS             08710000
         LA    R15,WORKTMP                     ACTUAL DSNAME            08720000
         LA    R0,VOLALLOC                     VOLUME SERIAL            08730000
         LA    R1,DS1FMTID                     OUTPUT START ADDRESS     08740000
         STM   R14,R1,PARMLIST                 SAVE CAMLIST PARAMETERS  08750000
         OBTAIN PARMLIST                       GET THE FORMAT 1 DSCB    08760000
         SPACE 1                                                        08770000
         LTR   R15,R15                         SUCCESSFUL?              08780000
         BZ    RESTART7                        YES, BRANCH              08790000
         SPACE 1                                                        08800000
RESTART5 M$MSG L830                     NO DSCB FOUND MESSAGE           08810000
         BAS   R2,SHUTSTW2              DELETE DATA SET ENQUEUES        08820000
         BAS   R2,CLOSEIT               CLOSE THE DATA SET              08830000
         BAS   R2,DEALLDCB              FREE THE DATA SET               08840000
RESTART6 M$PUTGT PDS381A,ATTN=EXIT12N   DATA SET RECOVERY MESSAGE       08850000
         SPACE 2                                                        08860000
         TM    FLAGSBB,FNULL            USER WANT ANOTHER DATA SET?     08870000
         BO    RESTART6                 NULL REPLY, ASK AGAIN           08880000
         SPACE 1                                                        08890000
         MVC   DSNLEN(SAVLEN),SAVDSN+1  RESET THE DATA SET NAME         08900000
         MVC   FULLWORD(4),##ADRCMD     SAVE CONTINUATION INFORMATION   08910000
         L     R1,=V($CHA)              PCL FOR DATA SET NAME           08920000
         MVC   ##SUBCOM(PTW),0(R1)      PCL FOR DATA SET NAME           08930000
         L     R15,=V(PARSE)            PARSE ADDRESS                   08940000
         BASR  R14,R15                  INVOKE PARSE                    08950000
         B     EXIT12N                  EXIT - PARSE FAILURE            08960000
         MVC   ##ADRCMD(4),FULLWORD     CONTINUATION INFORMATION        08970000
         B     RESTART0                 RETRY ALLOCATION                08980000
         SPACE 2                                                        08990000
RESTART7 TM    FLAGSJJ,FNOREAD          REOPEN FOR LSTAR?     ABL JUN88 09000000
         BNO   *+8                      NO, BRANCH            ABL JUN88 09010000
         STCM  R2,B'1110',DS1REFD       YES, PRESERVE LREF    ABL JUN88 09020000
         SPACE 2                                              ABL JUN88 09030000
         TM    DS1SMSFG,DS1PDSE         PDSE DATASET?          GP AUG05 09040000
         BNO   NOTPDSE7                 NO, PROCEED AS USUAL   GP AUG05 09050000
         SR    R0,R0                                           GP AUG05 09060000
         BCTR  R0,0                     GET HIGH VALUES        GP AUG05 09070000
         STCM  R0,7,DS1LSTAR            SET DS1LSTAR HIGH      GP AUG05 09080000
         B     NOT2314                                         GP AUG05 09090000
PDSERLTV L     R0,4(,R2)                GET SAVED TTR (CURMBB) GP AUG05 09100000
         SLL   R0,8                     CONVERT TO TTRZ        GP AUG05 09110000
         BR    R14                      RETURN TO CALLER       GP AUG05 09120000
NOTPDSE7 EQU   *                                               GP AUG05 09130000
         STM   R14,R12,12(R13)                 SAVE REGISTERS ABL JUN88 09140000
         ICM   R0,B'0111',DS1LSTAR             DS1LSTAR --> MBBCCHHR    09150000
         SLL   R0,8                            MOVE TO HIGH POSITION    09160000
         L     R1,DCBDEBAD-IHADCB+INDCB        DEB ADDRESS              09170000
         LA    R2,LSTARMBB                     RETURN ADDRESS           09180000
         L     R15,ADDRCNVT                    CONVERSION ROUTINE       09190000
         LR    R3,R13                          SAVE R13                 09200000
         BASR  R14,R15                                                  09210000
         LR    R13,R3                          RESTORE R13              09220000
         LM    R14,R12,12(R13)                 RESTORE REGISTERS        09230000
         SPACE 2                                                        09240000
         LA    R0,IOECB                        ECB ADDRESS              09250000
         ST    R0,IOBECB                       SET INTO IOB             09260000
         LA    R0,INDCB                        DCB ADDRESS              09270099
         ST    R0,IOBDCB                       SET INTO DCB             09280000
         MVI   IOB,X'C2'                       SET IOB FLAGS            09290000
         SPACE 2                                                        09300000
         XC    TOTUSEDX(4+4),TOTUSEDX          CLEAR TOTUSEDX/TOTALLOX  09310000
         TM    DSORG,DS1DSGPO                  PARTITIONED DATA SET?    09320000
         BNO   RESTART9                        NO, BRANCH               09330000
         SPACE 1                                                        09340000
         L     R14,=X'01080100'                R=1, K=08, DD=256        09350000
         PUSH  ACONTROL                                        DP MAY08 09360099
         ACONTROL FLAG(NOPAGE0)                                DP MAY08 09370099
         TRKCALC FUNCTN=TRKCAP,TYPE=BYTEUCB+1,RKDD=(14),              XX09380000
               REGSAVE=YES,MF=(E,PARMLIST)                              09390000
         POP   ACONTROL                                        DP MAY08 09400099
         ST    R0,DIRTRACK                     DIRECTORY BLOCKS/TRACK   09410000
         CLC   DS1LSTAR(3),ZERO                NULL DATA SET?           09420000
         BE    RESTART9                        YES, BRANCH              09430000
         SPACE 1                                                        09440000
         STM   R14,R12,12(R13)                 SAVE REGISTERS           09450000
         LA    R0,1*256                        TTR=000001               09460000
         L     R1,DCBDEBAD-IHADCB+INDCB        DEB ADDRESS              09470000
         LA    R2,IOBSEEK                      OUTPUT ADDRESS           09480000
         L     R15,ADDRCNVT                    CONVERSION ROUTINE       09490000
         LR    R3,R13                          SAVE R13                 09500000
         BASR  R14,R15                                                  09510000
         LR    R13,R3                          RESTORE R13              09520000
         LM    R14,R12,12(R13)                 RESTORE REGISTERS        09530000
         SPACE 1                                                        09540000
         LA    R1,CCW0                         START OF CHANNEL PROGRAM 09550000
         ST    R1,IOBCCW                                                09560000
         MVC   CCW0(7*8),CCWDIRR               CCW'S TO READ DIRECTORY  09570000
         MVC   WORKTMP(8),IOBSEEK              INITIALIZE BOTH CCHHR'S  09580000
         MVC   WORKTMP+8(8),IOBSEEK            INITIALIZE BOTH CCHHR'S  09590000
         LA    R1,WORKTMP+3                    USED CCHHR               09600000
         STCM  R1,B'0111',CCW1+1                                        09610000
         LA    R1,CCW1                         TIC TARGET 1             09620000
         STCM  R1,B'0111',CCW3+1                                        09630000
         LA    R1,WORKTMP+8+3                  TOTAL CCHHR              09640000
         STCM  R1,B'0111',CCW4+1                                        09650000
         LA    R1,CCW4                         TIC TARGET 2             09660000
         STCM  R1,B'0111',CCW6+1                                        09670000
         SPACE 2                                                        09680000
         MVI   IOECB,0                                                  09690000
         EXCP  IOB                                                      09700000
         WAIT  ECB=IOECB                                                09710000
         MVI   IOB,X'C2'                       SET IOB FLAGS            09720000
         NI    DCBIFLG-IHADCB+INDCB,X'3B'      RESET DCB ERROR FLAG     09730000
         SPACE 1                                                        09740000
         STM   R2,R12,28(R13)                  CONVERT CCHHR TO TTR     09750000
         LA    R2,WORKTMP                                               09760000
         L     R1,INDCB+(DCBDEBAD-IHADCB)                               09770000
         L     R15,ADDRRLTV                                             09780000
         LR    R3,R13                                                   09790000
         BASR  R14,R15                                                  09800000
         LR    R13,R3                                                   09810000
         LM    R2,R12,28(R13)                                           09820000
         SRDL  R0,16                           00TT RXXX                09830000
         SRL   R1,24                           00TT 000R                09840000
         MH    R0,DIRTRACK+2                                            09850000
         AR    R0,R1                                                    09860000
         ST    R0,TOTUSEDX                     USED DIR. BLOCKS         09870000
         SPACE 1                                                        09880000
         STM   R2,R12,28(R13)                  CONVERT CCHHR TO TTR     09890000
         LA    R2,WORKTMP+8                                             09900000
         L     R1,INDCB+(DCBDEBAD-IHADCB)                               09910000
         L     R15,ADDRRLTV                                             09920000
         LR    R3,R13                                                   09930000
         BASR  R14,R15                                                  09940000
         LR    R13,R3                                                   09950000
         LM    R2,R12,28(R13)                                           09960000
         SRDL  R0,16                           00TT RXXX                09970000
         SRL   R1,24                           00TT 000R                09980000
         MH    R0,DIRTRACK+2                                            09990000
         AR    R0,R1                                                    10000000
         BCTR  R0,0                                                     10010000
         ST    R0,TOTALLOX                     ALLOCATED DIR. BLOCKS    10020000
         SPACE 2                                                        10030000
RESTART9 MVC   CCWS(LCCWINIT),CCWINIT          INITIALIZE CCWS          10040000
         SPACE 1                                                        10050000
         LA    R0,IOBSEEK+3                                             10060000
         LA    R1,CCW1A                                                 10070000
         STCM  R0,B'0111',CCW1A+1              ***                      10080000
         STCM  R1,B'0111',CCW2A+1              *** -- INIT. CCW'S       10090000
         STCM  R0,B'0111',CCW3A+1              ***                      10100000
         SPACE 1                                                        10110000
         LA    R1,SNO                                                   10120000
         LA    R2,CCW1                                                  10130000
         STCM  R1,B'0111',CCW0+1               ***                      10140000
         STCM  R0,B'0111',CCW1+1               ***                      10150000
         STCM  R2,B'0111',CCW2+1               ***  -- READ CCW'S       10160000
         STCM  R0,B'0111',CCW5+1               ***                      10170000
         STCM  R1,B'0111',CCW6+1               ***                      10180000
         SPACE 2                                                        10190000
         LA    R1,CCW0                         FIRST CCW (SET SECTOR)   10200000
         ST    R1,EXCPCCWI                     SAVE FOR EXCP ROUTINE    10210000
         TM    FLAGSJJ,FCHANGEB                CHANGE BUFFERING?        10220000
         BNO   SETBUFF                         NO, BRANCH               10230000
         LH    R15,BYTEUCB                     UCBBYTE                  10240000
         MH    R15,=H'9'                       INDEX INTO UNIT TABLE    10250000
         LA    R15,UNITTBL(R15)                DEVICE UNIT TYPE         10260000
         NI    FLAGSEE,FF-FFULLTRK-FDOUBCON                             10270000
         MVI   DEVRPS,X'05'                    ASSUME RETAIN RESULTS    10280000
         CLI   0(R15),C'R'                     RETAIN RESULTS?          10290000
         BE    SETBUFF                         YES, BRANCH              10300000
         MVI   DEVRPS,X'04'                    DO NOT RETAIN RESULTS    10310000
         CLI   0(R15),C'M'                     READ MULTIPLE?           10320000
         BE    SETBUFF                         YES, BRANCH              10330000
         OI    FLAGSEE,FFULLTRK                                         10340000
         CLI   0(R15),C'D'                     DOUBLE?                  10350000
         BE    SETBUFF                         YES, BRANCH              10360000
         OI    FLAGSEE,FDOUBCON                NO, MUST BE SINGLE       10370000
         SPACE 1                                                        10380000
SETBUFF  NI    FLAGSJJ,FF-FCHANGEB             BUFFERING IS SET         10390000
         CLI   UCBTYP+3(R4),X'08'              2314 DISK?               10400000
         BNE   NOT2314                         NO, BRANCH               10410000
         ST    R2,EXCPCCWI                     YES, DO NOT READ SECTOR  10420000
         XI    CCW5+4,X'40'                    DO NOT CHAIN CCW5        10430000
         SPACE 1                                                        10440000
NOT2314  MVI   DSORG+1,0                       CLEAR SECOND DSORG BYTE  10450000
         TM    DSORG,DS1DSGIS+DS1DSGPS+DS1DSGDA+DS1DSGPO  DSORG KNOWN?  10460000
         BM    *+10                                       YES, BRANCH   10470000
         MVC   DSORG(2),DS1DSORG                          NO, USE LABEL 10480000
         SPACE 1                                                        10490000
         LA    R14,FIRST4K                                              10500000
         LA    R14,MSGENTDS-FIRST4K(R14)       POINT TO ENTER OPTIONS   10510000
         ST    R14,MSGENTDA                    SAVE FOR LATER           10520000
         MVC   0(115,R14),PDS300A              " ENTER OPTIONS -- ..."  10530000
         SPACE 1                                                        10540000
         AIF   ('&SYSPARM' NE 'CSC-STL').NOTSTL               DRK OCT05 10550000
         TM    DS1SMSFG,DS1PDSE        PDSE DATASET?          DRK SEP05 10560000
         BNO   NOTSTL                  NO                     DRK SEP05 10570000
         L     R15,CVTPTR(,R0)         CVT ADDRESS            DRK SEP05 10580000
         L     R15,CVTSMCA-CVTMAP(,R15)  SMCA                 DRK SEP11 10590099
         CLC   SMCASID-SMCABASE(4,R15),=C'A1VS' CSC-STL?      DRK SEP11 10600099
         BE    CSCSTL                  YES                    DRK SEP05 10610000
         CLC   SMCASID-SMCABASE(4,R15),=C'WLMD' CSC-STL?      DRK SEP11 10620099
         BNE   NOTSTL                  NO                     DRK SEP05 10630000
CSCSTL   DS    0H                      YES                    DRK SEP05 10640000
*        MVI   19+6(R14),C'='          IN MESSAGE PDS300A     DRK JAN08 10650000
         MVI   19+7(R14),C'+'          IN MESSAGE PDS300A     DRK JAN08 10660000
*        MVI   19+7(R14),X'85'         IN MESSAGE PDS300A     DRK SEP05 10670000
NOTSTL   DS    0H                                             DRK SEP05 10680000
.NOTSTL  ANOP                                                 DRK OCT05 10690000
         SPACE 1                                                        10700000
         LA    R1,25+7(R14)                    WHERE TO ADD DSNAME      10710000
         MVC   0(44,R1),DSNAME                 ADD DSNAME               10720000
         AH    R1,DSNLEN                       POINT TO DSNAME END      10730000
         MVC   0(9,R1),=C',VOL=SER='           ADD ",VOL=SER="          10740000
         MVC   9(6,R1),VOLALLOC                ADD VOLUME SERIAL        10750000
         TM    DSORG,DS1DSGPO                  PARTITIONED?             10760000
         BNO   *+10                            NO, BRANCH               10770000
         MVC   9+6+2(4,R1),=C'MEM='            DEFAULT GROUP NAME       10780000
         LA    R1,9+6+2+4(,R1)                 WHERE TO ADD MEM=...     10790000
         ST    R1,MSGENTPT                     WHERE TO ADD MEM=...     10800000
         BAS   R14,DEFGROUP                    ADD DEFAULT GROUP        10810000
         SPACE 1                                                        10820000
         MVC   LABLRECL(2),LRECL               SAVE THE DCB LRECL FIELD 10830000
         TM    FLAGSCC,RECFMF                  FIXED FORMAT?            10840000
         BNO   NEWSTAX                         NO, BRANCH               10850000
         TM    RECFM,DCBRECBR                  RECFM=FB?                10860000
         BO    NEWSTAX                         YES, BRANCH              10870000
         MVC   LRECL(2),BLKSI                  RECFM=F ONLY             10880000
         SPACE 1                                                        10890000
NEWSTAX  LA    R0,NEWCMD              ABEND RECOVERY ADDRESS            10900000
         ST    R0,RECOVER                                               10910000
         L     R14,ADDRECT                                              10920000
         MVC   ECTPCMD-ECT(8,R14),PDSNAME   RESET PDS COMMAND NAME      10930000
         SPACE 1                                                        10940000
         L     R2,=A(ATTNEXIT)                                          10950000
         STAX  (2),USADDR=(R7),REPLACE=YES,IBUF=0,OBUF=0,              X10960000
               MF=(E,STAXPARM)                                          10970000
         SPACE 1                                                        10980000
         AIF   ('&ISPOPT' NE 'ISPMODE').NNISPM2                         10990000
         AIF   ('&CISP' NE 'ISPFV2').NNISPM2                            11000000
         TM    FLAGSGG,FISPMODE         ISPMODE TO BE SET?              11010000
         BNO   NEWSTAX8                 NO,BRANCH                       11020000
         LA    R1,L731                  ASSUME SPF DID NOT INITIALIZE   11030000
         TM    FLAGSFF,FSPFERR          CORRECT?                        11040000
         BO    MSGNEWXX                 YES, BRANCH                     11050000
         TM    FLAGSFF,FSPFCALL+FSPFDIAL  SPF ENVIRONMENT INITIALIZED?  11060000
         BM    NEWSTAX2                   YES, CALL SPF EDIT/BROWSE     11070000
         BAS   R2,SPFRECUR                NO, INVOKE PDS AS A DIALOG    11080000
         SPACE 3                                                        11090000
NEWSTAX2 ICM   R15,B'1111',ISPLINK      ISPLINK ADDRESS KNOWN?          11100000
         BNZ   NEWSTAX5                 YES, BRANCH                     11110000
         OI    FLAGSFF,FSPFERR          SPF ERROR                       11120000
         LOAD  EP=ISPLINK,ERRET=NOISPF2 ADDRESS OF SPF INTERFACE MODULE 11130000
         ST    R0,ISPLINK               SAVE ADDRESS FOR LATER          11140000
NOISPF2  DS    0H                                             DRK APR01 11150000
         XI    FLAGSFF,FSPFERR          NOT AN SPF ERROR NOW            11160000
NEWSTAX5 NI    FLAGSGG,FF-FISPMODE      ISPMODE WILL BE SET NOW         11170000
         STFSMODE ON,INITIAL=YES        ENTER FULLSCREEN MODE           11180000
         OI    SPFLAG0,SPFDON           ISPMODE ACTIVE NOW              11190000
         OI    SPFLAG3,SPFCHN           FORCE MSG TO BE LOGGED          11200000
         MVC   INSERT#1(8),PDSNAME                                      11210000
         M$MSG L100$1                                                   11220000
         M$ERRST MSGBLANK               ONE BLANK LINE                  11230000
.NNISPM2 ANOP                                                           11240000
NEWSTAX8 ICM   R8,B'1111',##ADRCMD    SUBCOMMAND TO BE CONTINUED?       11250000
         BNM   NEWCMD                 NO, BRANCH                        11260000
         NI    ##ADRCM#,FF-CONTINUE           TURN OFF CALL FLAG        11270000
         BASR  R2,R8                  YES, BRANCH                       11280000
         TITLE 'P D S  --  PDS NEW SUBCOMMAND PROCESSING     09/28/88'  11290000
*                                                                       11300000
*  GET THE NEXT SUBCOMMAND                                              11310000
*                                                                       11320000
         SPACE 1                                                        11330000
NEWCMD   DS    0H                                                       11340000
         BAS   R2,CONDEND$             CONDITIONAL END        DRK APR08 11350000
         MVI   STARTTR+3,0             CLEAR THE READ ADDRESS           11360000
         BAS   R2,SHUTSTOW             CLOSE STOW; RELEASE ANY ENQUEUES 11370000
         SPACE 1                                                        11380000
         SR    R0,R0                                                    11390000
         ICM   R0,B'1000',SUBPOOLT     ANY TEMPORARY STORAGE?           11400000
         MVI   SUBPOOLT,0              CLEAR THE SUBPOOL CHARACTER      11410000
         BZ    NEWCMD10                NO, LINK TO THE SUBCOMMAND       11420000
         FREEMAIN R,SP=(0)             YES, RELEASE IT                  11430000
         SPACE 1                                                        11440000
NEWCMD10 MVI   MTLEN,8                 LENGTH OF STANDARD INSERT 1      11450000
         MVI   MTLEN+4,8               LENGTH OF STANDARD INSERT 2      11460000
         TM    FLAGSAA,FMEM#MEM        MEMBER GROUP IN PROGRESS?        11470000
         BO    MEMSGET                 YES, BRANCH                      11480000
         SPACE 2                                                        11490000
         TM    SPFLAG2,SPFLNCD         LINE COMMAND?                    11500000
         BO    NEWCMD20                YES, IGNORE MEMBER LIST          11510000
         TM    PMEMMIN,X'80'           MEMBER LIST ACTIVE?              11520000
         BNO   NEWCMD20                NO, BRANCH                       11530000
         TM    DSORG,DS1DSGPO          PARTITIONED?                     11540000
         BNO   NEWCMD20                NO, MEMBER NAME NOT NEEDED       11550000
         TM    ##ADRPC#,@G             MEMBER GROUP ALLOWED?            11560000
         BNO   NEWCMD20                NO, BRANCH                       11570000
         L     R1,PMEMCURR             CURRENT MEMBER LIST ELEMENT      11580000
         TM    0(R1),X'80'             ACTIVE ELEMENT?                  11590000
         BNO   NEWCMD20                NO, BRANCH                       11600000
         NI    FLAGSHH,FOPTIONS+FLKEDYES+FLKEDNO   RESET SOME  SS FEB88 11610000
         MVC   FLAGSAA,4(R1)           RESET CONTROL FLAGS              11620000
         MVC   LMEMBER1+1(19),5(R1)    RESET MEMBER NAMES AND LENGTH    11630000
         MVC   DEVRPS+1(3),5+18(R1)    GET CURRENT TTR ADDRESS ***TEST  11640000
         L     R1,0(,R1)               NEXT LIST ELEMENT                11650000
         ST    R1,PMEMCURR             SAVE FOR NEXT LIST ITERATION     11660000
         MVC   ##SUBCOM(#LSUB),#SUBHOLD  RESET SUBCOMMAND CHANGED DATA  11670000
         TM    FLAGSAA,FMEM#MEM        MEMBER GROUP REQUESTED?          11680000
         BO    CMDVER                  YES, BRANCH                      11690000
         SPACE 1                                                        11700000
         TM    ##ADRPA#,$W             DELAY MEMBER MESSAGE?            11710000
         BNO   NEWCMD14                NO, BRANCH                       11720000
         MVC   DELAYMSG(38),MSGMEMQ                                     11730000
         MVC   DELAYMSG+7(8),##SUBCOM                                   11740000
         MVC   DELAYMSG+7+8+1(8),MEMBER1                                11750000
         TR    DELAYMSG+7+8+1(8),TRLINE                                 11760000
         OI    FLAGSHH,FDELAYM         MESSAGE IS AVAILABLE             11770000
         B     CMDVER                                                   11780000
         SPACE 1                                                        11790000
NEWCMD14 TM    ##ADRPA#,$D             SUPPRESS DEFAULT MESSAGE?        11800000
         BO    CMDVER                  YES, BRANCH                      11810000
         M$ERRST MSGBLANK                                               11820000
         MVC   INSERT#1(8),MEMBER1                                      11830000
         M$MSG L002$1                  WHO IS BEING PROCESSED           11840000
         B     CMDVER                                                   11850000
         SPACE 1                                                        11860000
NEWCMD20 MVI   FLAGSAA,0               CLEAR THE MAJOR CONTROL FLAGS    11870000
         NI    FLAGSZZ,FF-LIST#MSG     RESET NOWRITE MSG      DRK NOV06 11880099
         NI    FLAGSZZ,FF-ATT#MSG      RESET DIRECTORY MSG    DRK APR16 11890099
         MVC   ##HELOFF(1),FLAGSII     SAVE THE THEN/ELSE FLAGS         11900000
         MVI   FLAGSHH,0               CLEAR ALL FLAGSHH FLAGS          11910000
         MVI   FLAGSII,0               CLEAR ALL FLAGSII FLAGS          11920000
         MVI   IODIRADD,X'FE'          MARK AS AN INVALID CCHH ADDRESS  11930000
         MVI   IOBUFADD,X'FE'          MARK AS AN INVALID CCHH ADDRESS  11940000
         STD   R2,DOUBLE               GET SUBPOOL 19 STATUS   GP JUL10 11950000
         OC    DOUBLE,DOUBLE           ANY LEFT DANGLING?      GP JUL10 11960000
         BZ    SP19OKAY                NO, GOOD                GP JUL10 11970000
         FREEMAIN RC,SP=19             YES                     GP JUL10 11980000
         XC    DOUBLE,DOUBLE           BUT NOT NOW             GP JUL10 11990000
         LD    R2,DOUBLE               UPDATE STATUS           GP JUL10 12000000
SP19OKAY EQU   *                                               GP JUL10 12010000
         STD   R4,DOUBLE               GET SUBPOOL 18 STATUS   GP JUL10 12020000
         OC    DOUBLE,DOUBLE           ANY LEFT DANGLING?      GP JUL10 12030000
         BZ    SP18OKAY                NO, GOOD                GP JUL10 12040000
         FREEMAIN RC,SP=18             YES                     GP JUL10 12050000
         XC    DOUBLE,DOUBLE           BUT NOT NOW             GP JUL10 12060000
         LD    R4,DOUBLE               UPDATE STATUS           GP JUL10 12070000
SP18OKAY EQU   *                                               GP JUL10 12080000
         L     R1,PMEMCURR             CURRENT START OF MEMBER LIST     12090000
         MVC   PMEMCURR(4),PMEMMIN     RESET THE CURRENT POINTER        12100000
         TM    FLAGSEE,FMEMGRP         SUBLIST FOR A NEW GRP?           12110000
         BNO   NEWCMD24                NO, BRANCH                       12120000
         TM    DSORG,DS1DSGPO          PARTITIONED?                     12130000
         BNO   NEWCMD24                NO, MEMBER NAME NOT NEEDED       12140000
         CLI   #ALIAOPT,1              ALIAS MEMBERS TOO?               12150000
         BNE   NEWCMD22                NO, BRANCH                       12160000
         CLC   $SUL(8),##SUBCOM        SUBLIST SUBCOMMAND?              12170000
         BNE   NEWCMD22                NO, BRANCH                       12180000
         MVI   #ALIAOPT,X'80'+1        ALIAS PHASE                      12190000
         ST    R1,PMEMCURR             RESET START OF MEMBER LIST       12200000
         B     CALLCMDZ                CALL SUBLIST AGAIN               12210000
         SPACE 1                                                        12220000
NEWCMD22 MVC   LMEMBER1(2+8+8+2),MMEMBERD+1  RESET THE MEMBER NAME      12230000
***TEST  MVC   FLAGSAA(1),MMEMBERD     RESET THE MEMBER FLAG            12240000
         XC    MMEMMIN(12),PMEMMIN     INTERCHANGE                      12250000
         XC    PMEMMIN(12),MMEMMIN                THE                   12260000
         XC    MMEMMIN(12),PMEMMIN                   MEMBER LISTS       12270000
         MVC   MEMBERD(1+2+8+8+2),MMEMBERD    RESET THE DEFAULT NAME    12280000
         BAS   R14,DEFGROUP            ADD DEFAULT GROUP                12290000
         XI    FLAGSEE,FMEMGRP         MEMGRP USED NOW                  12300000
         SPACE 1                                                        12310000
NEWCMD24 TM    FLAGSBB,FCMD            COMMAND BUFFER AVAILABLE?        12320000
         BO    HAVECMD                 YES, BRANCH                      12330000
         SPACE 1                                                        12340000
         TM    FLAGSBB,FONESHOT        ONE SUBCOMMAND ONLY?             12350000
         BNO   NEWCMD28                NO, BRANCH             ABL NOV86 12360000
         CLC   ##SUBCOM(8),$ML         ML COMMAND FAIL?       ABL FEB87 12370000
         BE    NEWCMD25                YES, BRANCH            ABL FEB87 12380000
         CLC   ##SUBCOM(8),$MML        MEMLIST COMMAND FAIL?  ABL NOV86 12390000
         BNE   RETURN                  NO, TERMINATE          ABL NOV86 12400000
NEWCMD25 MVC   ##SUBCOM(8),$ISM        USE ISPMODE INSTEAD    ABL NOV86 12410000
         ICM   R1,B'1111',#ACTIONT     ANY THEN(MEMLIST)?     ABL NOV86 12420000
         BZ    CALLCMDZ                NO, BRANCH             ABL NOV86 12430000
         MVC   ##ADRCMD+1(3),9(R1)     CHANGE START ADDRESS   ABL NOV86 12440000
         B     CALLCMDZ                TRY AGAIN              ABL NOV86 12450000
         SPACE 1                                                        12460000
NEWCMD28 DS    0H                                                       12470000
         TM    FLAGSEE,FBKGRND         BACKGROUND MODE?                 12480000
         BNO   NEWCMD30                NO, BRANCH                       12490000
         M$ERRST MSGBLANK              YES, OUTPUT A SEPARATOR LINE     12500000
         SPACE 2                                                        12510000
NEWCMD30 DS    0H                                                       12520000
         ICM   R8,B'1111',ADDRSUMR        SUMMARY ROUTINE?    ABL NOV86 12530000
         BZ    *+6                        NO, BRANCH          ABL NOV86 12540000
         BASR  R2,R8                      YES, BRANCH         ABL NOV86 12550000
         SPACE 1                                                        12560000
         TM    FLAGSGG,FOUTSOME           ANY OUTPUT FOR SUBCOMMAND?    12570000
         BO    NEWCMD38                   YES, BRANCH                   12580099
         TM    FLAGSGG,FOUTSUB            SUBCOMMAND GAIN CONTROL?      12590000
         BNO   NEWCMD38                   NO, BRANCH                    12600000
         SPACE 1                                                        12610000
         LA    R1,L241                    NO MATCHING DATA              12620000
         AIF   ('&FINDMSG' EQ 'PDS241I').SKIP240              DRK MAY04 12630000
         SPACE 1                                              DRK APR04 12640000
         LA    R1,L240$1                  NOT FOUND MESSAGE   DRK APR04 12650000
         LH    R15,FINDLTH                FIND STRING LENGTH  DRK APR04 12660000
         BCTR  R15,0                      -1                  DRK APR04 12670099
         MVC   MTLEN,FINDLTH+1            LENGTH OF INSERT 1  DRK APR04 12680000
         MVC   INSERT#1(32),BLANK128                          DRK APR04 12690000
         MVC   INSERT#1(*-*),FINDSTR                          DRK APR04 12700000
         EX    R15,*-6                    MOVE IN MESSAGE     DRK APR04 12710000
         SPACE 1                                              DRK APR04 12720000
.SKIP240 ANOP                                                 DRK MAY04 12730000
         CLC   $FIN(8),##SUBCOM           FIND SUBCOMMAND?              12740000
         BE    NEWCMD33                   YES, BRANCH                   12750000
*        LA    R1,L241                                                  12760000
         CLC   $REP(8),##SUBCOM           REPLACE SUBCOMMAND?           12770000
         BE    NEWCMD36                   YES, BRANCH                   12780000
         LA    R1,L242                                                  12790000
         CLC   $MAP(8),##SUBCOM           MAP SUBCOMMAND?               12800000
         BE    NEWCMD36                   YES, BRANCH                   12810000
         LA    R1,L243                                                  12820000
         CLC   $HIS(8),##SUBCOM           HISTORY SUBCOMMAND?           12830000
         BE    NEWCMD36                   YES, BRANCH                   12840000
         LA    R1,L715                                                  12850000
         CLC   $MML(8),##SUBCOM           MEMLIST SUBCOMMAND?           12860000
         BE    NEWCMD36                   YES, BRANCH                   12870000
         CLC   $ML(8),##SUBCOM            ML SUBCOMMAND?                12880000
         BE    NEWCMD36                   YES, BRANCH                   12890000
         CLC   $IFX(8),##SUBCOM           IF SUBCOMMAND?                12900000
         BNE   NEWCMD38                   NO, BRANCH                    12910000
NEWCMD33 M$MSG (R1)                                                     12920000
         BAS   R2,CONDEND$                CONDITIONAL END     DRK FEB20 12930099
         TM    ##HELOFF,FSUBLIST          THEN/ELSE(SUBLIST)?           12940000
         BNO   NEWCMD38                   NO, BRANCH                    12950000
         MVI   FLAGSAA,0                  NULL MEMBER GROUP             12960000
         MVC   PMEMCURR(4),PMEMMAX        NULL MEMBER LIST              12970000
         NI    PMEMMIN,255-X'80'          NULL MEMBER LIST              12980000
         XC    MEMBERD(1+2+8+8+2),MEMBERD NO MEMBER LIST                12990000
         L     R1,MSGENTPT                START OF MEMBER PART          13000000
         MVC   0(17,R1),BLANK128          CLEAR OUT THE MEMBER NAME     13010000
         B     NEWCMD38                                                 13020000
         SPACE 2                                                        13030000
NEWCMD36 M$MSG (R1)                                                     13040000
         SPACE 2                                                        13050000
NEWCMD38 NI    FLAGSGG,FF-FOUTSOME-FOUTSUB  NO OUTPUT FOR SUBCOMMAND    13060000
         MVI   ##SUBCOM,0              RESET THE SUBCOMMAND NAME        13070000
         MVI   ATTNECB,2+1             FLAG -- CAN BE ATTENTIONED       13080000
         L     R1,MSGENTDA             POINT TO ENTER OPTIONS MESSAGE   13090000
        M$PUTGT (R1),ATTN=NEWCMD40     FIRST TRY FOR A COMMAND          13100000
         B     HAVECMD                 GOT A COMMAND                    13110000
         SPACE 2                                                        13120000
NEWCMD40 MVI   ATTNECB,2+1             FLAG -- CAN BE ATTENTIONED       13130000
         L     R1,MSGENTDA             POINT TO ENTER OPTIONS MESSAGE   13140000
        M$PUTGT (R1),ATTN=EXIT8N       SECOND TRY FOR A COMMAND         13150000
         B     HAVECMD                 GOT A COMMAND                    13160000
         TITLE 'P D S  --  PDS SUBCOMMAND INVOKE SCAN        09/28/88'  13170000
*                                                                       13180000
*        SET UP FOR SUBCOMMAND SCAN                                     13190000
*                                                                       13200000
         SPACE 1                                                        13210000
HAVECMD  NI    FLAGSBB,FF-FCMD                                          13220000
         NI    FLAGSEE,FF-FMEMGRP      SUBLIST NOT USED YET             13230000
         LA    R15,PARMLIST                                             13240000
         USING CSPL,R15                                                 13250000
         SPACE 1                                                        13260000
         L     R1,ADDRUPT              ADDRESS OF THE UPT               13270000
         L     R2,ADDRECT              ADDRESS OF THE ECT               13280000
         L     R14,ECTIOWA-ECT(R2)     ADDRESS OF I/O WORK AREA         13290000
         L     R14,0(,R14)             STACK ADDRESS                    13300000
         ST    R14,PARMSTAK            SAVE STACK ADDRESS FOR LATER     13310000
         LA    R3,ATTNECB              ADDRESS OF THE ATTENTION ECB     13320000
         LA    R4,ZERO                 ADDRESS OF A ZERO FLAG AREA      13330000
         LA    R5,SCANANSR             ADDRESS OF THE RESULT AREA       13340000
         L     R6,ADDRCBUF             ADDRESS OF THE SUBCOMMAND        13350000
         STM   R1,R6,CSPLUPT           SETUP CSPLUPT, CSPLECT, CSPLECB, 13360000
         DROP  R15                           CSPLFLG, CSPLOA & CSPLCBUF 13370000
         SPACE 1                                                        13380000
         LA    R14,FIRST4K                                              13390000
         MVC   MSGTEXT1(256),RECALLST-FIRST4K(R14) SAVE SUBCOMMAND      13400000
         MVC   MSGTEXT2(9),BLANK128             BLANK FIRST             13410000
         LH    R1,0(,R6)                        TOTAL LENGTH            13420000
         SH    R1,=H'4'                         NULL INPUT?             13430000
         BNP   HAVECMD8                         YES, IGNORE SUBCOMMAND  13440000
         BCTR  R1,0                             MACHINE LENGTH          13450000
         OC    MSGTEXT2(*-*),4(R6)              <<EXECUTED>>            13460000
         EX    R1,*-6                           UPPER CASE AND MOVE     13470000
         LA    R0,(HAVECMDE-HAVECMDT)/2         TABLE ENTRIES           13480000
         LA    R1,HAVECMDT-2                    START OF COMMAND TABLE  13490000
         CLI   1(R6),5                          ONE CHARACTER?          13500000
         BE    HAVECMD1                         YES, BRANCH             13510000
         CNOP  0,8                              ALIGN FOR LOOP          13520000
HAVECMD0 LA    R1,2(,R1)                        NEXT TABLE ENTRY        13530000
         CLC   MSGTEXT2(2),0(R1)                THIS SUBCOMMAND?        13540000
         BE    HAVECMD3                         YES, IGNORE FOR RECALL  13550000
         BCT   R0,HAVECMD0                      CHECK ALL ENTRIES       13560000
         CLI   MSGTEXT2+1,X'40'                 FOLLOWED BY A BLANK?    13570000
         BNE   HAVECMD2                         NO, BRANCH              13580000
         SPACE 1                                                        13590000
         LA    R0,(HAVECMDE-HAVECMDT)/2         TABLE ENTRIES           13600000
         LA    R1,HAVECMDT-2                    START OF COMMAND TABLE  13610000
         CNOP  0,8                              ALIGN FOR LOOP          13620000
HAVECMD1 LA    R1,2(,R1)                        NEXT TABLE ENTRY        13630000
         CLC   MSGTEXT2(1),0(R1)                THIS SUBCOMMAND         13640000
         BE    HAVECMD3                         YES, IGNORE FOR RECALL  13650000
         BCT   R0,HAVECMD1                      CHECK ALL ENTRIES       13660000
         SPACE 1                                                        13670000
HAVECMD2 MVC   RECALLST-FIRST4K(256,R14),0(R6)  NO, RESET SUBCOMMAND    13680000
         SPACE 2                                                        13690000
HAVECMD3 CLI   4(R6),C'?'              QUESTION ?                       13700000
         BE    HAVECMD4                YES, BRANCH                      13710000
         CLI   4(R6),C'.'              PERIOD (FOR EXTENDED HELP)?      13720000
         BNE   HAVECMD7                NO, BRANCH                       13730000
         CLI   5(R6),C'?'              QUESTION (FOR EXTENDED HELP)?    13740000
         BNE   HAVECMD7                NO, BRANCH                       13750000
         SPACE 1                                                        13760000
HAVECMD4 LA    R1,L520                 ** EXTENDED HELP IS REQUESTED    13770000
         MVC   RECALLST-FIRST4K(256,R14),MSGTEXT1  RESET SUBCOMMAND     13780000
         OC    ERRORMSG(3*5),ERRORMSG  ANY ERRORS NOTED?                13790000
         BZ    MSGNEW                  NO, "NO INFORMATION AVAILABLE"   13800000
         MVC   0(12,R6),MSGHELP        'H MS MS(' AND 4 BYTE LENGTH     13810000
         LA    R2,ERRORMSG-3           START OF ERROR MESSAGES-3        13820000
         LA    R0,3*5/3                MAXIMUM NUMBER OF MESSAGES       13830000
         LH    R4,0(,R6)               CURRENT LENGTH                   13840000
         SPACE 1                                                        13850000
         CNOP  0,8                     ALIGN FOR LOOP                   13860000
HAVECMD5 LA    R3,0(R4,R6)             POINT TO CURRENT BYTE            13870000
         LA    R2,3(,R2)               NEXT MESSAGE                     13880000
         MVC   0(3,R3),PDS300A+4       'PDSNNN,' (AFTER FORMATTING)     13890000
         MVC   3(3,R3),0(R2)           MESSAGE IDENTIFICATION           13900000
         MVI   6(R3),C','              SEPARATING COMMA                 13910000
         LA    R4,7(,R4)               ADD TO LENGTH                    13920000
         STH   R4,0(,R6)               UPDATE LENGTH                    13930000
         CLI   3(R2),X'00'             ANOTHER MESSAGE?                 13940000
         BE    *+8                     NO, BRANCH                       13950000
         BCT   R0,HAVECMD5             REPEAT FOR ALL MESSAGES          13960000
         MVI   6(R3),C')'              FINAL MATCHING PARENTHESIS       13970000
**       M$ERRST (R6)                  DELETE ** FOR TESTING            13980000
         SPACE 1                                                        13990000
HAVECMD7 XC    ERRORMSG(3*5),ERRORMSG  CLEAR PREVIOUS ERROR MESSAGES    14000000
         SPACE 1                                                        14010000
HAVECMD8 MVI   ATTNECB,0               CLEAR ECB                        14020000
         LA    R1,PARMLIST             PARAMETER LIST START             14030000
         L     R15,ADDRSCAN            IKJSCAN ADDRESS                  14040000
         BASR  R14,R15                 INVOKE COMMAND SCAN              14050000
         SPACE 1                                                        14060000
         LA    R15,SCANANSR            ADDR OF RESULTS                  14070000
         USING CSOA,R15                                                 14080000
         SPACE 1                                                        14090000
         TM    CSOAFLG,CSOANOC         EMPTY BUFFER?                    14100000
         BO    NEWCMD30                YES, STILL NEED COMMAND          14110000
         SPACE 1                                                        14120000
         L     R8,=V(EXEC)             EXEC ENTRY POINT                 14130000
         TM    CSOAFLG,CSOAEXEC        IMPLICIT EXEC?                   14140000
         BO    4(R8)                   YES, BRANCH                      14150000
         SPACE 2                                                        14160000
         TM    CSOAFLG,CSOAVWP+CSOAVNP VALID COMMAND?                   14170000
         BNZ   HAVECMD9                YES, BRANCH                      14180000
         LA    R1,L877                 INVALID COMMAND MESSAGE          14190000
         CLI   4(R6),X'6E'             RESHOW COMMAND?                  14200000
         BNE   MSGNEW                  NO, ERROR MESSAGE                14210000
         MVI   ATTNECB,2+1             FLAG -- CAN BE ATTENTIONED       14220000
        M$PUTGT MSGBLANK,ATTN=NEWCMD40 FIRST TRY FOR A COMMAND          14230000
         B     HAVECMD                 GOT A COMMAND                    14240000
         SPACE 1                                                        14250000
HAVECMD9 TM    CSOAFLG,CSOAVWP         ANY OPERAND?                     14260000
         BNO   *+8                     NO, BRANCH                       14270000
         OI    FLAGSHH,FOPTIONS        YES, NOTE FOR LATER              14280000
         TITLE 'P D S  --  PDS SUBCOMMAND TABLE SCAN         09/28/88'  14290000
*                                                                       14300000
*   COMMAND SCAN - IN THE CASE OF A POTENTIALLY AMBIGUOUS ENTRY         14310000
*                  (E.G. 'A ') THE FIRST MATCH IN THE COMMAND TABLE     14320000
*                  (ATTR IN THIS CASE) IS USED.                         14330000
*                                                                       14340000
         L     R2,CSOACNM              ADDR OF COMMAND NAME             14350000
         LH    R3,CSOALNM              LENGTH OF NAME                   14360000
         BCTR  R3,0                    MACHINE LENGTH                   14370000
         SPACE 2                                                        14380000
         L     R1,=V($TBL)             START OF COMMAND SCAN            14390000
         SPACE 2                                                        14400000
         CLC   0(*-*,R1),0(R2)         <<EXECUTED>>                     14410000
CMDSCAN  EX    R3,*-6                  THIS SUBCOMMAND?                 14420000
         BNE   CMDSCAN2                NO, BRANCH                       14430000
         SPACE 1                                                        14440000
         MVC   ##SUBCOM(PTW),0(R1)     INITIALIZE ##SUBCOM, ##ADRCMD,   14450000
*                                        ##ADRPCL AND ##ADRPAR          14460000
         TM    DSORG,DS1DSGPO          PARTITIONED?                     14470000
         BO    CMDFND                  YES, BRANCH                      14480000
         TM    ##ADRPC#,@S             SUPPORTED IF NOT PARTITIONED?    14490000
         BO    CMDFND2                 YES, BRANCH                      14500000
         SPACE 1                                                        14510000
CMDSCAN2 LA    R1,PTW(R1)              NEXT ENTRY IN TABLE              14520000
         CLI   0(R1),X'FF'             END OF TABLE?                    14530000
         BNE   CMDSCAN                 NO, CONTINUE                     14540000
         SPACE 1                                                        14550000
         SR    R2,R2                                                    14560000
         L     R8,=V(OPTIONS)          OPTIONS SUBCOMMAND START         14570000
         BR    R8                                                       14580000
         SPACE 1                                                        14590000
CMDSCAN4 LA    R15,SCANANSR            INVALID SUBCOMMAND MESSAGE       14600000
         LH    R3,CSOALNM              LENGTH OF NAME                   14610000
         BCTR  R3,0                    MACHINE LENGTH                   14620000
         SR    R2,R2                                                    14630000
         L     R8,=V(OPTIONS)          OPTIONS SUBCOMMAND START         14640000
         BR    R8                                                       14650000
         DROP  R15                                                      14660000
         TITLE 'P D S  --  PDS SUBCOMMAND INITIAL PROCESSING 09/28/88'  14670000
CMDFND   NI    ##ADRPC#,FF-@S          PARTITIONED, TURN OFF OTHER FLAG 14680000
         SPACE 2                                                        14690000
CMDFND2  MVC   ##ANSWER(LISUBS),ISUBS  INITIALIZE THE PDL SAVE AREA     14700000
         L     R14,ADDRECT                                              14710000
         MVC   ECTSCMD-ECT(8,R14),##SUBCOM  RESET PDS SUBCOMMAND NAME   14720000
         NI    ECTSWS2-ECT(R14),FF-X'04'    (ECTNOQPR) DO PROMPT HELP   14730000
         CLC   0(8,R1),$RC2            RECALL SUBCOMMAND?               14740000
         BE    CMDFND3                 YES, BRANCH                      14750000
         CLC   0(8,R1),$REC            RECALL SUBCOMMAND?               14760000
         BNE   CMDCHECK                NO, BRANCH                       14770000
CMDFND3  LA    R14,FIRST4K                                              14780000
         MVC   RECALLST-FIRST4K(256,R14),MSGTEXT1  YES, USE PREVIOUS    14790000
         LH    R1,RECALLST-FIRST4K(R14)  LENGTH OF OLD SUBCOMMAND       14800000
         BCTR  R1,0                    MACHINE LENGTH                   14810000
         XC    MSGTEXT1(256),MSGTEXT1  CLEAR THE MESSAGE AREA           14820000
         MVC   MSGTEXT1(*-*),RECALLST-FIRST4K(R14) <<EXECUTED>>         14830000
         EX    R1,*-6                  MOVE IN MESSAGE                  14840000
         CLI   MSGTEXT1+1,79+4         A FULL LINE (80 -1)?             14850000
         BH    *+8                     YES, BRANCH                      14860000
         MVI   MSGTEXT1+1,79+4         NO, CHANGE LENGTH TO 80          14870000
         LA    R1,MSGTEXT1+1(R1)       POINT TO POSITION AFTER TEXT     14880000
         MVI   0(R1),X'40'             ADD ONE TRAILING BLANK           14890000
         LH    R1,2(,R6)               OFFSET TO OPERANDS               14900000
         LA    R1,4(R1,R6)             POINT TO OPERANDS                14910000
         TM    FLAGSHH,FOPTIONS        ANY OPERANDS?                    14920000
         BNO   CMDFND4                 NO, BRANCH                       14930000
         OI    0(R1),X'40'             UPPER CASE THE OPERAND           14940000
         CLI   0(R1),C'C'              CHANGE OPERAND?                  14950000
         BNE   CMDFND4                 NO, BRANCH                       14960000
         MVC   MSGTEXT1(132),RECALLDS-FIRST4K(R14)  MOVE IN DSNAME      14970000
         SPACE 2                                                        14980000
CMDFND4  M$ERRST MSGTEXT1              DISPLAY THE OLD SUBCOMMAND       14990000
         LH    R1,2(,R6)               OFFSET TO OPERANDS               15000000
         LA    R1,4(R1,R6)             POINT TO OPERANDS                15010000
         TM    FLAGSHH,FOPTIONS        ANY OPERANDS?                    15020000
         BNO   NEWCMD                  NO, BRANCH                       15030000
         OI    0(R1),X'40'             UPPER CASE THE OPERAND           15040000
         CLI   0(R1),C'E'              ENTER OPERAND?                   15050000
         BNE   NEWCMD                  NO, BRANCH                       15060000
         NI    FLAGSHH,FF-FOPTIONS     TURN OFF THE OPERAND FLAG        15070000
         LA    R14,FIRST4K                                              15080000
         MVC   PUTGETBF(256),RECALLST-FIRST4K(R14)  CHANGE TO PREVIOUS  15090000
         B     HAVECMD                 SCAN AND PARSE THIS AGAIN        15100000
         SPACE 2                                                        15110000
CMDCHECK TM    ##ADRPC#,@N       IGNORE OPTIONS?                        15120000
         BO    CMDVER            YES, BRANCH                            15130000
         SPACE 2                                                        15140000
         CLC   ##SUBCOM(8),$PAT  PATTERN SUBCOMMAND?                    15150000
         BNE   CMDCHK2           NO, BRANCH                             15160000
         TM    FLAGSHH,FOPTIONS  ANY OPERAND SPECIFIED?                 15170000
         BO    CMDPARSE          YES, USE THE SPECIFIED DATA            15180000
         CLI   MEMBERP,X'00'     ANY DEFAULT PATTERN YET?               15190000
         BE    CMDPARSE          NO, FORCE A CALL TO PARSE              15200000
         SPACE 1                                                        15210000
         MVC   LMEMBER1(2+8+8+2),MEMBERP+1  RESET DEFAULT PATTERN       15220000
         MVC   FLAGSAA,MEMBERP   RESTORE THE DEFAULT FLAGS              15230000
         B     CMDVER                                                   15240000
         SPACE 2                                                        15250000
CMDCHK2  TM    ##ADRPC#,@G       MEMBER NAME DEFAULT (AND GROUP)?       15260000
         BNO   CMDREQD           NO, CHECK IF OPERANDS REQUIRED         15270000
         TM    FLAGSHH,FOPTIONS  ANY OPERAND SPECIFIED?                 15280000
         BO    CMDPARSE          YES, USE THE SPECIFIED DATA            15290000
         SPACE 2                                                        15300000
         TM    ##ADRPC#,@S       NON-PARTITIONED DATA SET?              15310000
         BO    CMDVER            YES, BRANCH                            15320000
         CLI   MEMBERD,X'00'     ANY DEFAULT MEMBER NAME YET?           15330000
         BE    CMDPARSE          NO, FORCE A CALL TO PARSE              15340000
         TM    ##ADRPC#,@R       OPERANDS REQUIRED?                     15350000
         BO    CMDPARSE          YES, BRANCH                            15360000
         SPACE 1                                                        15370000
         MVC   LMEMBER1(2+8+8+2),MEMBERD+1  RESET DEFAULT MEMBER NAMES  15380000
         MVC   FLAGSAA,MEMBERD   RESTORE THE DEFAULT FLAGS              15390000
         MVC   PMEMCURR(4),PMEMMIN  RESET THE FIRST MEMBER POINTER      15400000
         TM    FLAGSAA,FMEM#MEM  MEMBER GROUP REQUESTED?                15410000
         BO    CMDVER            YES, BRANCH                            15420000
         SPACE 1                                                        15430000
         TM    ##ADRPA#,$W       DELAY MEMBER MESSAGE?                  15440000
         BO    CMDPARS2          YES, BRANCH                            15450000
         SPACE 1                                                        15460000
         TM    ##ADRPA#,$D       SUPPRESS DEFAULT MESSAGE?              15470000
         BO    CMDVER            YES, BRANCH                            15480000
         SPACE 1                                                        15490000
         TM    PMEMMIN,X'80'     ACTIVE MEMBER LIST?                    15500000
         BNO   CMDCHK6           NO, BRANCH                             15510000
         SPACE 1                                                        15520000
         CLC   ##SUBCOM(8),$MEM  MEMBERS SUBCOMMAND?                    15530000
         BE    CMDVER            YES, BRANCH                            15540000
         SPACE 1                                                        15550000
         CLC   ##SUBCOM(8),$SUB  SUBMIT SUBCOMMAND?                     15560000
         BE    CMDVER            YES, BRANCH                            15570000
         SPACE 1                                                        15580000
         CLC   ##SUBCOM(8),$DEL  DELETE SUBCOMMAND?                     15590000
         BE    CMDVER            YES, BRANCH                            15600000
         SPACE 1                                                        15610000
CMDCHK6  MVC   INSERT#1(8),MEMBER1                                      15620000
         M$MSG L002$1            TELL THE USER WHO IS BEING PROCESSED   15630000
         B     CMDVER            CALL THE COMMAND                       15640000
         SPACE 3                                                        15650000
CMDREQD  TM    ##ADRPC#,@R       OPERANDS REQUIRED?                     15660000
         BO    CMDPARSE          YES, BRANCH                            15670000
         TM    FLAGSHH,FOPTIONS  ANY OPERANDS SPECIFIED?                15680000
         BZ    CMDVER            NO, BRANCH                             15690000
         SPACE 2                                                        15700000
CMDPARSE OI    FLAGSHH,FOPTIONS  NOW THERE ARE OPERANDS                 15710000
         L     R1,ADDRCBUF       START OF SUBCOMMAND BUFFER             15720000
         MVC   ##HELOFF(2),2(R1) SAVE THE OFFSET                        15730000
         L     R15,=V(PARSE)     PARSE ADDRESS                          15740000
         BASR  R14,R15           GET THE COMMAND OPERANDS               15750000
         B     NEWCMD            INVALID PARSE, IGNORE                  15760000
         L     R1,ADDRCBUF       START OF SUBCOMMAND BUFFER             15770000
         MVC   2(2,R1),##HELOFF  RESET THE OFFSET                       15780000
         SPACE 1                                                        15790000
         TM    ##ADRPA#,$W       DELAY MEMBER MESSAGE?                  15800000
         BNO   CMDVER            NO, BRANCH                             15810000
CMDPARS2 MVC   DELAYMSG(38),MSGMEMQ                                     15820000
         MVC   DELAYMSG+7(8),##SUBCOM                                   15830000
         MVC   DELAYMSG+7+8+1(8),MEMBER1                                15840000
         TR    DELAYMSG+7+8+1(8),TRLINE                                 15850000
         OI    FLAGSHH,FDELAYM         MESSAGE IS AVAILABLE             15860000
         B     CMDVER                                                   15870000
         SPACE 3                                                        15880000
CMDVER   ICM   R15,B'1111',=V(VSUBCMD)  VERIFY THE SUBCOMMAND?          15890000
         BZ    CALLCMD                  NO, BRANCH                      15900000
         OI    FLAGSJJ,FSUBCMD          YES, SET A ESTAE FLAG           15910000
         L     R1,ADDRCBUF              COMMAND BUFFER ADDRESS          15920000
         ST    R1,ADDRTEXT              COMMAND ADDRESS                 15930000
         MVC   MSGTEXT1(16),ADDRTEXT    MOVE ARGUMENT LIST              15940000
         LA    R1,##SUBCOM              COMMAND NAME                    15950000
         CLC   ##SUBCOM(8),$ATTL        ATTRIB SUBCOMMAND?              15960000
         BNE   CMDVER2                  NO, BRANCH                      15970000
         TM    #OPTOPT,X'F0'            ATTRIBUTE CHANGES?              15980000
         BNO   CMDVER2                  NO, BRANCH                      15990000
         LA    R1,=CL8'ATTRMOD'         YES, CHANGE THE COMMAND NAME    16000000
CMDVER2  CLC   ##SUBCOM(8),$VER         VERIFY SUBCOMMAND?              16010000
         BNE   CMDVER4                  NO, BRANCH                      16020000
         TM    #VERUPDT,2               NOUPDATE?                       16030000
         BO    CMDVER4                  YES, BRANCH                     16040000
         TM    DSORG,DS1DSGPO           PARTITIONED DATA SET?           16050000
         BNO   CMDVER4                  NO, BRANCH                      16060000
         TM    FLAGSAA,FMEMBER1+FMEMBER2  ALL MEMBERS?                  16070000
         BNZ   CMDVER4                    NO, BRANCH                    16080000
         TM    FLAGSAA,FMEM#MEM           MEMBER GROUP?                 16090000
         BO    CMDVER4                    YES, BRANCH                   16100000
         LA    R1,=CL8'VERMOD'            NO, CHANGE THE COMMAND NAME   16110000
         SPACE 1                                                        16120000
CMDVER4  ST    R1,MSGTEXT1+16           FOR VERIFICATION ROUTINE        16130000
         LA    R1,DSNAME                DSNAME                          16140000
         ST    R1,MSGTEXT1+20           FOR VERIFICATION ROUTINE        16150000
         OI    MSGTEXT1+20,X'80'        MARK END OF LIST                16160000
         LA    R1,MSGTEXT1              START OF ARGUMENT LIST          16170000
         BASR  R14,R15                  CALL VERIFICATION ROUTINE       16180000
         NI    FLAGSJJ,FF-FSUBCMD       RESET THE ESTAE FLAG            16190000
         MVC   INSERT#1(8),##SUBCOM     COMMAND NAME                    16200000
         LA    R1,L920$1                ASSUME NOT AUTHORIZED           16210000
         LTR   R15,R15                  CORRECT?                        16220000
         BNZ   MSGNEWXX                 YES, BRANCH                     16230000
         SPACE 2                                                        16240000
         CLC   ##SUBCOM(8),$FIN         FIND SUBCOMMAND?                16250000
         BE    CMDVER6                  YES, BRANCH                     16260000
         CLC   ##SUBCOM(8),$IFX         IF SUBCOMMAND?                  16270000
         BNE   CALLCMD                  NO, BRANCH                      16280000
         SPACE 1                                                        16290000
CMDVER6  L     R15,=V(VSUBCMD)          VERIFY THE SUBCOMMAND           16300000
         ICM   R1,B'1111',#ACTIONT      THEN ACTION?                    16310000
         BZ    CMDVER8                  NO, BRANCH                      16320000
         OI    FLAGSJJ,FSUBCMD          YES, SET A ESTAE FLAG           16330000
         MVC   MSGTEXT1(16),ADDRTEXT    MOVE ARGUMENT LIST              16340000
         ST    R1,MSGTEXT1+16           FOR VERIFICATION ROUTINE        16350000
         LA    R1,MSGTEXT1              START OF ARGUMENT LIST          16360000
         BASR  R14,R15                  CALL VERIFICATION ROUTINE       16370000
         NI    FLAGSJJ,FF-FSUBCMD       RESET THE ESTAE FLAG            16380000
         ICM   R1,B'1111',#ACTIONT      THEN ACTION                     16390000
         MVC   INSERT#1(8),0(R1)        COMMAND NAME                    16400000
         LA    R1,L920$1                ASSUME NOT AUTHORIZED           16410000
         LTR   R15,R15                  CORRECT?                        16420000
         BNZ   MSGNEWXX                 YES, BRANCH                     16430000
         SPACE 2                                                        16440000
CMDVER8  L     R15,=V(VSUBCMD)          VERIFY THE SUBCOMMAND           16450000
         ICM   R1,B'1111',#ACTIONE      ELSE ACTION?                    16460000
         BZ    CALLCMD                  NO, BRANCH                      16470000
         OI    FLAGSJJ,FSUBCMD          YES, SET A ESTAE FLAG           16480000
         MVC   MSGTEXT1(16),ADDRTEXT    MOVE ARGUMENT LIST              16490000
         ST    R1,MSGTEXT1+16           FOR VERIFICATION ROUTINE        16500000
         LA    R1,MSGTEXT1              START OF ARGUMENT LIST          16510000
         BASR  R14,R15                  CALL VERIFICATION ROUTINE       16520000
         NI    FLAGSJJ,FF-FSUBCMD       RESET THE ESTAE FLAG            16530000
         ICM   R1,B'1111',#ACTIONE      ELSE ACTION                     16540000
         MVC   INSERT#1(8),0(R1)        COMMAND NAME                    16550000
         LA    R1,L920$1                ASSUME NOT AUTHORIZED           16560000
         LTR   R15,R15                  CORRECT?                        16570000
         BNZ   MSGNEWXX                 YES, BRANCH                     16580000
         TITLE 'P D S  --  PDS SUBCOMMAND BLDL CHECKING      09/28/88'  16590000
CALLCMD  MVC   #SUBHOLD(#LSUB),##SUBCOM   SAVE SUBCOMMAND CHANGED DATA  16600000
         TM    ##ADRPC#,@S         NON-PARTITIONED DATA SET?            16610000
         BO    CALLCMD9            YES, BRANCH                          16620000
         TM    FLAGSAA,FMEM#MEM    MEMBER GROUP DESIRED?                16630000
         BO    CALLCMD8            YES, BRANCH                          16640000
         TM    ##ADRPC#,@C         CHANGE DIRECTORY AND NO BLDL?        16650000
         BNO   CALLCMD2            NO, BRANCH                           16660000
         MVC   DIRNAME,MEMBER1     GET MEMBER NAME                      16670000
         SPACE 2                                                        16680000
CALLCMD2 TM    ##ADRPC#,@B         BLDL REQUIRED?                       16690000
         BNO   CALLCMD8            NO, BRANCH                           16700000
         SPACE 2                                                        16710000
         XC    DIRUSER,DIRUSER     CLEAR THE USER FIELDS                16720000
         MVC   DIRNAME,MEMBER1     ORIGINAL MEMBER NAME                 16730000
         MVC   DIRTTR(3),DEVRPS+1  GET ORIGINAL TTR ADDRESS  ***TEST    16740000
         SPACE 2                                                        16750000
         SR    R15,R15                                                  16760000
         BLDL  INDCB,BLDLLIST      LOCATE DIRECTORY ENTRY               16770000
         B     *+4(R15)            PROCESS RETURN CODE                  16780000
         B     CALLCMD6              00 - SUCCESSFUL                    16790000
         B     NOMEMBER              04 - MEMBER NOT FOUND              16800000
         B     IOERROR               08 - I/O ERROR                     16810000
         SPACE 2                                                        16820000
CALLCMD6 DS    0H                                                       16830000
         MVC   DIRFLAG(DIREND-DIRFLAG),DIRFLAG+2 BLDL ADDS THINGS       16840000
         LA    R14,DIRNAME                CURRENT MEMBER NAME ADDRESS   16850000
         ST    R14,DIRPTRS                UPDATE IF NO GROUP            16860000
         SPACE 2                                                        16870000
CALLCMD8 TM    FLAGSAA,FMEM#MEM           MEMBER GROUP TO START?        16880000
         BNO   CALLCMDZ                   NO, BRANCH                    16890000
         SPACE 1                                                        16900000
         TM    FLAGSAA,FMEMBER1+FMEMBER2  ANY MEMBER NAMES?             16910000
         BNZ   MEMSINIT                   YES, BRANCH                   16920000
         OI    FLAGSHH,FMEMALLM           : NOTATION USED (FOR COPY)    16930000
         TM    ##ADRPC#,@I                BROWSE, EDIT OR VERIFY?       16940000
         BNO   MEMSINIT                   NO, BRANCH                    16950000
         SPACE 2                                                        16960000
CALLCMD9 NI    FLAGSAA,FF-FMEM#MEM        TURN OFF MEMBER GROUPS        16970000
         B     CALLCMDZ                   CALL THE SUBCOMMAND           16980000
         TITLE 'P D S  --  PDS SUBCOMMAND MEMBER GROUPS      09/28/88'  16990000
MEMSINIT MVC   #SUBHOLD(#LSUB),##SUBCOM SAVE SUBCOMMAND CHANGED DATA    17000000
         XC    DIRNAME(8),DIRNAME       CLEAR THE MEMBER NAME           17010000
         XC    DIRHOLD(8),DIRHOLD       HIGHEST NAME PROCESSED YET      17020000
         OI    FLAGSII,FDIRGRP          INPUT FOR MEMBER GROUP          17030000
         TM    FLAGSAA,FMEMRANG         MEMBER RANGE?                   17040000
         L     R8,=V(DISPLAY)           DISPLAY SUBCOMMAND START        17050000
         BOR   R8                       YES, BRANCH                     17060000
         B     8(R8)                    NO, MEMBER PATTERN              17070000
         SPACE 1                                                        17080000
MEMSGET  MVC   DIRPTRS(12),DIRPTRS2     RESTORE THE DIRPTRS             17090000
         MVC   CURMBB(8),CURDIR         RESTORE THE DIRECTORY ADDRESS   17100000
         OI    FLAGSII,FDIRGRP          INPUT FOR MEMBER GROUP          17110000
         L     R8,=V(DISPLAY)           DISPLAY SUBCOMMAND START        17120000
         B     4(R8)                    GET NEXT MEMBER                 17130000
         SPACE 1                                                        17140000
MEMSNEXT NI    FLAGSII,FF-FDIRGRP       MEMBER GROUP INPUT IS COMPLETE  17150000
         OI    FLAGSBB,FRANPAT          MEMBERS EXIST IN THIS RANGE     17160000
         MVC   DIRPTRS2(12),DIRPTRS     SAVE THE DIRPTRS                17170000
         MVC   CURDIR(8),CURMBB         SAVE THE DIRECTORY ADDRESS      17180000
         MVC   ##SUBCOM(#LSUB),#SUBHOLD RESET CHANGED INFORMATION       17190000
         L     R14,DIRPTRS              START OF CURRENT MEMBER NAME    17200000
         CLC   DIRHOLD(8),0(R14)        NAME PROCESSED BEFORE?          17210000
         BNL   MEMSGET                  YES, BRANCH AND IGNORE          17220000
         MVC   DIRHOLD(8),0(R14)        SAVE LAST NAME PROCESSED        17230000
         XC    DIRNAME(74),DIRNAME      CLEAR THE CURRENT ENTRY         17240000
         IC    R15,MEMFLAG              DIRECTORY FLAG BYTE             17250000
         N     R15,=XL4'0000001F'       NUMBER OF HALFWORDS             17260000
         LA    R15,11(R15,R15)          MACHINE LENGTH OF ENTRY         17270000
         MVC   DIRNAME(*-*),0(R14)      <<EXECUTED>>                    17280000
         EX    R15,*-6                  MOVE IN THE CURRENT ENTRY       17290000
         SPACE 1                                                        17300000
         MVC   MSGTEXT1,MSGMEMQ         SUBCOMMAND AND MEMBER MESSAGE   17310000
         MVC   MSGTEXT1+7(8),##SUBCOM                                   17320000
         MVC   MSGTEXT1+7+8+1(8),DIRNAME                                17330000
         TR    MSGTEXT1+7+8+1(8),TRLINE                                 17340000
         TM    ##ADRPC#,@W              HEADER DELAYED SUBCOMMAND?      17350000
         BNO   MEMSMSG                  NO, BRANCH                      17360000
         SPACE 1                                                        17370000
MEMSKIP  MVC   DELAYMSG(38),MSGTEXT1    SAVE FOR THEN/ELSE ACTION       17380000
         OI    FLAGSHH,FDELAYM          SUBCOMMAND IS AVAILABLE         17390000
         B     CALLCMDZ                 CALL THE SUBCOMMAND             17400000
         SPACE 2                                                        17410000
MEMSMSG  M$ERRST MSGBLANK                                               17420000
         M$ERRST MSGTEXT1                                               17430000
         SPACE 3                                                        17440000
CALLCMDZ L     R8,##ADRCMD              SUBCOMMAND ROUTINE START        17450000
         LA    R2,NEWCMD                SUBCOMMAND TERMINATION ADDRESS  17460000
         BR    R8                       LINK TO THE SUBCOMMAND          17470000
         TITLE 'P D S  --  PDS YES/NO PROMPTING ROUTINE      09/28/88'  17480000
*                                                                       17490000
*        ROUTINE TO PROMPT FOR A YES OR NO ANSWER                       17500000
*                                                                       17510000
         SPACE 1                                                        17520000
YESNO    TM    FLAGSGG,FPROMCON          PROMPTING TURNED OFF?          17530000
         BO    4(R2)                     YES, SIMULATE A YES RESPONSE   17540000
YESNO1   TM    FLAGSEE,FBKGRND+FNOTTERM  INPUT FROM THE TERMINAL?       17550000
         BNZ   4(R2)                     NO, SIMULATE A YES RESPONSE    17560000
         TM    FLAGSBB,FONESHOT          ONE SUBCOMMAND ONLY?           17570000
         BO    4(R2)                     YES, ALL DONE                  17580000
         ST    R1,YESNOSV                PROMPTING MESSAGE ADDRESS      17590000
         SPACE 1                                                        17600000
YESNO2   L     R1,YESNOSV              PROMPTING MESSAGE ADDRESS        17610000
        M$PUTGT (R1),ATTN=NEWCMD       PROMPT FOR DESIRED ACTION        17620000
         TM    FLAGSEE,FNOTTERM        INPUT FROM THE TERMINAL?         17630000
         BZ    YESNO4                  YES, BRANCH                      17640000
         OI    FLAGSBB,FCMD            NO, PDS SUBCOMMAND AVAILABLE     17650000
         B     4(R2)                   SIMULATE A YES RESPONSE          17660000
         SPACE 1                                                        17670000
YESNO4   TM    FLAGSBB,FNULL           NULL REPLY?                      17680000
         BO    YESNO2                  YES, TRY AGAIN                   17690000
         L     R1,ADDRCBUF                                              17700000
         LH    R14,0(,R1)              TOTAL NUMBER OF BYTES IN MESSAGE 17710000
         SH    R14,=H'4'               LESS LENGTH OF COUNT FIELDS      17720000
         SPACE 1                                                        17730000
YESNO6   CLI   4(R1),X'40'             BLANK?                           17740000
         BNE   YESNO8                  NO, BRANCH                       17750000
         LA    R1,1(,R1)               TRY THE NEXT BYTE                17760000
         BCT   R14,YESNO6              ANY NON-BLANK?                   17770000
         B     YESNO2                  NO, TRY AGAIN                    17780000
         SPACE 1                                                        17790000
YESNO8   OI    4(R1),X'40'             UPPER-CASE THE RESULT            17800000
         CLI   4(R1),C'N'              CHECK REPLY                      17810000
         BER   R2                      "N", RETURN AT +0                17820000
         SPACE 1                                                        17830000
         CLI   4(R1),C'Y'              VALID REPLY?                     17840000
         BNE   YESNO2                  NO, ASK AGAIN                    17850000
         B     4(,R2)                  "Y", RETURN AT +4                17860000
         TITLE 'P D S  --  PDS MEMBER FILTERING BY NAME      09/28/88'  17870000
*                                                                       17880000
*        ROUTINE TO FILTER MEMBER NAMES                                 17890000
*          EXITS: 0(R2) - SIMULATE END OF DIRECTORY                     17900000
*                 4(R2) - MEMBER FAILED FILTERING                       17910000
*                 8(R2) - MEMBER PASSED FILTERING                       17920000
*                                                                       17930000
         SPACE 1                                                        17940000
MFILTER  TM    FLAGSAA,FMEMASTR      ASTERISK MEMBER NAME?              17950000
         BO    MFIL200               YES, BRANCH                        17960000
         TM    FLAGSAA,FMEMRANG      MEMBER NAME RANGE?                 17970000
         BNO   MFIL300               NO, BRANCH                         17980000
*** MEMBER RANGE SPECIFICATION LIKE  COND:CONZ                          17990000
         TM    FLAGSAA,FMEMBER1      START ENTRY SPECIFIED?             18000000
         BNO   MFIL100               NO, BRANCH                         18010000
         SPACE 1                                                        18020000
         LH    R15,LMEMBER1          MACHINE LENGTH OF THE MEMBER NAME  18030000
         CLC   MEMBER1(*-*),MEMNAME  <<EXECUTED>>                       18040000
         EX    R15,*-6               ABOVE THIS VALUE?                  18050000
         BH    4(R2)                 YES, **FAILED                      18060000
         XI    FLAGSAA,FMEMBER1      FIRST NAME IS SATISFIED            18070000
         SPACE 2                                                        18080000
         AIF   ('&CONDRNG' EQ 'N').NRNG                                 18090000
         TM    FLAGSAA,FMEMBER2          LAST ENTRY SPECIFIED?          18100000
         BO    MFIL100                   YES, BRANCH                    18110000
         CLC   $DIS(8),##SUBCOM          DISPLAY SUBCOMMAND?            18120000
         BNE   MFIL100                   NO, BRANCH                     18130000
         STH   R15,LMEMBER2              LENGTH-1 OF SECOND NAME        18140000
         MVC   MEMBER2(*-*),MEMBER1      <<EXECUTED>>                   18150000
         EX    R15,*-6                   DUPLICATE FIRST MEMBER NAME    18160000
         OI    FLAGSAA,FMEMBER2          SET SECOND ENTRY HERE          18170000
         SPACE 2                                                        18180000
.NRNG    ANOP                                                           18190000
         SPACE 2                                                        18200000
MFIL100  TM    FLAGSAA,FMEMBER2      END ENTRY SPECIFIED?               18210000
         BNO   8(R2)                 NO, **PASSED                       18220000
         SPACE 1                                                        18230000
         LH    R15,LMEMBER2          MACHINE LENGTH OF THE MEMBER NAME  18240000
         CLC   MEMBER2(*-*),MEMNAME  <<EXECUTED>>                       18250000
         EX    R15,*-6               BELOW THIS VALUE?                  18260000
         BL    0(R2)                 YES, **SIMULATE DIRECTORY END      18270000
         B     8(R2)                 **PASSED                           18280000
         SPACE 3                                                        18290000
*** MEMBER PART SPECIFICATION LIKE  COND*PT                             18300000
MFIL200  CLI   MEMBER1,0             ANY DATA?                          18310000
         BE    MFIL210               NO, BRANCH                         18320000
         LH    R15,LMEMBER1          MACHINE LENGTH OF THE MEMBER NAME  18330000
         SPACE 1                                                        18340000
         CLC   MEMNAME(*-*),MEMBER1  <<EXECUTED>>                       18350000
         EX    R15,*-6               MEMBER NAME:FIRST PART             18360000
         BL    4(R2)                   BELOW, **FAILED                  18370000
         BH    0(R2)                   ABOVE, **SIMULATE DIRECTORY END  18380000
         SPACE 1                                                        18390000
MFIL210  TM    FLAGSAA,FMEMBER2      A SECOND PART TOO?                 18400000
         BNO   8(R2)                 NO, **PASSED                       18410000
         LA    R1,8                  MAXIMUM MEMBER LENGTH              18420000
         LH    R14,LMEMBER1          FIRST PART MACHINE LENGTH          18430000
         CLI   MEMBER1,0             ANY DATA?                          18440000
         BE    MFIL220               NO, BRANCH                         18450000
         LA    R14,1(,R14)           FIRST PART LENGTH                  18460000
MFIL220  SR    R1,R14                MAXIMUM PATTERN LENGTH             18470000
         LH    R15,LMEMBER2          MACHINE LENGTH OF THIS PART        18480000
         SR    R1,R15                NUMBER OF COMPARES VALID?          18490000
         BNP   4(R2)                 NO, FAILED                         18500000
         LA    R14,MEMNAME(R14)      POSITION IN MEMBER NAME            18510000
         CLC   0(*-*,R14),MEMBER2    <<EXECUTED>>                       18520000
MFIL230  EX    R15,*-6               IN THIS MEMBER NAME?               18530000
         BE    8(R2)                 YES, **PASSED                      18540000
         LA    R14,1(,R14)                                              18550000
         BCT   R1,MFIL230            MAYBE, CHECK ALL OTHER POSITIONS   18560000
         B     4(R2)                 NO, **FAILED                       18570000
         SPACE 3                                                        18580000
*** MEMBER PATTERN SPECIFICATION LIKE  COND/PT                          18590000
MFIL300  LH    R15,LMEMBER1          MACHINE LENGTH OF THIS PATTERN     18600000
         LA    R1,8                  MAXIMUM PATTERN LENGTH             18610000
         SR    R1,R15                COMPARE LENGTH                     18620000
         LA    R14,MEMNAME           POSITION IN MEMBER NAME            18630000
         CLC   0(*-*,R14),MEMBER1    <<EXECUTED>>                       18640000
MFIL310  EX    R15,*-6               IN THIS MEMBER NAME?               18650000
         BE    MFIL320               YES, BRANCH                        18660000
         LA    R14,1(,R14)                                              18670000
         BCT   R1,MFIL310            MAYBE, CHECK ALL OTHER POSITIONS   18680000
         B     4(R2)                 NO, **FAILED                       18690000
         SPACE 2                                                        18700000
MFIL320  TM    FLAGSAA,FMEMBER2      A SECOND PATTERN TOO?              18710000
         BNO   8(R2)                 NO, **PASSED                       18720000
         LH    R15,LMEMBER2          MACHINE LENGTH OF THIS PATTERN     18730000
         LA    R1,8                  MAXIMUM PATTERN LENGTH             18740000
         SR    R1,R15                COMPARE LENGTH                     18750000
         LA    R14,MEMNAME           POSITION IN MEMBER NAME            18760000
         CLC   0(*-*,R14),MEMBER2    <<EXECUTED>>                       18770000
MFIL330  EX    R15,*-6               IN THIS MEMBER NAME?               18780000
         BE    8(R2)                 YES, **PASSED                      18790000
         LA    R14,1(,R14)                                              18800000
         BCT   R1,MFIL330            MAYBE, CHECK ALL OTHER POSITIONS   18810000
         B     4(R2)                 NO, **FAILED                       18820000
         TITLE 'P D S  --  PDS DATE CONVERSION ROUTINE       09/28/88'  18830000
*                                                                       18840000
*        DATE CONVERSION ROUTINE -- CHANGES FORMAT YYDDDF TO MMDDYY     18850000
*                                                                       18860000
         SPACE 1                                                        18870000
         ENTRY CONVDATE                                        SS JUL85 18880000
CONVDATE ST    R14,R14SAVE                                              18890000
         MVC   DAYTABLE,DAYMONTH                                        18900000
         XC    DOUBLE,DOUBLE                                            18910000
         MVC   0(3,R15),=X'456799' INVALID DATE IS 45/67/99             18920000
         SR    R14,R14             SETUP FOR LEAP YEAR TEST             18930000
         IC    R14,0(,R1)                                               18940000
         SLL   R14,4                                                    18950000
         ST    R14,DOUBLE+4                                             18960000
         OI    DOUBLE+7,X'0F'                                           18970000
         LR    R14,R1                                                   18980000
         AIF   ('&MVSLEV' EQ 'MVS038').MVS038A                DRK MAY09 18990000
         PUSH  ACONTROL                                       DRK AUG09 19000000
         ACONTROL FLAG(NOPAGE0)                               DRK AUG09 19010000
         TM    FLCFACL2-PSA,FLCFETF2    TP VALID (ETF-2)?     DRK AUG09 19020000
         BNO   NO#TP#A                  NO                    DRK AUG09 19030000
         POP   ACONTROL                                       DRK AUG09 19040000
         TP    DOUBLE(8)           VALID PACKED?  LFSCLAS IDR DRK MAY09 19050000
         BNZ   DAYSKIP             NO, DON'T 0C7              DRK MAY09 19060000
NO#TP#A  DS    0H                                             DRK AUG09 19070000
.MVS038A ANOP                                                 DRK AUG09 19080000
         CVB   R0,DOUBLE           GET YEAR IN BINARY                   19090000
         SR    R1,R1                                                    19100000
         SRDL  R0,2                SHIFT OFF REMAINDER OF YEAR/4        19110000
         LTR   R1,R1               THIS A LEAP YEAR?                    19120000
         BNZ   *+8                 NO, BRANCH                           19130000
         MVI   DAYTABLE+1,29       YES, FEB HAS 29 DAYS                 19140000
         SPACE 1                                                        19150000
         MVC   2(1,R15),0(R14)     YEAR RECORD CREATED                  19160000
         MVC   DOUBLE+6(2),1(R14)                                       19170000
         TM    DOUBLE+7,X'0C'      VALID SIGN?                          19180000
         BNO   DAYSKIP             NO, DON'T 0C7                        19190000
         AIF   ('&MVSLEV' EQ 'MVS038').MVS038B                DRK MAY09 19200000
         PUSH  ACONTROL                                       DRK AUG09 19210000
         ACONTROL FLAG(NOPAGE0)                               DRK AUG09 19220000
         TM    FLCFACL2-PSA,FLCFETF2    TP VALID (ETF-2)?     DRK AUG09 19230000
         BNO   NO#TP#B                  NO                    DRK AUG09 19240000
         POP   ACONTROL                                       DRK AUG09 19250000
         TP    DOUBLE+6(2)         VALID PACKED?  LFSCLAS IDR DRK MAY09 19260000
         BNZ   DAYSKIP             NO, DON'T 0C7              DRK MAY09 19270000
NO#TP#B  DS    0H                                             DRK AUG09 19280000
.MVS038B ANOP                                                 DRK AUG09 19290000
         CVB   R1,DOUBLE           GET RELATIVE DAYS IN BINARY          19300000
         SPACE 1                                                        19310000
         LA    R14,DAYTABLE                                             19320000
         SR    R0,R0                                                    19330000
DAYLOOP  IC    R0,0(R14)           DAYS THIS MONTH                      19340000
         SR    R1,R0               WITHIN THIS MONTH?                   19350000
         BNP   DAYNOW                                                   19360000
         LA    R14,1(R14)                                               19370000
         B     DAYLOOP                                                  19380000
         SPACE 1                                                        19390000
DAYNOW   AR    R1,R0               GET DAY OF THE MONTH                 19400000
         LA    R0,10                                                    19410000
         MR    R0,R0                                                    19420000
         CVD   R1,DOUBLE                                                19430000
         MVC   1(1,R15),DOUBLE+6                                        19440000
         LA    R1,DAYTABLE-1                                            19450000
         SR    R14,R1                                                   19460000
         LA    R1,10                                                    19470000
         MR    R0,R14                                                   19480000
         CVD   R1,DOUBLE                                                19490000
         MVC   0(1,R15),DOUBLE+6                                        19500000
         SPACE 1                                                        19510000
DAYSKIP  L     R14,R14SAVE                                              19520000
         BR    R14                                                      19530000
         TITLE 'P D S  --  PDS GROUP DISPLAY ROUTINE         09/28/88'  19540000
*                                                                       19550000
*        GROUP NAME DISPLAY -- UPDATES THE PDS300A MESSAGE              19560000
*                                                                       19570000
         SPACE 1                                                        19580000
DEFGROUP TM    DSORG,DS1DSGPO                  PARTITIONED?             19590000
         BNOR  R14                             NO, RETURN               19600000
         CLI   MEMBERD,0                       ANY DEFAULT YET?         19610000
         BER   R14                             NO, RETURN               19620000
         ST    R14,R14SAVE                     RETURN ADDRESS           19630000
         LA    R0,17                           MAX CHARACTERS           19640000
         L     R1,MSGENTPT                     WHERE TO START OUTPUT    19650000
         MVC   0(17,R1),BLANK128               BLANK THE OUTPUT         19660000
         TM    PMEMMIN,X'80'                   ACTIVE MEMBER LIST?      19670000
         BNO   DEFGR10                         NO, BRANCH               19680000
         MVI   0(R1),C'('                      START OF MEMBER LIST     19690000
         LA    R1,1(,R1)                       NEXT CHARACTER           19700000
         BCTR  R0,0                            ONE LESS CHARACTER       19710000
         SPACE 1                                                        19720000
DEFGR10  MVI   0(R1),C':'                      ASSUME COLON SEPARATOR   19730000
         TM    MEMBERD,FMEMBER1+FMEMBER2       ANY MEMBERS?             19740000
         BZ    DEFGR90                         NO, ASSUME ALL MEMBERS   19750000
         MVC   0(8,R1),MEMBERD+1+2             ASSUME A SINGLE MEMBER   19760000
         TM    MEMBERD,FMEM#MEM                MEMBER GROUP?            19770000
         BNO   DEFGR90                         NO, DONE                 19780000
         SPACE 1                                                        19790000
         SR    R14,R14                                                  19800000
         ICM   R14,B'0011',MEMBERD+1           MACHINE LENGTH OF MEMBER 19810000
         BNZ   DEFGR20                         MORE THAN ZERO, BRANCH   19820000
         CLI   0(R1),X'00'                     NULL FIRST OPERAND?      19830000
         BNE   DEFGR20                         NO, BRANCH               19840000
         TM    MEMBERD,FMEMRANG+FMEMASTR       RANGE OR PART MEMBER?    19850000
         BNZ   DEFGR30                         YES, BRANCH              19860000
         SPACE 1                                                        19870000
DEFGR20  AH    R14,=H'1'                       ACTUAL LENGTH            19880000
         SR    R0,R14                          OK?                      19890000
         BNP   DEFGR90                         YES, BRANCH              19900000
         AR    R1,R14                          NEXT CHARACTER START     19910000
         SPACE 1                                                        19920000
DEFGR30  MVI   0(R1),C':'                      ASSUME RANGE             19930000
         TM    MEMBERD,FMEMRANG                CORRECT?                 19940000
         BO    *+8                             YES, BRANCH              19950000
         MVI   0(R1),C'/'                      NO, PATTERN              19960000
         TM    MEMBERD,FMEMASTR                PART NAME?               19970000
         BNO   *+8                             YES, BRANCH              19980000
         MVI   0(R1),C'*'                      NO, USE *                19990000
         TM    MEMBERD,FMEMBER2                ANY MEMBER 2?            20000000
         BNO   DEFGR90                         NO, BRANCH               20010000
         MVC   1(8,R1),MEMBERD+1+2+8           ADD THE SECOND NAME      20020000
         SPACE 1                                                        20030000
DEFGR90  L     R1,MSGENTPT                     WHERE TO START OUTPUT    20040000
         TR    0(17,R1),TRLINE                 TRANSLATE TO PRINTABLE   20050000
         L     R14,R14SAVE                     RETURN ADDRESS           20060000
         BR    R14                                                      20070000
         TITLE 'P D S  --  INITIALIZATION OF SPF ENVIRONMENT 09/28/88'  20080000
*        CALL SPF; REQUEST SPF TO CALL PDS RECURSIVELY AS A DIALOG      20090000
SPFRECUR DS    0H                                                       20100000
         AIF   ('&CISP' NE 'ISPFV2').NSPF350                            20110000
         TM    FLAGSFF,FSPFOPT6         UNDER SPF AS A DIALOG?          20120000
         BOR   R2                       YES, BRANCH                     20130000
.NSPF350 ANOP                                                           20140000
         OI    FLAGSFF,FSPFERR          SPF ERROR FLAG                  20150000
         MVI   ##ADRCM#,CONTINUE+EDITOR+FABEND                          20160000
         BAS   R2,CLOSEIT               NEED TO CLOSE BEFORE SPF        20170000
         BAS   R2,DEALLDCB              AND FREE THE DATA SET           20180000
*                                                                       20190000
         ICM   R0,B'1100',PDSDATE   MM OF MM/DD/YY            ABL NOV86 20200000
         ICM   R0,B'0011',PDSDATE+3 DD OF MM/DD/YY            ABL NOV86 20210000
         ICM   R1,B'1100',PDSTIME   HH OF HH:MM               ABL NOV86 20220000
         ICM   R1,B'0011',PDSTIME+3 MM OF HH:MM               ABL NOV86 20230000
         AR    R0,R1                COMBINED                  ABL NOV86 20240000
         ST    R0,0(,R7)            SAVE DATE/TIME STAMP      ABL NOV86 20250000
*                                                                       20260000
         ESTAE 0                        *                      SS SEP89 20270000
ESTAE3   DS    0H                       Z/XDC PROBE           DRK DEC08 20280000
         MVC   ISPFTEXT+4(L'ISPF),ISPF        ISPF   PGM(PDS45678) P... 20290000
         MVC   ISPFTEXT+ISPFPGM+4(8),PDSNAME  PDS COMMAND NAME          20300000
         ST    R7,ISPFTEXT+4+ISPFPARM         ADD STORAGE ADDRESS       20310000
         UNPK  ISPFTEXT+4+ISPFPARM(9),ISPFTEXT+4+ISPFPARM(5)            20320000
         MVI   ISPFTEXT+4+ISPFPARM+8,C')'     RESTORE )                 20330000
         TR    ISPFTEXT+4+ISPFPARM(8),TRTABLE CONVERT TO EBCDIC         20340000
         CLC   PDSNAME(3),=C'PDS'       PDS... NAME?                    20350000
         BNE   SPFREC2                  NO, BRANCH                      20360000
         CLI   PDSNAME+5,C'T'           TEST IDENTIFIER?                20370000
         BNE   SPFREC2                  NO, BRANCH                      20380000
         MVC   ISPFTEXT+4+ISPFTEST(4),=C'TEST'  ADD TEST TO STRING      20390000
SPFREC2  LA    R1,L'ISPF+4              LENGTH OF STRING PASSED TO SPF  20400000
         SLL   R1,16                    CLEAR BOTTOM TWO BYTES          20410000
         ST    R1,ISPFTEXT              SAVE STRING TOTAL LENGTH        20420000
*        M$ERRST ISPFTEXT               DELETE * TO OUTPUT COMMAND      20430000
         MVI   ISPFTEXT+3,8             OFFSET OF PGM(... PARAMETER     20440000
         LA    R1,ISPFTEXT              START OF PARAMETER LIST         20450000
         ST    R1,ADDRTEXT              COMMAND ADDRESS                 20460000
         LA    R1,ADDRTEXT              START OF CPPL PARAMETERS        20470000
         LA    R15,FIRST4K              START OF EXTENDED DATA AREA     20480000
         LA    R15,ATTACHS1-FIRST4K(,R15)  FIRST PARAMETER LIST         20490000
         MVI   SPFECB,0                 CLEAR SPFECB          DRK OCT99 20500000
         ATTACH EPLOC=ISPF,ECB=SPFECB,SZERO=NO,SHSPV=78,SF=(E,(15))     20510000
         ST    R1,SPFTCB                TCB ADDRESS FOR THE SUBTASK     20520000
         WAIT  ECB=SPFECB               WAIT FOR COMPLETION             20530000
         DETACH SPFTCB                  REMOVE THIS SUBTASK             20540000
         NI    FLAGSFF,FF-FSPFCALL      SPF FLAG TURNED OFF             20550000
         SR    R5,R5                                                    20560000
         CLC   ##SUBCOM(8),$END         END SUBCOMMAND?                 20570000
         BE    RETURN8                  YES, DONE                       20580000
         OI    FLAGSFF,FSPFERR          SPF ERROR                       20590000
         B     RESTART0                 REALLOCATE THE FILE AND REOPEN  20600000
         TITLE 'P D S  --  PDS LOGGING OF SESSION DATA       09/28/88'  20610000
         SPACE 1                                                        20620000
LOGDATA  L     R0,RECOVER                   CURRENT RECOVERY ADDRESS    20630000
         ENTRY LOGDATA                                         SS JUL85 20640000
         LA    R15,FIRST4K                  SECOND WORK AREA BASE       20650000
         STM   R14,R8,LOGREGS-FIRST4K(R15)  SAVE ENTRY REGISTERS        20660000
         LA    R0,LOGD90                    LOCAL RECOVERY ADDRESS      20670000
         ST    R0,RECOVER                                               20680000
         MVC   MSGLAST(80),BLANK128         BLANK                       20690000
         LH    R14,0(,R1)                   LENGTH OF MESSAGE           20700000
         SH    R14,=H'5'                    MACHINE LENGTH VALID?       20710000
         BM    LOGD96                       NO, DO NOT LOG              20720000
         CH    R14,=H'79'                                               20730000
         BNH   *+8                          LINE LENGTH=MIN(80,ACTUAL)  20740000
         LH    R14,=H'79'                                               20750000
         MVC   MSGLAST(*-*),4(R1)          <<EXECUTED>>                 20760000
         EX    R14,*-6                     MOVE IN THE PROMPT           20770000
         LA    R0,MSGLAST                      OUTPUT THE MESSAGE       20780000
         TM    DCBRECFM-IHADCB+LOGDCB,DCBRECV  RECFM=V?                 20790000
         BNO   LOGD40                          NO, BRANCH               20800000
         CLC   0(2,R1),DCBLRECL-IHADCB+LOGDCB  LRECL OK?                20810000
         BNH   *+10                            YES, BRANCH              20820000
         MVC   0(2,R1),DCBLRECL-IHADCB+LOGDCB  NO, REDUCE LRECL         20830000
         LR    R0,R1                                                    20840000
         SPACE 1                                                        20850000
LOGD40   NI    FLAGSFF,FF-FLOGWRT           TURN OFF FOR AN ERROR       20860000
         PUT   LOGDCB,(0)                                               20870000
         OI    FLAGSFF,FLOGWRT              TURN ON -- IT IS OK         20880000
         B     LOGD96                                                   20890000
         SPACE 1                                                        20900000
LOGD90   LA    R15,FIRST4K        RECOVERY: SECOND WORK AREA BASE       20910000
         LM    R14,R8,LOGREGS-FIRST4K(R15)  RESET ENTRY REGISTERS       20920000
         MVI   CONTOPTN,0                   TURN OFF RECORDING          20930000
         MVI   OPENLIST,X'80'                                           20940000
         CLOSE (LOGDCB),MF=(E,OPENLIST)                                 20950000
         M$MSG L081                         NOTE THE CLOSE              20960000
***TEST  OI    ATTNECB,X'40'                MARK AS AN ATTENTION        20970000
LOGD96   LA    R15,FIRST4K                  SECOND WORK AREA BASE       20980000
         LM    R14,R1,LOGREGS-FIRST4K(R15)  RESET CHANGED REGISTERS     20990000
         ST    R0,RECOVER                   RESET THE RECOVERY ADDRESS  21000000
         BR    R14                                                      21010000
         TITLE 'P D S  --  PDS ATTACH EXTERNAL SUBCOMMANDS   09/28/88'  21020000
*                                                                       21030000
*        ATTACH EXTERNAL PDS SUBCOMMANDS                                21040000
*                                                                       21050000
         SPACE 3                                                        21060000
ATTACH   LA    R0,NEWSTAX                 ABEND RECOVERY (EXCEPT EDIT)  21070000
         ST    R0,RECOVER                                               21080000
         SPACE 1                                                        21090000
ATTACH2  MVC   DIRNAME,0(R3)               WHO TO CALL                  21100000
         LR    R5,R1                                                    21110000
         SPACE 2                                                        21120000
         AIF   ('&MVSLEV' LE 'MVS510').MVS510                           21130099
         LOAD  EPLOC=DIRNAME,ERRET=ATTACH4E  CHECK ALL LIBS   DRK JUL17 21140099
         B     ATTACH8                       FOUND            DRK JUL17 21150099
.MVS510  ANOP                                                           21160099
*** IN A LINKLIST LIBRARY?                                              21170000
         BLDL  0,BLDLLIST -----+           CHECK FOR A LOAD MODULE      21180000
         LA    R1,X'100'       |           TTR=1 (FOR SEQUENTIAL)       21190000
         ST    R1,DIRTTR       |           RESET TTR                    21200000
         LTR   R15,R15    <----+           IN THE LINKLIST?             21210000
         BZ    ATTACH8                     YES, LINK TO IT              21220000
         L     R15,CVTPTR(,R0)             NEED TO ALSO CHECK LPALIB    21230000
         L     R15,CVTLPDIA-CVTMAP(R15)    POINT TO LINK PACK DIRECTORY 21240000
         SPACE 2                                                        21250000
*** MODULE NOT IN LINKLIST/STEPLIB, TRY THE IN-STORAGE LPALIB DIRECTORY 21260000
ATTACH4  CLC   8(8,R15),DIRNAME            THIS MODULE NAME?            21270000
         BE    ATTACH8                     YES, LINK TO IT              21280000
         CLI   8(R15),X'FF'                END OF DIRECTORY?            21290000
         LA    R15,40(,R15)                                             21300000
         BNE   ATTACH4                     NO, BRANCH                   21310000
*** MODULE NOT IN LINKLIST/STEPLIB OR IN-STORAGE LPALIB DIRECTORY       21320099
ATTACH4E DS    0H                                             DRK JUL17 21330099
         MVC   INSERT#1(8),##SUBCAL        YES, ISSUE AN ERROR MESSAGE  21340000
         M$MSG L859$1                                                   21350000
         B     NEWCMD                                                   21360000
         SPACE 3                                                        21370000
ATTACH8  OI    ##ADRCM#,EXTERNAL          AN EXTERNAL SUBCOMMAND        21380000
         LR    R1,R5                                                    21390000
         MVI   SUBSECB,0                  CLEAR THE ATTENTION ECB       21400000
         SPACE 2                                                        21410000
         L     R4,=A(STAEEXIT)            POINT TO THE ESTAE EXIT       21420000
         LA    R15,FIRST4K                START OF EXTENDED DATA AREA   21430000
         LA    R15,ATTACHS2-FIRST4K(,R15) SECOND PARAMETER LIST         21440000
         ATTACH EPLOC=(3),ECB=SUBSECB,SZERO=NO,SHSPV=78,              XX21450000
               TERM=YES,ESTAI=((4),(7)),SF=(E,(15))                     21460000
         SPACE 2                                                        21470000
         ST    R1,SUBSTCB                 SUBTASK TCB ADDRESS           21480000
         WAIT  ECB=SUBSECB                WAIT FOR COMPLETION           21490000
         SPACE 2                                                        21500000
         NI    ##ADRCM#,FF-EXTERNAL       BACK IN PDS NOW               21510000
         XC    M99RBPTR(40),M99RBPTR      CLEAR THE WORK AREA           21520000
         LA    R1,M99RBPTR                MARK ITS DATA SETS FOR REUSE  21530000
         USING S99RBP,R1                                                21540000
         SPACE 1                                                        21550000
         LA    R4,M99RB                                                 21560000
         USING S99RB,R4                                                 21570000
         ST    R4,S99RBPTR                                              21580000
         OI    S99RBPTR,S99RBPND          MARK END OF LIST              21590000
         SPACE 1                                                        21600000
         LA    R5,M99TUPL                                               21610000
         USING S99TUPL,R5                                               21620000
         MVI   S99RBLN,20                 LENGTH 20                     21630000
         MVI   S99VERB,S99VRBRI           REMOVE IN-USE VERB            21640000
         ST    R5,S99TXTPP                POINT TO TEXT POINTER         21650000
         SPACE 1                                                        21660000
         LA    R3,M99TUNIT                                              21670000
         USING S99TUNIT,R3                                              21680000
         ST    R3,S99TUPTR                POINT TO TEXT UNITS           21690000
         OI    S99TUPTR,S99TUPLN          MARK END OF LIST              21700000
         MVI   S99TUKEY+1,1               KEY=1                         21710000
         MVI   S99TUNUM+1,1               NUMBER=1                      21720000
         MVI   S99TULNG+1,4               LENGTH OF TEXT=4              21730000
         MVC   S99TUPAR(4),SUBSTCB        SUBTASK TCB ADDRESS           21740000
         SPACE 1                                                        21750000
         DYNALLOC                                                       21760000
         SPACE 2                                                        21770000
         ICM   R1,B'1111',SUBSTCB         NEED TO BE DETACHED?          21780000
         BZR   R2                         NO, DONE                      21790000
         MVC   FULLWORD(4),SUBSTCB        PREPARE FOR THE XC            21800000
         XC    SUBSTCB(4),SUBSTCB         DO NOT DETACH AGAIN           21810000
         DETACH FULLWORD                  REMOVE THIS SUBTASK           21820000
         BR    R2                         DONE                          21830000
         DROP  R1,R3,R4,R5                                              21840000
         TITLE 'P D S  --  PDS ATTENTION EXIT ROUTINE        09/28/88'  21850000
***                                                                     21860000
***      ATTENTION EXIT ROUTINE                                         21870000
***                                                                     21880000
         SPACE 1                                                        21890000
ATTNEXIT M$ENTER ATTNEXIT                                               21900000
         MVC   PMEMHOLD(4),PMEMCURR      SAVE MEMBER LIST POSITION      21910000
         MVC   PMEMHOLD(1),FLAGSAA       SAVE MEMBER GROUP FLAG         21920000
         NI    FLAGSAA,FF-FMEM#MEM       TERMINATE ANY MEMBER GROUP     21930000
         MVC   PMEMCURR(4),PMEMMAX       TERMINATE ANY MEMBER LIST      21940000
         TM    ATTNECB,2+1             PARSE OR "ENTER OPTIONS"?        21950000
         BO    ATTNPOST                YES, "ENTER OPTIONS" -- BRANCH   21960000
         SPACE 2                                                        21970000
         TM    ##ADRPA#,$A+$D          BROWSE, ISPF OR EDIT?            21980000
         BNO   ATTN$A                  NO, BRANCH                       21990000
         STAX  ,                       CANCEL THE ATTENTION EXIT        22000000
         OI    ##ADRPA#,$F                                     SOFTATTN 22010000
         B     ATTNDONE                                                 22020000
         SPACE 2                                                        22030000
ATTN$A   TM    ##ADRPA#,$A             ATTENTIONS ACCEPTED?             22040000
         BZ    ATTNPTGT                YES, BRANCH                      22050000
         MVI   ATTNECB,0               CLEAR THE ECB                    22060000
         CLC   ##SUBCOM,$COP           COPY SUBCOMMAND?                 22070000
         BE    ATTN$A2                 YES, BRANCH                      22080000
         M$MSG L481                    COMPRESS SUBCOMMAND              22090000
         B     ATTNDONE                                                 22100000
ATTN$A2  M$MSG L485                    COPY SUBCOMMAND                  22110000
         B     ATTNDONE                                                 22120000
         SPACE 2                                                        22130000
ATTNPTGT TM    ATTNECB,X'40'           PREVIOUS ATTENTION CLEARED?      22140000
         BNZ   ATTNLOOP                NO, BRANCH                       22150000
         TCLEARQ INPUT                 SYNCHRONIZE INPUT QUEUE AGAIN    22160000
         OI    FLAGSII,FATTNPRO        FLAG FOR PROMPT INPUT ONLY       22170000
         L     R2,R14PTGT              M$PUTGT IS NOT RECURSIVE         22180000
         L     R1,MSGENTDA             POINT TO ENTER OPTIONS MESSAGE   22190000
        M$PUTGT (R1)                   PROMPT WITH "ENTER OPTIONS"      22200000
         ST    R2,R14PTGT              M$PUTGT IS NOT RECURSIVE         22210000
         TM    FLAGSBB,FNULL           NULL LINE ENTERED?               22220000
         BO    ATTNBACK                YES, UNDO ATTENTION              22230000
         OI    FLAGSBB,FCMD            NO, INDICATE COMMAND AVAILABLE   22240000
         B     ATTNPOST                                                 22250000
ATTNBACK MVC   PMEMCURR(4),PMEMHOLD    RESET MEMBER LIST POSITION       22260000
         TM    PMEMHOLD,FMEM#MEM       MEMBER GROUP IN PROGRESS?        22270000
         BNO   ATTNDONE                NO, BRANCH                       22280000
         OI    FLAGSAA,FMEM#MEM        RESET ANY MEMBER GROUP           22290000
         B     ATTNDONE                                                 22300000
         SPACE 2                                                        22310000
ATTNPOST LA    R1,ATTNECB                                               22320000
         TM    ##ADRCM#,EXTERNAL       ATTENTION FOR INTERNAL PDS CODE? 22330000
         BZ    ATTNPOS2                YES, BRANCH                      22340000
         L     R2,SUBSTCB              SUBTASK TCB ADDRESS              22350000
         STATUS STOP,TCB=(2)           STOP THE SUBTASK                 22360000
         LA    R1,SUBSECB              SUBCOMMAND ECB                   22370000
ATTNPOS2 POST  (1)                     NOTIFY OF ATTENTION ENTERED      22380000
         XC    ADDRSUMR,ADDRSUMR       CLEAR THE SUMMARY ADDRESS        22390000
         XC    ATTRCNT2(4+4),ATTRCNT2  CLEAR COUNTS                     22400000
         XC    ATTRTOT2(8+8),ATTRTOT2  CLEAR TOTALS                     22410000
         XC    PARMLIST(28),PARMLIST   CLEAR THE STACK PARAMETER LIST   22420000
         LA    R1,PARMLIST                                              22430000
         L     R14,ADDRUPT                                              22440000
         L     R15,ADDRECT                                              22450000
         LA    R0,PARMLIST+24                                           22460000
         STM   R14,R0,IOPLUPT-IOPL(R1) FOR IOPLUPT, IOPLECT & IOPLECB   22470000
         L     R15,ADDRSTCK            STACK ROUTINE START              22480000
         STACK PARM=PARMLIST+16,DELETE=ALL,MF=(E,(1)),ENTRY=(15)        22490000
         SPACE 1                                                        22500000
ATTNDONE SR    R15,R15                 ATTENTION PROCESSED              22510000
         M$EXIT                                                         22520000
         SPACE 1                                                        22530000
ATTNLOOP MVI   ATTNECB,0               CLEAR THE ATTENTION ECB FOR NOW  22540000
         M$MSG L470                    POSSIBLE LOOP MESSAGE            22550000
         OI    ##ADRPA#,$Q             NO ABEND MSG, QUIET MODE         22560000
         DC    H'0'                    *** S0C1 ABEND TO RESTART PDS ** 22570000
         TITLE 'P D S  --  PDS ESTAE EXIT ROUTINE            09/28/88'  22580000
         ENTRY STAEEXIT                                        SS JUL85 22590000
STAEEXIT CSECT                                                          22600000
         USING *,R15                    TEMPORARY BASE                  22610000
         CH    R0,STAECD                WORK AREA PROVIDED?             22620000
         BNE   STAE02                   YES, BRANCH                     22630000
         SR    R15,R15                  NO RETRY TO BE ATTEMPTED        22640000
         BR    R14                      RETURN                          22650000
         DROP  R15                                                      22660000
STAECD   DC    H'12'                                                    22670000
         SPACE 1                                                        22680000
STAE02   STM   R14,R12,12(R13)          SAVE REGISTERS                  22690000
         LR    R5,R1                    SDWA POINTER                    22700000
         USING SDWA,R5                                                  22710000
         L     R7,SDWAPARM              WORK AREA ADDRESS               22720000
         LR    R8,R15                   BASE REGISTER                   22730000
         USING STAEEXIT,R8                                              22740000
         AIF   ('&MVSLEV' LT 'MVS220').MVS22A                  SS JUL88 22750000
         L     R1,CVTPTR(,R0)           *                      SS JUL88 22760000
         TM    CVTDCB-CVT(R1),CVTMVSE   REALLY XA              SS JUL88 22770000
         BZ    *+4+4+2                  NO, SKIP  BSM          SS JUL88 22780000
         LA    R1,*+4+2                 POINT AFTER BSM        SS JUL88 22790000
         BSM   0,R1                     SET MODE 24            SS JUL88 22800000
.MVS22A  ANOP                                                  SS JUL88 22810000
         LA    R15,FIRST4K                                              22820000
         LA    R15,STAESAVE-FIRST4K(,R15)  STAE SAVE AREA               22830000
         ST    R13,4(,R15)                                              22840000
         ST    R15,8(,R13)                                              22850000
         LR    R13,R15                                                  22860000
         LM    R9,R12,BASES                                             22870000
         MVC   INSERT#1,MSGABE          ABEND MESSAGE                   22880000
         L     R0,SDWAABCC              ABEND CODE                      22890000
         SRDL  R0,12                    SHIFT USER ABEND TO R1          22900000
         ST    R0,FULLWORD              SYSTEM ABEND CODE               22910000
         UNPK  INSERT#1(5),FULLWORD+2(3)                                22920000
         TR    INSERT#1(4),TRTABLE                                      22930000
         MVI   INSERT#1,C'S'                                            22940000
         MVI   INSERT#1+4,X'40'                                         22950000
         SRL   R1,20                    USER ABEND                      22960000
         CVD   R1,DOUBLE                                                22970000
         UNPK  DOUBLE(5),DOUBLE+5(3)                          ABL NOV86 22980000
         OI    DOUBLE+4,X'F0'                 MAKE PRINTABLE  ABL NOV86 22990000
         MVC   INSERT#1+MSGABEUS(4),DOUBLE+1  GET USER ABEND  ABL NOV86 23000000
         TR    SDWANAME(8),TRLINE             MAKE DISPLAYABLE          23010000
         MVC   INSERT#1+MSGABEPG(8),SDWANAME  PROGRAM NAME              23020000
         SR    R0,R0                                                    23030000
         SR    R1,R1                                                    23040000
         ICM   R0,B'0111',SDWANXTP            NEXT INSTRUCTION          23050000
         ICM   R1,B'0111',SDWAEPA+1           ENTRY POINT ADDRESS ZERO? 23060000
         BNZ   STAE10                         NO, BRANCH                23070000
         LR    R1,R9                          PDS ENTRY POINT ADDRESS   23080000
         CLI   INSERT#1+MSGABEPG,C'.'         UNPRINTABLE NAME?         23090000
         BNE   STAE10                         NO, BRANCH                23100000
         MVC   INSERT#1+MSGABEPG(8),PDSNAME   YES, USE PDS MAINLINE     23110000
         SPACE 1                                                        23120000
STAE10   TM    FLAGSJJ,FTSOCMD                TSOCMD VERIFICATION?      23130000
         BNO   STAE12                         NO, BRANCH                23140000
         L     R1,=V(VTSOCMD)                 YES, ACTUAL START         23150000
         MVC   INSERT#1+MSGABEPG(8),=CL8'VTSOCMD'                       23160000
         SPACE 1                                                        23170000
STAE12   TM    FLAGSJJ,FSUBCMD                SUBCMD VERIFICATION?      23180000
         BNO   STAE14                         NO, BRANCH                23190000
         L     R1,=V(VSUBCMD)                 YES, ACTUAL START         23200000
         MVC   INSERT#1+MSGABEPG(8),=CL8'VSUBCMD'                       23210000
         SPACE 1                                                        23220000
STAE14   NI    FLAGSJJ,FF-FTSOCMD-FSUBCMD     RESET ESTAE FLAGS         23230000
         SR    R0,R1                          OFFSET TO ERROR POSITIVE? 23240000
         BP    STAE16                         YES, BRANCH               23250000
         AR    R0,R1                          NO, USE ERROR LOCATION    23260000
         SR    R1,R1                                                    23270000
         SPACE 1                                                        23280000
STAE16   CLI   SDWANAME,C'.'                  DISPLAYABLE?              23290000
         BNE   STAE20                         YES, BRANCH               23300000
         MVC   INSERT#1+MSGABEAT-1(27),INSERT#1+MSGABEAT-2              23310000
         AR    R0,R1                          NO, USE ERROR LOCATION    23320000
         SPACE 1                                                        23330000
STAE20   LR    R2,R0                          BEST OFFSET SO FAR        23340000
         CLC   INSERT#1+MSGABEPG(8),PDSNAME   PDS MAINLINE?             23350000
         BNE   STAE24                         NO, BRANCH                23360000
         LA    R3,STAEADDR-12                 START OF ADDRESS LIST -12 23370000
         SPACE 1                                                        23380000
STAE22   LA    R3,12(,R3)                     NEXT ADDRESS POINTER      23390000
         CLI   0(R3),X'FF'                    END OF ADDRESSES?         23400000
         BE    STAE24                         YES, BRANCH               23410000
         SR    R0,R0                                                    23420000
         SR    R1,R1                                                    23430000
         ICM   R0,B'0111',SDWANXTP            NEXT INSTRUCTION          23440000
         ICM   R1,B'0111',1(R3)               POSSIBLE ASSEMBLY GROUP   23450000
         SR    R0,R1                          OFFSET TO ERROR VALID?    23460000
         BM    STAE22                         NO, BRANCH                23470000
         CR    R0,R2                          CLOSER FIT?               23480000
         BH    STAE22                         NO, BRANCH                23490000
         LR    R2,R0                          YES, USE THIS OFFSET      23500000
         MVC   INSERT#1+MSGABEPG(8),4(R3)     AND USE THIS LABEL        23510000
         B     STAE22                                                   23520000
         SPACE 1                                                        23530000
STAE24   ST    R2,FULLWORD                                              23540000
         UNPK  INSERT#1+MSGABEAT(7),FULLWORD+1(4)                       23550000
         TR    INSERT#1+MSGABEAT(6),TRTABLE                             23560000
         MVI   INSERT#1+MSGABEAT+6,X'40'                                23570000
         CLM   R2,B'0111',SDWANXTP            ADJUSTED ADDRESS?         23580000
         BNE   *+8                            YES, BRANCH               23590000
         MVI   INSERT#1+MSGABEAT-1,X'40'      NO, CLEAR THE + SIGN      23600000
         SPACE 1                                                        23610000
         CLC   INSERT#1+2(2),=C'3E'           S*3E ABEND?               23620000
         BE    STAE60                         YES, IGNORE THIS ABEND    23630000
***TEST  FROM TENNIE                                                    23640000
***TEST  CLC   INSERT#1+2(2),=C'22'           S*3E ABEND?               23650000
***TEST  BE    STAE60                         YES, IGNORE THIS ABEND    23660000
***TEST  NI    SPFFLAG0,255-SPFDON            TURN OFF DIALOG MODE      23670000
         TM    ##ADRPA#,$Q                    QUIET MODE?               23680000
         BO    STAE30                         YES, BRANCH               23690000
         L     R2,MTADDR-1                    SAVE CURRENT PARM#1       23700000
         LA    R1,INSERT#1                    START OF THIS INSERT      23710000
         ST    R1,MTADDR-1                    TELL IKJEFF02             23720000
         MVI   MTLEN,MSGABEND-MSGABE          LENGTH FOR THIS MESSAGE   23730000
         M$MSG L999$1                         ABEND ERROR MESSAGE       23740000
         ST    R2,MTADDR-1                    RESET CURRENT PARM#1      23750000
         SPACE 1                                                        23760000
         TCLEARQ INPUT                        CLEAR ANY INPUT           23770000
         XC    PARMLIST(28),PARMLIST          CLEAR THE STACK           23780000
         LA    R1,PARMLIST                    AREA FOR STACK PARM LIST  23790000
         SPACE 1                                                        23800000
         L     R2,ADDRUPT                                               23810000
         L     R3,ADDRECT                                               23820000
         LA    R4,PARMLIST+24                                           23830000
         STM   R2,R4,IOPLUPT-IOPL(R1)         IOPLUPT, IOPLECT, IOPLECB 23840000
         SPACE 2                                                        23850000
         L     R15,ADDRSTCK                   STACK ROUTINE             23860000
         STACK PARM=PARMLIST+16,DELETE=ALL,MF=(E,(1)),ENTRY=(15)        23870000
         SPACE 1                                                        23880000
         NI    FLAGSAA,FF-FMEM#MEM            TURN OFF ANY MEMBER GROUP 23890000
         MVC   PMEMCURR(4),PMEMMAX      TERMINATE ANY MEMBER LIST       23900000
         SPACE 2                                                        23910000
STAE30   LR    R1,R5                    SDWA START                      23920000
         STM   R0,R15,SDWASRSV          RESET THE RETURN REGISTERS      23930000
         LR    R0,R7                    MAIN SAVE AREA ADDRESS          23940000
         TM    FLAGSFF,FSPFCALL         SPF INITIALIZED?                23950000
         BNO   STAE31                   NO, BRANCH                      23960000
         LA    R2,FIRST4K                                               23970000
         LA    R0,SPFMAIN-FIRST4K(,R2)  SAVEAREA WHEN PDS IS A DIALOGUE 23980000
STAE31   ST    R0,SDWASR13              RESET REGISTER 13               23990000
         SR    R2,R2                                                    24000000
         ICM   R2,B'0111',RECOVER+1     ANY ABEND RECOVERY ADDRESS?     24010000
         BZ    STAE60                   NO, BRANCH                      24020000
         CLC   INSERT#1+2(2),=C'22'     S*22 ABEND?                     24030000
         BE    STAE60                   YES, RECOVERY NOT POSSIBLE      24040000
         TM    ##ADRPA#,$Q              QUIET MODE?                     24050000
         BO    STAE32                   YES, BRANCH                     24060000
         TM    FLAGSGG,FRECVCON         STAE RECOVERY DISALLOWED?       24070000
         BO    STAE60                   YES, BRANCH                     24080000
         SPACE 1                                                        24090000
STAE32   TM    ##ADRCM#,EXTERNAL        EXTERNAL SUBCOMMAND?            24100000
         BO    STAE40                   YES, BRANCH                     24110000
         TM    ##ADRCM#,CONTINUE+FABEND CONTINUE THROUGH RECOVERY?      24120000
         BO    STAE35                   YES, BRANCH                     24130000
         NI    ##ADRCM#,FF-CONTINUE     TURN OFF ANY CONTINUATION       24140000
STAE35   LR    R1,R5                    PDS ABENDED !!!                 24150000
         L     R13,4(,R13)                                              24160000
         SETRP REGS=(14,12),RC=4,RETADDR=(2),RETREGS=YES,FRESDWA=YES    24170000
         SPACE 2                                                        24180000
STAE40   POST  SUBSECB                  NOTIFY OF ATTENTION ENTERED     24190000
         SPACE 1                                                        24200000
STAE60   NI    FLAGSAA,FF-FMEM#MEM      TURN OFF ANY MEMBER GROUP       24210000
         MVC   PMEMCURR(4),PMEMMAX      TERMINATE ANY MEMBER LIST       24220000
         L     R13,4(,R13)                                              24230000
         LR    R1,R5                    SDWA POINTER                    24240000
         SETRP REGS=(14,12),RC=0        NO RECOVERY                     24250000
         SPACE 2                                                        24260000
* KEEP THESE CSECT NAMES/ENTRY SYMBOLS IN LOAD MODULE ORDER   DRK FEB10 24270099
STAEADDR DC    A(PDSMAIN),CL8'PDSMAIN'                                  24280000
         DC    V(ALIAS),CL8'ALIAS'                                      24290000
         DC    V(AMBLIST),CL8'AMBLIST'                                  24300000
         DC    V(ATTRIB),CL8'ATTRIB'                                    24310000
         DC    V(BROWSE),CL8'BROWSE'                                    24320000
         DC    V(CLEAR),CL8'CLEAR'                                      24330000
         DC    V(CHANGE),CL8'CHANGE'                                    24340000
         DC    V(COBANAL),CL8'COBANAL'                                  24350000
         DC    V(COMPARE),CL8'COMPARE'                                  24360000
         DC    V(COMPRESS),CL8'COMPRESS'                                24370000
         DC    V(CONTROL),CL8'CONTROL'                                  24380000
         DC    V(COPY),CL8'COPY'                                        24390000
         DC    V(CPKMAP),CL8'CPKMAP'                                    24400000
         DC    V(DELETE),CL8'DELETE'                                    24410000
         DC    V(DELINK),CL8'DELINK'                                    24420000
         DC    V(DISASM),CL8'DISASM'                                    24430000
         DC    V(DISPLAY),CL8'DISPLAY'                                  24440000
         DC    V(DSNAMES),CL8'DSNAMES'                                  24450000
         DC    V(EXEC),CL8'EXEC'                                        24460000
         DC    V(FIXPDS),CL8'FIXPDS'                                    24470000
         DC    V(HELP),CL8'HELP'                                        24480000
         DC    V(HISTORY),CL8'HISTORY'                                  24490000
         DC    V(IF),CL8'IF'                                            24500000
         DC    V(LCS),CL8'LCS'                                          24510000
         DC    V(LIST),CL8'LIST'                                        24520000
         DC    V(LMA),CL8'LMA'                                          24530000
         DC    V(MAP),CL8'MAP'                                          24540000
         DC    V(MATCH),CL8'MATCH'                                      24550080
         DC    V(MXIBAT),CL8'MXIBAT'                                    24560000
         DC    V(OFFLOAD),CL8'OFFLOAD'                                  24570000
         DC    V(OUTCOPY),CL8'OUTCOPY'                                  24580000
         DC    V(PRINTOFF),CL8'PRINTOFF'                                24590079
         DC    V(PTSEXP),CL8'PTSEXP'                                    24600079
         DC    V(RENAME),CL8'RENAME'                                    24610079
         DC    V(REPRO),CL8'REPRO'                                      24620079
         DC    V(RESTORE),CL8'RESTORE'                                  24630079
         DC    V(SEPARATE),CL8'LOAD'                                    24640079
         DC    V(SMPGEN),CL8'SMPGEN'                                    24650079
         DC    V(SRCHFOR),CL8'SRCHFOR'                                  24660079
         DC    V(SUBLIST),CL8'SUBLIST'                                  24670079
         DC    V(RX),CL8'RX'                                            24680079
         DC    V(TIME),CL8'TIME'                                        24690079
         DC    V(TSO),CL8'TSO'                                          24700079
         DC    V(TSOEDIT),CL8'TSOEDIT'                                  24710079
         DC    V(USAGE),CL8'USAGE'                                      24720079
         DC    V(FAMS),CL8'FAMS'          ENTRY SYMBOL                  24730099
         DC    V(VERIFY),CL8'VERIFY'                                    24740099
         DC    V(VPDSE),CL8'VPDSE'                                      24750099
         DC    V(XMIT),CL8'XMIT'                                        24760000
         DC    V(PARSE),CL8'PARSE'                                      24770000
         DC    V(ISPDSPY),CL8'ISPDSPY'                                  24780000
         DC    X'FF'                                                    24790000
         SPACE 2                                                        24800000
MSGABE   DC    C'S123 U1234 AT +123456 IN PROGRAM 12345678'             24810000
MSGABEUS EQU   6                 USER ERROR CODE                        24820000
MSGABEAT EQU   MSGABEUS+9        OFFSET TO ERROR                        24830000
MSGABEPG EQU   MSGABEAT+18       PROGRAM NAME                           24840000
MSGABEND DS    0X                END OF MSGABE MESSAGE                  24850000
         DROP  R5,R8                                                    24860000
PDSMAIN  CSECT                                                          24870000
         TITLE 'P D S  --  PDS MEMBER IN USE CHECKING        09/28/88'  24880000
*                                                                       24890000
*        MEMBER IN USE CHECKS                                           24900000
*                                                                       24910000
         SPACE 2                                                        24920000
ENQMTEST MVC   PARMLIST(4),ENQTEST     INITIALIZE ENQUEUE PARAMETERS    24930000
         ENQ   (SPFEDIT,DSNAME,E,52,SYSTEMS),RET=TEST,MF=(E,PARMLIST)   24940000
         SR    R1,R1                                                    24950000
         LTR   R15,R15                 MEMBER IN USE?                   24960000
         BZ    4(,R2)                  NO, SKIP ONE INSTRUCTION         24970000
         SPACE 1                                                        24980000
         AIF   ('&MVSLEV' LT 'MVS13X').NMVS13A                          24990000
         XC    PARMLIST(48),PARMLIST                                    25000000
         GQSCAN AREA=(WORKTBL,296),RESNAME=(SPFEDIT,DSNAME,52),        X25010000
               REQLIM=1,SCOPE=ALL,MF=(E,PARMLIST)                       25020000
         SR    R1,R1                                                    25030000
         CH    R15,=H'4'               ALLOCATED?                       25040000
         BE    4(,R2)                  NO, RETURN                       25050000
         LA    R1,L862                 ERROR?                           25060000
         BH    MSGNEWXX                YES, TERMINATE                   25070000
         LH    R14,WORKTBL+RIBVLEN-RIB         VARIABLE SECTION LENGTH  25080000
         LA    R14,WORKTBL+RIBEND-RIB(R14)     START OF RIB ENTRY       25090000
         MVC   INSERT#2(8),RIBEJBNM-RIBE(R14)  JOBNAME                  25100000
         AGO   .GOTQCB                                                  25110000
.NMVS13A ANOP                                                           25120000
         MVC   INSERT#2(8),=CL8'????????'  NAME IF NOT ON SP 1.3 SYSTEM 25130000
         L     R14,CVTPTR(,R0)         --> CVT                          25140000
         LA    R14,640(,R14)           --> FIRST QCB                    25150000
***TEST  LA    R14,TESTQCB  ***TEST    --> TEST STRUCTURE               25160000
         SPACE 1                                                        25170000
ENQ2     ICM   R14,B'0111',1(R14)      ANY MORE MAJORS?                 25180000
         BZ    ENQDONE                 NO, USE ????????                 25190000
         CLC   16(8,R14),SPFEDIT       SPFEDIT MAJOR?                   25200000
         BNE   ENQ2                    NO, CONTINUE LOOKING             25210000
         SPACE 1                                                        25220000
         LA    R14,8(,R14)             POINT TO START OF MINOR LIST     25230000
ENQ4     ICM   R14,B'0111',1(R14)      ANY MORE MINORS?                 25240000
         BZ    ENQDONE                 NO, USE ????????                 25250000
         CLI   16(R14),52              SAME LENGTH?                     25260000
         BNE   ENQ4                    NO, NO MATCH                     25270000
         CLC   DSNAME(52),20(R14)      THE SAME MINOR?                  25280000
         BNE   ENQ4                    NO, BRANCH                       25290000
         SPACE 1                                                        25300000
         L     R1,8(,R14)              FIRST (AND ONLY) QEL             25310000
         MVC   INSERT#2-2(2),14(R1)    ASID VALUE                       25320000
         L     R1,CVTPTR(,R0)          --> CVT                          25330000
         L     R14,556(,R1)            --> ASVT                         25340000
         LA    R15,520(,R14)           --> ENTRY ADDRESS -4             25350000
         L     R0,516(,R14)            NUMBER OF ASID'S                 25360000
         SPACE 1                                                        25370000
         CNOP  0,8                     ALIGN FOR LOOP                   25380000
ENQ6     LA    R15,4(,R15)             NEXT ENTRY                       25390000
         TM    0(R15),X'80'            IN USE?                          25400000
         BO    ENQ8                    NO, BRANCH                       25410000
         L     R1,0(,R15)              --> ASCB                         25420000
         CLC   INSERT#2-2(2),36(R1)    THIS ASCB?                       25430000
         BE    ENQ10                   YES, BRANCH                      25440000
ENQ8     BCT   R0,ENQ6                 CHECK ALL ACTIVE ASID'S          25450000
         B     ENQDONE                 NOT FOUND, USE ????????          25460000
         SPACE 1                                                        25470000
ENQ10    ICM   R15,B'1111',172(R1)     INITIATED PROGRAM JOBNAME        25480000
         BNP   ENQ12                   NO, BRANCH                       25490000
         MVC   INSERT#2(8),0(R15)      YES, GET THE JOBNAME             25500000
         B     ENQDONE                                                  25510000
ENQ12    ICM   R15,B'1111',176(R1)     JOBNAME FOR START/MOUNT/LOGON    25520000
         BNP   ENQ14                   NO, CANNOT LOCATE                25530000
         MVC   INSERT#2(8),0(R15)      YES, GET THE JOBNAME             25540000
         B     ENQDONE                                                  25550000
ENQ14    MVC   INSERT#2(8),=CL8'SYSTEM'                                 25560000
         ICM   R15,B'1111',56(R1)      CSCB?                            25570000
         BNP   ENQDONE                 NO, BRANCH                       25580000
         MVC   INSERT#2(8),8(R15)      YES, GET THE JOBNAME             25590000
         SPACE 3                                                        25600000
         AGO   .GOTQCB      ***TEST                                     25610000
         B     ENQDONE                                                  25620000
         LA    R14,TESTQCB             --> TEST STRUCTURE               25630000
TESTQCB  DC    A(TESTQCB2)                                              25640000
TESTQCB2 DC    A(TESTQCB3),A(0),A(MINOR1),A(0),CL8'SYSDSN'              25650000
TESTQCB3 DC    A(00000000),A(0),A(MINOR2),A(0),CL8'SPFEDIT'             25660000
MINOR1   DC    CL2'NOT USED'                                            25670000
MINOR2   DC    A(MINOR3),A(0),A(TESTQEL1),A(0),AL1(52),AL3(0)           25680000
         DC    CL44'HABL.LIB.CNTL',CL8'XXXXXXXX'                        25690000
MINOR3   DC    A(0),A(0),A(TESTQEL2),A(0),AL1(52),AL3(0)                25700000
         DC    CL44'HABL.LIB.CNTL',CL8'PDSMAIN'                         25710000
TESTQEL1 DC    A(0),A(0),A(0),AL2(0),AL2(1)                             25720000
TESTQEL2 DC    A(0),A(0),A(0),AL2(0),AL2(2)                             25730000
         SPACE 3                                                        25740000
.GOTQCB  ANOP                                                           25750000
ENQDONE  DS    0H                                                       25760000
         MVI   MTLEN,8                 EIGHT CHARACTER MEMBER NAME      25770000
         MVI   MTLEN+4,8               EIGHT CHARACTER JOBNAME          25780000
         MVC   INSERT#1(8),DSNMEMQ     MEMBER IN USE                    25790000
         LA    R1,L850$2               ERROR MESSAGE                    25800000
         TM    ##ADRPA#,$Q             QUIET MODE CHECK?                25810000
         BOR   R2                      YES, RETURN                      25820000
         M$MSG (R1)                    YES, MESSAGE                     25830000
         BR    R2                                  AND ERROR RETURN     25840000
         TITLE 'P D S  --  PDS STANDARD MESSAGES             09/28/88'  25850000
*                                                                       25860000
*        SUBCOMMAND MESSAGE SUBROUTINES                                 25870000
*                                                                       25880000
         SPACE 3                                                        25890000
NOMEMBER LA    R1,L853$1              MSG - (MEMBER) NOT FOUND          25900000
         MVC   INSERT#1(8),DIRNAME                                      25910000
         CLI   INSERT#1,C'*'          * MEMBER NAME?                    25920000
         BNE   MSGNEW                 NO, BRANCH                        25930000
         CLI   INSERT#1+1,X'40'       *BLANK MEMBER NAME?               25940000
         BNE   MSGNEW                 NO, BRANCH                        25950000
         LA    R1,L858                YES, USE PDS858 INSTEAD           25960000
         B     MSGNEW                                                   25970000
         SPACE 3                                                        25980000
IOERROR  LA    R1,L836                MSG - I/O ERROR IN DIRECTORY      25990000
         CH    R15,=H'16'             RC > 16?                DRK AUG05 26000000
         BNH   MSGNEWXX               NO, THEN PDS836 MESSAGE DRK AUG05 26010000
IOERRORE DS    0H                                                       26020000
         CVD   R15,DOUBLE             RETURN CODE             DRK AUG05 26030000
         MVC   DOUBLE(4),=X'40212020' EDIT MASK               DRK AUG05 26040000
         ED    DOUBLE(4),DOUBLE+6                             DRK AUG05 26050000
         MVI   MTLEN,19                                       DRK AUG05 26060000
         MVC   INSERT#1(20),=C'R15=NN, R0=NNNNNNNN '          DRK AUG05 26070000
         MVC   INSERT#1+4(2),DOUBLE+2                         DRK AUG05 26080000
         ST    R0,FULLWORD            REASON CODE             DRK SEP05 26090000
         UNPK  INSERT#1+11(9),FULLWORD(5) CONVERT TO HEX      DRK SEP05 26100000
         TR    INSERT#1+11(8),TRTABLE   CONVERT TO PRINTABLE  DRK SEP05 26110000
         MVI   INSERT#1+11+8,X'40'                            DRK SEP05 26120000
         M$MSG L856$1                 STOW MESSAGE            DRK AUG05 26130000
         NI    FLAGSAA,FF-FMEM#MEM    TURN OFF ANY MEMBER GROUP         26140000
         MVC   PMEMCURR(4),PMEMMAX    TERMINATE ANY MEMBER LIST         26150000
         B     NEWCMD                                         DRK AUG05 26160000
         SPACE 3                                                        26170000
MSGNEWXX NI    FLAGSAA,FF-FMEM#MEM       TURN OFF ANY MEMBER GROUP      26180000
         MVC   PMEMCURR(4),PMEMMAX       TERMINATE ANY MEMBER LIST      26190000
         SPACE 2                                                        26200000
MSGNEW   M$MSG (R1)                   OUTPUT THE MESSAGE REFERRED TO    26210000
         B     NEWCMD                   AND GET A NEW SUBCOMMAND        26220000
         TITLE 'P D S  --  PDS IKJEFF02 SETUP PROCESSING     09/28/88'  26230000
*                                                                       26240000
*        IKJEFF02 SETUP PROCESSING                                      26250000
*                                                                       26260000
         SPACE 1                                                        26270000
$TMSGRT  CLI   0(R1),C'0'               IKJEFF02 CALL?                  26280000
         BL    MESSAGE0                 NO, BRANCH                      26290000
         ST    R14,R14PUTT              SAVE RETURN ADDRESS             26300000
         MVC   MTMSGID+1(3),0(R1)       MESSAGE IDENTIFIER              26310000
         TR    INSERT#1(8),TRLINE       TRANSLATE ANY MEMBER NAME       26320000
         CLI   0(R1),C'4'               WARNING OR ERROR MESSAGE?       26330000
         BL    $TMSGRT5                 NO, BRANCH                      26340000
         LA    R0,3*5/3                 NUMBER OF MESSAGES TO SAVE      26350000
         LA    R15,ERRORMSG-3           START OF MESSAGES -3            26360000
         SPACE 1                                                        26370000
         CNOP  0,8                      ALIGN FOR LOOP                  26380000
$TMSGRT2 LA    R15,3(,R15)              NEXT SAVED MESSAGE ID           26390000
         CLC   0(3,R15),0(R1)           THIS MESSAGE?                   26400000
         BE    $TMSGRT5                 YES, BRANCH                     26410000
         CLI   0(R15),X'00'             EMPTY SLOT?                     26420000
         BNE   $TMSGRT3                 NO, BRANCH                      26430000
         MVC   0(3,R15),0(R1)           YES, SAVE THIS MESSAGE ID       26440000
         B     $TMSGRT5                                                 26450000
$TMSGRT3 BCT   R0,$TMSGRT2              CONTINUE FOR ALL POSITIONS      26460000
         MVC   ERRORMSG(3*5),ERRORMSG+3 SLIDE UP BY ONE ENTRY           26470000
         MVC   ERRORMSG+3*5-3(3),0(R1)  SAVE THIS NEW ENTRY             26480000
         SPACE 1                                                        26490000
$TMSGRT5 LA    R15,PARTADDR-4           PARTITIONED SEARCH LIST -4      26500000
         L     R1,PARTADDR              INITIALIZE FOR THE LOOP         26510000
         CNOP  0,8                      ALIGN FOR LOOP                  26520000
$TMSGRT7 LA    R15,4(,R15)              NEXT LIST ENTRY                 26530000
         LR    R0,R1                    SAVE FOR OVERRUN                26540000
         L     R1,0(,R15)               POINTER IN MSGCSECT             26550000
         CLI   0(R1),X'40'              END OF MSGCSECT?                26560000
         BE    $TMSGRT9                 YES, BRANCH                     26570000
         CLC   1(3,R1),MTMSGID+1        IN THIS PARTITION ELEMENT?      26580000
         BNH   $TMSGRT7                 NO, BRANCH                      26590000
         SPACE 1                                                        26600000
$TMSGRT9 ST    R0,MTCSECTP              START OF MESSAGE CSECT          26610000
         LA    R1,MTPLPTR               START OF PARAMETER LIST         26620000
         L     R15,ADDRFF02             START OF IKJEFF02               26630000
         BASR  R14,R15                  FORMAT THIS MESSAGE             26640000
         SPACE 1                                                        26650000
         L     R14,R14PUTT              LOAD RETURN ADDRESS             26660000
         L     R1,MTEXTRCT              ADDRESS OF EXTRACTED MESSAGE    26670000
         CLC   4(3,R1),=C'PDS'          PDS ROUTINE MESSAGE?            26680000
         BNE   MESSAGE0                 NO, BRANCH                      26690000
         TM    SPFLAG0,SPFDON           SPF DISPLAY MODE ON    SS SEP84 26700000
         BO    MESSAGE0                 YES, WANT MSGIDS       SS SEP84 26710000
         L     R15,ADDRUPT              ADDRESS OF THE UPT              26720000
         TM    UPTSWS-UPT(R15),UPTMID   MESSAGE ID DESIRED?             26730000
         BO    MESSAGE0                 YES, BRANCH                     26740000
         LH    R0,0(,R1)                CURRENT LENGTH                  26750000
         SH    R0,=H'8'                 LESS EIGHT                      26760000
         SLL   R0,16                    SHIFT TO CORRECT POSITION       26770000
         ST    R0,8(,R1)                STORE OVER MESSAGE-ID           26780000
         LA    R1,8(,R1)                POINT TO NEW LENGTH WORD        26790000
         B     MESSAGE0                                                 26800000
         TITLE 'P D S  --  PDS MESSAGE/PUTLINE PROCESSING    09/28/88'  26810000
*                                                                       26820000
*        M$ERRST PROCESSING (MULTILEVEL MESSAGES HAVE BEEN DISABLED)    26830000
*                                                                       26840000
         SPACE 1                                                        26850000
MESSTXT1 LA    R1,MSGTEXT1              OUTPUT MSGTEXT1                 26860000
         SPACE 1                                                        26870000
MESSAGE0 ST    R14,R14PUTM              SAVE LINKAGE REGISTER           26880000
        M$PUTLIN (R1),ATTN=NEWCMD       DEFAULT INTERRUPT ADDRESS       26890000
         L     R14,R14PUTM              RESTORE LINKAGE REGISTER        26900000
         BR    R14                      RETURN                          26910000
         SPACE 3                                                        26920000
*                                                                       26930000
*        PUTLINE PROCESSING                                             26940000
*                                                                       26950000
         SPACE 1                                                        26960000
M$PUTLIN TM    ATTNECB,X'40'          ATTN OCCUR?                       26970000
         BOR   R14                    YES, IMMEDIATE RETURN             26980000
         ST    R14,R14PUTL                                              26990000
         TM    FLAGSFF,FLOGWRT        LOG RECORDING?                    27000000
         BNO   PUTLINE1               NO, BRANCH                        27010000
         ST    R14,R14PUTL2           SECONDARY PUTLINE RETURN ADDRESS  27020000
         L     R14,R14PUTM                                              27030000
         ST    R14,R14PUTL2+4                                           27040000
         BAS   R14,LOGDATA            YES, LINK TO LOG ROUTINE          27050000
         L     R14,R14PUTL2+4                                           27060000
         ST    R14,R14PUTM            LINKAGE FOR MESSAGE0              27070000
         L     R14,R14PUTL2                                             27080000
         ST    R14,R14PUTL                                              27090000
PUTLINE1 DS    0H                                                       27100000
         SPACE 1                                                        27110000
         TM    SPFLAG0,SPFDON         DIALOG DISPLAY MODE      SS JUL84 27120000
         BZ    SPFNO1                 NO                       SS JUL84 27130000
         MVI   SPFLAG1,SPFPUTL        FUNCTION TYPE            SS JUL84 27140000
         L     R15,=V(ISPDSPY)                                 SS JUL84 27150000
         TM    ##ADRCM#,EXTERNAL      EXTERNAL SUBCOMMAND?    ABL NOV84 27160000
         BNOR  R15                    NO, CALL ISPMODE        ABL NOV84 27170000
         CLC   4(6,R1),=C'PDS999'     PDS ABEND MESSAGE?      ABL NOV84 27180000
         BNER  R15                    NO, CALL ISPMODE        ABL NOV84 27190000
*** ISPMODE CANNOT ISSUE THIS ERROR MESSAGE ???               ABL NOV84 27200000
SPFNO1   DS    0H                                              SS JUL84 27210000
         SPACE 1                                                        27220000
         LR    R0,R1                  SAVE DATA LINE POINTER            27230000
         LA    R1,PARMLIST                                              27240000
         USING IOPL,R1                                                  27250000
         L     R14,ADDRUPT                                              27260000
         L     R15,ADDRECT                                              27270000
         STM   R14,R15,IOPLUPT       INITIALIZE IOPLUPT AND IOPLECT     27280000
         SPACE 1                                                        27290000
         LA    R15,ATTNECB                                              27300000
         ST    R15,IOPLECB           INITIALIZE IOPLECB                 27310000
         DROP  R1                                                       27320000
         SPACE 1                                                        27330000
         TM    FLAGSEE,FNOTTERM      FROM A CLIST SOURCE?               27340000
         BNO   PUTLINE4              NO, BRANCH                         27350000
         CLI   CONTOPTN,03           CONTROL DSN OUTPUT?                27360000
         BNE   PUTLINE4              NO, BRANCH                         27370000
         L     R14,R14PUTL           RETURN ADDRESS                     27380000
         B     4(R14)                RETURN ADDRESS (+4)                27390000
PUTLINE4 DS    0H                                                       27400000
**                                                                      27410000
         L     R15,ADDRPUTL                                             27420000
         SPACE 2                                                        27430000
         PUTLINE PARM=PUTLPARM,ENTRY=(15),MF=(E,(1)),                  X27440000
               OUTPUT=((0),TERM,SINGLE,DATA),                          X27450000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK)                       27460000
         SPACE 2                                                        27470000
         L     R14,R14PUTL           RETURN ADDRESS (+0 OR +4)          27480000
         TM    ATTNECB,X'40'         ATTN OCCUR?                        27490000
         BOR   R14                   YES, RETURN AT +0                  27500000
         SPACE 2                                                        27510000
         CH    R15,=H'4'             PUTLINE ERROR SIGNALLED?           27520000
         BNH   4(R14)                NO, RETURN AT +4                   27530000
         SPACE 2                                                        27540000
         LA    R1,PUTLINER           ERROR MESSAGE                      27550000
         LA    R0,L'PUTLINER         ERROR MESSAGE LENGTH               27560000
         TPUT  (1),(0),R             PUTLINE FAILED                     27570000
         SPACE 2                                                        27580000
         L     R1,PUTLPARM+4         START OF OUTPUT MESSAGE            27590000
         LA    R1,4(,R1)             LESS LENGTH CODE                   27600000
         LA    R0,79                 FIRST 79 BYTES                     27610000
         TPUT  (1),(0),R             INVALID OUTPUT TEXT                27620000
         SPACE 2                                                        27630000
         NOP   NEWCMD                LOCATION FOR TEST COMMAND          27640000
         DC    H'0'                  FORCE AN ABEND CLEANUP             27650000
         SPACE 2                                                        27660000
PUTLINER DC    C'*** PUTLINE FAILED, RC > 4; DATA WAS:'                 27670000
         TITLE 'P D S  --  PDS PUTGET PROCESSING             09/28/88'  27680000
*                                                                       27690000
*        PUTGET PROCESSING                                              27700000
*                                                                       27710000
         SPACE 1                                                        27720000
M$PUTGT  TM    ATTNECB,X'40'         ATTN OCCUR?                        27730000
         BOR   R14                   YES, IMMEDIATE RETURN              27740000
         LA    R0,1                  ONLY ONE SEGMENT                   27750000
         STM   R0,R1,PUTOLD1                                            27760000
         ST    R14,R14PTGT                                              27770000
         TM    FLAGSFF,FLOGWRT       LOG RECORDING?                     27780000
         BNO   PUTGT01               NO, BRANCH                         27790000
         ST    R14,R14PUTL2+8                                           27800000
         BAS   R14,LOGDATA           YES, LINK TO LOG ROUTINE           27810000
         L     R14,R14PUTL2+8                                           27820000
         ST    R14,R14PTGT                                              27830000
         L     R1,PUTOLD1+4          PROMPT MESSAGE                     27840000
PUTGT01  DS    0H                                                       27850000
         SPACE 1                                                        27860000
         TM    SPFLAG0,SPFDON         DIALOG DISPLAY MODE      SS JUL84 27870000
         BZ    SPFNO2                 NO                       SS JUL84 27880000
         MVI   SPFLAG1,SPFPTGET       FUNCTION TYPE            SS JUL84 27890000
         L     R15,=V(ISPDSPY)                                 SS JUL84 27900000
         BR    R15                                             SS JUL84 27910000
SPFNO2   DS    0H                                              SS JUL84 27920000
         NI    FLAGSBB,FF-FNULL                                         27930000
         SPACE 1                                                        27940000
         LA    R0,1                  ONLY ONE SEGMENT                   27950000
         STM   R0,R1,PUTOLD1                                            27960000
         SPACE 2                                                        27970000
PUTGT02  LA    R1,PARMLIST                                              27980000
         L     R14,ADDRUPT                                              27990000
         L     R15,ADDRECT                                              28000000
         LA    R0,ATTNECB                                               28010000
         STM   R14,R0,IOPLUPT-IOPL(R1)  INITIALIZE IOPLUPT, IOPLECT,    28020000
*                                                  AND IOPLECB          28030000
         TM    FLAGSJJ,FSTACKED         STACKED DATA?         ABL NOV86 28040000
         BNO   PUTGT03                  NO, BRANCH            ABL NOV86 28050000
         L     R15,PUTOLD1+4            PROMPT MESSAGE        ABL NOV86 28060000
         CLC   4(7,R15),PDS300A+4       ENTER OPTIONS?        ABL NOV86 28070000
         BE    PUTGT20                  YES, BRANCH           ABL NOV86 28080000
PUTGT03  DS    0H                                             ABL NOV86 28090000
         L     R15,ADDRPTGT                                             28100000
         LA    R14,PTGTPARM             LOAD PARM ADDRESS               28110000
         MVI   00(R14),X'10'            SINGLE LEVEL                    28120000
         MVI   01(R14),X'80'            MODE MESSAGE                    28130000
         MVI   08(R14),X'00'            PUTGET                          28140000
         MVI   10(R14),X'80'            TGET EDIT                       28150000
         LA    R0,PUTOLD1               ADDRESS OF OUTPUT               28160000
         ST    R0,4(,R14)                                               28170000
         SPACE 1                                                        28180000
         TM    FLAGSII,FATTNPRO         ATTENTION PROCESSING?           28190000
         BNO   PUTGT04                  NO, BRANCH                      28200000
         MVI   08(R14),X'10'            TERM PROCESSING                 28210000
         NI    FLAGSII,FF-FATTNPRO      NOT ATTENTION PROCESSING        28220000
         SPACE 1                                                        28230000
PUTGT04  PUTGET PARM=PTGTPARM,MF=(E,(1)),ENTRY=(15),                   X28240000
               TERMPUT=(EDIT,WAIT,NOHOLD,NOBREAK)                       28250000
         STC   R15,PARMLIST          SAVE RETURN CODE                   28260000
         NI    FLAGSEE,FF-FNOTTERM   ASSUME INPUT WAS FROM THE TERMINAL 28270000
         CLI   PARMLIST,4            CORRECT?                           28280000
         BNE   *+8                   YES, BRANCH                        28290000
         OI    FLAGSEE,FNOTTERM      NO, NOT FROM THE TERMINAL          28300000
         SPACE 1                                                        28310000
         CLI   PARMLIST,12           PUTGET STATUS:                     28320000
         BH    EXIT8N                  ERROR -- BRANCH                  28330000
         BL    PUTGT10                 SUCCESSFUL, STACK OR ATTENTION   28340000
         L     R1,ADDRECT              STACK, 2ND-LEVEL MSG., NO PAUSE  28350000
         OI    ECTMSGF-ECT(R1),X'80' IGNORE SECOND LEVEL MESSAGES AND   28360000
         B     PUTGT02               GET THE DATA FROM THE STACK        28370000
         SPACE 3                                                        28380000
PUTGT10  SR    R15,R15               ASSUME RETURN AT +0                28390000
         TM    ATTNECB,X'40'         ATTN OCCUR?                        28400000
         BO    PUTGT80               YES, BRANCH                        28410000
         SPACE 1                                                        28420000
         LA    R1,PTGTPARM           PUTGET PARM AREA START             28430000
         L     R1,PGPBIBUF-PGPB(R1)  INPUT BUFFER ADDRESS               28440000
         XC    PUTGETBF(256),PUTGETBF                         ABL NOV86 28450000
         SPACE 2                                                        28460000
         LH    R14,0(,R1)            SUBCOMMAND LENGTH                  28470000
         CH    R14,=H'256'           MORE THAN PDS'S LIMIT?             28480000
         BNH   *+8                   NO, BRANCH                         28490000
         LH    R14,=H'256'           YES, USE THE CURRENT LIMIT         28500000
         BCTR  R14,0                 MACHINE LENGTH OF THIS LINE        28510000
         MVC   PUTGETBF(*-*),0(R1)   <<EXECUTED>>                       28520000
         EX    R14,*-6               SAVE THE ENTERED LINE              28530000
         SPACE 2                                                        28540000
         LH    R0,0(R1)              BUFFER LENGTH                      28550000
         ICM   R0,B'1000',=X'01'     SUBPOOL IS 1                       28560000
         SPACE 1                                                        28570000
         FREEMAIN R,LV=(0),A=(1)     RELEASE THE INPUT BUFFER           28580000
         B     PUTGT30                                        ABL NOV86 28590000
         SPACE 2                                              ABL NOV86 28600000
PUTGT20  LA    R15,FIRST4K                                    ABL NOV86 28610000
         MVC   PUTGETBF(256),PUTGETST-FIRST4K(R15)            ABL NOV86 28620000
         NI    FLAGSJJ,FF-FSTACKED                            ABL NOV86 28630000
         SPACE 2                                              ABL NOV86 28640000
*UTGT30  NI    FLAGSJJ,FF-FSTACKED                            ABL NOV86 28650000
PUTGT30  LH    R14,PUTGETBF          STRING LENGTH            ABL NOV86 28660000
         SH    R14,=H'4'             LESS HEADER LENGTH       ABL NOV86 28670000
         BNP   PUTGT60               NULL, BRANCH             ABL NOV86 28680000
         LA    R1,PUTGETBF+3                                  ABL NOV86 28690000
         SPACE 1                                              ABL NOV86 28700000
         CNOP  0,8                   ALIGN FOR LOOP                     28710000
PUTGT40  LA    R1,1(,R1)             FIND                     ABL NOV86 28720000
         CLI   0(R1),C';'                FIRST                ABL NOV86 28730000
         BE    PUTGT50                        SEMICOLON       ABL NOV86 28740000
         BCT   R14,PUTGT40           FOUND?                   ABL NOV86 28750000
         B     PUTGT60               NO, BRANCH               ABL NOV86 28760000
         SPACE 2                                              ABL NOV86 28770000
PUTGT50  MVI   0(R1),X'40'           BLANK THE SEMICOLON      ABL NOV86 28780000
         LCR   R0,R14                - REMAINING LENGTH       ABL NOV86 28790000
         SH    R14,=H'2'             SKIP ; MACHINE LENGTH OK?ABL NOV86 28800000
         BNP   PUTGT60               NO, BRANCH               ABL NOV86 28810000
         OC    1(*-*,R1),1(R1)       <<EXECUTED>>             ABL NOV86 28820000
         EX    R14,*-6               ANY FOLLOWING DATA?      ABL NOV86 28830000
         BZ    PUTGT60               NO, BRANCH               ABL NOV86 28840000
         OI    FLAGSJJ,FSTACKED      STACKED DATA NOW         ABL NOV86 28850000
         AH    R0,PUTGETBF           LESS NUMBER              ABL NOV86 28860000
         STH   R0,PUTGETBF                      REMOVED       ABL NOV86 28870000
         LA    R15,FIRST4K                                    ABL NOV86 28880000
         XC    PUTGETST-FIRST4K(256,R15),PUTGETST-FIRST4K(R15)    NOV86 28890000
         MVC   PUTGETST-FIRST4K+4(*-*,R15),1(R1)  <<EXECUTED>>ABL NOV86 28900000
         EX    R14,*-6               MOVE TO SECOND STRING    ABL NOV86 28910000
         LA    R0,5(,R14)            LENGTH OF SECOND STRING  ABL NOV86 28920000
         STH   R0,PUTGETST-FIRST4K(R15)                       ABL NOV86 28930000
         XC    1(*-*,R1),1(R1)       <<EXECUTED>>             ABL NOV86 28940000
         EX    R14,*-6               CLEAR AFTER SEMICOLON    ABL NOV86 28950000
PUTGT60  DS    0H                                             ABL NOV86 28960000
         SPACE 2                                                        28970000
         LA    R1,PUTGETBF           ADDRESS OF INPUT LINE              28980000
         ST    R1,ADDRCBUF           SAVE THE LINE ADDRESS              28990000
         SPACE 1                                                        29000000
         TM    FLAGSFF,FLOGWRT       LOG RECORDING?                     29010000
         BNO   PUTGT70               NO, BRANCH                         29020000
         L     R14,R14PTGT                                              29030000
         ST    R14,R14PUTL2+12                                          29040000
         L     R1,ADDRCBUF           USER RESPONSE                      29050000
         BAS   R14,LOGDATA           YES, LINK TO LOG ROUTINE           29060000
         L     R14,R14PUTL2+12                                          29070000
         ST    R14,R14PTGT                                              29080000
         SPACE 2                                                        29090000
PUTGT70  LA    R15,4                 ASSUME RETURN AT +4                29100000
         CH    R15,PUTGETBF          A NULL LINE?                       29110000
         BL    PUTGT80               NO, BRANCH                         29120000
         OI    FLAGSBB,FNULL         YES, INDICATE A NULL LINE          29130000
         SPACE 2                                                        29140000
PUTGT80  L     R14,R14PTGT                                              29150000
         B     0(R14,R15)                                               29160000
         TITLE 'P D S  --  PDS DATA SET ALLOCATION           09/28/88'  29170000
*                                                                       29180000
*        DATA SET ALLOCATION SUBROUTINE                                 29190000
*                                                                       29200000
         SPACE 2                                                        29210000
ALLOCATE CSECT                                                          29220000
         USING *,R8                                                     29230000
         LR    R8,R15                                                   29240000
         ST    R14,R14SAVE             SAVE LINKAGE REGISTER            29250000
         NI    FLAGSCC,FF-FVOLSET      CLEAR VOLUME SET FLAG            29260000
         SPACE 2                                                        29270000
DYNA010  NI    FLAGSCC,FF-FPERMDS      CLEAR PERMANENT STATUS           29280000
         SPACE 2                                                        29290000
         XC    M99RBPTR(40),M99RBPTR    CLEAR THE WORK AREA             29300000
         LA    R1,M99RBPTR              DYNAMIC ALLOCATION              29310000
         USING S99RBP,R1                                                29320000
         SPACE 1                                                        29330000
         LA    R4,M99RB                                                 29340000
         USING S99RB,R4                                                 29350000
         ST    R4,S99RBPTR                                              29360000
         OI    S99RBPTR,S99RBPND        MARK END OF LIST                29370000
         SPACE 1                                                        29380000
         LA    R5,M99TUPL                                               29390000
         USING S99TUPL,R5                                               29400000
         MVI   S99RBLN,20               LENGTH 20                       29410000
         MVI   S99VERB,S99VRBAL         ALLOCATE                        29420000
         ST    R5,S99TXTPP              POINT TO TEXT POINTERS          29430000
         LA    R3,WORKTBL                        START OF TEXT          29440000
         SPACE 1                                                        29450000
         MVC   0(L'ALLDDNAM,R3),ALLDDNAM         SPECIFY DDNAME TEXT    29460000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     29470000
         LA    R3,L'ALLDDNAM(,R3)                START OF NEXT TEXT     29480000
         SPACE 1                                                        29490000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   29500000
         MVC   0(L'ALLDSORG,R3),ALLDSORG         SPECIFY DSORG TEXT     29510000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     29520000
         LA    R3,L'ALLDSORG(,R3)                START OF NEXT TEXT     29530000
         SPACE 1                                                        29540000
         TM    FLAGSBB,FNOTFILE                  FILENAME ENTERED?      29550000
         BO    DYNA080                           NO, BRANCH             29560000
         SPACE 1                                                        29570000
*** FILE NAME ALLOCATION                                                29580000
* GET DSN FROM DDNAME + CAT NUMBER      *                      SS JUL88 29590000
         L     R1,PSATOLD-PSA(,R0)       ACT TCB               SS JUL88 29600000
         L     R1,TCBJSCB-TCBRBP(R1)     JSCB                  SS JUL88 29610000
         L     R1,JSCDSABQ-IEZJSCB(R1)   DSAB QUE              SS JUL88 29620000
         L     R15,12(,R1)               FIRST DSAB            SS JUL88 29630000
         USING DSAB,R15                                        SS JUL88 29640000
DYNA020  DS    0H                       *                      SS JUL88 29650000
         LTR   R15,R15                  END OF THE LINE        SS JUL88 29660000
         BZ    DYNA050                  NO DDNAME              SS JUL88 29670000
         L     R1,DSABTIOT                                     SS JUL88 29680000
         CLC   4(8,R1),DDNAMEH          THIS DDNAME            SS JUL88 29690000
         BE    DYNA025                  YES                    SS JUL88 29700000
         L     R15,DSABFCHN             NEXT DSAB              SS JUL88 29710000
         B     DYNA020                  CONTINUE SEARCH        SS JUL88 29720000
DYNA025  DS    0H                       *                      SS JUL88 29730000
         LR    R14,R15                  SAVE DSAB ADDR         SS JUL88 29740000
         L     R15,DSABFCHN             NEXT ENTRY             SS JUL88 29750000
         LTR   R15,R15                  ANY ENTRY              SS JUL88 29760000
         BZ    DYNA050                  NO DDNAME              SS JUL88 29770000
         LA    R0,1                     ASSUME ONLY ONE        SS JUL88 29780000
         L     R1,DSABTIOT                                     SS JUL88 29790000
         CLC   4(8,R1),BLANKS           CONCATENATED           SS JUL88 29800000
         BNE   DYNA035                  NO                     SS JUL88 29810000
         LR    R15,R14                  START WITH FIRST       SS JUL88 29820000
         SR    R0,R0                    ZERO COUNTER           SS JUL88 29830000
DYNA030  DS    0H                       *                      SS JUL88 29840000
         A     R0,=F'1'                 ADD ONE                SS JUL88 29850000
         CH    R0,CONCATNM              IS THIS THE NUMBER     SS JUL88 29860000
         BNL   DYNA036                  YES                   ABL AUG88 29870000
         LR    R14,R15                  SAVE PREV              SS JUL88 29880000
         L     R15,DSABFCHN             NEXT ENTRY             SS JUL88 29890000
         LTR   R15,R15                  ANY ENTRY              SS JUL88 29900000
         BZ    DYNA035                  USE LAST ENTRY         SS JUL88 29910000
         L     R1,DSABTIOT                                     SS JUL88 29920000
         CLC   4(8,R1),BLANKS           CONCATENATED           SS JUL88 29930000
         BE    DYNA030                  YES, CONTINUE SEARCH   SS JUL88 29940000
DYNA035  DS    0H                       *                      SS JUL88 29950000
         STC   R0,DDNAMEN               CAT NUMBER OF          SS JUL88 29960000
         B     DYNA040                  DONE WITH SEARCH       SS JUL88 29970000
DYNA036  DS    0H                       *                      SS JUL88 29980000
         LR    R14,R15                  SAVE GOOD ENTRY        SS JUL88 29990000
         STC   R0,DDNAMEN               CAT NUMBER OF          SS JUL88 30000000
DYNA037  DS    0H                       *                      SS JUL88 30010000
         L     R15,DSABFCHN             NEXT ENTRY             SS JUL88 30020000
         LTR   R15,R15                  ANY ENTRY              SS JUL88 30030000
         BZ    DYNA040                  FOUND LAST ENTRY       SS JUL88 30040000
         L     R1,DSABTIOT                                     SS JUL88 30050000
         CLC   4(8,R1),BLANKS           CONCATENATED           SS JUL88 30060000
         BNE   DYNA040                  NO, END SEARCH         SS JUL88 30070000
         A     R0,=F'1'                 ADD ONE                SS JUL88 30080000
         B     DYNA037                  TRY NEXT ONE           SS JUL88 30090000
DYNA040  DS    0H                       *                      SS JUL88 30100000
         LR    R15,R14                  THIS ENTRY IS THE ONE  SS JUL88 30110000
         STC   R0,DDNAMEM               NUMBER IN CAT          SS JUL88 30120000
         L     R1,DSABTIOT                                     SS JUL88 30130000
         USING TIOENTRY,R1                                     SS JUL88 30140000
         SR    R14,R14                  *                      SS JUL88 30150000
         ICM   R14,7,TIOEFSRT           UCB ADDRESS            SS JUL88 30160000
         TM    0(R14),X'80'             UCB FOR VID DEVICE     SS MAR89 30170000
         BO    DYNA050                  YES,  NO VOLUME SERIAL SS MAR89 30180000
         CLI   UCBTYP+2(R14),X'20'      IS IT DASD             SS JUL88 30190000
         BNE   DYNA065                  NO,  CANNOT USE        SS JUL88 30200000
         MVC   VOLUME(6),UCBVOLI(R14)   VOL SER                SS JUL88 30210000
         AIF   ('&MVSLEV' GE 'MVS220').MVS22C                  SS JUL88 30220000
         ICM   R1,7,TIOEJFCB                                   SS JUL88 30230000
         LA    R1,16(,R1)        OVER HEADER                   SS JUL88 30240000
         MVC   DSNAME(44),0(R1)         MOVE DSN               SS JUL88 30250000
         AGO   .MVS22CX                                        SS JUL88 30260000
.MVS22C  ANOP                                                  SS JUL88 30270000
         L     R1,CVTPTR(,R0)           *                      SS JUL88 30280000
         TM    CVTDCB-CVT(R1),CVTMVSE   REALLY XA              SS JUL88 30290000
         BZ    *+4+4+4+2                NO, SKIP  BSM          SS JUL88 30300000
         LA    R1,*+4+4+2               POINT AFTER BSM        SS JUL88 30310000
         O     R1,=X'80000000'          31 BIT MODE            SS JUL88 30320000
         BSM   0,R1                     SET MODE               SS JUL88 30330000
*        L     R1,DSABSIOT              POINT TO SIOT          SS JUL88 30340000
*        L     R1,SJFCBPTR-SIOT(R1)     JFCB ADDR              SS JUL88 30350000
*        MVC   DSNAME(44),0(R1)         MOVE DSN               SS JUL88 30360000
         SPACE 1                                                        30370000
         L     R1,DSABTIOT              POINT TO TIOT         DRK AUG99 30380000
         DROP  R15                                            DRK AUG99 30390000
         USING TIOENTRY,R1                                    DRK AUG99 30400000
         LA    R6,EPA                   POINT TO EPA          DRK AUG99 30410000
         ST    R6,SWEPAPTR              INITIALIZE EPA PTR    DRK AUG99 30420000
         USING ZB505,R6                                       DRK AUG99 30430000
         XC    SWAEPAX,SWAEPAX          INITIALIZE THE EPA    DRK AUG99 30440000
         MVC   SWVA,TIOEJFCB            SVA OF JFCB INTO EPA  DRK AUG99 30450000
         PUSH  ACONTROL                                        DP MAY08 30460099
         ACONTROL FLAG(NOPAGE0)                                DP MAY08 30470099
         SWAREQ FCODE=RL,               LOCATE                DRK AUG99X30480000
               EPA=SWEPAPTR,             JFCB                 DRK AUG99X30490000
               MF=(E,PARMLIST),           IN                  DRK AUG99X30500000
               UNAUTH=YES                  SWA                DRK AUG99 30510000
         POP   ACONTROL                                        DP MAY08 30520099
         L     R1,SWBLKPTR              SET PTR TO THE JFCB   DRK AUG99 30530000
         USING INFMJFCB,R1              ADDRESS JFCB          DRK AUG99 30540000
         MVC   DSNAME(44),JFCBDSNM      MOVE DSN              DRK AUG99 30550000
         SPACE 1                                                        30560000
         L     R1,CVTPTR(,R0)           *                      SS JUL88 30570000
         TM    CVTDCB-CVT(R1),CVTMVSE   REALLY XA              SS JUL88 30580000
         BZ    *+4+4+2                  NO, SKIP  BSM          SS JUL88 30590000
         LA    R1,*+4+2                 POINT AFTER BSM        SS JUL88 30600000
         BSM   0,R1                     SET MODE 24            SS JUL88 30610000
         DROP  R1,R6                                          DRK DEC02 30620000
.MVS22CX ANOP                                                  SS JUL88 30630000
         OI    FLAGSBB,FNOTFILE                  IGNORE FILE NOW        30640000
         LA    R0,44                                                    30650000
         LA    R1,DSNAME+44                                             30660000
         SPACE 1                                                        30670000
         CNOP  0,8                               ALIGN FOR LOOP         30680000
DYNA042  BCTR  R1,0                              BACK UP ONE BYTE       30690000
         CLI   0(R1),X'40'                       BLANK?                 30700000
         BNE   DYNA044                           NO, BRANCH             30710000
         BCT   R0,DYNA042                        YES, FIND NONBLANK     30720000
         SPACE 1                                                        30730000
DYNA044  STH   R0,DSNLEN                         UPDATE DSNAME LENGTH   30740000
         B     DYNA080                                                  30750000
         SPACE 1                                                        30760000
DYNA050  LA    R1,M99RBPTR                                              30770000
         USING S99RBP,R1                                                30780000
         MVI   S99VERB,S99VRBIN                  REQUEST INFORMATION    30790000
         MVI   WORKTBL+1,X'01'                   SPECIFY DDNAME KEY     30800000
         MVC   WORKTBL+6(8),DDNAMEH              SPECIFY DDNAME         30810000
         MVC   DDNAME(8),DDNAMEH                 SAVE DDNAME            30820000
         MVI   WORKTBL+6+8+1,X'0A'               REQUEST DSORG          30830000
         SPACE 1                                                        30840000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   30850000
         MVC   0(L'ALLDSNAM,R3),ALLDSNAM         SPECIFY DSNAME TEXT    30860000
         MVI   1(R3),X'05'                       REQUEST DSNAME KEY     30870000
         MVC   6(44,R3),BLANK128                 BLANK DSNAME           30880000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     30890000
         OI    S99TUPTR,X'80'                    MARK END OF LIST       30900000
         SPACE 1                                                        30910000
         DYNALLOC                                                       30920000
         SPACE 1                                                        30930000
         LTR   R15,R15                           ANY PROBLEM?           30940000
         BNZ   DYNA400                           YES, BRANCH            30950000
         SPACE 1                                                        30960000
         MVC   DSNLEN(46),4(R3)                  GET DSN AND LENGTH     30970000
         MVC   DSORG(2),WORKTBL+20               SAVE RETURNED DSORG    30980000
         MVC   VOLUME(8),BLANKS                                         30990000
         MVI   VOLALLOC,X'40'                    VOLUME IS NOT KNOWN    31000000
         L     R1,PSATOLD-PSA(,R0)               --> CURRENT TCB        31010000
         L     R1,X'00C'(,R1)                    --> TIOT               31020000
         LA    R15,24                            OFFSET TO TIOENTRY     31030000
         SPACE 1                                                        31040000
DYNA060  LA    R1,0(R15,R1)                      NEXT ENTRY             31050000
         CLI   0(R1),0                           END OF TIOT?           31060000
         BE    DYNA200                           YES, BRANCH            31070000
         SR    R15,R15                                                  31080000
         IC    R15,0(,R1)                                               31090000
         CLC   4(8,R1),DDNAME                    THIS DDNAME?           31100000
         BNE   DYNA060                           NO, BRANCH             31110000
         SPACE 1                                                        31120000
         L     R14,16(,R1)                       POINT TO UCB           31130000
         TM    18(R14),X'20'                     DASD?                  31140000
         BO    DYNA070                           YES, BRANCH            31150000
DYNA065  M$MSG L843                              NO, ERROR MESSAGE      31160000
         B     DYNA440                                                  31170000
         SPACE 1                                                        31180000
DYNA070  MVC   VOLUME(6),28(R14)                 SAVE VOLUME NAME       31190000
         MVC   VOLALLOC(6),28(R14)               SAVE VOLUME NAME       31200000
         B     DYNA200                                                  31210000
         SPACE 3                                                        31220000
*** ALLOCATION BY DATA SET NAME                                         31230000
DYNA080  DS    0H                                                       31240000
         AIF   ('&CISP' EQ '').NOSPF2                         DRK NOV02 31250000
         AIF   ('&DSLIST' NE 'YES').NODSL1                    DRK NOV02 31260000
*                                                             DRK NOV02 31270000
* CHECK FOR ENTRY FROM DSLIST (ISRUDL)                        DRK NOV02 31280000
*                                                             DRK NOV02 31290000
DSLIST   DS    0H                                             DRK JUN07 31300000
         TM    FLAGSZZ,FALLOCI          INITIAL ALLOCATION?   DRK NOV02 31310000
         BO    DSLISTX                  NO                    DRK NOV02 31320000
         CLI   VOLUME,X'40'             ANY VOLUME SPECIFIED? DRK NOV02 31330000
         BNE   DSLISTX                  YES                   DRK NOV02 31340000
         L     R1,PSATOLD-PSA(,R0)      PSATOLD               DRK NOV02 31350000
         L     R1,X'84'(,R1)            TCBOTC (ISPTASK)      DRK NOV02 31360000
         L     R1,X'00'(,R1)            TCBRBP                DRK NOV02 31370000
         L     R1,X'0C'(,R1)            RBCDE                 DRK NOV02 31380000
         CLC   8(8,R1),=CL8'ISRDSLST'   ISRDSLST? MAJOR CDE   AJF MAR07 31390099
         BE    UZVOLSER                 YES                   AJF MAR07 31400000
*        CLC   8(8,R1),=CL8'ISRUDA'     ISRUDA?   MINOR CDE   DRK FEB10 31410099
*        BE    UZVOLSER                 YES                   DRK FEB10 31420000
         CLC   8(8,R1),=CL8'ISRUDL'     ISRUDL?   MAJOR CDE   DRK NOV02 31430099
         BNE   DSLISTX                  NO                    DRK NOV02 31440000
UZVOLSER DS    0H                                             AJF MAR07 31450000
         SR    R0,R0                    ZERO R0               DRK NOV02 31460000
         C     R0,ISPLINK               ISPLINK LOADED?       DRK NOV02 31470000
         BNZ   VDEFINE                  YES                   DRK NOV02 31480000
         LOAD  EP=ISPLINK,ERRET=DSLISTX NO                    DRK NOV02 31490000
         ST    R0,ISPLINK                                     DRK NOV02 31500000
VDEFINE  DS    0H                                             DRK NOV02 31510000
         MVC   MSGTEXT2+50(6),BLANKS    CLEAR OUTPUT FIELD    DRK NOV02 31520000
         LA    R1,=CL8'VDEFINE'         VDEFINE               DRK NOV02 31530000
         ST    R1,MSGTEXT2+20                                 DRK NOV02 31540000
         LA    R1,=C'(ZDLVOL)'          ZDLVOL                DRK JAN08 31550000
         ST    R1,MSGTEXT2+20+4                               DRK NOV02 31560000
         LA    R1,MSGTEXT2+50           WHERE TO PLACE OUTPUT DRK NOV02 31570000
         ST    R1,MSGTEXT2+20+8                               DRK NOV02 31580000
         LA    R1,=CL8'CHAR'            CHARACTER             DRK NOV02 31590000
         ST    R1,MSGTEXT2+20+12                              DRK NOV02 31600000
         LA    R15,6                    LENGTH 6              DRK NOV02 31610000
         ST    R15,FULLWORD                                   DRK NOV02 31620000
         LA    R1,FULLWORD              USE AS PARM           DRK NOV02 31630000
         ST    R1,MSGTEXT2+20+16                              DRK NOV02 31640000
         OI    MSGTEXT2+20+16,X'80'     END OF LIST           DRK NOV02 31650000
         LA    R1,MSGTEXT2+20           START OF PARM LIST    DRK NOV02 31660000
         L     R15,ISPLINK                                    DRK NOV02 31670000
         BASR  R14,R15                                        DRK NOV02 31680000
         LA    R1,=CL8'VDEFINE'         VDEFINE               DRK JAN08 31690000
         ST    R1,MSGTEXT2+20                                 DRK JAN08 31700000
         LA    R1,=C'(ZDLCMD)'          ZDLCMD L=53           DRK JAN08 31710000
         ST    R1,MSGTEXT2+20+4                               DRK JAN08 31720000
         LA    R1,MSGTEXT2+50+6         WHERE TO PLACE OUTPUT DRK JAN08 31730000
         ST    R1,MSGTEXT2+20+8                               DRK JAN08 31740000
         LA    R1,=CL8'CHAR'            CHARACTER             DRK JAN08 31750000
         ST    R1,MSGTEXT2+20+12                              DRK JAN08 31760000
         LA    R15,53                   LENGTH 53             DRK JAN08 31770000
         ST    R15,FULLWORD                                   DRK JAN08 31780000
         LA    R1,FULLWORD              USE AS PARM           DRK JAN08 31790000
         ST    R1,MSGTEXT2+20+16                              DRK JAN08 31800000
         OI    MSGTEXT2+20+16,X'80'     END OF LIST           DRK JAN08 31810000
         LA    R1,MSGTEXT2+20           START OF PARM LIST    DRK JAN08 31820000
         L     R15,ISPLINK                                    DRK JAN08 31830000
         BASR  R14,R15                                        DRK JAN08 31840000
VGET     DS    0H                                             DRK NOV02 31850000
         LA    R1,=CL8'VGET'            VGET                  DRK NOV02 31860000
         ST    R1,MSGTEXT2+20                                 DRK NOV02 31870000
         LA    R1,=C'(ZDLVOL ZDLCMD)'   ZDLVOL, ZDLCMD        DRK JUN07 31880000
         ST    R1,MSGTEXT2+20+4                               DRK NOV02 31890000
         LA    R1,=CL8'SHARED'          SHARED                DRK NOV02 31900000
         ST    R1,MSGTEXT2+20+8                               DRK NOV02 31910000
         OI    MSGTEXT2+20+8,X'80'      END OF LIST           DRK NOV02 31920000
         LA    R1,MSGTEXT2+20           START OF PARM LIST    DRK NOV02 31930000
         L     R15,ISPLINK                                    DRK NOV02 31940000
         BASR  R14,R15                                        DRK NOV02 31950000
         LTR   R15,R15                  SUCCESSFUL VGET?      DRK NOV02 31960000
         BNZ   VDELETE                  NO, BRANCH            DRK NOV02 31970000
*        CLI   MSGTEXT2+50+6,C' '       ZDLCMD NULL?          DRK JUN07 31980000
*        BE    VDELETE                  YES                   DRK JUN07 31990000
         SPACE 1                                                        32000000
         OC    MSGTEXT2+50+6(3),=C'   ' FOLD TO UPPERCASE     DRK FEB10 32010000
         CLC   MSGTEXT2+50+6(3),=C'PDS' ZDLCMD = PDS?         DRK FEB10 32020000
         BNE   VDELETE                  NO, THEN IGNORE       DRK FEB10 32030000
         SPACE 1                                                        32040000
         CLC   MSGTEXT2+50(6),=C'&MIGVOL' HSM MIGRATED?       DRK SEP07 32050000
         BE    VDELETE                    YES, DON'T USE      DRK SEP07 32060000
         CLC   MSGTEXT2+50(6),=C'*ALIAS'  ALIAS?              DRK OCT07 32070000
         BE    VDELETE                    YES, DON'T USE      DRK OCT07 32080000
         SPACE 1                                                        32090000
         MVC   VOLUME(6),MSGTEXT2+50    MOVE DSLIST VOLUME    DRK NOV02 32100000
VPUT     DS    0H                                             DRK JUN07 32110000
         MVC   MSGTEXT2+50+6(6),BLANKS  BLANK FOR NEXT CALL   DRK JUN07 32120000
         LA    R1,=CL8'VPUT'            VPUT                  DRK JUN07 32130000
         ST    R1,MSGTEXT2+20                                 DRK JUN07 32140000
         LA    R1,=C'(ZDLCMD)'          ZDLCMD                DRK JUN07 32150000
         ST    R1,MSGTEXT2+20+4                               DRK JUN07 32160000
         LA    R1,=CL8'SHARED'          SHARED                DRK JUN07 32170000
         ST    R1,MSGTEXT2+20+8                               DRK JUN07 32180000
         OI    MSGTEXT2+20+8,X'80'      END OF LIST           DRK JUN07 32190000
         LA    R1,MSGTEXT2+20           START OF PARM LIST    DRK JUN07 32200000
         L     R15,ISPLINK                                    DRK JUN07 32210000
         BASR  R14,R15                                        DRK JUN07 32220000
VDELETE  DS    0H                                             DRK NOV02 32230000
         LA    R1,=CL8'VDELETE'         VDELETE               DRK NOV02 32240000
         ST    R1,MSGTEXT2+20                                 DRK NOV02 32250000
         LA    R1,=C'(ZDLVOL ZDLCMD)'   ZDLVOL, ZDLCMD        DRK JUN07 32260000
         ST    R1,MSGTEXT2+20+4                               DRK NOV02 32270000
         OI    MSGTEXT2+20+4,X'80'      END OF LIST           DRK NOV02 32280000
         LA    R1,MSGTEXT2+20           START OF PARM LIST    DRK NOV02 32290000
         L     R15,ISPLINK                                    DRK NOV02 32300000
         BASR  R14,R15                                        DRK NOV02 32310000
DSLISTX  DS    0H                                             DRK NOV02 32320000
         OI    FLAGSZZ,FALLOCI          TURN ON INIT ALLOC    DRK NOV02 32330000
.NODSL1  ANOP                                                 DRK NOV02 32340000
.NOSPF2  ANOP                                                 DRK NOV02 32350000
         OI    S99FLG11,S99NOCNV                 USE A FRESH ALLOCATION 32360000
         LA    R1,M99RBPTR                                              32370000
         USING S99RBP,R1                                                32380000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32390000
         MVC   0(L'ALLVOLUM,R3),ALLVOLUM         SPECIFY VOLUME TEXT    32400000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32410000
         LA    R0,L'ALLVOLUM(,R3)                START OF NEXT TEXT     32420000
         SPACE 1                                                        32430000
         CLI   VOLUME,X'40'                      ANY VOLUME SPECIFIED?  32440000
         BE    DYNA100                           NO, BRANCH             32450000
         MVI   1(R3),X'10'                       CONVERT TO SPECIFY     32460000
         MVC   6(6,R3),VOLUME                    SPECIFY VOLUME         32470000
         LA    R3,L'ALLVOLUM(,R3)                START OF NEXT TEXT     32480000
         SPACE 1                                                        32490000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32500000
         MVC   0(L'ALLUNIT,R3),ALLUNIT           SPECIFY UNIT TEXT      32510000
         MVC   6(8,R3),ALLOLSYS                  USE "SYSALLDA"         32520000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32530000
         LA    R0,L'ALLUNIT(,R3)                 START OF NEXT TEXT     32540000
         SPACE 1                                                        32550000
DYNA100  LR    R3,R0                             NEXT TEXT POINTER      32560000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32570000
         MVC   0(L'ALLPERM,R3),ALLPERM           SPECIFY PERMANENT      32580000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32590000
         LA    R3,L'ALLPERM(,R3)                 START OF NEXT TEXT     32600000
         SPACE 1                                                        32610000
         CLI   PASSWORD,X'41'                    ANY PASSWORD?          32620000
         BL    DYNA140                           NO, BRANCH             32630000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32640000
         MVC   0(L'ALLPASSW,R3),ALLPASSW         SPECIFY PASSWORD TEXT  32650000
         MVC   6(8,R3),PASSWORD                  SPECIFY DDNAME         32660000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32670000
         LA    R3,L'ALLPASSW(,R3)                START OF NEXT TEXT     32680000
         SPACE 1                                                        32690000
DYNA140  LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32700000
         MVC   0(L'ALLDSNAM,R3),ALLDSNAM         SPECIFY DSNAME TEXT    32710000
         MVC   4(46,R3),DSNLEN                   SPECIFY DSNAME         32720000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32730000
         LA    R3,L'ALLDSNAM+44(,R3)             START OF NEXT TEXT     32740000
         SPACE 1                                                        32750000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32760000
         MVC   0(L'ALLALLOC,R3),ALLALLOC         SPECIFY DISP TEXT      32770000
         MVC   6(1,R3),DSPALLOC                  SPECIFY DISPOSITION    32780000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32790000
         LA    R3,L'ALLALLOC(,R3)                START OF NEXT TEXT     32800000
         SPACE 1                                                        32810000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32820000
         MVC   0(L'ALLNORM,R3),ALLNORM           SPECIFY NORMAL TEXT    32830000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32840000
         LA    R3,L'ALLNORM(,R3)                 START OF NEXT TEXT     32850000
         SPACE 1                                                        32860000
         LA    R5,4(,R5)                         NEXT POINTER ELEMENT   32870000
         MVC   0(L'ALLANORM,R3),ALLANORM         SPECIFY ABNORMAL TEXT  32880000
         ST    R3,S99TUPTR                       POINT TO TEXT UNIT     32890000
         OI    S99TUPTR,X'80'                    MARK END OF LIST       32900000
         SPACE 1                                                        32910000
         DYNALLOC                                                       32920000
         SPACE 2                                                        32930000
         DROP  R1                                                       32940000
         LTR   R15,R15                  SUCCESSFUL?                     32950000
         BNZ   DYNA400                  NO, BRANCH                      32960000
         MVC   DDNAME,WORKTBL+6         SAVE DDNAME                     32970000
         MVC   DSORG(2),WORKTBL+20      SAVE DSORG                      32980000
         MVC   VOLALLOC(6),VOLUME       SET THE VOLUME SPECIFIED        32990000
         CLI   VOLUME,X'40'             ANY VOLUME?                     33000000
         BNE   *+10                     YES, BRANCH                     33010000
         MVC   VOLALLOC(6),WORKTBL+28   GET THE ALLOCATED VOLUME NAME   33020000
         SPACE 1                                                        33030000
         CLC   DDNAME(3),=CL8'SYS00000'   TEMPORARY TYPE DDNAME?        33040000
         BNE   DYNA200                    NO, BRANCH                    33050000
         NC    WORKTBL+6(8),=CL8'SYS00000'  MASK WITH "SYS00000"        33060000
         CLC   WORKTBL+6(8),=CL8'SYS00000'  TEMPORARY TYPE DDNAME?      33070000
         BE    *+8                          YES, BRANCH                 33080000
DYNA200  OI    FLAGSCC,FPERMDS            NO, MARK AS "PERMANENT"       33090000
         SPACE 1                                                        33100000
         DEVTYPE DDNAME,DEVTYPE,DEVTAB  GET DEVICE DEPENDENT DATA       33110000
         SPACE 1                                                        33120000
         L     R14,OBTAIN               OBTAIN FLAGS                    33130000
         LA    R15,DSNAME               ADDRESS OF DSNAME               33140000
         LA    R0,VOLALLOC              VOLUME SERIAL                   33150000
         LA    R1,DS1FMTID              OUTPUT START ADDRESS            33160000
         STM   R14,R1,PARMLIST          SAVE CAMLIST PARAMETERS         33170000
         OBTAIN PARMLIST                GET THE FORMAT 1 DSCB           33180000
         SPACE 1                                                        33190000
         LTR   R15,R15                  SUCCESSFUL OBTAIN?              33200000
         BZ    DYNA260                  YES, BRANCH                     33210000
         SPACE 1                                                        33220000
*     IF THE DSNAME IS AN ALIAS ENTRY IN A VSAM CATALOG, A LOCATE       33230000
*     WILL PUT THE TRUE NAME IN THE DSNAME FIELD -- ISSUE A LOCATE,     33240000
*     AND TRY THE OBTAIN AGAIN.                                         33250000
         MVC   WORKTBL(44),DSNAME       COPY DSNAME TO ANOTHER AREA     33260000
         L     R14,LOCATE                                               33270000
         LA    R15,WORKTBL              ACTUAL DSNAME                   33280000
         SR    R0,R0                    NO CVOL VALUE                   33290000
         LA    R1,MSGTEXT1              LOCATE WORK AREA                33300000
         STM   R14,R1,PARMLIST          SAVE CAMLIST PARAMETERS         33310000
         LOCATE PARMLIST                                                33320000
         LTR   15,15                    SUCCESSFUL LOCATE?              33330000
         BNZ   DYNA240                  NO, ERROR                       33340000
         SPACE 1                                                        33350000
         MVC   DSNAME(44),WORKTBL       COPY TRUE DSNAME      DRK OCT07 33360000
         LA    R0,44                                          DRK OCT07 33370000
         LA    R1,DSNAME+44                                   DRK OCT07 33380000
         CNOP  0,8                               ALIGN FOR LOOP       " 33390000
DSNLEN1B BCTR  R1,0                              BACK UP ONE BYTE     " 33400000
         CLI   0(R1),X'40'                       BLANK?               " 33410000
         BNE   DSNLEN2B                          NO, BRANCH           " 33420000
         BCT   R0,DSNLEN1B                       YES, FIND NONBLANK   " 33430000
DSNLEN2B STH   R0,DSNLEN                         UPDATE DSNAME LENGTH " 33440000
         SPACE 1                                                        33450000
         L     R14,OBTAIN               OBTAIN FLAGS                    33460000
         LA    R15,WORKTBL              ACTUAL DSNAME                   33470000
         LA    R0,VOLALLOC              VOLUME SERIAL                   33480000
         LA    R1,DS1FMTID              OUTPUT START ADDRESS            33490000
         STM   R14,R1,PARMLIST          SAVE CAMLIST PARAMETERS         33500000
         OBTAIN PARMLIST                GET THE FORMAT 1 DSCB           33510000
         SPACE 1                                                        33520000
         LTR   R15,R15                  SUCCESSFUL OBTAIN?              33530000
         BZ    DYNA260                  YES, BRANCH                     33540000
DYNA240  MVI   VOLALLOC,X'40'           NO, SET BACK TO BLANK           33550000
         SPACE 2                                                        33560000
DYNA260  DS    0H                                                       33570000
         LA    R1,L708                  NOT SUPPORTED MESSAGE DRK JUL10 33580000
         TM    DS1SMSFG,DS1STRP+DS1PDSEX  EXT FORMAT OR HFS?  DRK JUL10 33590078
         BM    EXIT8M                   YES, EXIT             DRK JUL10 33600078
         TM    DSORG+1,DS1ACBM          VSAM DATA SET?        DRK JUL10 33610000
         BO    EXIT8M                   YES, EXIT             DRK JUL10 33620000
         TM    DS1FLAG1,DS1LARGE        LARGE FORMAT?         DRK SEP11 33630099
         BO    EXIT8M                   YES, EXIT             DRK SEP11 33640099
*                                                                       33650000
         TM    DSORG,DS1DSGPO           PARTITIONED?                    33660000
         BO    DYNA300                  YES, BRANCH                     33670000
         SPACE 2                                                        33680000
         LA    R1,X'100'                TTR=1                           33690000
         ST    R1,DIRTTR                SAVE FOR LATTER                 33700000
         TM    ##ADRCM#,EDITOR          EDIT, BROWSE, TSOEDIT OR FSE?   33710000
         BO    DYNA300                  YES, BRANCH                     33720000
         OI    DDNAMEN,X'80'            OUTPUT A WARNING MESSAGE LATER  33730000
*        M$MSG L530                     OUTPUT A WARNING MESSAGE LATER  33740000
         SPACE 2                                                        33750000
DYNA300  LA    R14,FIRST4K                                              33760000
         LA    R14,RECALLDS-FIRST4K(R14)  POINT TO THE DSNAME SAVE      33770000
         MVC   0(132,R14),MSGBL132                                      33780000
         MVC   4(8,R14),$CHAL             "CHANGE"                      33790000
         MVI   4+9(R14),C''''             QUOTE                         33800000
         MVC   4+10(44,R14),DSNAME        DATA SET NAME                 33810000
         LH    R1,DSNLEN                  LENGTH                        33820000
         LA    R14,4+10(R1,R14)           POINT TO END OF NAME          33830000
         MVI   0(R14),C''''               FINAL QUOTE                   33840000
         CLI   VOLUME,X'41'               ANY VOLUME?                   33850000
         BL    DYNA310                    NO, BRANCH                    33860000
         MVC   2(4,R14),DYNAVOL           ADD "VOL("                    33870000
         MVC   2+4(6,R14),VOLUME          ADD VOLUME                    33880000
         MVI   2+4+6(R14),C')'            ADD FINAL )                   33890000
         LA    R14,2+4+6(R14)             POINT TO ) -1                 33900000
         SPACE 1                                                        33910000
DYNA310  CLI   DSPALLOC,ALLOOLD           OLD ALLOCATION?               33920000
         BNE   *+10                       NO, BRANCH                    33930000
         MVC   2(3,R14),DYNAOLD           YES, ADD OLD                  33940000
         SPACE 1                                                        33950000
         XC    6(40,R14),6(R14)           INSERT FINAL NULLS            33960000
         SPACE 1                                                        33970000
         L     R14,R14SAVE              RETURN AT                       33980000
         B     4(R14)                            +4 (SUCCESSFUL)        33990000
         SPACE 2                                                        34000000
DYNA400  CLC   DSNAMEH(3),=C'END '      WAS "END" ENTERED BY THE USER?  34010000
         BNE   DYNA410                  NO, BRANCH                      34020000
         TM    DSNAMEH+3,X'FF'-X'40'    WITH A FOLLOWING BLANK OR NULL? 34030000
         BZ    DYNA900                  YES, TERMINATE THE PROGRAM      34040000
         SPACE 1                                                        34050000
DYNA410  LA    R14,M99RB                POINTER TO SVC 99 BLOCK         34060000
         ST    R15,DAIRRC               RETURN CODE                     34070000
         LA    R15,DAIRRC               POINTER TO RETURN CODE          34080000
         LA    R0,ADDRFF02              POINTER TO A(IKJEFF02)          34090000
         LA    R1,=AL2(DFBUFSW*256+DFSVC99)  RETURN BUFFER;GENERAL CALL 34100000
         L     R2,ADDRCPPL              POINTER TO THE CPPL             34110000
         LA    R3,MSGTEXT1              POINTER TO OUTPUT TEXT          34120000
         STM   R14,R3,DFDAPLP           INITIALIZE DFDAPLP, DFDRCP,     34130000
*                                       DFJEFF02, DFIDP, DFCPPLP DFBUFP 34140000
         SPACE 1                                                        34150000
         LINK  EP=IKJEFF18,MF=(E,DFPARMS)                               34160000
         LTR   R15,R15                  PROBLEM WITH IKJEFF18?          34170000
         BNZ   DYNA420                  YES, BRANCH                     34180000
*                                                                       34190000
         LA    R1,MSGTEXT1              START OF MESSAGE                34200000
         L     R15,ADDRUPT              ADDRESS OF THE UPT              34210000
         TM    UPTSWS-UPT(R15),UPTMID   MESSAGE ID DESIRED?             34220000
         BO    DYNA412                  YES, BRANCH                     34230000
         CLI   13(R1),X'40'             BLANK FOLLOWING MSGID?          34240000
         BNE   DYNA412                  NO, KEEP THE WHOLE THING        34250000
         LH    R0,0(,R1)                CURRENT LENGTH                  34260000
         SH    R0,=H'10'                LESS TEN                        34270000
         SLL   R0,16                    SHIFT TO CORRECT POSITION       34280000
         ST    R0,10(,R1)               STORE OVER MESSAGE-ID           34290000
         LA    R1,10(,R1)               POINT TO NEW LENGTH WORD        34300000
DYNA412  M$ERRST (R1)                   OUTPUT FIRST LEVEL MESSAGE      34310000
*                                                                       34320000
         CLC   MSGTEXT1+256(2),=H'0'    ANY SECOND MESSAGE?             34330000
         BE    DYNA440                  NO, BRANCH                      34340000
         LA    R1,MSGTEXT1+256          START OF MESSAGE                34350000
         L     R15,ADDRUPT              ADDRESS OF THE UPT              34360000
         TM    UPTSWS-UPT(R15),UPTMID   MESSAGE ID DESIRED?             34370000
         BO    DYNA414                  YES, BRANCH                     34380000
         CLI   13(R1),X'40'             BLANK FOLLOWING MSGID?          34390000
         BNE   DYNA414                  NO, KEEP THE WHOLE THING        34400000
         LH    R0,0(,R1)                CURRENT LENGTH                  34410000
         SH    R0,=H'10'                LESS TEN                        34420000
         SLL   R0,16                    SHIFT TO CORRECT POSITION       34430000
         ST    R0,10(,R1)               STORE OVER MESSAGE-ID           34440000
         LA    R1,10(,R1)               POINT TO NEW LENGTH WORD        34450000
DYNA414  M$ERRST (R1)                   OUTPUT SECOND LEVEL MESSAGE     34460000
         B     DYNA440                                                  34470000
         SPACE 2                                                        34480000
DYNA420  CVD   R15,DOUBLE                                               34490000
         MVI   MTLEN,4                                                  34500000
         MVC   INSERT#1(4),=X'40202120'                                 34510000
         ED    INSERT#1(4),DOUBLE+6                                     34520000
         MVI   INSERT#1,C'='                                            34530000
         M$MSG L835$1                                                   34540000
         SPACE 1                                                        34550000
DYNA440  TM    FLAGSBB,FONESHOT         ONE SUBCOMMAND ONLY?            34560000
         BO    DYNA900                  YES, TERMINATE                  34570000
         CLI   DSPREQST,ALLOOLD         DISP=OLD REQUESTED?             34580000
         BE    DYNA500                  YES, ATTEMPT RETRY              34590000
         CLI   DSPALLOC,ALLOMOD         MOD ALLOCATION ATTEMPT?         34600000
         BE    DYNA444                  YES, BRANCH                     34610000
         CLI   DSPALLOC,ALLOOLD         OLD ALLOCATION ATTEMPT?         34620000
         BNE   DYNA500                  NO, REALLOCATE                  34630000
         SPACE 1                                                        34640000
DYNA444  MVI   DSPALLOC,ALLOSHR         YES, RETRY WITH DISP=SHR        34650000
         NI    FLAGSAA,FF-FMEM#MEM      TURN OFF MEMBER GROUPS          34660000
         NI    ##ADRCM#,FF-CONTINUE     TURN OFF THE CONTINUED FLAG     34670000
         B     DYNA010                                                  34680000
         SPACE 2                                                        34690000
DYNA500  CLI   VOLSET,C'*'              ANY VOLSET IN EFFECT?           34700000
         BE    DYNA600                  NO, BRANCH                      34710000
         CLI   VOLSET,X'40'             ANY VOLSET IN EFFECT?           34720000
         BNH   DYNA600                  NO, BRANCH                      34730000
         CLI   VOLUME,X'40'             VOLUME(*)?                      34740000
         BNH   DYNA590                  YES, BRANCH                     34750000
         TM    FLAGSCC,FVOLSET          VOLSET IGNORE?                  34760000
         BO    DYNA590                  YES, BRANCH                     34770000
         OI    FLAGSCC,FVOLSET          VOLSET IGNORE ALLOCATION        34780000
         M$MSG L412                     REALLOCATE AND IGNORE VOLSET    34790000
         MVC   VOLUME(8),BLANKS         RESET VOLUME                    34800000
         B     DYNA010                  RETRY ALLOCATION                34810000
DYNA590  MVI   MTLEN,8                                                  34820000
         MVC   INSERT#1(8),VOLSET       CURRENT VOLSET VALUE            34830000
         M$MSG L410$1                   ISSUE A WARNING MESSAGE         34840000
         SPACE 2                                                        34850000
DYNA600 M$PUTGT PDS381A,ATTN=DYNA900    DATA SET RECOVERY ROUTINE       34860000
         SPACE 2                                                        34870000
         TM    FLAGSBB,FNULL            USER WANT ANOTHER DATA SET?     34880000
         BO    DYNA500                  NULL REPLY, ASK AGAIN           34890000
         SPACE 1                                                        34900000
         MVC   DSNLEN(SAVLEN),SAVDSN+1  RESET THE DATA SET NAME         34910000
         MVC   FULLWORD(4),##ADRCMD     SAVE CONTINUATION INFORMATION   34920000
         L     R1,=V($CHA)              PCL FOR DATA SET NAME           34930000
         MVC   ##SUBCOM(PTW),0(R1)      PCL FOR DATA SET NAME           34940000
         L     R15,=V(PARSE)            PARSE ADDRESS                   34950000
         BASR  R14,R15                  INVOKE PARSE                    34960000
         B     DYNA900                  EXIT - PARSE FAILURE            34970000
         NI    FLAGSCC,FF-FVOLSET       CLEAR VOLUME SET FLAG           34980000
         MVC   ##ADRCMD(4),FULLWORD     CONTINUATION INFORMATION        34990000
         B     DYNA010                  RETRY ALLOCATION                35000000
         SPACE 2                                                        35010000
DYNA900  L     R14,R14SAVE              ERROR EXIT - NOT ALLOCATED      35020000
         BR    R14                                                      35030000
ALLDDNAM DC    X'0055000100084040404040404040'                          35040000
ALLDSORG DC    X'0057000100020000'                                      35050000
ALLVOLUM DC    X'005D00010006404040404040'                              35060000
ALLUNIT  DC    X'0015000100084040404040404040'                          35070000
ALLPERM  DC    X'00520000'                                              35080000
ALLPASSW DC    X'0050000100084040404040404040'                          35090000
ALLDSNAM DC    X'00020001002C'                                          35100000
ALLALLOC DC    X'00040001000108'                                        35110000
ALLNORM  DC    X'00050001000108'                                        35120000
ALLANORM DC    X'00060001000108'                                        35130000
ALLOOLD  EQU   X'01'                                                    35140000
ALLOMOD  EQU   X'02'                                                    35150000
ALLOSHR  EQU   X'08'                                                    35160000
ALLOLSYS DC    C'SYSALLDA'                                              35170000
ALLOL000 DC    C'SYS00000'                                              35180000
DYNAVOL  DC    C'VOL('                                                  35190000
DYNAOLD  DC    C'OLD'                                                   35200000
PDSMAIN  CSECT                                                          35210000
         TITLE 'P D S  --  PDS DATA SET UNALLOCATION         09/28/88'  35220000
*                                                                       35230000
*        FREE DATA SET NO LONGER REQUIRED                               35240000
*                                                                       35250000
         SPACE 2                                                        35260000
DEALLDCB MVI   VOLALLOC,X'40'     ** CONDITIONAL FREE OF FILE           35270000
         TM    FLAGSCC,FPERMDS    DATA SET PERMANENTLY ALLOCATED?       35280000
         BOR   R2                 YES, SKIP EXPLICIT FREE               35290000
         SPACE 2                                                        35300000
DEALLOCZ CLC   DDNAME(8),SYSPROC        SYSPROC DDNAME?                 35310000
         BER   R2                       YES, QUIT                       35320000
         XC    M99RBPTR(40),M99RBPTR    CLEAR THE WORK AREA             35330000
         LA    R1,M99RBPTR              DYNAMIC ALLOCATION              35340000
         USING S99RBP,R1                                                35350000
         SPACE 1                                                        35360000
         LA    R4,M99RB                                                 35370000
         USING S99RB,R4                                                 35380000
         ST    R4,S99RBPTR                                              35390000
         OI    S99RBPTR,S99RBPND        MARK END OF LIST                35400000
         SPACE 1                                                        35410000
         LA    R5,M99TUPL                                               35420000
         USING S99TUPL,R5                                               35430000
         MVI   S99RBLN,20               LENGTH 20                       35440000
         MVI   S99VERB,S99VRBUN         UNALLOCATE                      35450000
         ST    R5,S99TXTPP              POINT TO TEXT POINTERS          35460000
         LA    R3,WORKTBL               START OF TEXT                   35470000
         SPACE 1                                                        35480000
         MVC   0(L'UNADDNAM,R3),UNADDNAM                                35490000
         MVC   6(8,R3),DDNAME           SPECIFY DDNAME                  35500000
         ST    R3,S99TUPTR              POINT TO TEXT UNIT              35510000
         LA    R3,L'UNADDNAM(,R3)       START OF NEXT TEXT              35520000
         SPACE 1                                                        35530000
         CLC   DDNAME(8),SYSHELP        SYSHELP DDNAME?                 35540000
         BE    UNA100                   YES, BRANCH                     35550000
         SPACE 1                                                        35560000
         LA    R5,4(,R5)                NEXT POINTER ELEMENT            35570000
         MVC   0(L'UNAPERM,R3),UNAPERM  UNALLOC "PERM" TOO              35580000
         ST    R3,S99TUPTR              POINT TO TEXT UNIT              35590000
         LA    R3,L'ALLDSORG(,R3)       START OF NEXT TEXT              35600000
         SPACE 1                                                        35610000
UNA100   OI    S99TUPTR,X'80'           MARK END OF LIST                35620000
         SPACE 1                                                        35630000
         DYNALLOC                                                       35640000
         SPACE 2                                                        35650000
         DROP  R1,R4,R5                                                 35660000
         LTR   R15,R15                  SUCCESSFUL?                     35670000
         BNZR  R2                       NO, RETURN                      35680000
         BR    R2                       RETURN                          35690000
         SPACE 1                                                        35700000
UNADDNAM DC    X'0001000100084040404040404040'                          35710000
UNAPERM  DC    X'00070000'                                              35720000
         TITLE 'P D S  --  PDS OPEN/CLOSE STOW ROUTINES      09/28/88'  35730000
*                                                                       35740000
*        OPEN/CLOSE STOW SUBROUTINES                                    35750000
*                                                                       35760000
         SPACE 3                                                        35770000
OPENSTOW TM    DCBOFLGS-IHADCB+STOWDCB,DCBOFOPN  STOW DCB OPEN?         35780000
         BO    4(R2)                             YES, EXIT              35790000
         SPACE 1                                                        35800000
         MVI   OPENLIST,X'80'                                           35810000
         TM    FLAGSCC,FUPDATE                   UPDATE DESIRED?        35820000
         BO    OPENSTW6                          YES, SKIP RESERVE      35830000
         SPACE 1                                                        35840000
         BAS   R6,RESERVE                        RESERVE THE DEVICE     35850000
OPENSTW6 OPEN  (STOWDCB,UPDAT),MF=(E,OPENLIST)   OPEN IT FOR UPDATE NOW 35860000
         SPACE 1                                                        35870000
         TM    DCBOFLGS-IHADCB+STOWDCB,DCBOFOPN  STOW DCB OPEN?         35880000
         BO    4(R2)                             YES, BRANCH            35890000
         SPACE 1                                                        35900000
         M$MSG L831                              STOW DID NOT OPEN      35910000
         NI    FLAGSCC,FF-FUPDATE                OPEN FAILED            35920000
         BR    R2                                ERROR RETURN           35930000
         EJECT                                                          35940000
*                                                                       35950000
*        OPEN/CLOSE STOW SUBROUTINES                                    35960000
*                                                                       35970000
         SPACE 3                                                        35980000
SHUTSTOW TM    FLAGSCC,FUPDATE                   UPDATE CLOSE?          35990000
         BO    SHUTSTW2                          YES, BRANCH            36000000
         TM    FLAGSEE,FBKGRND                   BACKGROUND MODE?       36010000
         BOR   R2                                YES, RESERVE IS OK     36020000
         SPACE 2                                                        36030000
SHUTSTW2 MVI   OPENLIST,X'80'                                           36040000
         TM    DS1SMSFG,DS1PDSE                  USING INDCB?  GP AUG05 36050000
         BNO   SHUTPDS                           NO, STOWDCB   GP AUG05 36060000
         TM    #REPFLAG,LIST#REP                 INDCB UPDATE? GP AUG05 36070000
         BNO   SHUTPDS                           NO, STOWDCB   GP AUG05 36080000
         CLOSE INDCB,MF=(E,OPENLIST)             YES, CLOSE IT GP AUG05 36090000
         MVI   OPENLIST,X'80'                                  GP AUG05 36100000
         OPEN  (INDCB,INPUT),MF=(E,OPENLIST)     OPEN IT AGAIN GP AUG05 36110000
SHUTPDS  EQU   *                                               GP AUG05 36120000
         TM    DCBOFLGS-IHADCB+STOWDCB,DCBOFOPN  STOW DCB OPEN?         36130000
         BNO   DEQ                               NO, BRANCH             36140000
         SPACE 1                                                        36150000
         TM    FLAGSCC,FUPDATE                   UPDATE CLOSE?          36160000
         BNO   SHUTSTW6                          NO, BRANCH             36170000
         XI    FLAGSCC,FUPDATE                   UPDATE CLOSE NOW       36180000
         MVI   OPENLIST,X'7C'                    MARK TERMINATION       36190000
         L     R8,=V(LIST)                       UPDATE BASE REGISTER   36200000
         L     R15,=V(LIST170)                   FINAL UPDATE ROUTINE   36210000
         BASR  R14,R15                                                  36220000
         SPACE 2                                                        36230000
SHUTSTW6 CLI   DSPALLOC,ALLOOLD                  EXCLUSIVE USE?         36240000
         BE    DEQ                               YES, NO CLOSE          36250000
         CLI   DSPALLOC,ALLOMOD                  EXCLUSIVE USE?         36260000
         BE    DEQ                               YES, NO CLOSE          36270000
         SPACE 1                                                        36280000
         MVI   OPENLIST,X'80'                                           36290000
         TM    DCBOFLGS-IHADCB+STOWDCB,DCBOFOPN  STOW DCB OPEN?         36300000
         BNO   DEQ                               NO, BRANCH             36310000
         CLOSE (STOWDCB),MF=(E,OPENLIST)         CLOSE IT NOW           36320000
         B     DEQ                                                      36330000
         TITLE 'P D S  --  PDS RESERVE ROUTINE               09/28/88'  36340000
*                                                                       36350000
*        UCB RESERVE ROUTINE                                            36360000
*                                                                       36370000
         SPACE 1                                                        36380000
RESERVE  CLI   DSPALLOC,ALLOOLD            EXCLUSIVE USE?               36390000
         BER   R6                          YES, RETURN                  36400000
         CLI   DSPALLOC,ALLOMOD            EXCLUSIVE USE?               36410000
         BER   R6                          YES, RETURN                  36420000
         SPACE 1                                                        36430000
         CLI   RESERVET,C'R'               ALREADY RESERVED?            36440000
         BER   R6                          YES, RETURN                  36450000
         MVI   RESERVET,C'R'               MARK AS RESERVED             36460000
         SPACE 2                                                        36470000
         MVC   PARMLIST(4),RESERVEL        LIST FORM OF RESERVE         36480000
         RESERVE (SPFEDIT,DSNAME,E,44,SYSTEMS),RET=HAVE,UCB=UCBADDR,  XX36490000
               MF=(E,PARMLIST)                                          36500000
         SPACE 2                                                        36510000
         TM    FLAGSCC,RECFMU              LOAD LIBRARY?                36520000
         BNOR  R6                          NO, RETURN                   36530000
         SPACE 2                                                        36540000
         L     R1,UCBADDR                  UCB ADDRESS                  36550000
         TM    UCBTYP+1(R1),UCBRR          SHARED DEVICE?               36560000
         BNO   RESERVE2                    NO, BRANCH                   36570000
         MVC   PARMLIST(4),RESERVEL        LIST FORM OF RESERVE         36580000
         RESERVE (SYSIEWLP,DSNAME,E,44,SYSTEMS),RET=HAVE,UCB=UCBADDR, XX36590000
               MF=(E,PARMLIST)                                          36600000
         BR    R6                                                       36610000
         SPACE 5                                                        36620000
RESERVE2 MVC   PARMLIST(4),ENQHAVE         LIST FORM OF RESERVE         36630000
         ENQ   (SYSIEWLP,DSNAME,E,44,SYSTEM),RET=HAVE,MF=(E,PARMLIST)   36640000
         BR    R6                                                       36650000
         TITLE 'P D S  --  PDS DEQ ROUTINE                   09/28/88'  36660000
*                                                                       36670000
*        UCB DEQ ROUTINE                                                36680000
*                                                                       36690000
         SPACE 1                                                        36700000
DEQ      CLI   DSPALLOC,ALLOOLD            EXCLUSIVE USE?               36710000
         BER   R2                          YES, RETURN                  36720000
         CLI   DSPALLOC,ALLOMOD            EXCLUSIVE USE?               36730000
         BER   R2                          YES, RETURN                  36740000
         SPACE 1                                                        36750000
         CLI   RESERVET,C'R'               RESERVED?                    36760000
         BNER  R2                          NO, RETURN                   36770000
         MVI   RESERVET,0                  NO LONGER RESERVED           36780000
         SPACE 2                                                        36790000
         MVC   PARMLIST(4),DEQSYSS         LIST FORM, DEQ "SYSTEMS"     36800000
         DEQ   (SPFEDIT,DSNAME,44,SYSTEMS),RET=HAVE,UCB=UCBADDR,       X36810000
               MF=(E,PARMLIST)                                          36820000
         SPACE 2                                                        36830000
         TM    FLAGSCC,RECFMU              LOAD LIBRARY?                36840000
         BNOR  R2                          NO, RETURN                   36850000
         SPACE 2                                                        36860000
         L     R1,UCBADDR                  UCB ADDRESS                  36870000
         TM    UCBTYP+1(R1),UCBRR          SHARED DEVICE?               36880000
         BNO   DEQ2                        NO, BRANCH                   36890000
         MVC   PARMLIST(4),DEQSYSS         LIST FORM, DEQ "SYSTEMS"     36900000
         DEQ   (SYSIEWLP,DSNAME,44,SYSTEMS),RET=HAVE,UCB=UCBADDR,      X36910000
               MF=(E,PARMLIST)                                          36920000
         BR    R2                                                       36930000
         SPACE 5                                                        36940000
DEQ2     MVC   PARMLIST(4),DEQSYS          LIST FORM, DEQ "SYSTEM"      36950000
         DEQ   (SYSIEWLP,DSNAME,44,SYSTEM),RET=HAVE,MF=(E,PARMLIST)     36960000
         BR    R2                                                       36970000
         TITLE 'P D S  --  PDS OPEN EXIT                     09/28/88'  36980000
         USING IHADCB,R1                                                36990000
OPENEXIT TM    ##ADRCM#,FIXOPEN                FIXPDS DCB MODIFICATION? 37000000
         BNO   OPENEXT2                        NO, BRANCH               37010000
         MVC   DCBRECFM(1),#RECFM+3            NEW RECORD FORMAT        37020000
         MVC   DCBLRECL(2),#LRECL+2            NEW LRECL                37030000
         MVC   DCBBLKSI(2),#BLKSI+2            NEW BLKSIZE              37040000
         MVI   DCBKEYLE,0                      RESET THE KEY LENGTH     37050000
         CLI   #OPTCD,1                        ANY OPTCD CHANGE?        37060000
         BL    OPENEXT2                        NO, BRANCH               37070000
         NI    DCBOPTCD,255-X'A4'              TURN OFF AFFECTED BITS   37080000
         OC    DCBOPTCD(1),#OPTCD+3            TURN ON DESIRED BITS     37090000
         SPACE 1                                                        37100000
OPENEXT2 MVC   RECFM(1),DCBRECFM               SAVE RECORD FORMAT BYTE  37110000
         NI    FLAGSCC,FF-RECFMU-RECFMV-RECFMF CLEAR TEST BITS          37120000
         XI    FLAGSCC,RECFMU                  ASSUME RECFM=U           37130000
         TM    DCBRECFM,DCBRECU                CORRECT?                 37140000
         BO    OPENEXT4                        YES, BRANCH              37150000
         XI    FLAGSCC,RECFMU+RECFMV           ASSUME RECFM=V           37160000
         TM    DCBRECFM,DCBRECV                CORRECT?                 37170000
         BO    OPENEXT4                        YES, BRANCH              37180000
         XI    FLAGSCC,RECFMV+RECFMF           ASSUME RECFM=F           37190000
         NI    DCBRECFM,FF-DCBRECSB            DROP ANY S OF RECFM=FBS  37200000
         TM    DCBRECFM,DCBRECF                CORRECT?                 37210000
         BO    OPENEXT4                        YES, BRANCH              37220000
         XI    FLAGSCC,RECFMV                  NO, INDICATE UNKNOWN     37230000
         SPACE 1                                                        37240000
OPENEXT4 CLC   BLKSI(2),ZERO                   HAVE ANY LRECL?          37250000
         BNER  R14                             YES, RETURN              37260000
         MVC   LRECL,DCBLRECL                  SAVE LRECL               37270000
         MVC   BLKSI,DCBBLKSI                  SAVE BLOCKSIZE           37280000
         MVC   OPTCD,DCBOPTCD                  SAVE OPTCD               37290000
         BR    R14                                                      37300000
         DROP  R1                                                       37310000
         TITLE 'P D S  --  PDS DIRECTORY READ SUBROUTINE     09/28/88'  37320000
*                                                                       37330000
*        DIRECTORY READ SUBROUTINE                                      37340000
*                                                                       37350000
         SPACE 1                                                        37360000
READDIR  ST    R14,R14READD                                             37370000
         NI    FLAGSEE,FF-FDIREND      END OF DIRECTORY TO COME YET     37380000
         CLI   STARTTR+2,X'01'         TTR=000001 (START OF DIRECTORY)? 37390000
         BNE   DEBLOCK                 NO, BRANCH                       37400000
         SPACE 1                                                        37410000
         XC    TOTBLOCK(LTOT),TOTBLOCK CLEAR THE TOTALS AREA            37420000
*   GP   TM    DS1SMSFG,DS1PDSE        PDSE DATASET?          DRK AUG05 37430000
*   GP   BO    READDIR1                YES, DS1LSTAR IS ZERO  DRK AUG05 37440000
         LA    R1,L875                 ASSUME NO DIRECTORY BLOCKS       37450000
         CLC   DS1LSTAR(3),ZERO        CORRECT?                         37460000
         BE    READDIRE                YES, ERROR EXIT                  37470000
         SPACE 2                                                        37480000
READDIR1 DS    0H                                                       37490000
         TM    DS1SMSFG,DS1PDSE         PDSE DATASET?         DRK AUG05 37500000
         BO    READPDSE                 YES                   DRK AUG05 37510000
         L     R15,=A(EXCP)        READ THE DIRECTORY RECORDS           37520000
         BASR  R14,R15                                                  37530000
         B     *+4(R15)                PROCESS RETURN CODE              37540000
         B     READDIR2                 00 - GOOD READ                  37550000
         B     READDIR4                 04 - END OF MEMBER              37560000
         B     READDIR4                 08 - END OF DATA SET            37570000
         B     IOERROR                  12 - I/O ERROR IN DIRECTORY     37580000
READPDSE DS    0H                                                       37590000
         L     R15,=A(PDSEDIR)     READ THE DIRECTORY RECORDS DRK AUG05 37600000
         BASR  R14,R15                                                  37610000
         B     *+4(R15)                PROCESS RETURN CODE              37620000
         B     READDIR2                 00 - GOOD READ                  37630000
         B     READDIR4                 04 - END OF MEMBER              37640000
         B     READDIR4                 08 - END OF DATA SET            37650000
         B     IOERROR                  12 - I/O ERROR IN DIRECTORY     37660000
         SPACE 2                                                        37670000
READDIR2 LA    R1,L876                 ASSUME INVALID DIRECTORY BLOCK   37680000
         CLC   LS+2(2),=H'256'         CORRECT?                         37690000
         BNE   READDIRE                YES, ERROR EXIT                  37700000
         L     R14,TOTTRKS                                              37710000
         LA    R14,1(,R14)                                              37720000
         CLC   TOTCCHH,CURMBB+3        SWITCH TRACKS?                   37730000
         BE    *+8                     NO, BRANCH                       37740000
         ST    R14,TOTTRKS             YES, UPDATE TRACK COUNT          37750000
         MVC   TOTCCHH,CURMBB+3        NEW CCHH QUANTITY                37760000
         SPACE 1                                                        37770000
         L     R14,TOTBLOCK                                             37780000
         LA    R14,1(R14)                                               37790000
         ST    R14,TOTBLOCK                                             37800000
         TM    FLAGSEE,FDIREND         USAGE AND LAST MEMBER FOUND?     37810000
         BO    READDIR1                YES, BRANCH                      37820000
         SPACE 1                                                        37830000
         L     R14,TOTUSED                                              37840000
         LA    R14,1(R14)                                               37850000
         ST    R14,TOTUSED                                              37860000
***      MVI   TOTTHISM+3,0                                             37870000
         SPACE 1                                                        37880000
         LR    R15,R0                   BUFFER ADDRESS                  37890000
         LA    R0,2                                                     37900000
         LH    R1,0(,R15)                                               37910000
         BCTR  R1,0                                                     37920000
         LA    R1,0(R1,R15)                                             37930000
         STM   R15,R1,DIRPTRS                                           37940000
         SPACE 8                                                        37950000
DEBLOCK  LM    R15,R1,DIRPTRS                                           37960000
         BXH   R15,R0,READDIR1         INDEX TO NEXT MEMBER NAME        37970000
         STM   R15,R1,DIRPTRS                                           37980000
         SPACE 1                                                        37990000
         CLI   0(R15),X'FF'            LAST MEMBER?                     38000000
         BE    READDIR3                YES                              38010000
         SPACE 1                                                        38020000
         MVC   MEMNAME(12),0(R15)      SAVE FIRST 12 BYTES OF ENTRY     38030000
         SPACE 1                                                        38040000
***      L     R0,TOTTHISM                                              38050000
***      A     R0,=F'1'                                                 38060000
***      ST    R0,TOTTHISM                                              38070000
***      C     R0,TOTMAXM                                               38080000
***      BNH   *+8                                                      38090000
***      ST    R0,TOTMAXM              MAX DIRECTORY ENTRIES IN A BLOCK 38100000
         SPACE 1                                                        38110000
         IC    R14,11(,R15)                                             38120000
         N     R14,=XL4'0000001F'                                       38130000
         LA    R0,12(R14,R14)                                           38140000
         STM   R15,R1,DIRPTRS                                           38150000
         SPACE 2                                                        38160000
         TM    MEMFLAG,X'80'           ALIAS?                           38170000
         LA    R14,TOTMEMR             ASSUME NOT                       38180000
         BZ    *+8                     CORRECT?                         38190000
         LA    R14,TOTMEMA             NO, ALIAS                        38200000
         SPACE 1                                                        38210000
         L     R15,0(,R14)                                              38220000
         LA    R15,1(,R15)                                              38230000
         ST    R15,0(,R14)                                              38240000
         SPACE 1                                                        38250000
         CLC   ##SUBCOM(8),$USA        USAGE SUBCOMMAND?                38260000
         BE    DEBLOCK                 YES, CONTINUE TO DEBLOCK         38270000
         LA    R15,4                   NO, GET THE EXIT OFFSET          38280000
         B     READDIR5                                                 38290000
         SPACE 2                                                        38300000
READDIR3 OI    FLAGSEE,FDIREND         FLAG LAST MEMBER FOUND           38310000
         CLC   ##SUBCOM(8),$USA        USAGE SUBCOMMAND?                38320000
         BE    READDIR1                YES, CONTINUE READING            38330000
         B     READDIR4                NO, EXIT WITH LAST MEMBER        38340000
         SPACE 2                                                        38350000
READDIRE M$MSG (R1)                    DIRECTORY ERROR                  38360000
         MVI   STARTTR+2,X'00'         RESET THE START TTR              38370000
         SPACE 2                                                        38380000
READDIR4 SR    R15,R15                 END OF DIRECTORY OR LAST MEMBER  38390000
         SPACE 1                                                        38400000
READDIR5 L     R14,R14READD                                             38410000
         NI    FLAGSAA,FF-FADSDIR      RESET FLAG              GP SEP05 38420000
         B     0(R14,R15)                                               38430000
         TITLE 'P D S  --  PDS EXCP READ SUBROUTINE          09/28/88'  38440000
*                                                                       38450000
*        EXCP SUBROUTINE                                                38460000
*                                                                       38470000
         SPACE 1                                                        38480000
EXCP     CSECT                                                          38490000
         USING *,R8                                                     38500000
         ST    R14,R14EXCP                                              38510000
         ST    R8,R8EXCP                                                38520000
         LR    R8,R15                                                   38530000
         LH    R1,IODONE                    ANOTHER                     38540000
         LA    R1,1(,R1)                           INPUT                38550000
         STH   R1,IODONE                                ENTRY           38560000
         TM    DS1SMSFG,DS1PDSE             PDSE DATASET?      GP AUG05 38570000
         BNO   ISNOTPAM                     NO, DON'T USE BPAM GP AUG05 38580000
         L     R15,=A(PAM)                  YES, GET E.P.      GP AUG05 38590000
         BR    R15                          BRANCH TO IT       GP AUG05 38600000
ISNOTPAM EQU   *                                               GP AUG05 38610000
*                                                                       38620000
         LA    R14,IODIR1                   ASSUME DIRECTORY BLOCKS     38630000
         LA    R15,IODIR1+4                 ASSUME DIRECTORY BLOCKS     38640000
         LA    R0,IODIRCUR                  ASSUME DIRECTORY BLOCKS     38650000
         TM    FLAGSII,FDIRGRP              DIRECTORY READ?             38660000
         BO    EXCPCON                      YES, BRANCH                 38670000
         LA    R14,IOBUFF1                  NO, I/O BUFFER CONTROL      38680000
         LA    R15,IOBUFF1+4                NO, I/O BUFFER CONTROL      38690000
         LA    R0,IOBUFCUR                  NO, I/O BUFFER CONTROL      38700000
*                                                                       38710000
EXCPCON  ST    R14,IBUFPTR                                              38720000
         ST    R15,ISAVSEEK                                             38730000
         ST    R0,ICONTROL                                              38740000
         ICM   R0,B'1111',STARTTR           NEW TTR ADDRESS?            38750000
         BNZ   EXCPNTTR                     YES, BRANCH                 38760000
         TM    FLAGSJJ,FNOREAD              REOPEN FOR NULL DATA SET?   38770000
         BO    EXCPNTTR                     YES, BRANCH                 38780000
         TM    FLAGSII,FDIRGRP              DIRECTORY READ?             38790000
         BO    EXCPCN50                     YES, BRANCH                 38800000
         MVC   IBUFPTR(12),IBUFSAV          RESTORE POINTERS            38810000
         CLI   DEVRPS,X'05'                 SAVE EXCP'S?                38820000
         BNE   EXCPCN50                     NO, DO NOT REUSE BUFFERS    38830000
*                                                                       38840000
         L     R1,ISAVSEEK                  PREVIOUS SEEK ADDRESS       38850000
         MVC   CURMBB(8),0(R1)              SAVE IN CURMBB              38860000
         MVC   IOBSEEK(LIOBDIR),0(R1)       RESET IOBSEEK               38870000
*                                                                       38880000
         L     R1,ICONTROL                  CONTROL WORDS ADDRESS       38890000
         L     R15,0(,R1)                   CURRENT DATA ADDRESS        38900000
         CLC   4(4,R1),0(R15)               ANY LOGICAL DATA RECORDS?   38910000
         BE    EXCPCN50                     YES, GET A LOGICAL RECORD   38920000
*                                                                       38930000
*  SEARCH OTHER TRACKS TO SEE IF THIS ONE IS ALREADY IN STORAGE         38940000
         LA    R1,FIRST4K                                               38950000
         LA    R1,IOBUFN-FIRST4K(,R1)         FIRST SAVED TRACK CONTROL 38960000
         LH    R0,INUMSAV                     NUMBER OF BUFFERS         38970000
         CNOP  0,8                            ALIGN FOR LOOP            38980000
EXCPCN10 CLC   IOBUFAN-IOBUFN(4,R1),CURMBB+3  THIS CCHH?                38990000
         BE    EXCPCN30                       YES, BRANCH               39000000
         LA    R1,32(,R1)                     NEXT ADDRESS              39010000
         BCT   R0,EXCPCN10                    CHECK ALL ADDRESSES       39020000
         B     EXCPCN50            ***TEST    NOT FOUND, OVERLAY TRACK  39030000
*                                                                       39040000
*  NOT IN STORAGE -- CHECK IF REQUESTED TTR CHANGE OR CONTINUATION      39050000
         TM    CUREXT,X'80'                 REQUESTED READ TRACK?       39060000
         BO    EXCPCN20                     YES, ALLOCATE TRACK TWO     39070000
         BNO   EXCPCN50                     NO,   OVERLAY TRACK TWO     39080000
*  NEED TO READ A TRACK; ALLOCATE A SECOND TRACK CONTROL                39090000
EXCPCN20 NI    CUREXT,FF-X'80'              MARK AS AFTER FIRST TRACK   39100000
         LA    R1,FIRST4K                                               39110000
         LA    R1,IOBUFN-FIRST4K(,R1)       FIRST SAVED TRACK CONTROL   39120000
         LH    R0,INXTSAV                   NEXT AVAILABLE              39130000
         MH    R0,=H'32'                    *32                         39140000
         AR    R1,R0                        TRACK CONTROL TO USE        39150000
         ST    R1,IBUFPTR                   BUFFER TO USE               39160000
         LA    R0,IOBUFCN-IOBUFN(,R1)                                   39170000
         ST    R0,ICONTROL                  CURRENT, ADDRESS            39180000
         MVI   IOBUFCN-IOBUFN(R1),X'40'     MARK AS A NEW ADDRESS       39190000
         OI    IOBUFAN-IOBUFN(R1),X'FC'     MARK CCHH AS INVALID        39200000
         LA    R0,IOBUFSN-IOBUFN(,R1)                                   39210000
         ST    R0,ISAVSEEK                  IOBSEEK AND RESET           39220000
         LH    R1,INXTSAV                   NEXT AVAILABLE TRK CONTROL  39230000
         LA    R1,1(,R1)                    NEXT AVAILABLE TRK CONTROL  39240000
         CH    R1,INUMSAV                   NEXT AVAILABLE TRK CONTROL  39250000
         BL    *+6                          NEXT AVAILABLE TRK CONTROL  39260000
         SR    R1,R1                        NEXT AVAILABLE TRK CONTROL  39270000
         STH   R1,INXTSAV                   NEXT AVAILABLE TRK CONTROL  39280000
         B     EXCPCONT                     DO A REAL EXCP              39290000
*                                                                       39300000
*  THIS TRACK IS ALREADY IN STORAGE, REUSE IT TO SAVE AN INPUT EXCP     39310000
EXCPCN30 DS    0H                                                       39320000
         ST    R1,IBUFPTR                   POTENTIAL POINTER           39330000
         LA    R0,IOBUFCN-IOBUFN(,R1)                                   39340000
         ST    R0,ICONTROL                  POTENTIAL POINTER           39350000
         LA    R0,IOBUFSN-IOBUFN(,R1)                                   39360000
         ST    R0,ISAVSEEK                  POTENTIAL POINTER           39370000
*                                                                       39380000
         L     R1,ICONTROL                  CONTROL WORD                39390000
         L     R15,IBUFPTR                  BUFFER ADDRESS              39400000
         L     R15,0(,R15)                  BUFFER POINTER              39410000
         STCM  R15,B'0111',1(R1)            RESET START OF READ BUFFER  39420000
         CLC   4(4,R1),0(R15)               SAME CCHH STILL IN STORAGE? 39430000
         BNE   EXCPCN49                     NO, BRANCH                  39440000
         SPACE 2                                                        39450000
         L     R14,0(,R1)                   START OF CCHHKDD(DATA)      39460000
         CLC   CURMBB+3(5),0(R14)           CCHHR:STORAGE CCHHR         39470000
         BE    EXCPCN60                       EQUAL; SAVE AN EXCP       39480000
         SPACE 2                                                        39490000
*  TRACK DOES NOT CONTAIN THIS TTR; INVALIDATE CCHH ADDRESS             39500000
EXCPCN49 L     R1,IBUFPTR                   START OF THIS TRACK CONTROL 39510000
         MVI   IOBUFAN-IOBUFN(R1),X'FE'     MARK CCHH AS INVALID        39520000
*  NEED TO READ A TRACK; SET UP IOBSEEK INFORMATION                     39530000
EXCPCN50 DS    0H                                                       39540000
         L     R15,ISAVSEEK                                             39550000
         MVC   IOBSEEK(LIOBDIR),0(R15)      RESTORE IOBSEEK INFORMATION 39560000
         B     EXCPCONT                     DO A REAL EXCP              39570000
*  PREVIOUSLY READ TRACK CONTAINS THIS TTR, REUSE THIS TRACK BUFFER     39580000
EXCPCN60 L     R15,ISAVSEEK                                             39590000
         MVC   IOBSEEK(LIOBDIR),0(R15)      RESTORE IOBSEEK INFORMATION 39600000
         MVI   IOECB,X'7F'                  RESET THE READ ECB          39610000
         B     EXCPCONT                                                 39620000
         SPACE 2                                                        39630000
EXCPNTTR LH    R1,IODONEW                   ANOTHER                     39640000
         LA    R1,1(,R1)                           TTR                  39650000
         STH   R1,IODONEW                             CHANGE            39660000
         L     R0,STARTTR                                               39670000
         CLM   R0,B'1110',DS1LSTAR          TTR:DS1LSTAR                39680000
         BL    EXCPNTT4                     LOW, VALID                  39690000
         CLI   RESERVET,C'R'                ALREADY RESERVED?           39700000
         BE    EXCPNTT4                     YES, DO NOT OPEN AGAIN      39710000
         SPACE 2                                                        39720000
*** TTR EXCEEDS DS1LSTAR -- NEED TO REOPEN THE DATA SET                 39730000
         LA    R0,EXCPNTT2                  REENTRY ADDRESS             39740000
         ST    R0,##ADRCMD                                              39750000
         OI    ##ADRCM#,CONTINUE            REENTER FLAG                39760000
         L     R1,RECOVER                   SAVE RECOVERY ADDRESS       39770000
         LM    R15,R0,IOBSEEK               SAVE NEXT IOBSEEK           39780000
         ICM   R14,B'1111',KEYLN            KEYLN, DATALN, SNO          39790000
         STM   R14,R8,R148EXCP              SAVE CHANGED REGISTERS      39800000
         BAS   R2,CLOSEIT                   CLOSE THE DATA SET          39810000
         MVI   VOLALLOC,X'40'               NEED ANOTHER OBTAIN         39820000
         B     RESTART2                                                 39830000
         SPACE 1                                                        39840000
EXCPNTT2 LM    R14,R8,R148EXCP              RESET REGISTERS             39850000
         ST    R1,RECOVER                   RESET RECOVERY ADDRESS      39860000
         STM   R15,R0,IOBSEEK               RESET NEXT IOBSEEK          39870000
         STCM  R14,B'1111',KEYLN            KEYLN, DATALN, SNO          39880000
EXCPNTT4 L     R0,STARTTR                                               39890000
         XC    STARTTR,STARTTR              ZERO THE TTR                39900000
         TM    FLAGSJJ,FNOREAD              NO INPUT MODE?              39910000
         BO    EXCPEND0                     YES, DONE                   39920000
         SPACE 2                                                        39930000
         SRL   R0,8                                                     39940000
         BCTR  R0,0                         REDUCE INITIAL TTR BY ONE   39950000
         SLL   R0,8                                                     39960000
         SPACE 1                                                        39970000
         STM   R15,R12,12+4(R13)            CONVERT TTR TO MBBCCHHR     39980000
         L     R1,INDCB+(DCBDEBAD-IHADCB)   DEB ADDRESS                 39990000
         LA    R2,CURMBB                    RETURN CCHHR                40000000
         L     R15,ADDRCNVT                 TTR TO MBBCCHHR CONVERTER   40010000
         LR    R3,R13                       SAVE ADDRESS OF SAVE AREA   40020000
         BASR  R14,R15                                                  40030000
         LR    R13,R3                       RESTORE SAVE AREA ADDRESS   40040000
         LM    R15,R12,12+4(R13)            RESTORE REGISTERS           40050000
         SPACE 1                                                        40060000
         SPACE 2                                                        40070000
         CLI   DEVRPS,X'05'                 SAVE EXCP'S?                40080000
         BNE   EXCPSV99                     NO, DO NOT REUSE BUFFERS    40090000
*                                                                       40100000
*  NEW TTR, TRY TO REUSE A TRACK IF READ MULTIPLE AND IN STORAGE        40110000
*                                                                       40120000
         CLI   IODIRADD,X'FE'               INVALID ADDRESS?            40130000
         BNE   EXCPSV04                     NO, BRANCH                  40140000
*                                                                       40150000
*  INPUT FOR A NEW COMMAND; REINITIALIZE THE READ CONTROL BUFFERS       40160000
         MVI   IODIRADD,X'FD'               STILL INVALID ADDRESS       40170000
         MVI   INXTSAV+1,0                  NEXT AVAILABLE BUFFER       40180000
         LA    R1,FIRST4K                                               40190000
         LA    R1,IOBUFAN-FIRST4K(,R1)      FIRST ADDRESS POINTER       40200000
         LH    R0,INUMSAV                   NUMBER OF BUFFERS           40210000
         CNOP  0,8                          ALIGN FOR LOOP              40220000
EXCPSV02 MVI   0(R1),X'FE'                  INVALIDATE THIS ADDRESS     40230000
         LA    R1,32(,R1)                   NEXT ADDRESS                40240000
         BCT   R0,EXCPSV02                  MARK ALL ADDRESSES          40250000
*                                                                       40260000
EXCPSV04 DS    0H                                                       40270000
         TM    FLAGSII,FDIRGRP              DIRECTORY READ?             40280000
         BNO   EXCPSV20                     NO, BRANCH                  40290000
         L     R1,ICONTROL                  START OF BUFFER CONTROL     40300000
         CLC   CURMBB+3(4),4(R1)            SAME CCHH AS LAST READ?     40310000
         BNE   EXCPSV99                     NO, BRANCH                  40320000
         L     R15,IBUFPTR                  BUFFER ADDRESS              40330000
         L     R15,0(,R15)                  BUFFER POINTER              40340000
         STCM  R15,B'0111',1(R1)            RESET START OF READ BUFFER  40350000
         CLC   4(4,R1),0(R15)               SAME CCHH STILL IN STORAGE? 40360000
         BNE   EXCPSV99                     NO, BRANCH                  40370000
         SR    R15,R15                                                  40380000
         IC    R15,CURMBB+7                 R-1                         40390000
         LA    R15,1(,R15)                  R                           40400000
         STC   R15,CURMBB+7                 UPDATE R                    40410000
         SPACE 2                                                        40420000
EXCPSV10 L     R14,0(,R1)                   START OF CCHHKDD(DATA)      40430000
         CLC   CURMBB+3(5),0(R14)           CCHHR:STORAGE CCHHR         40440000
         BL    EXCPSV99                       LOW, NOT IN STORAGE       40450000
         BE    EXCPSV14                       EQUAL; SAVE AN EXCP       40460000
         OC    0(4,R14),0(R14)              END OF DATA?                40470000
         BZ    EXCPSV99                     YES, BRANCH                 40480000
         SPACE 1                                                        40490000
         SR    R15,R15                                                  40500000
         IC    R15,5(,R14)                  K, KEY LENGTH               40510000
         SR    R0,R0                                                    40520000
         ICM   R0,B'0011',6(R14)            DD, DATA LENGTH             40530000
         ST    R0,LS                                                    40540000
         LA    R14,8(R14,R15)               (DATA), START OF DATA       40550000
         ST    R14,EXCPBUFF                                             40560000
         AR    R14,R0                                                   40570000
         STCM  R14,B'0111',1(R1)            NEXT DATA ADDRESS           40580000
         B     EXCPSV10                                                 40590000
*  PREVIOUSLY READ DIRECTORY TRACK CONTAINS THIS TTR, REUSE IT          40600000
EXCPSV14 L     R15,ISAVSEEK                                             40610000
         MVC   IOBSEEK(LIOBDIR),0(R15)      RESTORE IOBSEEK INFORMATION 40620000
         MVI   IOECB,X'7F'                  RESET THE READ ECB          40630000
         B     EXCPCONT                                                 40640000
         SPACE 2                                                        40650000
EXCPSV20 DS    0H                                                       40660000
         LA    R1,FIRST4K                                               40670000
         LA    R1,IOBUFN-FIRST4K(,R1)         FIRST SAVED TRACK CONTROL 40680000
         LH    R0,INUMSAV                     NUMBER OF BUFFERS         40690000
         CNOP  0,8                            ALIGN FOR LOOP            40700000
EXCPSV22 CLC   IOBUFAN-IOBUFN(4,R1),CURMBB+3  THIS CCHH?                40710000
         BE    EXCPSV30                       YES, BRANCH               40720000
         LA    R1,32(,R1)                     NEXT ADDRESS              40730000
         BCT   R0,EXCPSV22                    CHECK ALL ADDRESSES       40740000
         B     EXCPSV50                       NOT FOUND READ THE TRACK  40750000
*                                                                       40760000
EXCPSV30 DS    0H                                                       40770000
         ST    R1,IBUFPTR                   POTENTIAL POINTER           40780000
         LA    R0,IOBUFCN-IOBUFN(,R1)                                   40790000
         ST    R0,ICONTROL                  POTENTIAL POINTER           40800000
         LA    R0,IOBUFSN-IOBUFN(,R1)                                   40810000
         ST    R0,ISAVSEEK                  POTENTIAL POINTER           40820000
*                                                                       40830000
         L     R1,ICONTROL                  CONTROL WORD                40840000
         L     R15,IBUFPTR                  BUFFER ADDRESS              40850000
         L     R15,0(,R15)                  BUFFER POINTER              40860000
         STCM  R15,B'0111',1(R1)            RESET START OF READ BUFFER  40870000
         CLC   4(4,R1),0(R15)               SAME CCHH STILL IN STORAGE? 40880000
         BNE   EXCPSV49                     NO, BRANCH                  40890000
         SR    R15,R15                                                  40900000
         IC    R15,CURMBB+7                 R-1                         40910000
         LA    R15,1(,R15)                  R                           40920000
         STC   R15,CURMBB+7                 UPDATE R                    40930000
         SPACE 2                                                        40940000
EXCPSV40 L     R14,0(,R1)                   START OF CCHHKDD(DATA)      40950000
         CLC   CURMBB+3(5),0(R14)           CCHHR:STORAGE CCHHR         40960000
         BL    EXCPSV49                       LOW, NOT IN STORAGE       40970000
         BE    EXCPSV60                       EQUAL; SAVE AN EXCP       40980000
         OC    0(4,R14),0(R14)              END OF DATA?                40990000
         BZ    EXCPSV49                     YES, BRANCH                 41000000
         SPACE 1                                                        41010000
         SR    R15,R15                                                  41020000
         IC    R15,5(,R14)                  K, KEY LENGTH               41030000
         SR    R0,R0                                                    41040000
         ICM   R0,B'0011',6(R14)            DD, DATA LENGTH             41050000
         ST    R0,LS                                                    41060000
         LA    R14,8(R14,R15)               (DATA), START OF DATA       41070000
         ST    R14,EXCPBUFF                                             41080000
         AR    R14,R0                                                   41090000
         STCM  R14,B'0111',1(R1)            NEXT DATA ADDRESS           41100000
         B     EXCPSV40                                                 41110000
         SPACE 2                                                        41120000
*  TRACK DOES NOT CONTAIN THIS TTR; INVALIDATE CCHH ADDRESS             41130000
EXCPSV49 L     R1,IBUFPTR                   START OF THIS TRACK CONTROL 41140000
         MVI   IOBUFAN-IOBUFN(R1),X'FE'     MARK CCHH AS INVALID        41150000
*  NEED TO READ A TRACK; ALLOCATE A TRACK CONTROL                       41160000
EXCPSV50 DS    0H                                                       41170000
         OI    CUREXT,X'80'                 MARK AS FIRST TRACK         41180000
         LA    R1,FIRST4K                                               41190000
         LA    R1,IOBUFN-FIRST4K(,R1)       FIRST SAVED TRACK CONTROL   41200000
         LH    R0,INXTSAV                   NEXT AVAILABLE              41210000
         MH    R0,=H'32'                    *32                         41220000
         AR    R1,R0                        TRACK CONTROL TO USE        41230000
         ST    R1,IBUFPTR                   BUFFER TO USE               41240000
         LA    R0,IOBUFCN-IOBUFN(,R1)                                   41250000
         ST    R0,ICONTROL                  CURRENT, ADDRESS            41260000
         OI    IOBUFAN-IOBUFN(R1),X'FC'     MARK CCHH AS INVALID        41270000
         LA    R0,IOBUFSN-IOBUFN(,R1)                                   41280000
         ST    R0,ISAVSEEK                  IOBSEEK AND RESET           41290000
         LH    R1,INXTSAV                   NEXT AVAILABLE TRK CONTROL  41300000
         LA    R1,1(,R1)                    NEXT AVAILABLE TRK CONTROL  41310000
         CH    R1,INUMSAV                   NEXT AVAILABLE TRK CONTROL  41320000
         BL    *+6                          NEXT AVAILABLE TRK CONTROL  41330000
         SR    R1,R1                        NEXT AVAILABLE TRK CONTROL  41340000
         STH   R1,INXTSAV                   NEXT AVAILABLE TRK CONTROL  41350000
         B     EXCPSV99                     DO A REAL EXCP              41360000
*  PREVIOUSLY READ TRACK CONTAINS THIS TTR, REUSE THIS TRACK BUFFER     41370000
EXCPSV60 L     R15,ISAVSEEK                                             41380000
         MVC   IOBSEEK(LIOBDIR),0(R15)      RESTORE IOBSEEK INFORMATION 41390000
         MVI   IOECB,X'7F'                  RESET THE READ ECB          41400000
         B     EXCPCONT                                                 41410000
         SPACE 2                                                        41420000
*  DIFFERENT TRACK OR DATA START NOT FOUND, DO A REAL EXCP              41430000
EXCPSV99 MVC   IOBSEEK(8),CURMBB            RESET THE DESIRED CCHHR     41440000
         CLC   IOBSEEK(8),LSTARMBB          LESS THAN DS1LSTAR?         41450000
         BL    EXCP1                        YES, BRANCH                 41460000
         TM    DSORG+1,DS1ACBM              VSAM DATA SET?              41470000
         BO    EXCP1                        YES, IGNORE DS1LSTAR        41480000
         TM    DSORG,DS1DSGIS               ISAM DATA SET?              41490000
         BO    EXCP1                        YES, IGNORE DS1LSTAR        41500000
         TM    DSORG,DS1DSGPO               PARTITIONED DATA SET?       41510000
         BNO   EXCPEND8                     NO, NO WARNING MESSAGE      41520000
         M$MSG L872                         OUTPUT A WARNING MESSAGE    41530000
         B     EXCPEND8                     TERMINATE I/O FOR THIS      41540000
         SPACE 1                                                        41550000
EXCP1    L     R1,INDCB+(DCBDEBAD-IHADCB)   DEB ADDRESS                 41560000
         LA    R1,16(,R1)                   CURRENT EXTENT POINTER - 16 41570000
         SR    R15,R15                                                  41580000
EXCP2    LA    R1,16(,R1)                   NEXT EXTENT POINTER         41590000
         CLM   R15,B'0001',IOBSEEK          THIS EXTENT?                41600000
         LA    R15,1(,R15)                                              41610000
         BNE   EXCP2                        NO, BRANCH                  41620000
         B     EXCPINIT                     YES, DO THE FIRST READ      41630000
         SPACE 2                                                        41640000
*    INITIALIZE CCHHR, SECTOR NUMBER AND READ IN THE LENGTH OF RECORD 1 41650000
EXCPXTNT SR    R1,R1                        AFTER THE FIRST EXTENT      41660000
         IC    R1,IOBSEEK                                               41670000
         A     R1,=F'1'                                                 41680000
         STC   R1,IOBSEEK                   INCREMENT EXTENT NUMBER     41690000
         CH    R1,NUMEXT                    WITHIN THE EXTENTS?         41700000
         BNL   EXCPEND8                     NO, NO FINAL EOF RECORDED   41710000
         L     R1,CUREXT                                                41720000
         LA    R1,16(,R1)                   CURRENT EXTENT ENTRY        41730000
         MVC   IOBSEEK+3(4),6(R1)           INITIAL CCHH                41740000
         MVI   IOBSEEK+7,0                  INITIAL R=0                 41750000
         SPACE 3                                                        41760000
EXCPINIT STCM  R1,B'0111',CUREXT+1          UPDATE FOR LATER            41770000
         MVI   SNO,0                        SET SECTOR NUMBER=ZERO      41780000
         L     R1,ICONTROL                  CURRENT BUFFER START        41790000
         MVI   0(R1),X'40'                  MARK AS A NEW ADDRESS       41800000
         CLI   DEVRPS,X'05'                 SAVE EXCP'S?                41810000
         BNE   EXCPINI2                     NO, BRANCH                  41820000
         OI    4(R1),X'FC'                  INVALIDATE THE EXTENT       41830000
         TM    ATTNECB,X'40'                ATTENTION SIGNALLED?        41840000
         BO    NEWCMD                       YES, BRANCH                 41850000
         SR    R1,R1                                                    41860000
         IC    R1,IOBSEEK+7                 R OF CCHHR                  41870000
         LA    R1,1(,R1)                    R+1                         41880000
         STC   R1,IOBSEEK+7                 R OF CCHHR                  41890000
         MVC   CURMBB(8),IOBSEEK            DISK ADDRESS OF THIS RECORD 41900000
         MVI   IOBSEEK+7,X'01'              READ FIRST RECORD ON TRACK  41910000
         MVI   IOECB,X'7F'                  RESET THE IO ECB            41920000
         B     EXCPEXCP                     PERFORM THE INPUT EXCP      41930000
EXCPINI2 MVI   4(R1),X'FE'                  INVALIDATE THE EXTENT       41940000
         SPACE 1                                                        41950000
EXCPREST LA    1,CCW1A                                                  41960000
         ST    1,IOBCCW                     CHANNEL PROGRAM ADDRESS     41970000
         MVI   IOECB,0                      ZERO THE ECB                41980000
         EXCP  IOB                                                      41990000
         WAIT  ECB=IOECB                                                42000000
         MVC   IOBCCW,EXCPCCWI              CHANNEL PROGRAM ADDRESS     42010000
         CLI   IOECB,X'7F'                  GOOD READ?                  42020000
         BNE   EXCPERRA                     NO, INITIAL READ FAILED     42030000
         SPACE 2                                                        42040000
EXCPCONT TM    ATTNECB,X'40'                ATTENTION SIGNALLED?        42050000
         BO    NEWCMD                       YES, BRANCH                 42060000
         SPACE 1                                                        42070000
         MVC   CURMBB(8),IOBSEEK            DISK ADDRESS OF THIS RECORD 42080000
         MVC   LS+2(2),DATALN               BLOCK LENGTH FOR THIS READ  42090000
         CLI   IOECB,X'42'                  EXTENT VIOLATION LAST TIME? 42100000
         BE    EXCPXTNT                     YES, DO THE NEXT EXTENT     42110000
         CLI   IOECB,X'7F'                  PREVIOUS READ OK?           42120000
         BNE   EXCPREST                     NO, RETRY WITH OTHER EXCP   42130000
         SPACE 3                                                        42140000
*   CHECK FOR READ MULTIPLE                                             42150000
EXCPEXCP TM    FLAGSEE,FDOUBCON+FFULLTRK    MULTIPLE DESIRED?           42160000
         BNZ   EXCPDOUB                     NO, BRANCH                  42170000
         TM    FLAGSII,FSINGLE              SINGLE BUFFERING REQUIRED?  42180000
         BO    EXCPDOUB                     YES, BRANCH                 42190000
         TM    RECFM,DCBRECTO               TRACK OVERFLOW DATA SET?    42200000
         BO    EXCPDOUB                     YES, BRANCH                 42210000
         L     R1,ICONTROL                  CONTROL WORDS ADDRESS       42220000
         CLI   0(R1),X'40'                  DEGRADED BUFFERING?         42230000
         BL    EXCPDOUB                     YES, BRANCH                 42240000
         LH    R14,IOLOGUSE                 COUNT OF SAVED I/O'S        42250000
         LA    R14,1(,R14)                                              42260000
         CLI   4(R1),X'FE'                  NEW TTR?                    42270000
         BE    EXCPTRK                      YES, BRANCH                 42280000
         L     R15,0(,R1)                   CURRENT DATA ADDRESS        42290000
         CLC   4(4,R1),0(R15)               ANY LOGICAL DATA RECORDS?   42300000
         BE    EXCPLOG                      YES, BRANCH                 42310000
         SPACE 1                                                        42320000
EXCPTRK  MVI   CCW3,X'5E'              READ MULTIPLE COUNT, KEY, DATA   42330000
         L     R14,IBUFPTR                  BUFFER POINTER              42340000
         L     R14,0(,R14)                  BUFFER ADDRESS              42350000
         STCM  R14,B'0111',CCW3+1           UPDATE READ BUFFER ADDRESS  42360000
         ST    R14,EXCPBUFF                 EXCP BUFFER ADDRESS         42370000
         SR    R15,R15                                                  42380000
         ICM   R15,B'0011',DEVTMAXT         ZERO FILL AND LENGTH        42390000
         STCM  R15,B'0011',CCW3+6           UPDATE READ LENGTH          42400000
         SPACE 1                                                        42410000
         L     R1,ICONTROL                  CONTROL WORDS ADDRESS       42420000
         CLI   4(R1),X'FE'                  NEW TTR?                    42430000
         BNE   EXCPTRK1                     NO, BYPASS MVCL             42440000
         SR    R0,R0                        NULL SOURCE                 42450000
         SR    R1,R1                        NULL SOURCE                 42460000
         MVCL  R14,R0                       FILL WITH PAD 0 FROM R1     42470000
         SPACE 1                                                        42480000
EXCPTRK1 SR    R0,R0                                                    42490000
         IC    R0,IOBSEEK+7                                             42500000
         BCTR  R0,0                                                     42510000
         STC   R0,IOBSEEK+7                 REDUCE IOBSEEK BY ONE       42520000
         MVI   SNO,0                        SECTOR ZERO                 42530000
***TEST  MVC   CCW4(8),CCWTIC                                           42540000
***TEST  LA    R1,CCW5                      USE A TIC                   42550000
***TEST  STCM  R1,B'0111',CCW4+1                                        42560000
         MVI   IOECB,0                      CLEAR IOECB                 42570000
         MVC   CCW4(8),CCW5  **TEST         MOVE DOWN COMMAND CHAIN     42580000
         MVC   CCW5(8),CCW6  **TEST         MOVE DOWN COMMAND CHAIN     42590000
         EXCP  IOB                          INITIATE TRACK I/O          42600000
         WAIT  ECB=IOECB                    WAIT FOR COMPLETION         42610000
         MVC   CCW6(8),CCW5  **TEST         RESET COMMAND CHAIN         42620000
         MVC   CCW5(8),CCW4  **TEST         RESET COMMAND CHAIN         42630000
         LH    R14,IOPHYTRK                                             42640000
         LA    R14,1(,R14)                  COUNT OF PHYSICAL TRACKS    42650000
         STH   R14,IOPHYTRK                                             42660000
         L     R1,ICONTROL                  CONTROL WORDS ADDRESS       42670000
         L     R15,EXCPBUFF                 START OF DATA               42680000
         ST    R15,0(,R1)                   SAVE FOR LATER              42690000
         MVC   4(4,R1),0(R15)               SAVE CCHH OF CCHHRKDL       42700000
         LH    R14,IOLOGUSE                 COUNT OF SAVED I/O'S        42710000
         MVC   0(1,R1),IOECB                SAVE THE ECB                42720000
         MVI   IOECB,X'7F'                  ASSUME GOOD READ            42730000
         SPACE 1                                                        42740000
         CLI   0(R1),X'42'                  NEW EXTENT (NEXT TRACK)?    42750000
         BE    EXCPINT                      YES, BRANCH                 42760000
         CLI   0(R1),X'7F'                  GOOD READ?                  42770000
         BNE   EXCPTRK6                     NO, BRANCH                  42780000
EXCPTRK2 CLC   IOBSEEK+3(4),CURMBB+3        NEXT CCHH EQUAL THIS CCHH?  42790000
         BNE   EXCPINT                      NO, SUCCESSFUL READ         42800000
         MVC   IOBSEEK(8),CURMBB            RESTORE THE DISK ADDRESS    42810000
         MVI   0(R1),0                      DEGRADED I/O BUFFERING      42820000
         L     R14,0(,R1)                   START OF INPUT RECORD       42830000
         MVC   IOBSEEK+8(3),5(R14)          RESET KDD FIELDS            42840000
         TM    ##ADRPA#,$Q                  QUIET MODE?                 42850000
         BO    EXCPDOUB                     YES, BRANCH                 42860000
         LA    R1,L893                      NEXT TTR IS INCORRECT       42870000
         B     EXCPTRKX                     OUTPUT ERROR MESSAGE        42880000
         SPACE 1                                                        42890000
EXCPTRK6 MVC   IOBSEEK(8),CURMBB            RESTORE THE DISK ADDRESS    42900000
         MVI   0(R1),0                      DEGRADED I/O BUFFERING      42910000
         TM    ##ADRPA#,$Q                  QUIET MODE?                 42920000
         BO    EXCPDOUB                     YES, BRANCH                 42930000
         LA    R1,L892                      READ MULTIPLE FAILED        42940000
         SPACE 1                                                        42950000
EXCPTRKX STM   R1,R12,24(R13)               PERMANENT I/O ERROR         42960000
         LA    R2,IOBSEEK                                               42970000
         L     R1,INDCB+(DCBDEBAD-IHADCB)   CONVERT MBBCCHHR TO TTR     42980000
         L     R15,ADDRRLTV                                             42990000
         LR    R3,R13                                                   43000000
         BASR  R14,R15                                                  43010000
         LR    R13,R3                                                   43020000
         LM    R1,R12,24(R13)                                           43030000
         SPACE 1                                                        43040000
         STCM  R0,B'1110',EXCPWRK           TTR OF THIS ERROR           43050000
         MVC   EXCPWRK+3(1),MTLEN                                       43060000
         MVC   EXCPWRK+4(8),INSERT#1                                    43070000
         UNPK  INSERT#1(7),EXCPWRK(4)                                   43080000
         TR    INSERT#1(6),TRTABLE                                      43090000
         MVI   MTLEN,6                      LENGTH OF THE TTR INSERT    43100000
         M$MSG (R1)                         OUTPUT THE ERROR MESSAGE    43110000
         MVC   MTLEN(1),EXCPWRK+3                                       43120000
         MVC   INSERT#1(8),EXCPWRK+4                                    43130000
         B     EXCPDOUB                     DO NORMAL INPUTS            43140000
         SPACE 2                                                        43150000
EXCPINT  DS    0H                           REPOSITION TO R OF CCHHR    43160000
         CLI   DEVRPS,X'05'                 SAVE EXCP'S?                43170000
         BNE   EXCPLOG                      NO, BRANCH                  43180000
*                                                                       43190000
EXCPINT2 L     R14,0(,R1)                   START OF CCHHKDD(DATA)      43200000
         CLC   CURMBB+3(5),0(R14)           CCHHR:STORAGE CCHHR         43210000
         BL    EXCPINT9                       LOW, NOT IN STORAGE       43220000
         BE    EXCPLOG2                       EQUAL FOUND               43230000
         OC    0(4,R14),0(R14)              END OF DATA?                43240000
         BZ    EXCPINT9                     YES, BRANCH                 43250000
         SPACE 1                                                        43260000
         SR    R15,R15                                                  43270000
         IC    R15,5(,R14)                  K, KEY LENGTH               43280000
         SR    R0,R0                                                    43290000
         ICM   R0,B'0011',6(R14)            DD, DATA LENGTH             43300000
         ST    R0,LS                                                    43310000
         LA    R14,8(R14,R15)               (DATA), START OF DATA       43320000
         ST    R14,EXCPBUFF                                             43330000
         AR    R14,R0                                                   43340000
         STCM  R14,B'0111',1(R1)            NEXT DATA ADDRESS           43350000
         B     EXCPINT2                                                 43360000
*                                                                       43370000
*  ERROR: NOT FOUND IN STORAGE, STOP SAVED EXCPS AND CONTINUE           43380000
EXCPINT9 MVI   DEVRPS,X'06'                 ERROR IN SAVED EXCP CODE    43390000
         B     EXCPTRK2                                                 43400000
         SPACE 2                                                        43410000
         CNOP  0,8                          ALIGN FOR LOOP              43420000
*  GET NEXT LOGICAL PHYSICAL RECORD                                     43430000
EXCPLOG  STH   R14,IOLOGUSE                 COUNT OF SAVED I/O'S        43440000
EXCPLOG2 L     R14,0(,R1)                   START OF NEXT RECORD        43450000
         MVC   CURMBB+3(5),0(R14)           CURRENT MBBCCHHR            43460000
         SR    R15,R15                                                  43470000
         IC    R15,5(,R14)                  KEY LENGTH                  43480000
         SR    R0,R0                                                    43490000
         ICM   R0,B'0011',6(R14)            DATA LENGTH                 43500000
         ST    R0,LS                                                    43510000
         LA    R14,8(R14,R15)               START OF ACTUAL DATA        43520000
         ST    R14,EXCPBUFF                                             43530000
         AR    R14,R0                                                   43540000
         STCM  R14,B'0111',1(R1)            NEXT DATA ADDRESS           43550000
         MVI   IOECB,X'7F'                  ASSUME NORMAL INPUT         43560000
         CLC   0(4,R14),4(R1)               SAME TRACK ADDRESS?         43570000
         BE    *+10                         YES, BRANCH                 43580000
         MVC   IOECB(1),0(R1)               RESET THE IOECB             43590000
         B     EXCPFIN                                                  43600000
         SPACE 3                                                        43610000
* CHECK FOR DOUBLE BUFFERING                                            43620000
EXCPDOUB MVC   CCW3(8),CCWREAD              READ KEY AND DATA           43630000
         L     R1,IOBUFF1                   STANDARD BUFFER ADDRESS     43640000
         TM    FLAGSII,FDIRGRP              DIRECTORY GROUP INPUT?      43650000
         BNO   *+8                          NO, BRANCH                  43660000
         L     R1,IODIR1                    DIRECTORY BUFFER ADDRESS    43670000
         MVC   0(8,R1),IOBSEEK+3            SAVE THE CCHHRKDD DATA      43680000
         LA    R1,8(,R1)                    SKIP PAST CCHHRKDD BYTES    43690000
         STCM  R1,B'0111',CCW3+1            UPDATE READ BUFFER ADDRESS  43700000
         TM    RECFM,DCBRECTO               TRACK OVERFLOW DATA SET?    43710000
         BO    EXCPSING                     YES, BRANCH                 43720000
         TM    FLAGSEE,FDOUBCON+FFULLTRK    CONTROL SINGLE?             43730000
         BO    EXCPSING                     YES, BRANCH                 43740000
         TM    FLAGSII,FSINGLE+FNOTDOUB     THEN/ELSE(DELETE), RESTORE? 43750000
         BNZ   EXCPSING                     YES, BRANCH                 43760000
         MVC   CCW4(8),CCWREAD              INITIALIZE SECOND READ CCW  43770000
         MVI   CCW4,X'9E'                   MT READ COUNT, KEY, DATA    43780000
         L     R14,IODIR2                   ASSUME DIRECTORY INPUT      43790000
         TM    FLAGSII,FDIRGRP              CORRECT?                    43800000
         BO    *+8                          YES, BRANCH                 43810000
         L     R14,IOBUFF2                  NO, NORMAL INPUT            43820000
         STCM  R14,B'0111',CCW4+1                                       43830000
         SPACE 1                                                        43840000
         L     R1,ICONTROL                                              43850000
         CLI   0(R1),X'3F'                  GOOD READ?                  43860000
         BE    EXCPSEC                      YES, BRANCH                 43870000
         CLI   0(R1),X'02'                  NEW EXTENT NEXT TIME?       43880000
         BE    EXCPSEC                      YES, BRANCH                 43890000
         SPACE 1                                                        43900000
         MVI   IOECB,0                      ZERO THE ECB                43910000
         EXCP  IOB                                                      43920000
         WAIT  ECB=IOECB                                                43930000
         SPACE 1                                                        43940000
         L     R1,ICONTROL                                              43950000
         MVC   0(1,R1),IOECB                SAVE THE ECB                43960000
         NI    0(R1),FF-X'40'               REDUCE BY X'40'             43970000
         MVI   IOECB,X'7F'                  ASSUME A GOOD READ          43980000
         L     R14,CCW3                     LOAD FIRST BUFFER ADDRESS   43990000
         SH    R14,=H'8'                    BACK UP TO CCHHRKDD         44000000
         CLI   0(R1),X'3F'                  GOOD READ?                  44010000
         BE    EXCPSEC2                     YES, BRANCH                 44020000
         LA    R15,CCW5                     IF SECOND FAILED            44030000
         CLI   0(R1),X'02'                  NEW EXTENT?                 44040000
         BNE   EXCPDOU2                     NO, BRANCH                  44050000
         C     R15,IOBCSW                   FAILED ON:                  44060000
         BH    EXCPXTNT                       FIRST, BRANCH             44070000
         BE    EXCPSEC1                       SECOND, MARK NEXT INPUT   44080000
         B     EXCPSEC2                       THIRD, MARK AFTER NEXT    44090000
         SPACE 1                                                        44100000
EXCPDOU2 TM    IOBCSW+4,X'01'               X'41', END OF FILE?         44110000
         BNO   EXCPDOU4                     NO, BRANCH                  44120000
         MVI   0(R1),X'3F'                  YES, READ NEXT RECORD       44130000
         C     R15,IOBCSW                   FAILED ON FIRST?            44140000
         BNH   EXCPSEC2                     NO, BRANCH                  44150000
         MVI   0(R1),0                      READ THE NEXT BLOCK         44160000
         MVC   IOBSEEK+3(5),0(R14)          CURRENT MBBCCHHR            44170000
         SR    R0,R0                                                    44180000
         IC    R0,IOBSEEK+7                 R OF MBBCCHHR               44190000
         AH    R0,=H'1'                     NEXT R                      44200000
         STC   R0,IOBSEEK+7                 UPDATE FOR NEXT READ        44210000
         B     EXCPSEC2                                                 44220000
         SPACE 1                                                        44230000
EXCPDOU4 MVI   0(R1),0                      READ THE NEXT BLOCK         44240000
         MVC   IOBSEEK+3(5),0(R14)          CURRENT MBBCCHHR            44250000
         SR    R0,R0                                                    44260000
         IC    R0,IOBSEEK+7                 R OF MBBCCHHR               44270000
         AH    R0,=H'1'                     NEXT R                      44280000
         STC   R0,IOBSEEK+7                 UPDATE FOR NEXT READ        44290000
         SPACE 1                                                        44300000
         C     R15,IOBCSW                   FAILED ON FIRST?            44310000
         BNH   EXCPSEC2                     NO, BRANCH                  44320000
         MVI   IOECB,X'41'                  PERMANENT I/O ERROR         44330000
         MVC   IOBSEEK(8),CURMBB            RESET THE SEEK ADDRESS      44340000
         B     EXCPERR                                                  44350000
         SPACE 2                                                        44360000
EXCPSEC  LH    R14,IOLOGUSE                                             44370000
         LA    R14,1(,R14)                                              44380000
         STH   R14,IOLOGUSE                                             44390000
         L     R14,CCW4                     LOAD SECOND BUFFER ADDRESS  44400000
EXCPSEC1 MVC   IOECB(1),0(R1)               RESET THE ECB               44410000
         OI    IOECB,X'40'                  ADD X'40'                   44420000
         MVI   0(R1),0                      READ THE NEXT BLOCK         44430000
         SPACE 1                                                        44440000
EXCPSEC2 MVC   CURMBB+3(5),0(R14)           CURRENT MBBCCHHR            44450000
         SR    R15,R15                                                  44460000
         IC    R15,5(,R14)                  KEY LENGTH                  44470000
         SR    R0,R0                                                    44480000
         ICM   R0,B'0011',6(R14)            DATA LENGTH                 44490000
         ST    R0,LS                                                    44500000
         LA    R14,8(R14,R15)               START OF ACTUAL DATA        44510000
         ST    R14,EXCPBUFF                                             44520000
         B     EXCPFIN                                                  44530000
         SPACE 3                                                        44540000
*  IF ALL ELSE FAILS, TRY SINGLE BUFFERING                              44550000
EXCPSING MVC   CCW4(8),CCWTIC               USE A TIC                   44560000
         LA    R1,CCW5                                                  44570000
         STCM  R1,B'0111',CCW4+1            WHERE TO TIC                44580000
         SPACE 1                                                        44590000
         MVI   IOECB,0                      ZERO THE ECB                44600000
         EXCP  IOB                                                      44610000
         WAIT  ECB=IOECB                                                44620000
         L     R1,ISAVSEEK                  SAVE IOBSEEK INFORMATION    44630000
         MVC   0(LIOBDIR,R1),IOBSEEK        SAVE IOBSEEK INFORMATION    44640000
         SPACE 1                                                        44650000
         L     R1,ICONTROL                                              44660000
         MVI   0(R1),0                                                  44670000
         L     R14,CCW3                     POINT TO OUTPUT BUFFER      44680000
         SH    R14,=H'8'                    BACK UP TO CCHHRKDD         44690000
         CLI   IOECB,X'41'                  X'42' OR X'7F'?             44700000
         BH    EXCPSIN2                     YES, BRANCH                 44710000
         TM    IOBCSW+4,X'01'               X'41', END OF FILE?         44720000
         BNO   EXCPERR                      NO, BRANCH                  44730000
         SPACE 1                                                        44740000
EXCPSIN2 MVC   CURMBB+3(5),0(R14)           CURRENT MBBCCHHR            44750000
         SR    R15,R15                                                  44760000
         IC    R15,5(,R14)                  KEY LENGTH                  44770000
         SR    R0,R0                                                    44780000
         ICM   R0,B'0011',6(R14)            DATA LENGTH                 44790000
         ST    R0,LS                                                    44800000
         LA    R14,8(R14,R15)               START OF ACTUAL DATA        44810000
         ST    R14,EXCPBUFF                                             44820000
         SPACE 1                                                        44830000
         TM    RECFM,DCBRECTO               RECORD OVERFLOW DATA SET?   44840000
         BNO   EXCPFIN                      NO, BRANCH                  44850000
         CLI   IOBSEEK+7,2                  THIS R OF CCHHR=2?          44860000
         BNE   EXCPFIN                      NO, BRANCH                  44870000
         CLI   CURMBB+7,1                   THIS R OF CCHHR=1?          44880000
         BE    EXCPFIN                      YES, BRANCH                 44890000
         SPACE 1                                                        44900000
*  TRACK OVERFLOW RECORDS READ OK: HOWEVER, THE LENGTH                  44910000
*       IS SET TO THE FIRST SEGMENT OF A SPLIT RECORD.                  44920000
         AR    R14,R0                                                   44930000
         ICM   R0,B'0011',6(R14)            LENGTH OF SECOND SEGMENT    44940000
         L     R1,LS                        LENGTH OF FIRST SEGMENT     44950000
         AR    R1,R0                                                    44960000
         ST    R1,LS                        COMBINED RECORD LENGTH      44970000
         LA    R1,8(,R14)                   START OF SECOND SEGMENT     44980000
         LR    R15,R14                      END OF FIRST SEGMENT        44990000
         LR    R14,R0                       LENGTH TO MOVE              45000000
         MVCL  R14,R0                       SLIDE DOWN BY 8 BYTES       45010000
         L     R0,LS                                                    45020000
         SPACE 3                                                        45030000
EXCPFIN  LTR   R0,R0                        END OF FILE?                45040000
         BZ    EXCPFIN2                     YES, BRANCH                 45050000
         CLI   IOECB,X'42'                  EXTENT PROBLEM (NEXT TIME)? 45060000
         BE    EXCPEND0                     YES, QUIT                   45070000
EXCPFIN2 TM    DSORG+1,DS1ACBM              VSAM DATA SET?              45080000
         BO    EXCPFIN4                     YES, IGNORE DS1LSTAR        45090000
         TM    DSORG,DS1DSGIS               ISAM DATA SET?              45100000
         BO    EXCPFIN4                     YES, IGNORE DS1LSTAR        45110000
         CLC   CURMBB(8),LSTARMBB           CURRENT:DS1LSTAR            45120000
         BH    EXCPEND8                       HIGH, END OF DATA SET     45130000
         BL    EXCPFIN4                       LOW, GOOD READ            45140000
         TM    DSORG,DS1DSGPO                 EQUAL, PARTITIONED?       45150000
         BO    EXCPEND8                              YES, END OF DATA   45160000
         SPACE 1                                                        45170000
EXCPFIN4 LTR   R0,R0                        END OF MEMBER OR DATA SET?  45180000
         BP    EXCPEND0                     NO, BRANCH                  45190000
         TM    DSORG,DS1DSGPS+DS1DSGDA      DSORG=PS OR DA?             45200000
         BM    EXCPEND8                     YES, END OF DATA SET        45210000
         TM    DSORG+1,DS1ACBM              VSAM DATA SET?              45220000
         BO    EXCPEND8                     YES, END OF DATA SET        45230000
         B     EXCPEND4                     END OF MEMBER               45240000
         SPACE 3                                                        45250000
EXCPERRA SR    R0,R0                        FIRST READ OF EXTENT ERROR  45260000
         IC    R0,IOBSEEK+7                                             45270000
         A     R0,=F'1'                                                 45280000
         STC   R0,IOBSEEK+7                 ADD 1 TO R OF MBBCCHHR      45290000
         TM    ##ADRPA#,$Q                  QUIET MODE I/O?             45300000
         BO    EXCPERR+6                    YES, BRANCH                 45310000
         M$ERRST MSGBLANK                                               45320000
         M$MSG L990                         INITIALIZATION READ FAILED  45330000
         B     EXCPERR+6                                                45340000
         SPACE 1                                                        45350000
EXCPERR  MVC   IOBSEEK(8),CURMBB            CURRENT MBBCCHHR            45360000
         STM   R2,R12,28(R13)               PERMANENT I/O ERROR         45370000
         LA    R2,IOBSEEK                                               45380000
         L     R1,INDCB+(DCBDEBAD-IHADCB)   CONVERT MBBCCHHR TO TTR     45390000
         L     R15,ADDRRLTV                                             45400000
         LR    R3,R13                                                   45410000
         BASR  R14,R15                                                  45420000
         LR    R13,R3                                                   45430000
         LM    R2,R12,28(R13)                                           45440000
         STCM  R0,B'1110',MSGTEXT1+20       TTR OF THIS ERROR           45450000
         UNPK  INSERT#1(7),MSGTEXT1+20(4)                               45460000
         TR    INSERT#1(6),TRTABLE                                      45470000
         MVC   INSERT#1+6(2),BLANKS                                     45480000
         LA    R15,12                   *** PERMANENT I/O ERROR         45490000
         TM    ##ADRPA#,$Q                  QUIET MODE I/O?             45500000
         BO    EXCPENDZ                     YES, BRANCH                 45510000
         M$ERRST MSGBLANK                                               45520000
         MVC   INSERT#1+8(1),MTLEN          PRESERVE CURRENT LENGTH     45530000
         MVI   MTLEN,6                      LENGTH OF THE TTR INSERT    45540000
         M$MSG L991$1                                                   45550000
         MVC   MTLEN(1),INSERT#1+8          RESET MESSAGE LENGTH        45560000
         LA    R15,12                   *** PERMANENT I/O ERROR         45570000
         B     EXCPENDZ                                                 45580000
         SPACE 5                                                        45590000
EXCPEND8 LA    R15,8                    *** END OF DATA SET             45600000
         B     EXCPENDZ                                                 45610000
EXCPEND4 LA    R15,4                    *** END OF MEMBER OR ISAM AREA  45620000
         B     EXCPENDZ                                                 45630000
EXCPEND0 SR    R15,R15                  *** SUCCESSFUL READ             45640000
         L     R0,EXCPBUFF              EXCP BUFFER ADDRESS             45650000
EXCPENDZ L     R14,ISAVSEEK                 SAVE IOBSEEK INFORMATION    45660000
         MVC   0(LIOBDIR,R14),IOBSEEK       SAVE IOBSEEK INFORMATION    45670000
         TM    FLAGSII,FDIRGRP              DIRECTORY READ?             45680000
         BO    EXCPOUT                      YES, BRANCH                 45690000
         MVC   IBUFSAV(12),IBUFPTR ISAVSEEK ICONTROL -- SAVE I/O BUFFER 45700000
EXCPOUT  L     R8,R8EXCP                                                45710000
         L     R14,R14EXCP                                              45720000
         BR    R14                                                      45730000
         TITLE 'P D S  --  PDSE READ DIRECTORY SUBROUTINE    08/04/05'  45740000
*                                                                       45750000
*        READ PDSE DIRECTORY SUBROUTINE                                 45760000
*                                                                       45770000
         SPACE 1                                                        45780000
PDSEDIR  CSECT                                                DRK AUG05 45790000
         USING *,R8                                           DRK AUG05 45800000
         ST    R14,R14EXCP                                    DRK AUG05 45810000
         ST    R8,R8EXCP                                      DRK AUG05 45820000
         ST    R6,R6SAVE                                      DRK AUG05 45830000
         LR    R8,R15                                         DRK AUG05 45840000
         LA    R14,@4K                      BASE FOR PDSEDCB  DRK AUG05 45850000
         LA    R6,PDSEDCB-@4K(,R14)         A(PDSEDCB)        DRK AUG05 45860000
         TM    FLAGSAA,FADSDIR              DISPLAY CALLING?   GP SEP05 45870000
         BNO   PDSEOORC                     NO, GO SEE IF OPEN GP SEP05 45880000
         CLI   STARTTR+2,X'01'              REQUEST FOR 1ST?   GP SEP05 45890000
         BNE   PDSEDSRD                     NO, LOOK AT CACHE  GP SEP05 45900000
         XC    DOUBLE,DOUBLE                CLEAR POINTERS     GP SEP05 45910000
         LD    R2,DOUBLE                    SET FPR2 TO ZERO   GP SEP05 45920000
PDSEOORC EQU   *                            OPEN OR CLOSED?    GP SEP05 45930000
         TM    DCBOFLGS-IHADCB(R6),DCBOFOPN DCB OPEN?         DRK AUG05 45940000
         BO    PDSESTRT                     YES               DRK AUG05 45950000
         B     PDSEOPEN                     NO                DRK AUG05 45960000
PDSESTRT DS    0H                                             DRK AUG05 45970000
         CLI   STARTTR+2,X'01'              TTR=000001        DRK AUG05 45980000
         BNE   PDSEGET                      NOT 1ST BLOCK REQ DRK AUG05 45990000
         MVI   OPENLIST,X'80'                                 DRK AUG05 46000000
         CLOSE ((R6)),MF=(E,OPENLIST)       CLOSE/OPEN        DRK AUG05 46010000
PDSEOPEN DS    0H                                             DRK AUG05 46020000
         MVC   0(LDIREDCB,R6),DIREDCB       MOVE DCB PATTERN  DRK AUG05 46030000
         MVC   DCBDDNAM-IHADCB(,R6),DDNAME                    DRK AUG05 46040000
         MVI   OPENLIST,X'80'                                 DRK AUG05 46050000
         OPEN  ((R6),INPUT),MF=(E,OPENLIST)                   DRK AUG05 46060000
PDSEGET  DS    0H                                             DRK AUG05 46070000
         MVI   STARTTR+2,X'00'              TTR=000000        DRK AUG05 46080000
         LA    R14,@4K                      BASE FOR PDSEDCB  DRK AUG05 46090000
         LA    R6,PDSEDCB-@4K(,R14)         A(PDSEDCB)         GP SEP05 46100000
         GET   (R6)                         GET LOCATE        DRK AUG05 46110000
         LH    R14,IOEDIR                                     DRK SEP05 46120000
         LA    R14,1(,R14)                  COUNT OF DIR BLKS DRK SEP05 46130000
         STH   R14,IOEDIR                                     DRK SEP05 46140000
         TM    FLAGSAA,FADSDIR              DISPLAY CALLING?   GP SEP05 46150000
         BNO   PDSEGOT                      NO, RETURN BLOCK   GP SEP05 46160000
         LR    R6,R1                        SAVE BLOCK ADDRESS GP SEP05 46170000
         LA    R0,8+256                     SET SIZE           GP SEP05 46180000
         ICM   R0,8,=AL1(19)                SET SUBPOOL        GP SEP05 46190000
         GETMAIN R,LV=(0)                   GET STORAGE        GP SEP05 46200000
         XC    0(8,R1),0(R1)                RESET LINKS        GP SEP05 46210000
         MVC   8(256,R1),0(R6)              COPY DIR BLOCK     GP SEP05 46220000
         ICM   R14,15,DOUBLE+4              GET PREVIOUS BUFR  GP SEP05 46230000
         ST    R1,DOUBLE+4                  SAVE FOR NEXT TIME GP SEP05 46240000
         BNZ   PDSEREGT                     IS NO PREVIOUS     GP SEP05 46250000
         ST    R1,DOUBLE                    SAVE FIRST ADDRESS GP SEP05 46260000
         LD    R2,DOUBLE                    SET BLK TO RETURN  GP SEP05 46270000
         B     PDSEGET                      THIS IS FIRST BLK  GP SEP05 46280000
PDSEREGT ST    R1,0(,R14)                   SET FORWARD LINK   GP SEP05 46290000
         ST    R14,4(,R1)                   SET BACKWARD LINK  GP SEP05 46300000
         B     PDSEGET                      GO KEEP READING    GP SEP05 46310000
PDSEGOT  EQU   *                            GOT A BLOCK        GP SEP05 46320000
         LR    R0,R1                        R0 --> BUFFER     DRK AUG05 46330000
         MVC   LS(4),=F'256'                BLOCKSIZE         DRK AUG05 46340000
         SR    R15,R15                  *** SUCCESSFUL READ   DRK AUG05 46350000
         B     PDSEOUT                                        DRK AUG05 46360000
PDSEEOF  DS    0H                                             DRK AUG05 46370000
         MVI   OPENLIST,X'80'                                 DRK AUG05 46380000
         CLOSE ((R6)),MF=(E,OPENLIST)                         DRK AUG05 46390000
         LA    R15,8                    *** END OF DIRECTORY  DRK AUG05 46400000
         TM    FLAGSAA,FADSDIR              DISPLAY CALLING?   GP SEP05 46410000
         BNO   PDSEOUT                      NO, HAVE RESULT    GP SEP05 46420000
PDSEDSRD STD   R2,DOUBLE                    GET STATUS         GP SEP05 46430000
         ICM   R6,15,DOUBLE                 POINT TO BLOCK     GP SEP05 46440000
         BZ    PDSENDDS                     DONE ALL BLOCKS    GP SEP05 46450000
         LD    R2,0(,R6)                    SAVE DTLS OF NEXT  GP SEP05 46460000
         ICM   R1,15,4(R6)                  POINT TO PREVIOUS  GP SEP05 46470000
         BZ    PDSEDSGT                     MUST HAVE BEEN 1ST GP SEP05 46480000
         LA    R0,8+256                     SET SIZE           GP SEP05 46490000
         ICM   R0,8,=AL1(19)                SET SUBPOOL        GP SEP05 46500000
         FREEMAIN R,LV=(0),A=(1)            FREE PROCESSED BLK GP SEP05 46510000
PDSEDSGT LA    R1,8(,R6)                    POINT TO BLOCK     GP SEP05 46520000
         B     PDSEGOT                      RETURN IT          GP SEP05 46530000
PDSENDDS LA    R15,8                    *** END OF DIRECTORY   GP SEP05 46540000
PDSEOUT  DS    0H                                             DRK AUG05 46550000
         L     R6,R6SAVE                                      DRK AUG05 46560000
         L     R8,R8EXCP                                      DRK AUG05 46570000
         L     R14,R14EXCP                                    DRK AUG05 46580000
         BR    R14                                            DRK AUG05 46590000
         TITLE 'P D S  --  PDS/PDSE BPAM READ SUBROUTINE   2005-08-09'  46600000
*                                                              GP AUG05 46610000
*        PAM SUBROUTINE                                        GP AUG05 46620000
*                                                              GP AUG05 46630000
*  ADDED FOR PDSE SUPPORT BUT SHOULD ALSO WORK FOR PDS.        GP AUG05 46640000
*                                                              GP AUG05 46650000
*        R8 IS ALREADY SAVED IN R8EXCP                         GP AUG05 46660000
*        R14 IS ALREADY SAVED IN R14EXCP                       GP AUG05 46670000
*        IODONE IS ALREADY INCREMENTED                         GP AUG05 46680000
*                                                              GP AUG05 46690000
PAM      CSECT                                                 GP AUG05 46700000
         USING *,R8                                            GP AUG05 46710000
         LR    R8,R15                                          GP AUG05 46720000
         TM    DCBOFLGS-IHADCB+INDCB,DCBOFOPN                  GP AUG05 46730000
         BNO   PAMISCLS                INDCB IS CLOSED         GP AUG05 46740000
         TM    FLAGSJJ,FNOREAD         NO INPUT MODE?          GP AUG05 46750000
         BO    PAMCLSIT                YES, GO THROUGH CLOSE AND OPEN " 46760000
         L     R1,DCBDEBAD-IHADCB+INDCB NO, POINT TO THE DEB   GP AUG05 46770000
         USING DEBBASIC,R1                                     GP AUG05 46780000
         TM    DEBOPATB,DEBACCS        OPEN FOR INPUT?         GP AUG05 46790000
         BZ    PAMISINP                YES                     GP AUG05 46800000
         DROP  R1                      DEBBASIC                GP AUG05 46810000
         TM    #REPFLAG,LIST#REP       NO, UPDATE - SHOULD IT BE?     " 46820000
         BO    PAMISRDY                YES, PROCEED            GP AUG05 46830000
         B     PAMCLSIT                NO, NEED TO CHANGE      GP AUG05 46840000
         SPACE 1                                               GP AUG05 46850000
PAMISINP TM    #REPFLAG,LIST#REP       INPUT - SHOULD IT BE?   GP AUG05 46860000
         BNO   PAMISRDY                YES, PROCEED            GP AUG05 46870000
         SPACE 1                                               GP AUG05 46880000
PAMCLSIT MVI   OPENLIST,X'80'                                  GP AUG05 46890000
         CLOSE INDCB,MF=(E,OPENLIST)   CLOSE INDCB             GP AUG05 46900000
         BAS   R2,DEQ                  RELEASE THE DEVICE      GP AUG05 46910000
         SPACE 1                                               GP AUG05 46920000
PAMISCLS MVI   OPENLIST,X'80'                                  GP AUG05 46930000
         TM    #REPFLAG,LIST#REP       NEED TO UPDATE IN PLACE?       " 46940000
         BNO   PAMINPUT                NO                      GP AUG05 46950000
         ST    R6,R6SAVE                                      DRK AUG05 46960000
         BAS   R6,RESERVE              RESERVE THE DEVICE      GP AUG05 46970000
         L     R6,R6SAVE                                      DRK AUG05 46980000
         OPEN  (INDCB,UPDAT),MF=(E,OPENLIST)                   GP AUG05 46990000
         B     PAMISRDY                RIGHT ENTRY TO UPDATE STATS    " 47000000
PAMINPUT EQU   *                                               GP AUG05 47010000
         OPEN  (INDCB,INPUT),MF=(E,OPENLIST)                   GP AUG05 47020000
         SPACE 1                                               GP AUG05 47030000
PAMISRDY TM    FLAGSJJ,FNOREAD         NO INPUT MODE?          GP AUG05 47040000
         BO    PAMEND0                 YES, DONE               GP AUG05 47050000
         LA    R0,PAMEND4              ENSURE EODAD EXIT SET   GP AUG05 47060000
         STCM  R0,7,DCBEODA-IHADCB+INDCB                       GP AUG05 47070000
         ICM   R0,B'1111',STARTTR      NEW TTR ADDRESS?        GP AUG05 47080000
         BZ    PAMGET                  NO, GET NEXT RECORD     GP AUG05 47090000
         LH    R1,IODONEW              ANOTHER                 GP AUG05 47100000
         LA    R1,1(,R1)                      TTR              GP AUG05 47110000
         STH   R1,IODONEW                        CHANGE        GP AUG05 47120000
         FIND  INDCB,DIRNAME,D         POINT TO MEMBER FOR FIRST READ " 47130000
         CH    R15,=H'4'               HANDLE PROBLEMS         GP AUG05 47140000
         BE    NOMEMBER                TALK ABOUT UNLUCKY...   GP AUG05 47150000
         BH    IOERROR                                         GP AUG05 47160000
PAMGET   L     R2,IOBUFF1              START OF BUFFER         GP AUG05 47170000
         LA    R2,8(,R2)               POINT TO DATA AREA      GP AUG05 47180000
         ST    R2,EXCPBUFF             SAVE THE ADDRESS        GP AUG05 47190000
         SPACE 1                                               GP AUG05 47200000
         NI    FLAGSAA,255-FAIOERR     CLEAR I/O ERROR FLAG    GP AUG05 47210000
         READ  FIXPDSD,SF,INDCB,(2),'S',MF=E                   GP AUG05 47220000
         CHECK FIXPDSD                                         GP AUG05 47230000
         TM    FLAGSAA,FAIOERR         I/O ERROR?              GP AUG05 47240000
         BO    PAMEND12                YES                     GP AUG05 47250000
         NOTE  INDCB                   GET CURRENT TTRZ        GP AUG05 47260000
         XC    CURMBB,CURMBB           CLEAR MBBCCHHR AREA     GP AUG05 47270000
         STCM  R1,B'1110',CURMBB+5     SAVE CURRENT TTR        GP AUG05 47280000
         ICM   R14,B'1111',STARTTR     FIRST BLOCK OF MEMBER?  GP AUG05 47290000
         BZ    PAMTTROK                NO                      GP AUG05 47300000
         STCM  R1,B'1110',DIRTTR       YES, ENSURE RIGHT TTR FOR STOW " 47310000
PAMTTROK LH    R1,DCBBLKSI-IHADCB+INDCB                        GP AUG05 47320000
         L     R14,FIXPDSD+16          POINT TO THE IOB        GP AUG05 47330000
         SH    R1,14(,R14)             GET BLOCK LENGTH        GP AUG05 47340000
         ST    R1,LS                   SAVE IT                 GP AUG05 47350000
         L     R14,IOBUFF1             START OF BUFFER         GP AUG05 47360000
         MVC   0(8,R14),CURMBB         JUST IN CASE OTHER ROUTINES... " 47370000
         L     R0,EXCPBUFF             POINT TO THE BLOCK JUST READ   " 47380000
PAMEND0  SR    R15,R15             *** SUCCESSFUL READ         GP AUG05 47390000
PAMOUT   XC    STARTTR,STARTTR         ZERO THE TTR            GP AUG05 47400000
         L     R8,R8EXCP                                       GP AUG05 47410000
         L     R14,R14EXCP                                     GP AUG05 47420000
         BR    R14                                             GP AUG05 47430000
*                                                              GP AUG05 47440000
PAMEND4  LA    R15,4               *** END OF MEMBER           GP AUG05 47450000
         B     PAMOUT                                          GP AUG05 47460000
*                                                              GP AUG05 47470000
PAMEND12 EQU   *                                               GP AUG05 47480000
         M$ERRST (R2)                  DISPLAY I/O ERROR DETAILS      " 47490000
         SR    R0,R0                                           GP AUG05 47500000
         ICM   R0,3,0(R2)              GET LENGTH OF THIS MESSAGE     " 47510000
         AR    R2,R0                   POINT TO NEXT MESSAGE   GP AUG05 47520000
         CLI   1(R2),0                 ANY FURTHER MESSAGE?    GP AUG05 47530000
         BNE   PAMEND12                YES, GO SHOW IT         GP AUG05 47540000
         LA    R15,12              *** I/O ERROR               GP AUG05 47550000
         B     PAMOUT                                          GP AUG05 47560000
*                                                              GP AUG05 47570000
         DROP  R8                      PAM                     GP AUG05 47580000
*                                                              GP AUG05 47590000
         USING PAMSYNAD,R15                                    GP AUG05 47600000
PAMSYNAD EQU   *                                               GP AUG05 47610000
         OI    FLAGSAA,FAIOERR         FLAG I/O ERROR          GP AUG05 47620000
         SYNADAF ACSMETH=BPAM                                  GP AUG05 47630000
         XC    0(4,R2),0(R2)           CLEAR FIRST PUTLINE HEADER     " 47640000
         MVI   1(R2),82                SET MESSAGE LENGTH      GP AUG05 47650000
         MVC   4(78,R2),50(R1)         SET MESSAGE TEXT        GP AUG05 47660000
         CLI   127(R1),C'S'            SECOND MESSAGE?         GP AUG05 47670000
         BNE   PAMMSGOK                NO                      GP AUG05 47680000
         MVC   82(124,R2),140(R1)      YES, LOAD SECOND MESSAGE       " 47690000
         AH    R2,82(,R2)              ADD LENGTH OF SECOND MESSAGE   " 47700000
PAMMSGOK XC    82(4,R2),82(R2)         INDICATE NO FURTHER MESSAGE    " 47710000
         SYNADRLS                                              GP AUG05 47720000
         BR    R14                                             GP AUG05 47730000
*                                                              GP AUG05 47740000
*        EQUATES COPIED FROM @LIST                             GP AUG05 47750000
LISTUPDE EQU   X'80'                   #REPFLAG -- UPDATE ERROR       " 47760000
LISTUPDO EQU   X'40'                   #REPFLAG -- UPDATE OPEN        " 47770000
LISTUPDR EQU   X'20'                   #REPFLAG -- UPDATE THIS BLOCK  " 47780000
LISTUPQT EQU   X'10'                   #REPFLAG -- QUIET MODE UPDATE  " 47790000
LISTTERM EQU   X'08'                   #REPFLAG -- TERMINATE UPDATE   " 47800000
LIST#REP EQU   X'01'                   #REPFLAG -- WRITE FLAG         " 47810000
         DROP  R15                     PAMSYNAD                GP AUG05 47820000
PDSMAIN  CSECT                                                          47830000
         TITLE 'P D S  --  PDS CLOSE DCB ROUTINE             09/28/88'  47840000
*                                                                       47850000
*        CLOSE DCB'S                                                    47860000
*                                                                       47870000
CLOSEIT  MVI   FLAGSII,0               CLEAR THE I/O FLAGS              47880000
         SPACE 1                                                        47890000
         MVI   OPENLIST,0                                               47900000
         MVI   OPENLIST+4,X'80'                                         47910000
         CLOSE (INDCB,,STOWDCB),MF=(E,OPENLIST)                         47920000
         MVC   BLKSI(2),ZERO           CLEAR THE BLOCKSIZE              47930000
         ST    R6,R6SAVE                                      DRK AUG05 47940000
         LA    R14,@4K                      BASE FOR PDSEDCB  DRK AUG05 47950000
         LA    R6,PDSEDCB-@4K(,R14)         A(PDSEDCB)        DRK AUG05 47960000
         TM    DCBOFLGS-IHADCB(R6),DCBOFOPN DCB OPEN?         DRK AUG05 47970000
         BNO   CLOSEIT2                     NO                DRK AUG05 47980000
         MVI   OPENLIST,X'80'                                 DRK AUG05 47990000
         CLOSE ((R6)),MF=(E,OPENLIST)                         DRK AUG05 48000000
CLOSEIT2 DS    0H                                             DRK AUG05 48010000
         L     R6,R6SAVE                                      DRK AUG05 48020000
         SPACE 1                                                        48030000
         BR    R2                                                       48040000
         TITLE 'P D S  --  PDS CONDEND ROUTINE               04/24/08'  48050000
*                                                                       48060000
*        CONDITIONAL END PROCESSING                                     48070000
*                                                                       48080000
CONDEND$ DS    0H                                             DRK APR08 48090000
         OC    ERRORMSG(3*5),ERRORMSG  ANY WARNINGS/ERRORS?   DRK APR08 48100000
         BZ    CONDEXIT                NO, CONTINUE           DRK APR08 48110000
         CLI   #CONDLVL,X'00'          YES, CONDEND PENDING?  DRK APR08 48120000
         BE    CONDEXIT                NO, CONTINUE           DRK APR08 48130000
         CLI   #CONDLVL,C'W'           CONDEND WARNINGS?      DRK APR08 48140000
         BE    CWARN                   YES                    DRK APR08 48150000
CERROR   DS    0H                      NO, THEN ERRORS        DRK APR08 48160000
         LA    R1,5                                           DRK APR08 48170000
         LA    R14,ERRORMSG                                   DRK APR08 48180000
CERRORL  DS    0H                                             DRK DEC12 48190099
         CLI   0(R14),C'5'             ERROR MESSAGE?         DRK APR08 48200000
         BH    CONDEX8                 YES                    DRK APR08 48210000
         LA    R14,3(R14)              NEXT SLOT              DRK APR08 48220000
         BCT   R1,CERRORL                                     DRK APR08 48230000
         B     CONDEXIT                                       DRK APR08 48240000
         SPACE 1                                              DRK APR08 48250000
CWARN    DS    0H                                             DRK APR08 48260000
         LA    R1,5                                           DRK APR08 48270000
         LA    R14,ERRORMSG                                   DRK APR08 48280000
CWARNL1  DS    0H                                             DRK DEC12 48290099
         CLI   0(R14),C'5'             ERROR MESSAGE?         DRK APR08 48300000
         BH    CONDEX8                 YES                    DRK APR08 48310000
         LA    R14,3(R14)              NEXT SLOT              DRK APR08 48320000
         BCT   R1,CWARNL1                                     DRK APR08 48330000
         SPACE 1                                              DRK APR08 48340000
         LA    R1,5                                           DRK APR08 48350000
         LA    R14,ERRORMSG                                   DRK APR08 48360000
CWARNL2  DS    0H                                             DRK DEC12 48370099
         CLI   0(R14),C'3'             WARNING MESSAGE?       DRK APR08 48380000
         BH    CONDEX4                 YES                    DRK APR08 48390000
         LA    R14,3(R14)              NEXT SLOT              DRK APR08 48400000
         BCT   R1,CWARNL2                                     DRK APR08 48410000
         EX    R1,*                    CAN'T HAPPEN, S0C3     DRK APR08 48420000
         SPACE 1                                              DRK APR08 48430000
CONDEX4  DS    0H                                             DRK APR08 48440000
         LA    R1,L261$1                                      DRK APR08 48450000
         MVI   MTLEN,4                 LENGTH OF THE INSERT   DRK APR08 48460000
         MVC   INSERT#1(3),0(R14)      MESSAGE NUMBER         DRK APR08 48470000
         MVI   INSERT#1+3,C'W'         WARNING                DRK APR08 48480000
         B     EXIT4M                                         DRK APR08 48490000
CONDEX8  DS    0H                                             DRK APR08 48500000
         LA    R1,L261$1                                      DRK APR08 48510000
         MVI   MTLEN,4                 LENGTH OF THE INSERT   DRK APR08 48520000
         MVC   INSERT#1(3),0(R14)      MESSAGE NUMBER         DRK APR08 48530000
         MVI   INSERT#1+3,C'E'         ERROR                  DRK APR08 48540000
         B     EXIT8M                                         DRK APR08 48550000
CONDEXIT DS    0H                                             DRK APR08 48560000
         BR    R2                                             DRK APR08 48570000
         TITLE 'P D S  --  PDS END                           06/15/98'  48580000
EXIT12O  LA    R1,L831                  DATA SET DID NOT OPEN           48590000
EXIT12M  M$MSG (R1)                     OUTPUT THE ERROR MESSAGE        48600000
EXIT12N  MVI   RETURNCD+3,12            ERROR CODE 12 (NO CLOSE & FREE) 48610000
         MVC   ##SUBCOM(8),$END         SIMULATE AN END SUBCOMMAND      48620000
         B     RETURN2                                                  48630000
         SPACE 1                                                        48640000
EXIT8M   M$MSG (R1)                     OUTPUT THE ERROR MESSAGE        48650000
EXIT8N   MVI   RETURNCD+3,8             ERROR CODE 8                    48660000
         MVC   ##SUBCOM(8),$END         SIMULATE AN END SUBCOMMAND      48670000
         B     RETURN                                         DRK APR08 48680000
         SPACE 1                                                        48690000
EXIT4M   M$MSG (R1)                     OUTPUT THE ERROR MSG  DRK APR08 48700000
EXIT4N   MVI   RETURNCD+3,4             ERROR CODE 4                  " 48710000
         MVC   ##SUBCOM(8),$END         SIMULATE AN END SUBCOMMAND    " 48720000
         SPACE 1                                                        48730000
RETURN   TM    FLAGSSS,C'1'             RETURN SEEN AN END BEFORE?      48740000
         BO    RETURN1                  YES, BRANCH                     48750000
         OI    FLAGSSS,X'01'            CONVERT 2 --> 3;  4 --> 5       48760000
         CLI   FLAGSSS,C'0'             RETURN TRAP SET?                48770000
         BH    NEWCMD                   YES, BRANCH                     48780000
         SPACE 1                                                        48790000
RETURN1  DS    0H                       *                      SS DEC87 48800000
         TM    SPFLAG0,SPFTABLE       DIALOG TABLE UNCLEAN     SS DEC87 48810000
         BZ    SPFNO3                 NO                       SS DEC87 48820000
         MVI   SPFLAG1,SPFCLEAN       FUNCTION TYPE            SS DEC87 48830000
         L     R15,=V(ISPDSPY)                                 SS DEC87 48840000
         BASR  R14,R15                                         SS DEC87 48850000
         NOP   0(,R0)                 IGNORE RETURN 0          SS DEC87 48860000
SPFNO3   DS    0H                                              SS DEC87 48870000
         BAS   R2,SHUTSTW2              DELETE ANY DS ENQUES   SS DEC87 48880000
         BAS   R2,CLOSEIT               CLOSE THE DATA SET              48890000
         BAS   R2,DEALLDCB              FREE THE DATA SET TOO           48900000
         SPACE 1                                                        48910000
RETURN2  OI    FLAGSGG,FRECVCON         STAE RECOVERY DISALLOWED        48920000
         ICM   R5,B'1111',RETURNCD      NORMAL EXIT?                    48930000
         BZ    RETURN4                  YES, BRANCH                     48940000
         SPACE 2                                                        48950000
         XC    PARMLIST(6*4),PARMLIST   CLEAR STACK PARAMETER AREA      48960000
         LA    R1,PARMLIST              AREA FOR STACK PARM LIST        48970000
         USING IOPL,R1                                                  48980000
         SPACE 1                                                        48990000
         L     R2,ADDRUPT                                               49000000
         L     R3,ADDRECT                                               49010000
         LA    R4,ATTNECB                                               49020000
         STM   R2,R4,IOPLUPT            INITIALIZE IOPLUPT, IOPLECT,    49030000
         DROP  R1                                                       49040000
         SPACE 2                                                        49050000
         MVI   ATTNECB,0                                                49060000
         L     R15,ADDRSTCK             STACK ROUTINE                   49070000
         STACK PARM=PARMLIST+16,DELETE=ALL,MF=(E,(1)),ENTRY=(15)        49080000
         SPACE 2                                                        49090000
         TCLEARQ INPUT                  CLEAR INPUT BUFFERS             49100000
         SPACE 2                                                        49110000
RETURN4  STAX  ,                        CANCEL ANY OUTSTANDING STAX     49120000
         ESTAE 0                        CANCEL THE ESTAE EXIT           49130000
ESTAE4   DS    0H                       Z/XDC PROBE           DRK DEC08 49140000
         SPACE 2                                                        49150000
         TM    DCBOFLGS-IHADCB+QAMDCB,X'10' OUT OPEN?                   49160000
         BNO   RETURN5                      NO, BRANCH                  49170000
         MVI   OPENLIST,X'80'               END OF LIST                 49180000
         CLOSE (QAMDCB),MF=(E,OPENLIST)     CLOSE THE OUT DATA SET      49190000
         SPACE 1                                                        49200000
RETURN5  MVI   CONTOPTN,0                   TURN OFF ANY LOGGING        49210000
         TM    DCBOFLGS-IHADCB+LOGDCB,X'10' LOG OPEN?                   49220000
         BNO   RETURN6                      NO, BRANCH                  49230000
         MVI   OPENLIST,X'80'                                           49240000
         CLOSE (LOGDCB),MF=(E,OPENLIST)                                 49250000
         SPACE 2                                                        49260000
RETURN6  DS    0H                                             DRK AUG05 49270000
         ST    R6,R6SAVE                                      DRK AUG05 49280000
         LA    R14,@4K                      BASE FOR PDSEDCB  DRK AUG05 49290000
         LA    R6,PDSEDCB-@4K(,R14)         A(PDSEDCB)        DRK AUG05 49300000
         TM    DCBOFLGS-IHADCB(R6),DCBOFOPN DCB OPEN?         DRK AUG05 49310000
         BNO   RETURN6A                     NO                DRK AUG05 49320000
         MVI   OPENLIST,X'80'                                 DRK AUG05 49330000
         CLOSE ((R6)),MF=(E,OPENLIST)                         DRK AUG05 49340000
RETURN6A DS    0H                                             DRK AUG05 49350000
         L     R6,R6SAVE                                      DRK JUN07 49360000
         SR    R0,R0                                                    49370000
         ICM   R0,B'1000',SUBLIST2      ANY SUBPOOL 24 DATA?            49380000
         BZ    RETURN7                  NO, BRANCH                      49390000
         FREEMAIN R,SP=(0)                                              49400000
         SPACE 2                                                        49410000
RETURN7  DS    0H                                                       49420000
         TM    FLAGSFF,FSPFCALL         TERMINATE SPF?                  49430000
         BNO   RETURN9                  NO, BRANCH                      49440000
         NI    FLAGSFF,FF-FSPFCALL      YES, TERMINATE SPF TOO          49450000
***TEST  STLINENO LINE=1           CLEAR SCREEN               *TEST     49460000
***TEST  STFSMODE OFF              TURN OFF FULL SCREEN MODE  *TEST     49470000
         SPACE 1                                              *TEST     49480000
         MVC   ##SUBCOM(8),$END         SIMULATE END SUBCOMMAND         49490000
         LA    R1,RETURN8               END COMMAND FINAL CODE          49500000
         ST    R1,##ADRCMD              EXECUTED AFTER OPEN OF DATA SET 49510000
         MVI   ##ADRCM#,CONTINUE        FLAG TO CONTINUE                49520000
         L     R13,4(,R13)              PREVIOUS SAVE AREA              49530000
         LM    R14,R12,12(R13)          SAVE REGISTERS                  49540000
         LA    R15,4                    RC=4 -- SIMULATES RETURN KEY    49550000
         BR    R14                      RETURN TO SPF                   49560000
         SPACE 2                                                        49570000
RETURN8  DS    0H                                                       49580000
***TEST  STFSMODE OFF              TURN OFF FULL SCREEN MODE  *TEST     49590000
***TEST  STTMPMD  OFF              WAKE UP SESSION MANAGER    *TEST     49600000
***TEST  M$ERRST MSGBLANK                                     *TEST     49610000
         SPACE 1                                              *TEST     49620000
RETURN9  DS    0H                                                       49630000
         L     R1,ADDRCPPL                   ORIGINAL CPPL ADDRESS      49640000
         MVC   CPPLCBUF-CPPL(4,R1),ADDRCBU2  RESTORE ORIGINAL CBUF      49650000
         SPACE 1                                                        49660000
         TM    FLAGSFF,FSPFDIAL         PDS CALLED BY SPF AS A DIALOG?  49670000
         BNO   RETURN12                 NO, BRANCH                      49680000
         LA    R0,=CL8'CONTROL'         FIRST PARAMETER                 49690000
         LA    R1,=CL8'DISPLAY'         SECOND PARAMETER                49700000
         LA    R2,=CL8'REFRESH'         THIRD PARAMETER                 49710082
         STM   R0,R2,MSGTEXT2           SAVE ADDRESSES                  49720000
         OI    MSGTEXT2+8,X'80'         LAST                            49730000
         LA    R1,MSGTEXT2                  PARAMETER                   49740000
         L     R15,ISPLINK                                              49750000
         BASR  R14,R15                  LET SPF KNOW                    49760000
         SPACE 1                                                        49770000
         TM    DS1SMSFG,DS1STRP+DS1PDSEX  EXT FORMAT OR HFS?  DRK AUG10 49780084
         BM    RETURN9A                 YES, SETMSG           DRK AUG10 49790084
         TM    DSORG+1,DS1ACBM          VSAM DATA SET?        DRK AUG10 49800084
         BO    RETURN9A                 YES, SETMSG           DRK AUG10 49810084
         TM    DS1FLAG1,DS1LARGE        LARGE FORMAT?         DRK SEP11 49820099
         BO    RETURN9A                 YES, SETMSG           DRK SEP11 49830099
         B     RETURN9B                 NO                    DRK AUG10 49840088
RETURN9A DS    0H                                             DRK AUG10 49850084
* PDSM861Z 'DSORG NOT SUPPORTED' .ALARM=YES                   DRK AUG10 49860090
* 'EXTENDED FORMAT, HFS, AND VSAM DATASETS ARE NOT SUPPORTED' DRK AUG10 49870084
         LA    R0,=CL8'SETMSG'          FIRST PARAMETER       DRK AUG10 49880088
         LA    R1,=CL8'PDSM861Z'        SECOND PARAMETER      DRK AUG10 49890089
         STM   R0,R1,MSGTEXT2           SAVE ADDRESSES        DRK AUG10 49900088
         OI    MSGTEXT2+4,X'80'         LAST                  DRK AUG10 49910088
         LA    R1,MSGTEXT2                  PARAMETER         DRK AUG10 49920088
         L     R15,ISPLINK                                    DRK AUG10 49930088
         BASR  R14,R15                  LET SPF KNOW          DRK AUG10 49940088
         SPACE 1                                                        49950083
RETURN9B DS    0H                                             DRK AUG10 49960084
         L     R3,SUBPDIAL              START OF GETMAINED AREA         49970000
         CLC   16+96+64+8(2,R3),=H'32'  EXPANDED I/O WORK AREA?         49980000
         BE    RETURN10                 NO, BRANCH                      49990000
         L     R1,16+96+64(,R3)         START OF NEW I/O WORK AREA      50000000
         LH    R0,16+96+64+8(,R3)       SIZE OF NEW I/O WORK AREA       50010000
         ICM   R0,B'1000',SUBPDIAL      SUBPOOL OF NEW I/O WORK AREA    50020000
         FREEMAIN R,LV=(0),A=(1)                                        50030000
         SPACE 2                                                        50040000
RETURN10 LA    R0,16+96+64+16           LENGTH OF CREATED AREAS         50050000
         CLC   16+96+64+8(2,R3),=H'32'  I/O WORK AREA RELEASE TOO?      50060000
         BNE   *+8                      NO, BRANCH                      50070000
         LA    R0,16+96+64+16+32        LENGTH OF CREATED AREAS         50080000
         ICM   R0,B'1000',SUBPDIAL      SUBPOOL OF CREATED WORK AREAS   50090000
         FREEMAIN R,LV=(0),A=(3)                                        50100000
         SPACE 2                                                        50110000
RETURN12 SR    R0,R0                                                    50120000
         ICM   R0,B'1000',OUTMEMBS      ANY SUBPOOL 22 DATA?            50130000
         BZ    RETURN14                 NO, BRANCH                      50140000
         FREEMAIN R,SP=(0)                                              50150000
         SPACE 2                                                        50160000
RETURN14 SR    R0,R0                                                    50170000
         ICM   R0,B'1000',SUBLIST1      ANY SUBPOOL 23 DATA?            50180000
         BZ    RETURN20                 NO, BRANCH                      50190000
         FREEMAIN R,SP=(0)                                              50200000
         SPACE 2                                                        50210000
RETURN20 L     R1,IOBUFF1               START OF BUFFER AREA            50220000
         L     R0,WORKBUFF                                              50230000
         FREEMAIN R,LV=(0),A=(1)                                        50240000
         SPACE 2                                                        50250000
         L     R1,DEVLISTP              EDT WORK AREA         DRK JUN98 50260000
         L     R0,=A(DEVLISTL)          LENGTH OF WORK AREA   DRK JUN98 50270000
         ICM   R0,B'1000',=AL1(25)      SUBPOOL 25            DRK MAY04 50280000
         FREEMAIN R,LV=(0),A=(1)                              DRK JUN98 50290000
         SPACE 2                                                        50300000
         LA    R2,ADDRPUTL              FIRST SERVICE ROUTINE ADDRESS   50310000
         LA    R3,MODULEN               FIRST LOAD ADDRESS              50320000
         SPACE 1                                                        50330000
RETURN30 CLI   0(R2),X'D6'              DELETE REQUIRED?                50340000
         BNE   RETURN40                 NO, BRANCH                      50350000
         DELETE  EPLOC=2(R3)                                            50360000
RETURN40 LA    R2,4(,R2)                NEXT SERVICE ADDRESS            50370000
         LA    R3,10(,R3)               NEXT MODULES ADDRESS            50380000
         CLI   0(R3),X'FF'              END OF MODULES?                 50390000
         BNE   RETURN30                 NO, BRANCH                      50400000
         SPACE 2                                                        50410000
         LR    R13,R7                   ADDRESS OF THE FIRST SAVE AREA  50420000
         LR    R15,R5                   RETURN CODE                     50430000
         L     R0,WORKSIZE                                              50440000
         SPACE 1                                                        50450000
         M$EXIT LV=(0)                                                  50460000
         TITLE 'P D S  --  PDS CONSTANTS                     09/28/88'  50470000
WORKSIZE DC    0F'0',AL1(1),AL3(LENWORK)           DYNAMIC STORAGE SIZE 50480000
WORKBUFF DC    0F'0',AL1(1),AL3(32768*2+58786)     INPUT BUFFER SIZE    50490000
BLANKS   DC    0F'0',8X'40'                                             50500000
         SPACE 2                                                        50510000
FF       EQU   X'FF'        IMMEDIATE FLAG MASK (FOR NI INSTRUCTIONS)   50520000
UCBTYP   EQU   16           OFFSET IN UCB FOR UNIT TYPE WORD            50530000
UCBRR    EQU   X'20'        UCB IS ON A SHARED DASD DEVICE              50540000
UCBVOLI  EQU   28           OFFSET IN UCB FOR DISK VOLUME NAME          50550000
         SPACE 2                                                        50560099
         PRINT NOGEN                                                    50570099
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV2                 DRK JAN13 50580099
EXCPDCB  DCB   DEVD=DA,DDNAME=X,MACRF=E,EXLST=EXLST,DCBE=*-*   JH DEC12 50590099
LEXCPDCB EQU   *-EXCPDCB                                                50600099
C_DCBE   DCBE  EADSCB=OK                                       JH DEC12 50610099
C_DCBEL  EQU   *-C_DCBE                                        JH DEC12 50620099
.NOEAV2  ANOP                                                 DRK JAN13 50630099
         AIF   ('&MVSLEV' GE 'MVS710').EAV1                   DRK JAN13 50640099
EXCPDCB  DCB   DEVD=DA,DDNAME=X,MACRF=E,EXLST=EXLST                     50650000
LEXCPDCB EQU   *-EXCPDCB                                                50660000
.EAV1    ANOP                                                 DRK JAN13 50670099
SAMDCB   DCB   DSORG=PO,DEVD=DA,DDNAME=X,MACRF=(R,W),EXLST=EXLST,      X50680000
               SYNAD=PAMSYNAD                                  GP AUG05 50690000
LSAMDCB  EQU   *-SAMDCB                                                 50700000
DIREDCB  DCB   DSORG=PS,RECFM=F,LRECL=256,BLKSIZE=256,DDNAME=X,        X50710000
               MACRF=(GL),DEVD=DA,EODAD=PDSEEOF               DRK AUG05 50720000
LDIREDCB EQU   *-DIREDCB                                                50730000
EXLST    DC    X'85',AL3(OPENEXIT)                                      50740000
         PRINT GEN                                                      50750000
         SPACE 2                                                        50760000
BLDLPARM DC    AL2(1,74)                                                50770000
         SPACE 2                                                        50780000
DAYMONTH DC    AL1(31,28,31,30,31,30,31,31,30,31,30,31)                 50790000
TRTABLE  EQU   *-X'C0'                                                  50800000
UNHEXTBL DC    X'00',X'FAFBFCFDFEFF',9X'00'  X'C0' TO X'CF'             50810000
         DC    16X'00'                       X'D0' TO X'DF'             50820000
         DC    16X'00'                       X'E0' TO X'EF'             50830000
HEXTBL   DC    C'0123456789ABCDEF'           X'F0' TO X'FF'             50840000
         SPACE 2                                                        50850000
SYSHELP  DC    CL8'SYSHELP'               FOR DDNAME FREE IN HELP       50860000
SYSPROC  DC    CL8'SYSPROC'               FOR NO DDNAME FREE IN DEALLOC 50870000
SPFUSER  DC    CL8'SPFUSER'               FOR SPF OPTION 6 ENQ TEST     50880000
SPFEDIT  DC    CL8'SPFEDIT'               FOR SPF MEMBER ENQ TEST       50890000
SYSIEWLP DC    CL8'SYSIEWLP'              FOR LINKAGE-EDITOR RESERVE    50900000
         AIF   ('&CISP' EQ 'ISPF' OR '&CISP' EQ 'ISPFV2').FORISPF       50910000
ISPF     DC    C'ISPF    PGM(12345678)    PARM(++12345678)             X50920000
                    '      COULD ZAP TO CHANGE "NEWAPPL(ISR)" OR "TEST" 50930000
         AGO   .FORBOTH                                                 50940000
.FORISPF ANOP                                                           50950000
ISPF     DC    C'ISPF    PGM(12345678)    PARM(++12345678) NEWAPPL(ISR)X50960099
                    '      COULD ZAP TO CHANGE "NEWAPPL(ISR)" OR "TEST" 50970000
.FORBOTH ANOP                                                           50980000
ISPFPGM  EQU   12,8                       DISPLACEMENT TO PROGRAM NAME  50990000
ISPFPARM EQU   32,8                       DISPLACEMENT TO PARM PASSED   51000000
ISPFTEST EQU   55,4                       DISPLACEMENT TO TEST TEXT     51010000
         EJECT                                                          51020000
ISUBS    DC    33F'0'           INITIAL PDL AREA                        51030000
         ORG   *-20                                                     51040000
ZERO     DC    F'0'                                                     51050000
         DC    XL4'FFFFFF'      INITIALIZE #MAXLEN                      51060000
         DC    3F'9999999'      INITIALIZE #MAXFIND, #MAXIN, #MAXOUT    51070000
LISUBS   EQU   *-ISUBS          INITIALIZATION LENGTH                   51080000
         SPACE 2                                                        51090000
*  NOTE - THESE CCWS ARE USED FOR DATA READS                            51100000
CCWINIT  CCW   X'31',IOBSEEK-IOBSEEK+3,X'60',5  SEARCH ID EQUAL (CCHHR) 51110000
         CCW   X'08',*-8-(*-8),X'60',1          TIC                     51120000
         CCW   X'92',IOBSEEK-IOBSEEK+3,X'20',8  MT READ NEXT COUNT      51130000
*                                                                       51140000
         CCW   X'23',SNO-SNO,X'60',1            SET SECTOR              51150000
         CCW   X'31',IOBSEEK-IOBSEEK+3,X'60',5  SEARCH ID EQUAL (CCHHR) 51160000
         CCW   X'08',*-8-(*-8),X'60',1          TIC                     51170000
CCWREAD  CCW   X'0E',*-*,X'60',32768            READ KEY AND DATA       51180000
CCWTIC   CCW   X'08',*+8-(*+8),X'60',1          TIC (OR MT READ CKD)    51190000
         CCW   X'92',IOBSEEK-IOBSEEK+3,X'60',8  MT READ NEXT COUNT      51200000
         CCW   X'22',SNO-SNO,X'20',1            READ SECTOR NUMBER      51210000
         SPACE 1                                                        51220000
*  NOTE - THESE CCWS ARE USED FOR DIRECTORY COUNTS                      51230000
CCWDIRR  CCW   X'1A',0,X'70',5                  READ HOME ADDRESS       51240000
         CCW   X'92',WORKTMP+3-WORKTMP,X'60',5  MT READ NEXT COUNT      51250000
         CCW   X'A9',KEYDATA,X'60',8            SEARCH KEY EQUAL        51260000
         CCW   X'08',*-16-(*-16),X'60',1        TIC                     51270000
         CCW   X'92',WORKTMP+11-WORKTMP,X'60',5 MT READ NEXT COUNT      51280000
         CCW   X'86',0,X'70',1                  READ DATA               51290000
         CCW   X'08',*-16-(*-16),X'20',1        TIC                     51300000
         SPACE 2                                                        51310000
KEYDATA  DC    XL8'FFFFFFFFFFFFFFFF',XL2'000E',XL8'FFFFFFFFFFFFFFFF'    51320000
         EJECT                                                          51330000
UNITTBL  DC    CL9'D????    '                                           51340000
         DC    CL9'D????    '                                           51350000
         DC    CL9'D????    '                                           51360000
         DC    CL9'D????    '                                           51370000
         DC    CL1'&DB9345 ',CL8'&UN9345  '                   DRK NOV99 51380000
         DC    CL9'D????    '                                           51390000
         DC    CL1'&DB23051',CL8'&UN23051 '                             51400000
         DC    CL1'&DB23052',CL8'&UN23052 '                             51410000
         DC    CL1'&DB2314 ',CL8'&UN2314  '                             51420000
         DC    CL1'&DB3330 ',CL8'&UN3330  '                             51430000
         DC    CL1'&DB3340 ',CL8'&UN3340  '                             51440000
         DC    CL1'&DB3350 ',CL8'&UN3350  '                             51450000
         DC    CL1'&DB3375 ',CL8'&UN3375  '                             51460000
         DC    CL1'&DB33301',CL8'&UN33301 '                             51470000
         DC    CL1'&DB3380 ',CL8'&UN3380  '                             51480000
         DC    CL1'&DB3390 ',CL8'&UN3390  '                             51490000
         DC    CL9'M????    '                                           51500000
         SPACE 3                                                        51510000
HAVECMDT DC    CL2'&NOR1 '                                              51520000
         DC    CL2'&NOR2 '                                              51530000
         DC    CL2'&NOR3 '                                              51540000
         DC    CL2'&NOR4 '                                              51550000
         DC    CL2'&NOR5 '                                              51560000
         DC    CL2'&NOR6 '                                              51570000
         DC    CL2'&NOR7 '                                              51580000
         DC    CL2'&NOR8 '                                              51590000
         DC    CL2'&NOR9 '                                              51600000
HAVECMDE DS    0X                                                       51610000
         SPACE 3                                                        51620000
         AIF   ('&MVSLEV' LT 'MVS710').NOEAV3                 DRK JAN13 51630099
OBTAIN   CAMLST SEARCH,0,0,0,EADSCB=OK                         JH DEC12 51640099
         ORG   OBTAIN+4                                                 51650099
.NOEAV3  ANOP                                                 DRK JAN13 51660099
         AIF   ('&MVSLEV' GE 'MVS710').EAV2                   DRK JAN13 51670099
OBTAIN   CAMLST SEARCH,0,0,0                                            51680000
         ORG   OBTAIN+4                                                 51690000
.EAV2    ANOP                                                 DRK JAN13 51700099
         SPACE 3                                                        51710000
LOCATE   CAMLST NAME,0,,0                                               51720000
         ORG   LOCATE+4                                                 51730000
         SPACE 3                                                        51740000
*ENQSTEP  ENQ   (*-*,*-*,E,7,STEP),RET=TEST,MF=L                        51750000
*         ORG   ENQSTEP+4                                               51760000
*         SPACE 3                                                       51770000
ENQTEST  ENQ   (*-*,*-*,E,*-*,SYSTEMS),RET=TEST,MF=L                    51780000
         ORG   ENQTEST+4                                                51790000
         SPACE 3                                                        51800000
ENQHAVE  ENQ   (*-*,*-*,E,*-*,SYSTEM),RET=HAVE,MF=L                     51810000
         ORG   ENQHAVE+4                                                51820000
         SPACE 7                                                        51830000
RESERVEL RESERVE (*-*,*-*,E,*-*,SYSTEMS),RET=HAVE,UCB=0,MF=L            51840000
         ORG   RESERVEL+4                                               51850000
         SPACE 3                                                        51860000
DEQSYSS  DEQ   (*-*,*-*,*-*,SYSTEMS),RET=HAVE,UCB=0,MF=L                51870000
         ORG   DEQSYSS+4                                                51880000
         SPACE 3                                                        51890000
DEQSYS   DEQ   (*-*,*-*,*-*,SYSTEM),RET=HAVE,MF=L                       51900000
         ORG   DEQSYS+4                                                 51910000
         SPACE 3                                                        51920000
STAELIST ESTAE *-*,PARAM=*-*,TERM=YES,MF=L                              51930000
         ORG   STAELIST+4                                               51940000
         SPACE 3                                                        51950000
MODULEN  DC    AL2(CVTPUTL-CVTMAP),CL8'IKJPUTL '                        51960000
         DC    AL2(CVTPARS-CVTMAP),CL8'IKJPARS '                        51970000
         DC    AL2(CVTPTGT-CVTMAP),CL8'IKJPTGT '                        51980000
         DC    AL2(CVTGETL-CVTMAP),CL8'IKJGETL '                        51990000
         DC    AL2(CVTSCAN-CVTMAP),CL8'IKJSCAN '                        52000000
         DC    AL2(CVTSTCK-CVTMAP),CL8'IKJSTCK '                        52010000
         DC    AL2(CVTEHDEF-CVTMAP),CL8'IKJEHDEF'                       52020000
         DC    AL2(CVTEFF02-CVTMAP),CL8'IKJEFF02'                       52030000
         DC    AL2(CVTPCNVT-CVTMAP),CL8'CVTPCNVT'                       52040000
         DC    AL2(CVTPRLTV-CVTMAP),CL8'CVTPRLTV'                       52050000
         DC    X'FFFF'                                                  52060000
         SPACE 3                                                        52070000
$ATTL    DC    CL8'&NATT '                                              52080000
$CHAL    DC    CL8'&NCHA '                                              52090000
$COP     DC    CL8'&NCOP '                                              52100000
$DEL     DC    CL8'&NDEL '                                              52110000
$DIS     DC    CL8'&NDIS '                                    ABL NOV86 52120000
$END     DC    CL8'&NEND '                                              52130000
$FIN     DC    CL8'&NFIN '                                              52140000
$HIS     DC    CL8'&NHIS '                                              52150000
$IFX     DC    CL8'&NIFX '                                              52160000
$ISM     DC    CL8'&NISM '                                              52170000
$MAP     DC    CL8'&NMAP '                                              52180000
$MEM     DC    CL8'&NMEM '                                              52190000
$MML     DC    CL8'&NMML '                                              52200000
$ML      DC    CL8'&IMLX '                                              52210000
$PAT     DC    CL8'&NPAT '                                              52220000
$REC     DC    CL8'&NREC '                                              52230000
$RC2     DC    CL8'&NRC2 '                                              52240000
$REP     DC    CL8'&NREP '                                              52250000
$SUB     DC    CL8'&NSUB '                                              52260000
$SUL     DC    CL8'&NSUL '                                              52270000
$USA     DC    CL8'&NUSA '                                              52280000
$VER     DC    CL8'&NVER '                                              52290000
#EXE     DC    CL8'&CEXE '                                              52300000
PTW      EQU   32        SUBCOMMAND TABLE WIDTH                         52310000
         SPACE 3                                                        52320000
         PRINT NOGEN                                                    52330000
MSGBLANK M$TX  '  '                                                     52340000
MSGHELP  M$TX  'H MS MS('                                               52350000
MSGMEMQ  M$TX  '**                                '                     52360000
MSGBL132 M$TX  '                                                       X52370000
                                                                       X52380000
                                    '  -- 132 BYTES                     52390000
BLANK128 EQU   MSGBL132+4,128                                           52400000
         SPACE 2                                                        52410000
PDS300A  M$TX  'PDS300A ENTER OPTION -- DSN=...                        X52420000
                                                                      ' 52430000
*BYTE COUNT:   ' 234567 10 234567 20 234567 30 234567 40 234567 50 2345 52440000
*DS300A  M$TX  'PDS300A ENTER OPTION -- DSN=123456789012345678901234567 52450000
*              89012345678901234,VOL=SER=123456  MEM=12345678:12345678' 52460000
*BYTE COUNT:   67 60 234567 70 234567 80 234567 90 23456 100 23456 110' 52470000
*                                                                       52480000
*FOR DIALOG:   '- DSN=12345678901234567890123456789012345678901234,VOL= 52490000
*              SER=123456  MEM=12345678'                                52500000
*                                                                       52510000
PDS381A  M$TX  'PDS381A REENTER THE DATA SET NAME, VOLUME AND DISPOSITIX52520000
               ON'                                                      52530000
         TITLE 'P D S  --  PDS LITERALS                      09/28/88'  52540000
         LTORG                                                          52550000
         TITLE 'P D S  --  PDS TRANSLATE TABLES              09/28/88'  52560000
PATCH    B     PATCH                                                    52570000
         DC    18H'0'                                                   52580000
         SPACE 3                                                        52590000
***  TRANSLATE TABLE TO CONVERT UNPRINTABLES TO PERIODS                 52600000
TRLINE   DC    256C'.'            ASSUME ALL UNPRINTABLE FIRST          52610000
         ORG   TRLINE+C' '                                              52620000
         DC    1X'40'             BLANK IS OK                           52630000
         ORG   TRLINE+C'¢'                                              52640000
         DC    C'¢.<(+|&&'        ¢.<(+|&  ARE OK                       52650000
         ORG   TRLINE+C'!'                                              52660000
         DC    C'!$*);^-/'        !$*);^-/  ARE OK                      52670000
         ORG   TRLINE+C'¦'                                              52680000
         DC    C'¦,%_>?'          ¦,%_>?  ARE OK                        52690000
         ORG   TRLINE+C'`'                                              52700000
         DC    C'`:#@''="'        `:#@'="  ARE OK                       52710000
         ORG   TRLINE+X'81'       LOWER-CASE ABCDEFGHI                  52720000
         DC    X'818283848586878889'                                    52730000
         ORG   TRLINE+X'91'       LOWER-CASE JKLMONPQR                  52740000
         DC    X'919293949596979899'                                    52750000
         ORG   TRLINE+X'A1'       LOWER-CASE ~STUVWXYZ                  52760000
         DC    X'A1A2A3A4A5A6A7A8A9'                                    52770000
         ORG   TRLINE+X'AD'                                   DRK JUN05 52780000
         DC    X'AD'              [ IS OK                     DRK JUN05 52790000
         ORG   TRLINE+X'BD'                                   DRK JUN05 52800000
         DC    X'BD'              ] IS OK                     DRK JUN05 52810000
         ORG   TRLINE+C'{'                                              52820000
         DC    C'{ABCDEFGHI'      {ABCDEFGHI  ARE OK                    52830000
         ORG   TRLINE+C'}'                                              52840000
         DC    C'}JKLMNOPQR'      }JKLMNOPQR  ARE OK                    52850000
         ORG   TRLINE+C'\'                                              52860000
         DC    C'\'               \ IS OK                               52870000
         ORG   TRLINE+C'S'                                              52880000
         DC    C'STUVWXYZ'        STUVWXYZ  ARE OK                      52890000
         ORG   TRLINE+C'0'                                              52900000
         DC    C'0123456789'      0123456789  ARE OK                    52910000
         ORG   ,                                                        52920000
         TITLE 'P D S  --  PDS MESSAGE LABELS/MESSAGE CSECT  09/28/88'  52930000
L002$1   DC    C'002'                                                   52940000
L081     DC    C'081'                                                   52950000
L100$1   DC    C'100'                                                   52960000
L240$1   DC    C'240'                                         DRK APR04 52970000
L241     DC    C'241'                                                   52980000
L242     DC    C'242'                                                   52990000
L243     DC    C'243'                                                   53000000
L261$1   DC    C'261'                                         DRK APR08 53010000
L410$1   DC    C'410'                                                   53020000
L412     DC    C'412'                                                   53030000
L470     DC    C'470'                                                   53040000
L481     DC    C'481'                                                   53050000
L485     DC    C'485'                                                   53060000
L520     DC    C'520'                                                   53070000
L708     DC    C'708'                                         DRK JUL10 53080000
L715     DC    C'715'                                                   53090000
L731     DC    C'731'                                                   53100000
L830     DC    C'830'                                                   53110000
L831     DC    C'831'                                                   53120000
L835$1   DC    C'835'                                                   53130000
L836     DC    C'836'                                                   53140000
L843     DC    C'843'                                                   53150000
L850$2   DC    C'850'                                                   53160000
L853$1   DC    C'853'                                                   53170000
L856$1   DC    C'856'                                         DRK AUG05 53180000
L858     DC    C'858'                                                   53190000
L859$1   DC    C'859'                                                   53200000
L862     DC    C'862'                                                   53210000
L872     DC    C'872'                                                   53220000
L875     DC    C'875'                                                   53230000
L876     DC    C'876'                                                   53240000
L877     DC    C'877'                                                   53250000
L892     DC    C'892'                                                   53260000
L893     DC    C'893'                                                   53270000
L920$1   DC    C'920'                                                   53280000
L990     DC    C'990'                                                   53290000
L991$1   DC    C'991'                                                   53300000
L999$1   DC    C'999'                                                   53310000
         DC    X'FF'             LIST TERMINATOR                        53320000
         SPACE 5                                                        53330000
PARTADDR DC    A(PROBE01)        PROBE POINTS FOR THE MESSAGE CSECT     53340000
         DC    A(PROBE02)          (FOR A PARTITIONED SEARCH)           53350000
         DC    A(PROBE03)                                               53360000
         DC    A(PROBE04)                                               53370000
         DC    A(PROBE05)                                               53380000
         DC    A(PROBE06)                                               53390000
         DC    A(PROBE07)                                               53400000
         DC    A(PROBE08)                                               53410000
         DC    A(PROBE09)                                               53420000
         DC    A(PROBE10)                                               53430000
         DC    A(PROBE11)                                               53440000
         DC    A(PROBE12)                                               53450000
         DC    A(PROBE99)                                               53460000
         SPACE 2                                                        53470000
MSGCSECT CSECT                                                          53480000
** INFORMATIONAL MESSAGES                                               53490000
PROBE01  DS    0C          PLACE BEFORE THE FIRST MESSAGE OF THE CSECT  53500000
         IKJTSMSG ('PDS001I TESTMESSAGES -- ALL NUMBERED MESSAGES FOLLOX53510000
               W:'),L001                                                53520000
         IKJTSMSG ('PDS002I DEFAULT MEMBER IS ',),L002                  53530000
         IKJTSMSG ('PDS005I END OF FILE'),L005                          53540000
         IKJTSMSG ('PDS006I END OF DATA SET ',),L006          DRK JUL16 53550099
         IKJTSMSG ('PDS010I THE ALIAS HAS BEEN ASSIGNED'),L010          53560000
         IKJTSMSG ('PDS020I ',,' ATTRIBUTES ARE:',),L020                53570000
         IKJTSMSG ('PDS021I APF AUTHORIZED'),L021                       53580000
         IKJTSMSG ('PDS022I NOT APF AUTHORIZED, OBSOLETE LINKAGE EDITORX53590000
               '),L022                                                  53600000
         IKJTSMSG ('PDS023I APF AUTHORIZED, APF DATA VALUE GREATER THANX53610000
                1'),L023                                                53620000
         IKJTSMSG ('PDS024I PAGE ALIGNMENT IS REQUIRED'),L024           53630000
         IKJTSMSG ('PDS025I SSI INFORMATION: ',),L025                   53640000
         IKJTSMSG ('PDS026I MOD:',),L026                                53650000
         IKJTSMSG ('PDS030I GLOBAL OPERANDS: ',),L030                   53660000
         IKJTSMSG ('PDS031I INPUT BUFFERING: ',),L031                   53670000
         IKJTSMSG ('PDS032I TESTCPULOOP -- CPU LOOP FOLLOWS:'),L032     53680000
         IKJTSMSG ('PDS033I TESTABEND -- SYSTEM 0C1 FOLLOWS:'),L033     53690000
         IKJTSMSG ('PDS034I TESTOUTLOOP -- THIS DATA REPEATS'),L034     53700000
PROBE02  DS    0C                                                       53710000
         IKJTSMSG ('PDS035I TESTREAD -- EXCP RETURN CODE=',,'; NEXT TTRX53720000
                ADDRESS IS ',),L035                                     53730000
         IKJTSMSG ('PDS036I LARGEST FREE STORAGE AREA IS ',,'K'),L036   53740000
         IKJTSMSG ('PDS040I ',,' HAS BEEN DELETED'),L040                53750000
         IKJTSMSG ('PDS046I LARGEST AREA ABOVE THE LINE IS ',,'M'),L046 53760000
         IKJTSMSG ('PDS050I ',,' WILL BE ',),L050                       53770000
         IKJTSMSG ('PDS051I ',,' IS BEING ',),L051                      53780000
         IKJTSMSG ('PDS060I TRANSLATOR HISTORY BY CSECT -'),L060        53790000
         IKJTSMSG ('PDS061I AMASPZAP UPDATE HISTORY BY CSECT -'),L061   53800000
         IKJTSMSG ('PDS062I USER-SUPPLIED UPDATE HISTORY BY CSECT -'), X53810000
               L062                                                     53820000
         IKJTSMSG ('PDS064I LAST LINK-EDITED ON ',,'  BY LKED ',),L064  53830000
         IKJTSMSG ('PDS065I MAIN MEMBER NAME UPDATED FOR MEMBER: ',),  X53840000
               L065                                                     53850000
         IKJTSMSG ('PDS066I MEMBER IS AN ALIAS FOR: ',),L066            53860000
         IKJTSMSG ('PDS069I GLOBAL VARIABLES: ',),L069        DRK MAR11 53870099
         IKJTSMSG ('PDS070I MODIFICATION HISTORY:'),L070      DRK NOV03 53880000
         IKJTSMSG ('PDS071I THE FOLLOWING OPTIONS ARE AVAILABLE:'),L071 53890000
         IKJTSMSG ('PDS080I PDSOUT DCB IS CLOSED'),L080                 53900000
         IKJTSMSG ('PDS080I LOGCOPY DCB IS CLOSED'),L081                53910000
         IKJTSMSG ('PDS090I ',,' HAS BEEN RENAMED TO ',),L090           53920000
         IKJTSMSG ('PDS091I ',,' HAS BEEN RESTORED'),L091               53930000
PROBE03  DS    0C                                                       53940000
         IKJTSMSG ('PDS092I AMODE/RMODE INFORMATION UPDATED FOR MEMBER:X53950000
                ',),L092                                                53960000
         IKJTSMSG ('PDS096I DASD GEOMETRY:'),L096             DRK DEC04 53970000
         IKJTSMSG ('PDS097I TSO USERS: ',),L097               DRK JUN10 53980000
         IKJTSMSG ('PDS100I ',,' -- VERSION &VERS  &FIXDATE  MVSLEV=&MVX53990099
               SLEV'),L100                                    DRK OCT15 54000099
         IKJTSMSG ('PDS101I DELETED MEMBER FOUND AT TTR: ',),L101       54010000
         IKJTSMSG ('PDS102I ENTRY POINT AT ',),L102                     54020000
         IKJTSMSG ('PDS103I ENTRY POINT AT ',,'  --  ',),L103           54030000
         IKJTSMSG ('PDS104I MODULE LENGTH  ',,'  -- ',),L104            54040000
*        IKJTSMSG ('PDS105I LAST UPDATED: &FIXDATE'),L105     DRK SEP02 54050000
         AIF   ('&ISODT'  NE 'YES').NOISO1                    DRK NOV01 54060000
         IKJTSMSG ('PDS106I DATE FORMAT: ISO (YY/MM/DD)'),L106          54070000
         AGO   .ISO1                                          DRK NOV01 54080000
.NOISO1  ANOP                                                 DRK NOV01 54090000
         IKJTSMSG ('PDS106I DATE FORMAT: USA (MM/DD/YY)'),L106          54100000
.ISO1    ANOP                                                 DRK NOV01 54110000
         IKJTSMSG ('PDS107I LAST ASSEMBLED: ',),L107          DRK SEP02 54120000
         IKJTSMSG ('PDS108I',,' CHARACTERS PER AVERAGE VARIABLE LENGTH X54130000
               RECORD'),L108                                  DRK FEB09 54140000
         IKJTSMSG ('PDS109I',,' CHARACTERS IN THE LARGEST VARIABLE LENGX54150000
               TH RECORD'),L109                               DRK DEC06 54160000
         IKJTSMSG ('PDS110I',,' LOGICAL RECORDS WERE INPUT'),L110       54170000
         IKJTSMSG ('PDS111I',,' PHYSICAL BLOCKS WERE INPUT'),L111       54180000
         IKJTSMSG ('PDS112I',,' CHARACTERS IN THE LARGEST PHYSICAL BLOCX54190000
               K'),L112                                                 54200000
         IKJTSMSG ('PDS113I',,' CHARACTERS PER AVERAGE PHYSICAL BLOCK')X54210000
               ,L113                                                    54220000
         IKJTSMSG ('PDS114I',,' TRACKS COULD BE REGAINED BY COMPRESSINGX54230000
                THIS DATA SET'),L114                                    54240000
         IKJTSMSG ('PDS115I',,' MEMBERS WERE CHECKED'),L115             54250000
         IKJTSMSG ('PDS116I DATA SET WAS CHECKED'),L116                 54260000
         IKJTSMSG ('PDS117I ',,' MEMBERS COUNTED; CUMULATIVE SIZE IS ',X54270000
               ,' RECORDS',),L117                                       54280000
         IKJTSMSG ('PDS118I ',,' MEMBERS RMODE24; SIZE IS ',,'K'),L118  54290000
         IKJTSMSG ('PDS119I ',,' MEMBERS RMODEANY; SIZE IS ',,'K'),L119 54300000
         IKJTSMSG ('PDS120I PROGRAM RESIDENCE MODE IS ',,' -- ADDRESSINX54310000
               G MODE IS ',),L120                                       54320000
         IKJTSMSG ('PDS121I',,' SPANNED RECORD SEGMENTS WERE INPUT'),  X54330099
               L121                                           DRK NOV13 54340099
         IKJTSMSG ('PDS140I ',,' RECORD',),L140                         54350000
         IKJTSMSG ('PDS141I AT ',),L141                                 54360000
PROBE04  DS    0C                                                       54370000
         IKJTSMSG ('PDS142I ',),L142                                    54380000
         IKJTSMSG ('PDS143I ',,' DIRECTORY ENTRY, LENGTH=',),L143       54390000
         IKJTSMSG ('PDS144I DATA LINE ',,':'),L144                      54400000
         IKJTSMSG ('PDS145I ',),L145                                    54410000
         IKJTSMSG ('PDS160I ',),L160                                    54420000
         IKJTSMSG ('PDS161I ',),L161                                    54430000
         IKJTSMSG ('PDS162I ',),L162                                    54440000
         IKJTSMSG ('PDS163I ',),L163                                    54450000
         IKJTSMSG ('PDS164I ',),L164                                    54460000
         IKJTSMSG ('PDS165I ',),L165                                    54470000
         IKJTSMSG ('         ',),L169    *** USED IN @DELETE            54480000
         IKJTSMSG ('PDS171I ',,' HAS COMPLETED; RC',),L171              54490000
         IKJTSMSG ('PDS180I ',),L180                                    54500000
         IKJTSMSG ('PDS181I EXTENTS IN TRACKS: ',),L181                 54510000
         IKJTSMSG ('PDS182I ',),L182                                    54520000
         IKJTSMSG ('PDS183I ',),L183                                    54530000
PROBE05  DS    0C                                                       54540000
         IKJTSMSG ('PDS184I ',),L184                                    54550000
         IKJTSMSG ('PDS185I ',),L185                                    54560000
         IKJTSMSG ('PDS186I ',),L186                                    54570000
         IKJTSMSG ('PDS190I AN ALIAS NAMED ',,' IS ALREADY AT THIS TTR'X54580000
               ),L190                                                   54590000
         IKJTSMSG ('PDS191I ',),L191                          DRK NOV02 54600000
         IKJTSMSG ('PDS192I ',),L192                          DRK JUN16 54610099
         IKJTSMSG ('PDS193I THIS GROUP CONTAINS ',,' MEMBERS'),L193     54620000
         IKJTSMSG ('PDS194I CONCATENATION ',,' OF ',),L194              54630000
         IKJTSMSG ('PDS195I ISPLOG SUBCOMMAND MONITORING IS ',),L195    54640099
         IKJTSMSG ('PDS196I MEMBER NAME VALIDATION IS ',),L196          54650099
         IKJTSMSG ('PDS197I MEMLIST RESET IS ',),L197         DRK JAN18 54660099
         IKJTSMSG ('PDS198I CBT DIALOGS PGLITE/PDSEGEN SUPPORT PDSE V2 X54670099
               MEMBER GENERATIONS'),L198                      DRK SEP21 54680099
         IKJTSMSG ('PDS199I LARGEST FREE AREA ON VOLUME ',,' IS',,' CYLX54690099
               INDERS'),L199                                            54700099
         IKJTSMSG ('PDS200I ',),L200                                    54710000
         IKJTSMSG ('PDS210I ',),L210                                    54720000
         IKJTSMSG ('PDS220I ',),L220                                    54730000
         IKJTSMSG ('PDS230I ',),L230                                    54740000
         IKJTSMSG ('PDS231I ',),L231                          DRK SEP09 54750000
         IKJTSMSG ('PDS232I ',),L232                                    54760000
         IKJTSMSG ('PDS240I ''',,''' WAS NOT FOUND'),L240     DRK APR04 54770000
         IKJTSMSG ('PDS241I NO MATCHING DATA WAS FOUND'),L241           54780000
         IKJTSMSG ('PDS242I NO MATCHING EXTERNAL SYMBOLS WERE FOUND'),LX54790000
               242                                                      54800000
         IKJTSMSG ('PDS243I NO MATCHING HISTORY DATA WAS FOUND'),L243   54810000
         IKJTSMSG ('PDS245I NO MATCHING MEMBERS WERE FOUND'),L245       54820000
         IKJTSMSG ('PDS246I NOWRITE IS IN EFFECT; NO UPDATES WILL BE PEX54830000
               RFORMED'),L246                                           54840000
         IKJTSMSG ('PDS247I PDS DETERMINED BLOCKSIZE WILL BE USED'),L24X54850099
               7                                                        54860099
         IKJTSMSG ('PDS250I ',),L250                                    54870000
         IKJTSMSG ('PDS260I ',),L260                                    54880000
         IKJTSMSG ('PDS261I PROGRAM TERMINATED BY CONDEND FOR MESSAGE PX54890000
               DS',),L261                                     DRK APR08 54900000
         IKJTSMSG ('PDS262I ',),L262                                    54910000
         IKJTSMSG ('PDS273I OUTPUT DATA SET NAME IS ',),L273            54920000
         IKJTSMSG ('PDS276I A ZAP IDR RECORD WAS ADDED'),L276 DRK NOV06 54930000
         IKJTSMSG ('PDS277I RESTORE FIND STRING TRUNCATED TO 32 CHARACTX54940099
               ERS'),L277                                     DRK OCT11 54950099
         IKJTSMSG ('PDS280I OS NAME: ',,'   SMF ID: ',),L280  DRK MAY05 54960000
         IKJTSMSG ('PDS281I SCP PRODUCT LEVEL: ',),L281       DRK MAR05 54970000
         IKJTSMSG ('PDS282I CPC NODE: ',),L282                DRK MAR05 54980000
         IKJTSMSG ('PDS283I SU/SECOND:',,'   TOTAL MIPS:',),L283  APR05 54990000
         IKJTSMSG ('PDS284I CPU MODEL:',,'   ONLINE CPUS:',),L284 APR05 55000000
         IKJTSMSG ('PDS285I REAL STORAGE:',,'MB   EXPANDED STORAGE:',,'X55010000
               MB'),L285                                      DRK MAY05 55020000
         IKJTSMSG ('PDS286I PROCESSOR NAME: ',,'   LPAR NAME: ',),L286  55030000
         IKJTSMSG ('PDS287I ARCHITECTURE LEVEL: ',,'   ',),L287         55040000
         IKJTSMSG ('PDS288I CPU SERIAL: ',,'   VERSION CODE: ',),L288   55050000
         IKJTSMSG ('PDS289I SECURITY SYSTEM: ',,'   JOB ENTRY SYSTEM: 'X55060000
               ,),L289                                                  55070000
         IKJTSMSG ('PDS290I IPL TIME:',),L290                 DRK NOV06 55080000
         IKJTSMSG ('PDS291I SYSPLEX NAME: ',,'   SYSPLEX ID: ',),L291   55090000
         IKJTSMSG ('PDS292I SYSTEM NAME: ',),L292             DRK APR10 55100000
         SPACE 2                                                        55110000
** WARNING MESSAGES                                                     55120000
         IKJTSMSG ('PDS400W NO MEMBERS ARE IN THE DATA SET'),L400       55130000
PROBE06  DS    0C                                                       55140000
         IKJTSMSG ('PDS410W VOLSET(',,') IS STILL IN EFFECT'),L410      55150000
         IKJTSMSG ('PDS412W REALLOCATION WITHOUT VOLSET WILL BE ATTEMPTX55160000
               ED'),L412                                                55170000
         IKJTSMSG ('PDS441W ',,' (WEAK)'),L441                          55180000
         IKJTSMSG ('PDS442W ',,' (MISSING)'),L442                       55190000
         IKJTSMSG ('PDS443W MAXBLK HAS BEEN RAISED TO THE DATA SET LRECX55200000
               L VALUE'),L443                                           55210000
         IKJTSMSG ('PDS444W MAXBLK EXCEEDS THE DATA SET BLOCKSIZE'),   X55220000
               L444                                                     55230000
         IKJTSMSG ('PDS451W ALL MEMBERS IN THIS PDS WILL BE LOST'),    X55240000
               L451                                                     55250000
         IKJTSMSG ('PDS460W NO HISTORY DATA IS AVAILABLE'),L460         55260000
         IKJTSMSG ('PDS470W THE PROGRAM IS PROBABLY IN A LOOP'),L470    55270000
         IKJTSMSG ('PDS471W ',,' HAS COMPLETED WITH WARNINGS; RC',),L47X55280099
               1                                                        55290099
         IKJTSMSG ('PDS480W COMPRESS IS IN PROGRESS'),L480              55300000
         IKJTSMSG ('PDS480W COMPRESS MAY NOT BE INTERRUPTED'),L481      55310000
         IKJTSMSG ('PDS482W BLOCKSIZE SHOULD BE EVENLY DIVISIBLE BY THEX55320000
                DCB LRECL'),L482                                        55330000
         IKJTSMSG ('PDS484W COPY IS IN PROGRESS'),L484                  55340000
         IKJTSMSG ('PDS484W COPY SHOULD NOT BE INTERRUPTED'),L485       55350000
         IKJTSMSG ('PDS500W NO COBOL TASK GLOBAL TABLE WAS FOUND'),L500 55360000
         IKJTSMSG ('PDS502W THIS MODULE WAS COMPILED WITH ENDJOB AND MIX55370000
               XED RES AND NORES OPTIONS'),L502                         55380000
         IKJTSMSG ('PDS503W THIS MODULE WAS COMPILED WITH MIXED RES ANDX55390000
                NORES OPTIONS'),L503                                    55400000
         IKJTSMSG ('PDS510W THIS IS A NULL MEMBER'),L510                55410000
PROBE07  DS    0C                                                       55420000
         IKJTSMSG ('PDS520W NO INFORMATION IS AVAILABLE'),L520          55430000
         IKJTSMSG ('PDS521W OUTPUT DATA SET IS NOT PARTITIONED'),L521   55440000
         IKJTSMSG ('PDS522W ADDSTATS REQUIRED WITH EXTEND'),L522        55450000
         IKJTSMSG ('PDS530W THIS DATA SET IS NOT PARTITIONED'),L530     55460000
         IKJTSMSG ('PDS531W THIS DATA SET IS A PDSE',),L531   DRK JAN06 55470000
         IKJTSMSG ('PDS532W MULTIPLE INPUT MEMBERS WILL BE UNLOADED TO X55480000
               THIS SEQUENTIAL DATA SET'),L532                          55490000
         IKJTSMSG ('PDS533W TSO TRANSMIT LIMITED TO 3620 MEMBERS UNLESSX55500099
                ALL MEMBERS ARE SPECIFIED'),L533                        55510000
         IKJTSMSG ('PDS534W MATCH DATA SET IS NOT PARTITIONED'),L534    55520000
         IKJTSMSG ('PDS535W THIS DATA SET IS NOT A PDSE'),L535          55530099
         SPACE 2                                                        55540000
** ERROR MESSAGES                                                       55550000
         IKJTSMSG ('PDS700E THIS RANGE OF NAMES IS INVALID'),L700       55560000
         IKJTSMSG ('PDS701E THIS DATA SET IS NOT A LOAD LIBRARY'),L701  55570000
         IKJTSMSG ('PDS702E THIS DATA SET IS A LOAD LIBRARY'),L702      55580000
         IKJTSMSG ('PDS703E THIS MODULE HAS NO EXTERNAL SYMBOLS'),L703  55590000
         IKJTSMSG ('PDS704E MODULE ',,' HAS NO EXTERNAL SYMBOLS'),L704  55600000
         IKJTSMSG ('PDS705E EXTERNAL SYMBOL ',,' WAS NOT FOUND'),L705   55610000
         IKJTSMSG ('PDS706E ',,' IS NOT SUPPORTED FOR PDSE DATA SETS'),X55620099
               L706                                                     55630099
         IKJTSMSG ('PDS707E RENAME SWAP IS NOT SUPPORTED FOR PDSE DATA X55640000
               SETS'),L707                                              55650000
         IKJTSMSG ('PDS708E EXTENDED/LARGE FORMAT, HFS, AND VSAM ARE NOX55660099
               T SUPPORTED'),L708                                       55670099
         IKJTSMSG ('PDS710E INVALID APF INFORMATION FORMAT; MEMBER IS AX55680000
               SSUMED NOT AUTHORIZED'),L710                             55690000
         IKJTSMSG ('PDS711E NO MEMBER NAMES ARE IN THIS RANGE'),L711    55700000
         IKJTSMSG ('PDS712E NO MEMBER NAMES MATCH THIS PATTERN'),L712   55710000
         IKJTSMSG ('PDS713E NO MEMBER NAMES MATCH THIS COMBINATION NAMEX55720000
               '),L713                                                  55730000
         IKJTSMSG ('PDS715E NO MATCHING ATTRIBUTES WERE FOUND'),L715    55740000
         IKJTSMSG ('PDS720E NOT APF AUTHORIZED; THE APF DATA IS MISSINGX55750000
               '),L720                                                  55760000
         IKJTSMSG ('PDS721E NOT APF AUTHORIZED; THE APF DATA IS THE WROX55770000
               NG LENGTH'),L721                                         55780000
         IKJTSMSG ('PDS722E THE APF DATA CAN NOT BE CHANGED'),L722      55790000
         IKJTSMSG ('PDS723E THE RLD/CONTROL COUNT CAN NOT BE CHANGED'),X55800000
               L723                                                     55810000
         IKJTSMSG ('PDS724E RMODE AND AMODE CAN NOT BE CHANGED -- OBSOLX55820000
               ETE LINKAGE-EDITOR'),L724                                55830000
         IKJTSMSG ('PDS726E PAGE ALIGNMENT CAN NOT BE CHANGED -- OBSOLEX55840000
               TE LINKAGE-EDITOR'),L726                                 55850000
         IKJTSMSG ('PDS730E THIS SUBCOMMAND IS NOT OPERATIONAL; YOU AREX55860000
                ALREADY UNDER ISPF'),L730                               55870000
PROBE08  DS    0C                                                       55880000
         IKJTSMSG ('PDS731E ISPF IS NOT OPERATIONAL NOW'),L731          55890000
         IKJTSMSG ('PDS732E CLIST PROCESSING IS NOT SUPPORTED FROM ISPMX55900000
               ODE OR MEMLIST'),L732                                    55910000
         IKJTSMSG ('PDS733E BROWSE FAILED -- NULL MEMBER (ZERO-LENGTH DX55920099
               ATA)'),L733                                              55930099
         IKJTSMSG ('PDS734E BROWSE FAILED -- NO MEMBERS IN PDS'),L734   55940099
         IKJTSMSG ('PDS735E BROWSE FAILED -- I/O ERROR'),L735           55950099
         IKJTSMSG ('PDS740E THIS MODULE HAS NO MATCHING EXTERNAL SYMBOLX55960000
               S'),L740                                                 55970000
         IKJTSMSG ('PDS750E A REQUIRED NOTELIST POINTER WAS NOT FOUND IX55980000
               N THIS MEMBER'),L750                                     55990000
         IKJTSMSG ('PDS751E A NOTELIST RECORD COULD NOT BE FOUND FOR THX56000000
               IS MEMBER'),L751                                         56010000
         IKJTSMSG ('PDS752E THE NUMBER OF DESIRED DIRECTORY BLOCKS MUSTX56020000
                BE SPECIFIED'),L752                                     56030000
         IKJTSMSG ('PDS770E A SEARCH STRING IS REQUIRED'),L770          56040000
         IKJTSMSG ('PDS771E ',,' IS AN INVALID SUBCOMMAND; ENTER "HELP"X56050000
                OR "OPTIONS" FOR HELP'),L771                            56060000
         IKJTSMSG ('PDS772E A REPLACEMENT STRING IS REQUIRED'),L772     56070000
         IKJTSMSG ('PDS773E EQUAL LENGTH STRINGS ARE REQUIRED FOR BLOCKX56080000
                AND DUMP UPDATES'),L773                                 56090000
         IKJTSMSG ('PDS774E REPLACE TERMINATED; CHARACTER EXPANSION FAIX56100000
               LED'),L774                                               56110000
         IKJTSMSG ('PDS780E ',,' DCB OPEN ERROR -- REALLOCATE AND TRY AX56120000
               GAIN'),L780                                              56130000
         IKJTSMSG ('PDS781E ',,' DCB ATTRIBUTES CONFLICT -- USE SEQUENTX56140000
               IAL WITH RECFM=FB AND LRECL=80'),L781                    56150000
         IKJTSMSG ('PDS800E NO LOAD MODULE TEXT WAS FOUND FOR MEMBER'),X56160000
               L800                                                     56170000
         IKJTSMSG ('PDS801E END OF MEMBER SIMULATED -- REMAINDER OF TRAX56180000
               CK SKIPPED'),L801                                        56190000
PROBE09  DS    0C                                                       56200000
         IKJTSMSG ('PDS802E A MAIN MEMBER NAMED ',,' IS ALREADY AT THISX56210000
                TTR'),L802                                              56220000
         IKJTSMSG ('PDS804E RESTORE ABANDONED'),L804                    56230000
         IKJTSMSG ('PDS805E INVALID LOAD MODULE DATA'),L805             56240000
         IKJTSMSG ('PDS806E BLOCK LENGTH OF',,' EXCEEDS THE MAXBLK VALUX56250000
               E'),L806                                                 56260000
         IKJTSMSG ('PDS811E RECORD LENGTH ',,' IS INVALID'),L811        56270000
         IKJTSMSG ('PDS812E BLOCK LENGTH OF',,' EXCEEDS THE DATA SET DCX56280000
               B BLKSIZE'),L812                                         56290000
         IKJTSMSG ('PDS813E RECORD LENGTH OF',,' EXCEEDS THE MAXIMUM DCX56300000
               B LRECL'),L813                                           56310000
         IKJTSMSG ('PDS814E BLOCK LENGTH OF',,' IS NOT DIVISIBLE BY THEX56320000
                DCB LRECL'),L814                                        56330000
         IKJTSMSG ('PDS820E THIS MEMBER IS AN ALIAS FOR ',,' BUT IT POIX56340000
               NTS TO ',),L820                                          56350000
         IKJTSMSG ('PDS821E RMODE ENTRY DOES NOT CORRESPOND WITH MEMBERX56360000
                ',),L821                                                56370000
         IKJTSMSG ('PDS822E MAIN AMODE ENTRY DOES NOT CORRESPOND WITH MX56380000
               EMBER ',),L822                                           56390000
         IKJTSMSG ('PDS823E RLD/CONTROL COUNT DOES NOT CORRESPOND WITH X56400000
               MEMBER ',),L823                                          56410000
         IKJTSMSG ('PDS824E DUPLICATE MEMBER NAME -- IGNORED'),L824     56420000
         IKJTSMSG ('PDS825E MEMBER NAME IS OUT OF SEQUENCE -- IGNORED')X56430000
               ,L825                                                    56440000
         IKJTSMSG ('PDS826E THE DIRECTORY RLD/CONTROL COUNT DOES NOT MAX56450000
               TCH THE FIRST RLD ENTRY'),L826                           56460000
         IKJTSMSG ('PDS827E ',,' IS AN ALIAS FOR THIS MEMBER BUT IT POIX56470000
               NTS TO ',),L827                                          56480000
PROBE10  DS    0C                                                       56490000
         IKJTSMSG ('PDS830E OBTAIN ERROR; DSCB NOT ON VOLUME'),L830     56500000
         IKJTSMSG ('PDS831E UNABLE TO OPEN DATA SET'),L831              56510000
         IKJTSMSG ('PDS832E DUMMY MEMBER ADD FAILED, RC=8'),L832        56520000
         IKJTSMSG ('PDS833E DUMMY MEMBER DELETE FAILED, RC=8'),L833     56530000
         IKJTSMSG ('PDS834E ERROR IN GNRLFAIL SERVICE ROUTINE;  R15',),X56540000
               L834                                                     56550000
         IKJTSMSG ('PDS835E ERROR IN DAIRFAIL SERVICE ROUTINE;  R15',),X56560000
               L835                                                     56570000
         IKJTSMSG ('PDS836E I/O ERROR IN DIRECTORY'),L836               56580000
         IKJTSMSG ('PDS840E INVALID HEXADECIMAL STRING LENGTH'),L840    56590000
         IKJTSMSG ('PDS841E INVALID HEXADECIMAL CHARACTERS'),L841       56600000
         IKJTSMSG ('PDS842E THIS STRING IS TOO LONG'),L842              56610000
         IKJTSMSG ('PDS843E ONLY DISK DATA SETS ARE SUPPORTED'),L843    56620000
         IKJTSMSG ('PDS844E LOCATE FAILED FOR DATA SET ',),L844         56630000
         IKJTSMSG ('PDS850E ',,' IS BEING UPDATED BY ',),L850           56640000
         IKJTSMSG ('PDS851E THIS DATA SET IS BEING UPDATED BY ',),L851  56650000
         IKJTSMSG ('PDS852E ',,' ALREADY EXISTS'),L852                  56660000
         IKJTSMSG ('PDS853E MEMBER ',,' NOT FOUND'),L853                56670000
         IKJTSMSG ('PDS854E ',,' IS AN INVALID MEMBER NAME'),L854       56680000
PROBE11  DS    0C                                                       56690000
         IKJTSMSG ('PDS855E THE DATA SET DIRECTORY IS FULL AND MEMBERS X56700000
               CANNOT BE ADDED'),L855                                   56710000
         IKJTSMSG ('PDS856E STOW ERROR, ',),L856                        56720000
         IKJTSMSG ('PDS858E NO DEFAULT MEMBER HAS BEEN ESTABLISHED'),  X56730000
               L858                                                     56740000
         IKJTSMSG ('PDS859E COMMAND ',,' WAS NOT FOUND'),L859           56750000
         IKJTSMSG ('PDS860E MEMBER IS AN ALIAS BUT NO MAIN MEMBER EXISTX56760000
               S'),L860                                                 56770000
         IKJTSMSG ('PDS861E THE ALIAS DIRECTORY ENTRY NOTES THE MAIN ENX56780000
               TRY NAME AS ',),L861                                     56790000
         IKJTSMSG ('PDS862E ERROR IN GQSCAN DATA'),L862                 56800000
         IKJTSMSG ('PDS864E ',,' IS AN APPARENT ALIAS FOR THIS MEMBER')X56810000
               ,L864                                                    56820000
         IKJTSMSG ('PDS865E THE IEBCOPY OUTPUT CAN NOT BE OPENED'),L865 56830000
         IKJTSMSG ('PDS870E PDS DIRECTORIES MUST BE CONTAINED IN ONE EXX56840000
               TENT'),L870                                              56850000
         IKJTSMSG ('PDS871E A TTR FOR THIS MEMBER WAS NOT FOUND'),L871  56860000
         IKJTSMSG ('PDS872E THIS MEMBER IS AFTER THE DATA SET END-OF-FIX56870000
               LE'),L872                                                56880000
         IKJTSMSG ('PDS873E TTR IS BEYOND THE USED PORTION OF THE DATA X56890000
               SET'),L873                                               56900000
         IKJTSMSG ('PDS874E TSO COMMAND NAME IS INVALID'),L874          56910000
         IKJTSMSG ('PDS875E THIS DATA SET HAS NO DIRECTORY BLOCKS'),   X56920000
               L875                                                     56930000
         IKJTSMSG ('PDS876E A DIRECTORY RECORD HAS AN INCORRECT LENGTH X56940000
               (NOT 256 CHARACTERS)'),L876                              56950000
         IKJTSMSG ('PDS877E INVALID SUBCOMMAND NAME'),L877              56960000
         IKJTSMSG ('PDS879E RESIDENCE MODE 64 AND ADDRESSING MODE ',,  X56970099
               ' ARE INCOMPATIBLE'),L879                                56980099
         IKJTSMSG ('PDS880E RESIDENCE MODE ANY AND ADDRESSING MODE ',, X56990099
               ' ARE INCOMPATIBLE'),L880                                57000099
PROBE12  DS    0C                                                       57010000
         IKJTSMSG ('PDS881E REENTRANT ATTRIBUTE CONFLICTS WITH NOT REUSX57020000
               ABLE'),L881                                              57030000
         IKJTSMSG ('PDS882E TEST ATTRIBUTE CONFLICTS WITH NOT EDIT'),  X57040000
               L882                                                     57050000
         IKJTSMSG ('PDS883E REUSABLE ATTRIBUTE CONFLICTS WITH SCATTER')X57060000
               ,L883                                                    57070000
         IKJTSMSG ('PDS884E OVERLAY ATTRIBUTE CONFLICTS WITH ',),L884   57080000
         IKJTSMSG ('PDS885E MORE THAN ONE OUTPUT MEMBER WOULD BE NAMED X57090000
               ',),L885                                                 57100000
         IKJTSMSG ('PDS892E READ MULTIPLE FAILED AT TTR=',),L892        57110000
         IKJTSMSG ('PDS893E READ MULTIPLE ERROR -- NEXT TTR (',,') IS IX57120000
               NCORRECT'),L893                                          57130000
         IKJTSMSG ('PDS900E THE SOURCE AND TARGET DATA SETS MUST DIFFERX57140000
               '),L900                                                  57150000
         IKJTSMSG ('PDS910E TSO COMMAND ',,' IS NOT ALLOWED'),L910      57160000
         IKJTSMSG ('PDS920E SUBCOMMAND ',,' IS NOT ALLOWED FOR THIS DATX57170000
               A SET'),L920                                             57180000
         IKJTSMSG ('PDS930E ',,' IS AN INVALID SUBCOMMAND ABBREVIATION'X57190000
               ),L930                                                   57200000
         IKJTSMSG ('PDS932E OLD ALLOCATION IS REQUIRED FOR THIS FUNCTIOX57210000
               N'),L932                                                 57220000
         IKJTSMSG ('PDS973E NO DEFAULT OUTPUT DATA SET NAME HAS BEEN ESX57230000
               TABLISHED'),L973                                         57240000
         IKJTSMSG ('PDS980E IEBCOPY WAS INTERRUPTED'),L980              57250000
         IKJTSMSG ('PDS982E SEQUENTIAL INPUT MUST BE COPIED TO A SPECIFX57260000
               IC OUTPUT MEMBER'),L982                                  57270000
         IKJTSMSG ('PDS983E MAXGENS VALUE IS > 2,000,000,000'),L983     57280099
         IKJTSMSG ('PDS984E MAXGENS VALUE EXCEEDS THE SMS LIMIT'),L984  57290099
         IKJTSMSG ('PDS990E EXTENT INITIALIZATION READ FAILED'),L990    57300000
         IKJTSMSG ('PDS991E PERMANENT I/O ERROR AT TTR=',),L991         57310000
         IKJTSMSG ('PDS993E JOBNAME,STEPNAME,UCB,D,DDNAME,READ/WRITE,ERX57320000
               ROR MESSAGE,HEXBBCCHHR,BPAM S'),L993                     57330000
         IKJTSMSG ('PDS996E ',,' IS NOT SUPPORTED FOR PROGRAM OBJECTS')X57340000
               ,L996                                                    57350000
         IKJTSMSG ('PDS997E DIFFERENT VERSION OF PDS REINVOKED'),L997   57360000
         IKJTSMSG ('PDS998E ABEND ',,' LOADING THIS MODULE'),L998       57370000
         IKJTSMSG ('PDS999E ABEND ',),L999                              57380000
         PRINT GEN                                                      57390000
         SPACE 1                                                        57400000
** END OF MESSAGES                                                      57410000
PROBE99  DS    0C               MUST BE THE LAST PROBE LABEL            57420000
         IKJTSMSG                                                       57430000
         PRINT NOGEN                                                    57440099
&PDSPRT  SETC  'ON'                                                     57450000
&PDSMAIN SETC  'YES'                                                    57460000
         TITLE 'P D S  --  PDS DYNAMIC AREA                          '  57470000
         COPY  #MDSECT                                                  57480000
         SPACE 5                                                        57490000
         TITLE 'P D S  --  SYSTEM DIAGNOSTIC WORK AREA               '  57500000
         AIF   ('&MVSLEV' EQ 'MVS038').MVS038                           57510000
         IHASDWA  VRAMAP=NO                                             57520000
         AGO   .SDWADEF                                                 57530000
.MVS038  ANOP                                                           57540000
         IHASDWA                                                        57550000
.SDWADEF ANOP                                                           57560000
         TITLE 'P D S  --  SVC 99 PARAMETER LIST             09/28/88'  57570000
         IEFZB4D0                                                       57580000
         AIF   ('&MVSLEV' LT 'MVS13X').NMVS13C                          57590000
         TITLE 'P D S  --  RESOURCE INFORMATION BLOCK                '  57600000
         ISGRIB                                                         57610000
.NMVS13C ANOP                                                           57620000
         TITLE 'P D S  --  PARSE PARAMETER LIST                      '  57630000
         IKJPPL                                                         57640000
         SPACE 5                                                        57650000
         TITLE 'P D S  --  THE COMMAND SCAN PARAMETER LIST           '  57660000
         IKJCSPL                                                        57670000
         SPACE 5                                                        57680000
         TITLE 'P D S  --  THE COMMAND SCAN OUTPUT AREA              '  57690000
         IKJCSOA                                                        57700000
         SPACE 5                                                        57710000
         TITLE 'P D S  --  THE I/O SERVICE ROUTINE PARAMETER LIST    '  57720000
         IKJIOPL                                                        57730000
         SPACE 5                                                        57740000
         TITLE 'P D S  --  THE PUTGET PARAMETER BLOCK                '  57750000
         IKJPGPB                                                        57760000
         SPACE 5                                                        57770000
**       TITLE 'P D S  --  THE GETLINE PARAMETER BLOCK       09/28/88'  57780000
**       IKJGTPB                                                        57790000
         SPACE 5                                                        57800000
         TITLE 'P D S  --  THE USER PROFILE TABLE                    '  57810000
         IKJUPT                                                         57820000
         SPACE 5                                                        57830000
         TITLE 'P D S  --  TSO/E PROTECTED STEP CONTROL BLOCK        '  57840000
         IKJPSCB                                                        57850000
         SPACE 5                                                        57860000
         TITLE 'P D S  --  ENVIRONMENT CONTROL TABLE                 '  57870000
         IKJECT                                                         57880000
         SPACE 5                                                        57890000
         TITLE 'P D S  --  THE COMMAND PROCESSOR PARAMETER LIST      '  57900000
         IKJCPPL                                                        57910000
         SPACE 5                                                        57920000
         PRINT   GEN                                                    57930000
         TITLE 'P D S  --  DATA CONTROL BLOCK                        '  57940000
         DCBD  DSORG=PO                                                 57950000
         SPACE 5                                                        57960000
         TITLE 'P D S  --  COMMUNICATIONS VECTOR TABLE               '  57970000
         CVT   DSECT=YES                                                57980000
         SPACE 5                                                        57990000
         TITLE 'P D S  --  DATA SET ASSOCIATION BLOCK                '  58000000
         IHADSAB                                                        58010000
         SPACE 5                                                        58020000
         TITLE 'P D S  --  TASK CONTROL BLOCK                        '  58030000
         IKJTCB ,                                              SS JUL88 58040000
         SPACE 5                                                        58050000
         TITLE 'P D S  --  TASK INPUT/OUTPUT TABLE                   '  58060000
TIOT     DSECT                                                 SS JUL88 58070000
         IEFTIOT1                                              SS JUL88 58080000
         SPACE 5                                                        58090000
         TITLE 'P D S  --  JOB/STEP CONTROL BLOCK                    '  58100000
         IEZJSCB                                               SS JUL88 58110000
         SPACE 5                                               SS JUL88 58120000
         TITLE 'P D S  --  JOB FILE CONTROL BLOCK                    '  58130000
         IEFJFCBN                                             DRK AUG99 58140000
         SPACE 5                                               SS JUL88 58150000
         TITLE 'P D S  --  EPA MAPPING FOR LOCATE MODE SWA MANAGER   '  58160000
         IEFZB505  LOCEPAX=YES                                DRK AUG99 58170000
         SPACE 5                                                        58180000
         TITLE 'P D S  --  JOB ENTRY SUBSYSTEM COMMUNICATION TABLE   '  58190000
         IEFJESCT                                             DRK AUG99 58200000
         SPACE 5                                                        58210000
         TITLE 'P D S  --  THE DATA EXTENT BLOCK                     '  58220000
         IEZDEB                                                GP AUG05 58230000
         SPACE 5                                                        58240099
         TITLE 'P D S  --  SMF CONTROL TABLE                         '  58250099
         IEESMCA                                              DRK SEP11 58260099
         SPACE 5                                                        58270000
         TITLE 'P D S  --  PREFIXED SAVE AREA                        '  58280000
         IHAPSA LIST=YES                                      DRK MAY08 58290000
         SPACE 5                                                        58300000
         TITLE 'P D S  --  TSO/E VECTOR TABLE                        '  58310099
         IKJTSVT                                              DRK JUL17 58320099
         SPACE 5                                                        58330099
         AIF   (D'TSVTUMXL).Z23A                                        58340099
TSVTUMXL EQU   TSVT+X'06',1                                   DRK JUL17 58350099
PSCBUID8 EQU   PSCB+X'54',8                                   DRK JUL17 58360099
PSCBU8L  EQU   PSCB+X'20',1                                   DRK JUL17 58370099
         AIF   (D'UPTPREF8).Z23A                              DRK SEP17 58380099
UPTPREF8 EQU    UPT+X'21',8                                   DRK JUL17 58390099
UPTPRF8L EQU    UPT+X'29',1                                   DRK JUL17 58400099
.Z23A    ANOP                                                 DRK JUL17 58410099
.NOGEN   END  PDSMAIN                                         DRK JUL17 58420099
