         TITLE 'P D S  --  PDS VERIFY                        09/28/88'  00010023
*********************************************************************** 00020000
***      VERIFY SUBCOMMAND     ADDED BY BRUCE LELAND --  MAY, 1983  *** 00030000
*********************************************************************** 00040000
*                                                                       00050000
         SPACE 1                                                        00060000
VERIFY   CSECT                                                          00070021
         USING *,R8                                                     00080000
         XC    #VERMAXV(4),#VERMAXV                           DRK DEC06 00080127
         TM    DS1SMSFG,DS1PDSE         PDSE DATASET?         DRK AUG05 00080219
         BNO   VERP000                  NO, CONTINUE          DRK AUG05 00080319
         TM    FLAGSCC,RECFMU           RECFM=U?              DRK AUG05 00080419
         BNO   VERP000                  NO, CONTINUE          DRK AUG05 00080519
         TM    FLAGSAA,FMEMBER1+FMEMBER2  ALL MEMBERS?        DRK SEP05 00080620
         BNZ   VERP000                    NO, BRANCH          DRK SEP05 00080720
         MVI   #VERNLKD,X'02'             YES, NOLKED         DRK AUG05 00080820
         SPACE 1                                              DRK AUG05 00080919
VERP000  DS    0H                                             DRK AUG05 00081017
         TM    FLAGSCC,RECFMF      FIXED FORMAT RECORDS?                00090000
         BNO   VERP00              NO, BRANCH                           00100000
         LH    R15,BLKSI           BLKSIZE                              00110000
         SR    R14,R14                                                  00120000
         LH    R1,LRECL            LRECL                                00130000
         LTR   R1,R1               ANY LRECL?                           00140000
         BZ    VERP00              NO, AVOID DIVIDE ERROR               00150000
         DR    R14,R1              BLKSIZE/LRECL                        00160000
         LTR   R14,R14             INTEGRAL NUMBER OF LRECL RECORDS?    00170000
         BZ    VERP00              YES, BRANCH                          00180000
         M$MSG L482                NO, ERROR                            00190000
         SPACE 2                                                        00200000
VERP00   L     R15,AVERS00         SEQUENTIAL CHECK ROUTINE             00210000
         TM    DSORG,DS1DSGPO      PARTITIONED DATA SET?                00220000
         BNOR  R15                 NO, PERFORM OTHER GROUP OF CHECKS    00230000
         SPACE 1                                                        00240000
         TM    FLAGSAA,FMEMBER1+FMEMBER2  ALL MEMBERS?                  00250000
         BNZ   VERP02                     NO, BRANCH                    00260000
         TM    FLAGSAA,FMEM#MEM           MEMBER GROUP?                 00270000
         BNO   VERP03                     NO, BRANCH                    00280000
         SPACE 2                                                        00290000
* SINGLE MEMBER CHECK IS DESIRED                                        00300000
VERP02   OI    #VERUPDT,4+2               SET FLAG FOR LATER            00310000
         MVC   MEMNAME(12),DIRNAME        SET THE MEMBER NAME           00320000
         SR    R1,R1                      NO MESSAGE YET                00330000
         BAS   R2,VERMBR                  OUTPUT MEMBER IDENTIFIER      00340000
         LA    R4,#VERR4                  POINT TO A WORK AREA          00350000
         ST    R4,#MEMPTR                 ADD AT END OF THE TABLE       00360000
         SR    R3,R3                      NO TABLE ENTRIES              00370000
         B     VERP18                     SKIP INITIALIZATION           00380000
         SPACE 2                                                        00390000
VERP03   LA    R1,L875             ASSUME NO DIRECTORY BLOCKS           00400000
         CLC   DS1LSTAR(3),ZERO    CORRECT?                             00410000
         BE    MSGNEW              YES, BRANCH                          00420000
*        TM    #VERUPDT,2          NOUPDATE SPECIFIED?                  00430007
*        BO    VERP09              YES, DO NOT OPEN STOW                00440007
         TM    #VERUPDT,1          UPDATE SPECIFIED?          DRK NOV04 00441007
         BO    VERP03U             YES, OPEN STOW             DRK NOV04 00442007
         B     VERP09              NO, DO NOT OPEN STOW (DEF) DRK NOV04 00442108
VERP03U  DS    0H                                             DRK NOV04 00443007
         TM    DS1SMSFG,DS1PDSE    PDSE DATASET?              DRK AUG05 00443145
         BO    VERP09              YES, DO NOT OPEN STOW      DRK AUG05 00444045
         BAS   R2,OPENSTOW         OPEN THE STOW DCB; ENQUEUE           00450000
         B     VERP08              COULD NOT OPEN -- ERROR              00460000
         SPACE 1                                                        00470000
         MVI   MSGTEXT2,X'F9'          HIGH IN COLLATING SEQUENCE       00480000
         MVC   MSGTEXT2+1(7),=C'FIXPDS ' TEMPORARY STOW/DELETE NAME     00490000
         MVI   MSGTEXT2+11,B'1001111'  ALIAS/MAX LENGTH ENTRY           00500000
         STOW  STOWDCB,MSGTEXT2,A      ADD THIS MEMBER                  00510000
         SPACE 1                                                        00520000
         B     *+4(R15)                PROCESS RETURN CODE              00530000
         B     VERP06                    00 - SUCCESSFUL                00540000
         B     VERP06                    04 - MEMBER ALREADY EXISTS     00550000
         EX    0,*                       08 - SHOULD NOT OCCUR          00560000
         B     VERP04                    12 - FULL DIRECTORY            00570000
         M$MSG L836                      16 - I/O ERROR IN DIRECTORY    00580000
         B     VERP08                                                   00590000
         SPACE 1                                                        00600000
VERP04   M$MSG L855                    DIRECTORY IS FULL                00610000
         B     VERP08                    12 - FULL DIRECTORY            00620000
         SPACE 2                                                        00630000
VERP06   STOW  STOWDCB,MSGTEXT2,D      DELETE THIS MEMBER               00640000
         SPACE 1                                                        00650000
         LTR   R15,R15                 ANY ERROR?                       00660000
         BNP   VERP08                  NO, BRANCH                       00670000
         M$MSG L836                    YES, I/O ERROR IN DIRECTORY      00680000
VERP08   BAS   R2,SHUTSTOW         CLOSE THE STOW DCB; DEQUEUE          00690000
         SPACE 2                                                        00700000
VERP09   MVI   SUBPOOLT,21         TEMPORARY STORAGE IN USE             00710000
         MVI   STARTTR+2,X'01'     READ THE DIRECTORY                   00720000
         LA    R5,1024/2           1024 MEMBERS INITIALLY               00730000
         SPACE 1                                                        00740000
VERP10   SLL   R5,1                MEMBERS*2 FOR EACH LOOP              00750000
         SR    R6,R6                                                    00760000
         LR    R3,R5                                                    00770000
         LR    R0,R5                                                    00780000
         SLL   R0,4                MEMBERS*16 IS TABLE SIZE             00790000
         ICM   R0,B'1000',SUBPOOLT                                      00800000
         GETMAIN R,LV=(0)          ALLOCATE A NEW MEMBER TABLE          00810000
         LR    R4,R1               NEW TABLE ADDRESS                    00820000
         ICM   R0,B'1111',#MEMPTR  ANY PREVIOUS MEMBERS?                00830000
         BZ    VERP12              NO, BRANCH                           00840000
         SRL   R3,1                YES, USE SECOND HALF OF TABLE        00850000
         LR    R14,R4              NEW TABLE START ADDRESS              00860000
         LR    R15,R5                                                   00870000
         SLL   R15,3               MEMBERS*8 IS OLD TABLE SIZE          00880000
         LR    R6,R15              DISPLACEMENT TO NEW PART             00890000
         LR    R1,R15                                                   00900000
         MVCL  R14,R0              PRESERVE THE PREVIOUS TABLE          00910000
         L     R1,#MEMPTR                                               00920000
         LR    R0,R6               LENGTH TO FREE                       00930000
         ICM   R0,B'1000',SUBPOOLT SUBPOOL TO FREE                      00940000
         FREEMAIN R,LV=(0),A=(1)                                        00950000
         SPACE 1                                                        00960000
VERP12   ST    R4,#MEMPTR          MEMBER TABLE BASE                    00970000
         AR    R4,R6               WHERE TO ADD MEMBERS                 00980000
         SPACE 2                                                        00990000
VERP14   BAS   R14,READDIR         GET THE NEXT MEMBER                  01000000
         B     VERP50              END OF MEMBERS, BRANCH               01010000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                01020000
         SPACE 3                                                        01030000
* CHECK FOR STANDARD MEMBER NAMES IF REQUIRED                           01040000
         TM    #VERSTND,X'02'      STANDARD NAME CHECK?                 01050000
         BNZ   VERP18              NO, BRANCH                           01060000
         SPACE 1                                                        01070000
         LA    R15,7                                            QF84002 01080000
         LA    R14,DOUBLE+8                                             01090000
         MVC   DOUBLE(8),MEMNAME                                        01100000
         SPACE 1                                                        01110000
VERP16   BCTR  R14,0               SCAN                                 01120000
         CLI   0(R14),X'40'            BACKWARDS                        01130000
         BNE   *+8                              FOR FIRST               01140000
         BCT   R15,VERP16                             NON-BLANK QF84002 01150000
         SPACE 1                                                        01160000
         SR    R1,R1               NO MESSAGE YET                       01170000
         LA    R2,VERP18           EXIT ADDRESS                         01180000
         CLI   MEMNAME,C'0'        NUMERIC FIRST CHARACTER?             01190000
         BNL   VERMBR              YES, NON-STANDARD                    01200000
         SPACE 1                                                        01210000
         TRT   DOUBLE(*-*),TRTMEM  <<EXECUTED>>                         01220000
         EX    R15,*-6             STANDARD MEMBER NAME?        QF84002 01230000
         LA    R1,0                                                     01240000
         LA    R2,VERP18                                                01250000
         BNZ   VERMBR              NO, BRANCH                           01260000
         SPACE 3                                                        01270000
* CHECK FOR CONFLICTING LOAD MODULE ATTRIBUTES                          01280000
VERP18   L     R14,DIRPTRS         CURRENT MEMBER                       01290000
         MVC   DIRNAME(12),0(R14)  MOVE IN NAME, FIRST TTR              01300000
         TM    FLAGSCC,RECFMU      LOAD LIBRARY?                        01310000
         BO    VERP18U             YES, BRANCH                          01320000
*** GET SIZE FOR SOURCE                                                 01330000
         CLI   #VERSIZE,2          NOSIZE REQUESTED?                    01340000
         BE    VERP28              YES, BRANCH                          01350000
         CLI   #VERREAD,X'02'      NO, INPUT REQUESTED?                 01360000
         BNE   VERP28              YES, BRANCH                          01370000
         TM    DIRFLAG,X'80'       ALIAS?                               01380000
         BO    VERP28              YES, BRANCH                          01390000
*        MVC   DIRNAME(40),0(R14)  MOVE IN NAME, OTHER DATA             01400043
         MVC   DIRNAME(52),0(R14)  MOVE IN NAME, OTHER DATA   DRK SEP09 01401043
         SR    R0,R0               ZERO FOR NO STATS                    01410042
         TM    DIRFLAG,X'0F'       SPF STATISTICS PRESENT?              01420000
         BO    VERP18A             YES, BRANCH                          01430040
         TM    DIRFLAG,X'14'       EXT SPF STATISTICS PRESENT?DRK AUG09 01431041
         BO    VERP18A             YES, BRANCH                DRK AUG09 01432041
         B     VERP18C             NO                                   01432140
VERP18A  DS    0H                                                       01433040
         TM    DIRSPFCR,X'FE'      0C OF 0CYYDDDF ZEROS?      Y2K AUG97 01440002
         BNZ   VERP18C             NO, BRANCH                 Y2K AUG97 01450002
         TM    DIRSPFCD,X'FE'      0C OF OTHER 0CYYDDDF ZERO? Y2K AUG97 01460002
         BNZ   VERP18C             NO, BRANCH                 Y2K AUG97 01470002
         SPACE 1                                                        01480000
         TM    DIRSPFFL,DIRSPFXS   EXTENDED STATS?            DRK AUG09 01490241
         BNO   VERP18B             NO                         DRK AUG09 01490341
         L     R0,DIRSPXSI         YES                        DRK AUG09 01490441
         B     VERP18C                                        DRK AUG09 01490541
VERP18B  DS    0H                                                       01490641
         SR    R0,R0                                          DRK JAN98 01490741
         ICM   R0,B'0011',DIRSPFSI GET CURRENT SIZE           DRK JAN98 01490801
VERP18C  CVD   R0,DOUBLE           CONVERT TO DECIMAL                   01500000
         L     R1,ATTRCNT2                                              01510000
         LA    R1,1(,R1)             ADD ONE MORE                       01520000
         ST    R1,ATTRCNT2                                              01530000
         OI    ATTRTOT2+7,X'0F'      INSURE VALID PACKED SIGN           01540000
         AP    ATTRTOT2(8),DOUBLE(8) ADD IN CURRENT VALUE               01550000
*        LA    R1,VERSUMM          VERIFY SUMMARY                       01560056
         L     R1,AVERSUMM         VERIFY SUMMARY                       01561056
         ST    R1,ADDRSUMR         SET FOR A LATTER CALL                01570000
         XC    DIRNAME+12(28),DIRNAME+12   CLEAR AFTER NAME, TTR        01580000
         B     VERP28                                                   01590000
*** GET SIZE FOR LOAD                                                   01600000
VERP18U  TM    #VERNLKD,X'02'      NOLKED?                              01610000
         BO    VERP24              YES, BRANCH                          01620000
         SPACE 1                                                        01620182
         CLI   DIRFLAG,0           LENGTH=12, DATA?           DRK NOV20 01620289
         BE    VERP24              YES, BRANCH                DRK NOV20 01620389
         MVC   DIRNAME(40),0(R14)  MOVE IN NAME, OTHER DATA             01630000
         SPACE 1                                                        01631082
         TM    DIRFLAG,X'80'       ALIAS?                               01640000
         BO    VERP18Z             YES, BRANCH                          01650000
         L     R15,=A(VERAD00)                                          01651064
         BASR  R14,R15                                                  01652064
*        BAS   R14,VERAD00                                              01660064
VERP18Z  DS    0H                                                       01670000
         TM    DIRATTR2,DIRAOSLE           VS LINKAGE EDITOR?           01680000
         BNO   VERP20                      NO, BRANCH                   01690000
         TM    DIRATTR3,DIRRMANY           RMODE ANY?                   01700000
         BZ    VERP20                      NO, BRANCH                   01710000
         SR    R1,R1                                                    01720000
         IC    R1,DIRATTR3                 AMODE BITS                   01730000
         TM    DIRFLAG,X'80'               ALIAS?                       01740000
         BNO   *+8                         NO, BRANCH                   01750000
         SRL   R1,2                        YES, SHIFT AMODE BITS        01760000
         STC   R1,MODESAVE                 SAVE CURRENT AMODE           01770000
         SPACE 1                                                        01770269
         TM    MODESAVE,DIRRMANY+DIRRM64   RMODE 64?          DRK APR18 01770361
         BNO   VERP18ZA                    NO, BRANCH         DRK APR18 01770475
         L     R15,=A(VERRM64)             YES, CHECK AMODE           " 01770573
         BASR  R14,R15                                                  01770673
         B     VERP20                                         DRK APR18 01772161
VERP18ZA DS    0H                                                       01772269
         LA    R1,=C'ANY'                  ASSUME AMODE IS ANY          01780000
         TM    MODESAVE,DIRAM64+DIRAM31    CORRECT?           DRK OCT02 01790005
         BO    VERP19                      YES, INVALID                 01800000
         TM    MODESAVE,DIRAM31            AMODE 31?                    01810000
         BO    VERP20                      YES, BRANCH                  01820000
         TM    MODESAVE,DIRAM64            AMODE 64?          DRK OCT02 01821005
         BO    VERP20                      YES, BRANCH        DRK OCT02 01822005
         LA    R1,=C'24 '                  AMODE MUST BE 24             01830000
VERP19   MVI   MTLEN,3                     MESSAGE LENGTH               01840000
         MVC   INSERT#1(3),0(R1)           MOVE IN THE AMODE TEXT       01850000
         LA    R1,L880$1                   RMODE ANY/AMODE CONFLICT     01860000
         BAS   R2,VERMBR                   OUTPUT AN ERROR MESSAGE      01870000
         SPACE 3                                                        01880000
VERP20   TM    DIRATTR,ATTRRENT                REENTRANT?               01890000
         BNO   VERP22                          NO, BRANCH               01900000
         TM    DIRATTR,ATTRREUS                REUSABLE?                01910000
         BO    VERP22                          YES, BRANCH              01920000
         LA    R1,L881                         RENT AND NOT REUS        01930000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       01940000
VERP22   LA    R1,L882                         TEST AND NOT EDIT        01950000
         TM    DIRATTR+1,ATTRSYMS+ATTRNE       TEST AND NOT EDIT?       01960000
         BNO   *+8                             NO, BRANCH               01970000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       01980000
         LA    R1,L883                         REUSABLE AND SCATTER     01990000
         TM    DIRATTR,ATTRREUS+ATTRSCTR       REUSABLE AND SCATTER?    02000000
         BNO   *+8                             NO, BRANCH               02010000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02020000
         TM    DIRATTR,ATTROVLY                OVERLAY DEFINED?         02030000
         BNO   VERP24                          NO, BRANCH               02040000
         MVC   INSERT#1(8),BLANKS              BLANKS                   02050000
         MVC   INSERT#1(4),VERRENT             OVERLAY AND REENTRANT    02060000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02070000
         TM    DIRATTR,ATTRRENT                CORRECT?                 02080000
         BNO   *+8                             NO, BRANCH               02090000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02100000
         MVC   INSERT#1(4),VERREUS             OVERLAY AND REUSABLE     02110000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02120000
         TM    DIRATTR,ATTRREUS                CORRECT?                 02130000
         BNO   *+8                             NO, BRANCH               02140000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02150000
         MVC   INSERT#1(4),VERREFR             OVERLAY AND REFRESHABLE  02160000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02170000
         TM    DIRATTR+1,ATTRREFR              CORRECT?                 02180000
         BNO   *+8                             NO, BRANCH               02190000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02200000
         MVC   INSERT#1(4),VERSCTR             OVERLAY AND SCATTER      02210000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02220000
         TM    DIRATTR,ATTRSCTR                CORRECT?                 02230000
         BNO   *+8                             NO, BRANCH               02240000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02250000
         TM    DIRATTR2,DIRAOSLE               MVS LINKAGE-EDITOR?      02260000
         BNO   VERP24                          NO, BRANCH               02270000
         MVC   INSERT#1(5),=C'RMODE'                                    02280000
         MVC   INSERT#1+6(3),=C'ANY'           RMODE ANY                02290000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02300000
         TM    DIRATTR3,DIRRMANY               RMODE ANY?               02310000
         BNO   *+8                             NO, BRANCH               02320000
         BAS   R2,VERMBR                       YES, ERROR MESSAGE       02330000
         MVI   INSERT#1,C'A'                   AMODE ANY                02340000
         SR    R1,R1                                                    02350000
         IC    R1,DIRATTR3                     AMODE BITS               02360000
         TM    DIRFLAG,X'80'                   ALIAS?                   02370000
         BNO   *+8                             NO, BRANCH               02380000
         SRL   R1,2                            YES, SHIFT AMODE BITS    02390000
         STC   R1,MODESAVE                     SAVE CURRENT AMODE       02400000
         LA    R1,L884$1                       OVERLAY CONFLICT MESSAGE 02410000
         SPACE 1                                                        02411005
         TM    MODESAVE,DIRAM31+DIRAM64        AMODE ANY?     DRK OCT02 02411105
         BO    VERP23                          YES, ERROR     DRK OCT02 02411205
         MVC   INSERT#1+6(3),=C'31 '           AMODE 31       DRK OCT02 02411305
         TM    MODESAVE,DIRAM31                AMODE 31?      DRK OCT02 02411405
         BO    VERP23                          YES, ERROR     DRK OCT02 02411505
         MVC   INSERT#1+6(3),=C'64 '           AMODE 64       DRK OCT02 02411605
         TM    MODESAVE,DIRAM64                AMODE 64?      DRK OCT02 02411705
         BO    VERP23                          YES, ERROR     DRK OCT02 02411805
         B     VERP24                          NO, BRANCH     DRK OCT02 02411905
VERP23   DS    0H                                                       02461005
         BAS   R2,VERMBR                       ERROR MESSAGE            02470000
         SPACE 3                                                        02480000
* LOAD EACH MEMBER IF REQUIRED AND THIS IS A LOAD LIBRARY               02490000
VERP24   TM    #VERLOAD,X'02'      LOAD CHECK REQUESTED?                02500000
         BNZ   VERP28              NO, BRANCH                           02510000
         SPACE 1                                                        02520000
         TM    FLAGSCC,RECFMU      LOAD LIBRARY?                        02530000
         BZ    VERP28              NO, BRANCH                           02540000
         SPACE 1                                                        02550000
* SKIP LOAD OF SOURCE MEMBERS                                           02550148
         MVC   DOUBLE(1),DIRFLAG   PDS2LIBF                   DRK MAR11 02551047
         NI    DOUBLE,X'7F'        TURN OFF ALIAS BIT         DRK MAR11 02552046
         CLI   DOUBLE,X'00'        USER DATA?                 DRK MAR11 02553046
         BE    VERP28              NO, SKIP LOAD              DRK MAR11 02553146
         CLI   DOUBLE,X'0F'        SPF STATS?                 DRK MAR11 02553246
         BE    VERP28              YES, SKIP LOAD             DRK MAR11 02553346
         CLI   DOUBLE,X'14'        SPF XSTATS?                DRK MAR11 02553446
         BE    VERP28              YES, SKIP LOAD             DRK MAR11 02553546
         SPACE 1                                                        02554046
         OI    ##ADRPA#,$Q         ENTER QUIET MODE PROCESSING          02560000
         L     R2,RECOVER          PREVIOUS RECOVERY ADDRESS            02570000
         LA    R1,VERP26           RESUME ADDRESS                       02580000
         ST    R1,RECOVER          IN-LINE RECOVERY                     02590000
         STM   R2,R8,#SAVEREG      SAVE REGISTERS                       02600000
         LOAD   EPLOC=DIRNAME,DCB=INDCB                                 02610000
         DELETE EPLOC=DIRNAME                                           02620000
         ST    R2,RECOVER          RESET RECOVERY ADDRESS               02630000
         B     VERP28                                                   02640000
         SPACE 1                                                        02650000
VERP26   LM    R2,R8,#SAVEREG      SAVE REGISTERS                       02660000
         ST    R2,RECOVER          RESTORE RECOVERY ADDRESS             02670000
         MVI   MTLEN,4             FOUR CHARACTERS FROM ABEND MESSAGE   02680000
*        MVC   INSERT#1(4),INSERT#1                                     02690000
         LA    R1,L998$1           "ABEND SNNN LOADING THIS MODULE"     02700000
         BAS   R2,VERMBR           OUTPUT AN ABENDED MESSAGE            02710000
         SPACE 3                                                        02720000
* CHECK IF THIS MEMBER IS IN USE BY AN SPF EDIT SESSION                 02730000
VERP28   OI    ##ADRPA#,$Q         ENTER QUIET MODE PROCESSING          02740000
         SPACE 1                                                        02750000
         MVC   DSNMEMQ(8),DIRNAME  MEMBER NAME TO CHECK                 02760000
         BAS   R2,ENQMTEST         MEMBER IN USE?                       02770000
         BAS   R2,VERMBR           YES, OUTPUT AN IN-USE MESSAGE        02780000
         SPACE 3                                                        02790000
* CHECK THAT THE PDS DIRECTORY MEMBERS ARE IN CORRECT COLLATING ORDER   02800000
VERP30   NI    ##ADRPA#,FF-$Q      LEAVE QUIET MODE PROCESSING          02810000
         CLC   #VERMBR(8),DIRNAME  PREVIOUS:CURRENT                     02820000
         BH    VERP32                HIGH  -- ERROR, OUT OF ORDER       02830000
         MVC   #VERMBR(8),DIRNAME                                       02840000
         BL    VERP34                LOW   -- VALID                     02850000
         LA    R1,L824               EQUAL -- ERROR, DUPLICATE          02860000
         BAS   R2,VERMBR                                                02870000
         B     VERP14              IGNORE THIS MEMBER                   02880000
         SPACE 1                                                        02890000
VERP32   LA    R1,L825             MEMBER OUT OF SEQUENCE               02900000
         BAS   R2,VERMBR                                                02910000
         B     VERP14              IGNORE THIS MEMBER                   02920000
         SPACE 3                                                        02930000
* SELECT THE HIGHEST TTR POINTERS FOR THIS MEMBER                       02940000
VERP34   MVC   0(8+4,R4),DIRNAME   MOVE IN THE NAME, FIRST TTR          02950000
         XC    12(4,R4),12(R4)     CLEAR THE SECOND TTR ADDRESS         02960000
         TM    MEMTTR+3,DIR1TTR+DIR2TTR  ANY OTHER TTR'S?               02970000
         BZ    VERP35                    NO, BRANCH                     02980000
         SPACE 1                                                        02990000
         MVC   12(3,R4),DIRNAME+12 ADD FIRST USER TTR                   03000000
         TM    MEMTTR+3,DIR2TTR    SECOND TTR?                          03010000
         BZ    VERP35              NO, BRANCH                           03020000
         SPACE 1                                                        03030000
         CLC   12(3,R4),DIRNAME+16 FIRST TTR > SECOND TTR?              03040000
         BH    *+10                YES, BRANCH                          03050000
         MVC   12(3,R4),DIRNAME+16 NO, USE SECOND TTR                   03060000
         SPACE 1                                                        03070000
VERP35   NI    11(R4),X'80'        SAVE ONLY THE ALIAS BIT              03080000
         CLC   8(3,R4),DS1LSTAR    IN DATA SET BOUNDS?                  03090000
         BNH   VERP36              YES, BRANCH                          03100000
         SPACE 1                                                        03110000
*** PAST DS1LSTAR -- PERHAPS WE NEED TO REOPEN THE DATA SET             03120000
         OI    FLAGSJJ,FNOREAD     CALL EXCP FOR OPEN ONLY              03130000
         MVC   STARTTR(3),DIRTTR   READ ADDRESS                         03140000
         L     R15,=V(EXCP)        READ THE FIRST RECORD OF THIS MEMBER 03150000
         BASR  R14,R15                                                  03160000
         NI    FLAGSJJ,FF-FNOREAD  EXCP OPEN IS COMPLETE                03170000
         SPACE 2                                                        03180000
         CLC   8(3,R4),DS1LSTAR    IN DATA SET BOUNDS?                  03190000
         BNH   VERP36              YES, BRANCH                          03200000
         LA    R1,L872                                                  03210000
         BAS   R2,VERMBR           NO, OUTPUT AN ERROR MESSAGE          03220000
         B     VERP38                                                   03230000
         SPACE 1                                                        03240000
VERP36   CLC   12(3,R4),DS1LSTAR   IN DATA SET BOUNDS?                  03250000
         BNH   VERP37              YES, BRANCH                          03260000
         LA    R1,L873                                                  03270000
         BAS   R2,VERMBR           NO, OUTPUT AN ERROR MESSAGE          03280000
         SPACE 1                                                        03290000
VERP37   MVI   15(R4),X'FF'        ASSUME NOT AN OS/VS LINKAGE-EDITOR   03300000
         TM    FLAGSCC,RECFMU      RECFM=U?                             03310000
         BNO   VERP38              NO, BRANCH                           03320000
         TM    #VERNLKD,X'02'      NOLKED?                              03330000
         BO    VERP38              YES, BRANCH                          03340000
         TM    DIRATTR2,DIRAOSLE   OS/VS LINKAGE-EDITOR?                03350000
         BNO   VERP38              NO, BRANCH                           03360000
         NI    DIRATTR3,DIRRMANY+DIRAM31+DIRAM64              DRK OCT02 03370005
         OC    11(1,R4),DIRATTR3   SAVE THE RMODE/AMODE CHARACTER       03380000
         MVC   15(1,R4),DIRATTR4   SAVE THE RLD/CONTROL COUNT           03390000
         SPACE 3                                                        03400000
* PERFORM AN INSERTION SORT OF THIS ENTRY                               03410000
VERP38   MVC   DIRNAME(16),0(R4)   SAVE ENTRY FOR INSERTION SORT        03420000
         LR    R14,R4              LAST SORT POSITION                   03430000
         L     R1,#MEMPTR          FIRST SORT POSITION                  03440000
         SH    R1,=H'16'           ADJUST FOR NEXT LA                   03450000
         SPACE 1                                                        03460000
VERP40   LA    R1,16(,R1)          NEXT TABLE ENTRY                     03470000
         CLC   8(4,R1),DIRTTR      TABLE TTR:NEW TTR                    03480000
         BL    VERP40                LOW   --  ITERATE                  03490000
         BH    VERP41                HIGH  --  INSERT                   03500000
         CLC   0(8,R1),DIRNAME       EQUAL --  TABLE NAME:NEW NAME      03510000
         BL    VERP40                            LOW   -- ITERATE       03520000
         BE    VERP42                            EQUAL -- IN PLACE      03530000
         SPACE 1                                                        03540000
VERP41   SH    R14,=H'16'          PREVIOUS TABLE ENTRY                 03550000
         MVC   16(16,R14),0(R14)   SLIDE DOWN TO MAKE ROOM              03560000
         CR    R14,R1              DONE WITH SHIFTING?                  03570000
         BH    VERP41              NO, BRANCH                           03580000
         MVC   0(16,R1),DIRNAME    INSERT NEW ENTRY TO ITS POSITION     03590000
         SPACE 2                                                        03600000
VERP42   LA    R4,16(,R4)          NEXT TABLE ENTRY                     03610000
         S     R3,=F'1'            ANY MORE ENTRIES FIT?                03620000
         BP    VERP14              YES, BRANCH                          03630000
         BZ    VERP10              NO, REALLOCATE THE MEMBER TABLE      03640000
         SPACE 3                                                        03650000
* SINGLE MEMBER -- CHECK DIRECTORY ATTRIBUTES                           03660000
         ST    R4,#MEMLAST         UPDATE LAST MEMBER POINTER           03670000
         MVI   STARTTR+2,X'01'     TTR=00001 (START OF DIRECTORY)       03680000
         XC    INSERT#1(8),INSERT#1                                     03690000
         SPACE 1                                                        03700000
VERP44   BAS   R14,READDIR         GET NEXT MEMBER                      03710000
         B     VERP48              LAST MEMBER, BRANCH                  03720000
         SPACE 1                                                        03730000
         CLC   DIRTTR,MEMTTR       TTR MATCH?                           03740000
         BNE   VERP44              NO, BRANCH                           03750000
         TM    DIRFLAG,X'80'       FIRST THE MAIN ENTRY?                03760000
         BZ    VERP45              YES, BRANCH                          03770000
         TM    MEMFLAG,X'80'       SECOND AN ALIAS?                     03780000
         BO    VERP44              YES, IGNORE                          03790000
         SPACE 1                                                        03800000
* FOUND A REAL CORRESPONDING ENTRY                                      03810000
         MVC   INSERT#1(8),MEMNAME REAL ENTRY FOR THE ALIAS             03820000
         M$MSG L066$1                                                   03830000
         TM    FLAGSCC,RECFMU      LOAD MODULE?                         03840000
         BNO   VERP44              NO, DONE                             03850000
         TM    #VERNLKD,X'02'      NOLKED?                              03860000
         BO    VERP44              YES, BRANCH                          03870000
         LA    R14,DIRREAL                                              03880000
         TM    DIRATTR,ATTRSCTR    SCATTER LOADED?                      03890000
         BNO   *+8                 NO, BRANCH                           03900000
         LA    R14,DIRREALS                                             03910000
         MVC   INSERT#2(8),0(R14)                                       03920000
         TR    INSERT#2(8),TRLINE                                       03930000
         LA    R1,L820$2                                                03940000
         CLC   0(8,R14),MEMNAME    CORRECT MEMBER NAME?                 03950000
         BE    *+8                 YES, BRANCH                          03960000
         BAS   R2,VERMBR           NO, MESSAGE                          03970000
         B     VERP47                                                   03980000
         SPACE 3                                                        03990000
* FOUND AN ALIAS CORRESPONDING ENTRY                                    04000000
VERP45   MVC   INSERT#1(8),MEMNAME                                      04010000
         TM    MEMFLAG,X'80'       AN ALIAS?                            04020000
         BO    VERP46              YES, BRANCH                          04030000
         CLC   DIRNAME(8),MEMNAME  FIND MYSELF?                         04040000
         BE    VERP44              YES, BRANCH                          04050000
         M$MSG L864$1              FOUND AN APPARENT ALIAS              04060000
         B     VERP73                                                   04070000
         SPACE 1                                                        04080000
VERP46   TM    FLAGSCC,RECFMU      LOAD MODULE?                         04090000
         BNO   VERP44              NO, BRANCH                           04100000
         TM    #VERNLKD,X'02'      NOLKED?                              04110000
         BO    VERP44              YES, BRANCH                          04120000
         L     R3,DIRPTRS                                               04130000
         LA    R14,DIRREAL-DIRNAME(R3)                                  04140000
         TM    DIRATTR-DIRNAME(R3),ATTRSCTR                             04150000
         BNO   *+8                                                      04160000
         LA    R14,DIRREALS-DIRNAME(R3)                                 04170000
         MVC   INSERT#2(8),0(R14)                                       04180000
         TR    INSERT#2(8),TRLINE                                       04190000
         LA    R1,L827$2                                                04200000
         CLC   0(8,R14),DIRNAME    CORRECT MEMBER NAME?                 04210000
         BE    *+8                 YES, BRANCH                          04220000
         BAS   R2,VERMBR           NO, MESSAGE                          04230000
         SPACE 1                                                        04240000
VERP47   L     R3,DIRPTRS                                               04250000
         LA    R1,L823$1           RLD/CONTROL MISMATCH                 04260000
         CLC   DIRATTR4(1),DIRATTR4-DIRNAME(R3)                         04270000
         BE    *+8                                                      04280000
         BAS   R2,VERMBR                                                04290000
         SPACE 1                                                        04300000
         MVI   DOUBLE+0,DIRRMANY                                        04310000
         MVI   DOUBLE+1,DIRRMANY                                        04320000
         NC    DOUBLE+0(1),DIRATTR3                                     04330000
         NC    DOUBLE+1(1),DIRATTR3-DIRNAME(R3)                         04340000
         LA    R1,L821$1           RMODE BITS DO NOT CORRESPOND         04350000
         CLC   DOUBLE(1),DOUBLE+1  EQUAL?                               04360000
         BE    *+8                 YES, BRANCH                          04370000
         BAS   R2,VERMBR           NO, ERROR                            04380000
         SPACE 1                                                        04390000
         MVI   DOUBLE+0,DIRAM31+DIRAM64                       DRK OCT02 04400005
         MVI   DOUBLE+1,DIRAM31+DIRAM64                       DRK OCT02 04410005
         NC    DOUBLE+0(1),DIRATTR3                                     04420000
         NC    DOUBLE+1(1),DIRATTR3-DIRNAME(R3)                         04430000
         LA    R1,L822$1           AMODE BITS DO NOT CORRESPOND         04440000
         CLC   DOUBLE(1),DOUBLE+1  EQUAL?                               04450000
         BE    *+8                 YES, BRANCH                          04460000
         BAS   R2,VERMBR           NO, ERROR                            04470000
         B     VERP44                                                   04480000
         SPACE 1                                                        04490000
* END OF MEMBERS                                                        04500000
VERP48   TM    DIRFLAG,X'80'       ALIAS FIRST MEMBER?        DRK AUG05 04510016
*VERP48  TM    DIRNAME,X'80'       ALIAS FIRST MEMBER?                  04511016
         BNO   VERP73              NO, BRANCH                           04520000
         CLI   INSERT#1,0          ANY MAIN ENTRY FOUND?                04530000
         BNE   VERP73              YES, BRANCH                          04540000
         M$MSG L860                ORPHAN MEMBER                        04550000
         TM    FLAGSCC,RECFMU      LOAD MODULE?                         04560000
         BNO   VERP73              NO, BRANCH                           04570000
         TM    #VERNLKD,X'02'      NOLKED?                              04580000
         BO    VERP73              YES, BRANCH                          04590000
         MVC   INSERT#1(8),DIRREAL                                      04600000
         SPACE 1                                                        04610000
         TM    DIRATTR,ATTRSCTR   SCATTER LOADED?                       04620000
         BNO   *+10               NO, BRANCH                            04630000
         MVC   INSERT#1(8),DIRREALS                                     04640000
         M$MSG L861$1                                                   04650000
         L     R15,=A(VERAD00)                                          04651064
         BASR  R14,R15                                                  04652064
*        BAS   R14,VERAD00                                              04660064
         B     VERP73                                                   04670000
         SPACE 3                                                        04680000
* DIRECTORY TTR SORT COMPLETE -- CHECK FOR ORPHAN MEMBERS, APPARENT     04690000
* ALIAS MEMBERS AND ALIAS MEMBERS WITH INCORRECT MAIN MEMBER POINTERS   04700000
VERP50   LA    R1,L400                                                  04710000
         ST    R4,#MEMLAST         SAVE THE END POINTER                 04720000
         ICM   R3,B'1111',#MEMPTR  FIRST MEMBER                         04730000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                04740000
         OI    #VERSTND,X'02'      NO MORE MEMBER NAME CHECKING         04750000
         LR    R5,R3                                                    04760000
         TM    8+3(R3),X'80'       ALIAS ENTRY?                         04770000
         BO    VERP54              YES, BRANCH                          04780000
         B     VERP58+4                                                 04790000
         SPACE 1                                                        04800000
VERP52   LA    R3,16(,R5)          NEXT TABLE ENTRY                     04810000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                04820000
         CR    R3,R4               DONE?                                04830000
         BE    VERP66              YES, BRANCH                          04840000
         LR    R5,R3                                                    04850000
         SPACE 1                                                        04860000
         TM    8+3(R3),X'80'       ALIAS ENTRY?                         04870000
         BNO   VERP58+4            NO, BRANCH                           04880000
VERP54   LA    R1,L860             YES, THIS IS AN ORPHAN               04890000
         MVC   MEMNAME(8),0(R3)                                         04900000
         BAS   R2,VERMBR                                                04910000
         NI    8+3(R3),X'FF'-X'80' TURN OFF THE ALIAS BIT (ORPHAN)      04920000
         TM    FLAGSCC,RECFMU      LOAD MODULE?                         04930000
         BNO   VERP52              NO, BRANCH                           04940000
         TM    #VERNLKD,X'02'      NOLKED?                              04950000
         BO    VERP52              YES, BRANCH                          04960000
         XC    DIRUSER,DIRUSER                                          04970000
         MVC   DIRNAME,0(R3)       MEMBER NAME                          04980000
         BLDL  INDCB,BLDLLIST                                           04990000
         LTR   R15,R15             ANY BLDL ERROR?                      05000000
         BP    IOERROR             YES, I/O ERROR                       05010000
         SPACE 1                                                        05020000
         MVC   DIRFLAG(DIREND-DIRFLAG),DIRFLAG+2                        05030000
         MVC   INSERT#1(8),DIRREAL                                      05040000
         SPACE 1                                                        05050000
         TM    DIRATTR,ATTRSCTR   SCATTER LOADED?                       05060000
         BNO   *+10               NO, BRANCH                            05070000
         MVC   INSERT#1(8),DIRREALS                                     05080000
         M$MSG L861$1                                                   05090000
         L     R15,=A(VERAD00)                                          05091064
         BASR  R14,R15                                                  05092064
*        BAS   R14,VERAD00                                              05100064
         B     VERP52                                                   05110000
         SPACE 2                                                        05120000
VERP58   LA    R5,16(,R5)          NEXT POTENTIAL ALIAS ENTRY           05130000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                05140000
         CR    R5,R4               DONE?                                05150000
         BE    VERP66              YES, BRANCH                          05160000
         CLC   8(3,R3),16+8(R5)    TTR FOR AN ALIAS?                    05170000
         BNE   VERP52              NO, BRANCH                           05180000
         TM    16+8+3(R5),X'80'    ALIAS FLAG SET?                      05190000
         BNO   VERP64              NO, APPARENT ALIAS                   05200000
         SPACE 1                                                        05210000
         TM    FLAGSCC,RECFMU      LOAD MODULE?                         05220000
         BNO   VERP58              NO, BRANCH                           05230000
         TM    #VERNLKD,X'02'      NOLKED?                              05240000
         BO    VERP58              YES, BRANCH                          05250000
         XC    DIRUSER,DIRUSER                                          05260000
         MVC   DIRNAME,16(R5)      MEMBER NAME                          05270000
         BLDL  INDCB,BLDLLIST                                           05280000
         LTR   R15,R15             ANY BLDL ERROR?                      05290000
         BP    IOERROR             YES, I/O ERROR                       05300000
         SPACE 1                                                        05310000
         MVC   DIRFLAG(DIREND-DIRFLAG),DIRFLAG+2                        05320000
         LA    R1,DIRREAL          NAME OF CORRESPONDING MAIN           05330000
         TM    DIRATTR,ATTRSCTR    SCATTER LOADED?                      05340000
         BNO   *+8                 NO, BRANCH                           05350000
         LA    R1,DIRREALS         YES, USE THIS NAME INSTEAD           05360000
         SPACE 1                                                        05370000
         CLC   0(8,R1),0(R3)       CORRECT NAME RECORDED?               05380000
         BE    VERP60              YES, BRANCH                          05390000
         MVI   MTLEN,8             MEMBER NAME 1                        05400000
         MVI   MTLEN+4,8           MEMBER NAME 2                        05410000
         MVC   INSERT#1(8),0(R3)                                        05420000
         MVC   INSERT#2(8),0(R1)                                        05430000
         TR    INSERT#2(8),TRLINE                                       05440000
         LA    R1,L820$2                                                05450000
         MVC   MEMNAME(8),16(R5)                                        05460000
         BAS   R2,VERMBR                                                05470000
         SPACE 1                                                        05480000
VERP60   CLC   15(1,R3),16+15(R5)  MATCHING RLD/CONTROL COUNTS?         05490000
         BE    VERP62              YES, BRANCH                          05500000
         MVC   INSERT#1(8),16(R5)                                       05510000
         MVC   MEMNAME(8),0(R3)                                         05520000
         LA    R1,L823$1           NO, RLD/CONTROL MISMATCH             05530000
         BAS   R2,VERMBR                                                05540000
         SPACE 1                                                        05550000
VERP62   MVI   DOUBLE,DIRRMANY       BIT TO TEST                        05560000
         MVI   DOUBLE+1,DIRRMANY     BIT TO TEST                        05570000
         NC    DOUBLE(1),16+11(R5)   ALIAS RMODE BIT                    05580000
         NC    DOUBLE+1(1),11(R3)    MAIN RMODE BIT                     05590000
         CLC   DOUBLE(1),DOUBLE+1    RMODE BITS EQUAL?                  05600000
         BE    VERP63                YES, BRANCH                        05610000
         MVC   INSERT#1(8),16(R5)                                       05620000
         MVC   MEMNAME(8),0(R3)                                         05630000
         LA    R1,L821$1             NO, RMODE DOES NOT MATCH           05640000
         BAS   R2,VERMBR                                                05650000
         SPACE 1                                                        05660000
VERP63   MVI   DOUBLE,DIRAM31+DIRAM64    BITS TO TEST         DRK OCT02 05670005
         MVI   DOUBLE+1,DIRAM31+DIRAM64  BITS TO TEST         DRK OCT02 05680005
         NC    DOUBLE(1),16+11(R5)   ALIAS AMODE BITS                   05690000
         NC    DOUBLE+1(1),11(R3)    MAIN AMODE BIT                     05700000
         CLC   DOUBLE(1),DOUBLE+1    AMODE BITS EQUAL?                  05710000
         BE    VERP58                YES, BRANCH                        05720000
         MVC   INSERT#1(8),16(R5)                                       05730000
         MVC   MEMNAME(8),0(R3)                                         05740000
         LA    R1,L822$1             NO, AMODE DOES NOT MATCH           05750000
         BAS   R2,VERMBR                                                05760000
         B     VERP58                                                   05770000
         SPACE 1                                                        05780000
VERP64   MVC   INSERT#1(8),16(R5)  MEMBER NAME INSERTED                 05790000
         MVC   MEMNAME(8),0(R3)                                         05800000
         LA    R1,L864$1                                                05810000
         BAS   R2,VERMBR                                                05820000
         OI    16+8+3(R5),X'80'    TURN ON ALIAS BIT (APPARENT ALIAS)   05830000
         B     VERP58                                                   05840000
         SPACE 3                                                        05850000
* END OF DIRECTORY CHECK, NOW PERFORM ANY INPUT CHECK                   05860000
VERP66   MVI   STARTTR+2,X'01'     TTR=000001 (START OF DIRECTORY)      05870000
         TM    #VERUPDT,4+2        SINGLE MEMBER CHECK?                 05880000
         BO    VERP73              YES, BRANCH                          05890000
         SPACE 1                                                        05900000
VERP68   L     R15,=V(EXCP)        READ THE DIRECTORY RECORDS           05910000
         BASR  R14,R15                                                  05920000
         B     *+4(R15)            PROCESS RETURN CODE                  05930000
         B     VERP70                00 - SUCCESSFUL READ               05940000
         B     VERP72                04 - END OF MEMBER                 05950000
         B     VERP72                08 - END OF DATA SET               05960000
         B     IOERROR               12 - I/O ERROR                     05970000
         SPACE 2                                                        05980000
VERP70   L     R0,LS               LENGTH OF RECORD (DD OF RKDD)        05990000
         ICM   R0,B'0100',=X'08'   KEY LENGTH OF RECORD (K OF RKDD)     06000000
         BAS   R2,VERCOMP          DATA IS RETAINED IN THE OUTPUT       06010000
         B     VERP68              READ ALL DIRECTORY BLOCKS            06020000
         SPACE 1                                                        06030000
VERP72   SR    R0,R0               LENGTH OF RECORD & KEY (KDD OF RKDD) 06040000
         BAS   R2,VERCOMP          DATA IS RETAINED IN THE OUTPUT       06050000
         OI    ##ADRPA#,$Q         ENTER QUIET MODE PROCESSING          06060000
         CLI   CURMBB,0            MULTI-EXTENT DIRECTORY?              06070000
         BE    VERP73              NO, BRANCH                           06080000
         M$ERRST MSGBLANK          YES, ERROR MESSAGE                   06090000
         M$ERRST MSGBLANK                                               06100000
         M$MSG L870                                                     06110000
         SPACE 1                                                        06120000
VERP73   ICM   R6,B'1111',#MEMPTR  FIRST MEMBER                         06130000
         TM    #VERUPDT,4+2        SINGLE MEMBER CHECK?                 06140000
         BNO   *+8                 NO, BRANCH                           06150000
         NI    8+3(R6),FF-X'80'    YES, READ THIS MEMBER                06160000
         CLI   #VERREAD,X'02'      NOINPUT REQUESTED?                   06170000
         BE    VERP99              YES, BRANCH                          06180000
         B     VERP74+4                                                 06190000
         SPACE 2                                                        06200000
VERP74   LA    R6,16(,R6)          NEXT TABLE ENTRY                     06210000
         MVI   RLDCOUNT,X'FF'      ASSUME NO RLD/CONTROL IS FOUND       06220000
         C     R6,#MEMLAST         DONE?                                06230000
         BE    VERP97              YES, BRANCH                          06240000
         TM    8+3(R6),X'80'       ALIAS ENTRY?                         06250000
         BO    VERP74              YES, BRANCH                          06260000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                06270000
         MVC   MEMNAME(8),0(R6)    INITIALIZE THE MEMBER NAME           06280000
         XC    #MEMCNT(4),#MEMCNT  COUNT OF INPUT LOGICAL RECORDS       06290000
         LA    R5,3                ALLOW 3 PERMANENT ERRORS/MEMBER      06300000
         SPACE 1                                                        06310000
         CLC   8(3,R6),DS1LSTAR    BEYOND END OF DATA MARKER?           06320000
         BNL   VERP90              YES, DONE                            06330000
         MVC   STARTTR(3),8(R6)    NO, FIRST DISK ADDRESS TO READ       06340000
         MVC   DIRNAME(8),0(R6)    MEMBER NAME FOR PAM        DRK AUG05 06341012
         SPACE 3                                                        06350000
VERP76   L     R15,=V(EXCP)                                             06360000
         BASR  R14,R15                                                  06370000
         B     *+4(R15)            PROCESS RETURN CODE                  06380000
         B     VERP80                00 - SUCCESSFUL READ               06390000
         B     VERP92                04 - END OF MEMBER                 06400000
         B     VERP90                08 - END OF DATA SET               06410000
         B     VERP78                12 - I/O ERROR                     06420000
         SPACE 2                                                        06430000
*  PERMANENT I/O ERROR  -- SIMULATE END OF MEMBER                       06440000
VERP78   LA    R1,L991$1           OUTPUT THE I/O ERROR MESSAGE         06450000
         MVI   MTLEN,6             LENGTH OF THE TTR INSERT             06460000
         BAS   R2,VERMBR                                                06470000
         MVI   MTLEN,8             RESET TO EIGHT                       06480000
         B     VERP92                                                   06490000
         SPACE 2                                                        06500000
VERP80   LR    R3,R0               BUFFER START                         06510000
         L     R5,LS               BLOCK LENGTH                         06520000
         C     R5,#VERMAX          GREATER THAN MAXIMUM?                06530000
         BNH   *+8                 NO, BRANCH                           06540000
         ST    R5,#VERMAX          YES, SAVE NEW MAXIMUM                06550000
         L     R0,#VERCBLK         NUMBER                               06560000
         A     R0,=F'1'                  OF PHYSICAL                    06570000
         ST    R0,#VERCBLK                          BLOCKS              06580000
         L     R0,#VERCBLC         NUMBER                               06590000
         AR    R0,R5                     OF PHYSICAL                    06600000
         ST    R0,#VERCBLC                          CHARACTERS          06610000
         LR    R0,R5               LENGTH OF RECORD & KEY (KDD OF RKDD) 06620000
         BAS   R2,VERCOMP          DATA IS RETAINED IN THE OUTPUT       06630000
         SPACE 1                                                        06640000
         CH    R5,#MAXBLKV         EXCEED MAXBLK?                       06650000
         BNH   VERP81              YES, BRANCH                          06660000
         OC    #MAXBLKV(2),#MAXBLKV  ANY MAXBLK()?                      06670000
         BZ    VERP80A               NO, BRANCH                         06680000
         TM    #MEMPTR,#MEMBLKE    BLKSIZE SIZE ERROR NOTED?            06690000
         BO    VERP81              YES, BRANCH                          06700000
         OI    #MEMPTR,#MEMBLKE    BLKSIZE ERROR NOTED NOW              06710000
         CVD   R5,DOUBLE                                                06720000
         MVC   INSERT#1(8),VERP2020                                     06730000
         ED    INSERT#1(7),DOUBLE+5                                     06740000
         LA    R1,L806$1           BLKSIZE ERROR                        06750000
         BAS   R2,VERMBR                                                06760000
         SPACE 1                                                        06770000
VERP80A  CH    R5,BLKSI            BLKSIZE VALID?                       06780000
         BNH   VERP81              YES, BRANCH                          06790000
         TM    #MEMPTR,#MEMBLKE    BLKSIZE SIZE ERROR NOTED?            06800000
         BO    VERP81              YES, BRANCH                          06810000
         OI    #MEMPTR,#MEMBLKE    BLKSIZE ERROR NOTED NOW              06820000
         CVD   R5,DOUBLE                                                06830000
         MVC   INSERT#1(8),VERP2020                                     06840000
         ED    INSERT#1(7),DOUBLE+5                                     06850000
         LA    R1,L812$1           BLKSIZE ERROR                        06860000
         BAS   R2,VERMBR                                                06870000
         SPACE 1                                                        06880000
VERP81   TM    FLAGSCC,RECFMF      FIXED FORMAT?                        06890000
         BNO   VERP82              NO, BRANCH                           06900000
         LH    R14,LRECL           CURRENT LRECL                        06910000
         TM    #MEMPTR,#MEMDIVE    BLKSIZE/LRECL ERROR NOTED?           06920000
         BO    VERP82              YES, BRANCH                          06930000
         LR    R0,R5               BLOCK LENGTH                         06940000
         SRDA  R0,32                                                    06950000
         DR    R0,R14              BLKSIZE/LRECL                        06960000
         LTR   R0,R0               ANY REMAINDER?                       06970000
         BZ    VERP82              YES, BRANCH                          06980000
         OI    #MEMPTR,#MEMDIVE    BLKSIZE/LRECL ERROR NOTED NOW        06990000
         CVD   R5,DOUBLE                                                07000000
         MVC   INSERT#1(8),VERP2020                                     07010000
         ED    INSERT#1(7),DOUBLE+5                                     07020000
         LA    R1,L814$1           BLKSIZE/LRECL ERROR                  07030000
         BAS   R2,VERMBR                                                07040000
         LH    R14,LRECL           CURRENT LRECL                        07050000
         SPACE 1                                                        07060000
VERP82   LR    R1,R5                                                    07070000
         AR    R5,R3               END OF BUFFER                        07080000
         BCTR  R5,0                END OF BUFFER -1                     07090000
         TM    FLAGSCC,RECFMF      RECFM=F?                             07100000
         LH    R4,LRECL                                                 07110000
         BO    VERP88              YES, BRANCH                          07120000
         TM    FLAGSCC,RECFMU      RECFM=U?                             07130000
         LR    R4,R1                                                    07140000
         BO    VERP87              YES, BRANCH                          07150000
         TM    FLAGSCC,RECFMV      RECFM=V?                             07160000
         BNO   VERP88              NO, ASSUME RECFM=U                   07170000
         AH    R3,=H'4'            SKIP BLOCK LENGTH WORD               07180000
         B     VERP86                                                   07190000
         SPACE 3                                                        07200000
         CNOP  0,8                 ALIGN FOR LOOP                       07201059
VERP84   BXLE  R3,R4,VERP86        GET THE NEXT LOGICAL RECORD          07210000
         B     VERP76              END OF BLOCK, BRANCH                 07220000
         SPACE 2                                                        07230000
VERP86   TM    FLAGSCC,RECFMV      RECFM=V?                             07240000
         BNO   VERP88              NO, BRANCH                           07250000
         SR    R4,R4                                                    07260000
         ICM   R4,B'0011',0(R3)    RECORD LENGTH +4                     07270000
         LR    R14,R4              RECORD LENGTH +4                     07280000
         C     R14,#VERMAXV        GREATER THAN MAX?          DRK DEC06 07282026
         BNH   *+8                 NO                         DRK DEC06 07283026
         ST    R14,#VERMAXV        YES, SAVE NEW MAXIMUM      DRK DEC06 07284025
         AH    R3,=H'4'            SKIP RECORD LENGTH WORD              07290000
         SH    R4,=H'4'            RECORD LENGTH VALID?                 07300000
         BNM   VERP88              YES, BRANCH                          07310000
         TM    #MEMPTR,#MEMLRL0    LRECL ERROR NOTED?                   07320000
         BO    VERP76              YES, BRANCH                          07330000
         OI    #MEMPTR,#MEMLRL0    LRECL ERROR NOTED                    07340000
         MVI   MTLEN,1             LENGTH OF MESSAGE                    07350000
         LA    R14,240(,R14)       RECORD LENGTH IN DISPLAY             07360000
         STC   R14,INSERT#1        PLACE IN THE MESSAGE                 07370000
         LA    R1,L811$1           LRECL TOO SMALL                      07380000
         BAS   R2,VERMBR                                                07390000
         B     VERP76                                                   07400000
         SPACE 2                                                        07410000
VERP87   CLI   RLDCOUNT,X'FF'      ANY RLD/CONTROL RECORD YET?          07420000
         BNE   VERP88              YES, BRANCH                          07430000
         TM    0(R3),X'F0'         TEST, ESD, IDR OR SCATTER RECORD?    07440000
         BM    VERP88              YES, BRANCH                          07450000
         MVC   RLDCOUNT(1),3(R3)   NO, FIRST RLD/CONTROL ENTRY          07460000
         SPACE 2                                                        07470000
VERP88   L     R1,#MEMCNT          ANOTHER                              07480000
         LA    R1,1(,R1)                  OUTPUT                        07490000
         ST    R1,#MEMCNT                       RECORD                  07500000
         L     R0,#VERCLOG         NUMBER                               07510000
         A     R0,=F'1'                  OF LOGICAL                     07520000
         ST    R0,#VERCLOG                         RECORDS              07530000
         CH    R14,LRECL           VALID LRECL VALUE?                   07540000
         BNH   VERP84              YES, BRANCH                          07550000
         TM    FLAGSCC,RECFMU      RECFM=U?                             07560000
         BO    VERP84              YES, BRANCH                          07570000
         TM    #MEMPTR,#MEMLRLE    LRECL ERROR NOTED?                   07580000
         BO    VERP84              YES, BRANCH                          07590000
         OI    #MEMPTR,#MEMLRLE    LRECL ERROR HAS BEEN NOTED           07600000
         CVD   R14,DOUBLE                                               07610000
         MVC   INSERT#1(8),VERP2020                                     07620000
         ED    INSERT#1(7),DOUBLE+5                                     07630000
         LA    R1,L813$1           LRECL TOO LARGE                      07640000
         BAS   R2,VERMBR                                                07650000
         B     VERP84                                                   07660000
         SPACE 2                                                        07670000
VERP90   MVI   #MEMCNT,X'FF'              END OF DATA SET               07680000
         SPACE 2                                                        07690000
VERP92   DS    0H                                                       07691089
         TM    DS1SMSFG,DS1PDSE           PDSE DATASET?       DRK NOV20 07691189
         BO    VERP93                     YES, BRANCH         DRK NOV20 07692089
         CLI   11(R6),0                   LENGTH=12, DATA?    DRK NOV20 07693089
         BE    VERP93                     YES, BRANCH         DRK NOV20 07694089
         SR    R0,R0               LENGTH OF RECORD & KEY (KDD OF RKDD) 07700089
         BAS   R2,VERCOMP          DATA IS RETAINED IN THE OUTPUT       07710000
         OC    12(3,R6),12(R6)            ANY USER TTR?                 07720000
         BZ    VERP93                     NO, BRANCH                    07730000
         STM   R14,R12,12(R13)            CONVERT CCHHR TO TTR          07740000
         LA    R2,CURMBB                  CCHHR TO CONVERT              07750000
         L     R1,INDCB+(DCBDEBAD-IHADCB) DEB ADDRESS                   07760000
         L     R15,ADDRRLTV               ADDRESS OF CCHHR->TTR CONVERT 07770000
         LR    R3,R13                     ADDRESS OF SAVE AREA          07780000
         BASR  R14,R15                    CALL CONVERT ROUTINE          07790000
         LR    R13,R3                     RESTORE SAVE AREA ADDRESS     07800000
         ST    R0,12+4+4(R13)             RESULT TTR RETURNED IN R0     07810000
         LM    R14,R12,12(R13)            RESTORE REGISTERS             07820000
         CLM   R0,B'1110',12(R6)          TTR ACTUALLY INPUT?           07830000
         BH    VERP93                     YES, BRANCH                   07840000
         LA    R1,L871                    NO, ERROR MESSAGE             07850000
         BAS   R2,VERMBR                                                07860000
         SPACE 1                                                        07870000
VERP93   OC    #MEMCNT+1(3),#MEMCNT+1  ANY RECORDS?                     07880000
         BNZ   VERP94                  YES, BRANCH                      07890000
         LA    R1,L510                 NO, NULL MEMBER WARNING          07900000
         BAS   R2,VERMBR                                                07910000
         SPACE 2                                                        07920000
VERP94   CLI   15(R6),X'FF'        OS/VS LINKAGE EDITOR?                07930000
         BE    VERP95              NO, BRANCH                           07940000
         CLC   15(1,R6),RLDCOUNT   RLD/CONTROL COUNTS MATCH?            07950000
         BE    VERP95              YES, BRANCH                          07960000
         TM    FLAGSCC,RECFMU      RECFM=U?                             07970000
         BNO   VERP95              NO, BRANCH                           07980000
         SPACE 1                                                        07980183
         CLI   11(R6),0            LENGTH=12, DATA?           DRK NOV20 07980290
         BE    VERP95              YES, BRANCH                DRK NOV20 07980489
         SPACE 1                                              DRK AUG05 07981010
         TM    DS1SMSFG,DS1PDSE    PDSE DATASET?              DRK AUG05 07981110
         BNO   *+4+2+4             NO, RLD ERROR              DRK AUG05 07981311
         SR    R1,R1               YES                        DRK AUG05 07981411
         B     VERP94E             SKIP ERROR MESSAGE         DRK AUG05 07981511
         SPACE 1                                              DRK AUG05 07981611
         LA    R1,L826             ERROR MESSAGE                        07990010
VERP94E  DS    0H                                             DRK AUG05 07991010
         BAS   R2,VERMBR                                                08000000
         SPACE 2                                                        08010000
VERP95   TM    FLAGSCC,RECFMU      RECFM=U?                             08020000
         BO    VERP96              YES, BRANCH                          08030000
         CLI   #VERSIZE,2          NOSIZE REQUESTED?                    08040000
         BE    VERP96              YES, BRANCH                          08050000
         L     R0,#VERCLOG         GET LOGICAL RECORD COUNT             08060000
         CVD   R0,DOUBLE           CONVERT TO DECIMAL                   08070000
         L     R1,ATTRCNT2                                              08080000
         LA    R1,1(,R1)             ADD ONE MORE                       08090000
         ST    R1,ATTRCNT2                                              08100000
         OI    ATTRTOT2+7,X'0F'      INSURE VALID PACKED SIGN           08110000
         AP    ATTRTOT2(8),DOUBLE(8) ADD IN CURRENT VALUE               08120000
*        LA    R1,VERSUMM          VERIFY SUMMARY                       08131056
         L     R1,AVERSUMM         VERIFY SUMMARY                       08132056
         ST    R1,ADDRSUMR         SET FOR A LATTER CALL                08140000
         TM    #VERUPDT,4+2        SINGLE MEMBER CHECK?                 08150000
         BO    VERP96              YES, BRANCH                          08160000
         MVC   ATTRTOT2(8),DOUBLE  NO, RESET THE LRECL COUNT            08170000
         SPACE 2                                                        08210000
VERP96   CLI   #MEMCNT,X'FF'       END OF DATA SET?                     08220000
         BNE   VERP74              NO, BRANCH                           08230000
         M$ERRST MSGBLANK                                               08240000
         MVI   MTLEN,44            LENGTH OF INSERT           DRK JUL16 08240155
         MVC   INSERT#1(44),DSNAME                            DRK JUL16 08240255
         M$MSG L006$1              YES, STATUS MESSAGE        DRK JUL16 08250055
         SPACE 2                                                        08260000
VERP97   TM    #VERSTAT,2          STATISTICS DESIRED?                  08270000
         BO    NEWCMD              NO, BRANCH                           08280000
         TM    DS1SMSFG,DS1PDSE    PDSE DATASET?              DRK AUG05 08280114
         BNO   VERP97E             NO, CONTINUE               DRK AUG05 08280214
         TM    FLAGSAA,FMEMBER1+FMEMBER2  ALL MEMBERS?        DRK AUG05 08280314
         BNZ   VERP97E                    NO, BRANCH          DRK AUG05 08280414
         M$ERRST MSGBLANK                 YES, SIMULATE EOD   DRK AUG05 08282014
         MVI   MTLEN,44            LENGTH OF INSERT           DRK JUL16 08282155
         MVC   INSERT#1(44),DSNAME                            DRK JUL16 08282255
         M$MSG L006$1              EOD STATUS MESSAGE         DRK JUL16 08282355
VERP97E  DS    0H                                             DRK AUG05 08284014
         M$ERRST MSGBLANK                                               08290000
         MVI   MTLEN,10                                                 08300000
         TM    FLAGSCC,RECFMU      RECFM=U?                             08310000
         BO    VERP98              YES, BRANCH                          08310125
         SPACE 1                                                        08310230
         TM    FLAGSCC,RECFMV      RECFM=V?                   DRK DEC06 08311125
         BNO   VERP97F             NO, BRANCH                 DRK DEC06 08311225
         SPACE 1                                                        08311334
         L     R2,#VERCBLK         NUMBER OF PHYSICAL BLOCKS INPUT      08311439
         LTR   R2,R2               ANY RECORDS?               DRK FEB09 08311539
         BNP   VERP98B             NO, BRANCH                 DRK FEB09 08311639
         SR    R0,R0                                          DRK FEB09 08311734
         L     R1,#VERCBLC         NUMBER OF CHARACTERS READ  DRK FEB09 08311834
         S     R1,=F'4'            SUBTRACT 1 BDW LENGTH      DRK FEB09 08311991
         D     R0,#VERCLOG         AVERAGE CHARACTERS/LREC    DRK FEB09 08312035
         CVD   R1,DOUBLE                                      DRK FEB09 08312134
         MVC   INSERT#1(10),VERP206B                          DRK FEB09 08312234
         ED    INSERT#1(10),DOUBLE+4                          DRK FEB09 08312334
         M$MSG L108$1                                         DRK FEB09 08312434
         SPACE 1                                                        08312535
         L     R0,#VERMAXV         MAXIMUM LRECL VALUE        DRK DEC06 08312634
         CVD   R0,DOUBLE                                      DRK DEC06 08312734
         MVC   INSERT#1(10),VERP206B                          DRK DEC06 08312834
         ED    INSERT#1(10),DOUBLE+4                          DRK DEC06 08312934
         M$MSG L109$1                                         DRK DEC06 08313034
         SPACE 1                                                        08313134
VERP97F  DS    0H                                             DRK DEC06 08314025
         L     R0,#VERCLOG         NUMBER OF LOGICAL RECORDS INPUT      08330000
         CVD   R0,DOUBLE                                                08340000
         MVC   INSERT#1(10),VERP206B                                    08350000
         ED    INSERT#1(10),DOUBLE+4                                    08360000
         M$MSG L110$1                                                   08370000
         SPACE 1                                                        08380000
VERP98   L     R2,#VERCBLK         NUMBER OF PHYSICAL BLOCKS INPUT      08390000
         CVD   R2,DOUBLE                                                08400000
         MVC   INSERT#1(10),VERP206B                                    08410000
         ED    INSERT#1(10),DOUBLE+4                                    08420000
         M$MSG L111$1                                                   08430000
         SPACE 1                                                        08440000
         LTR   R2,R2               ANY RECORDS?                         08450000
         BNP   VERP98B             NO, BRANCH                           08460000
         L     R1,#VERMAX          MAXIMUM CHARACTERS/BLOCK             08470000
         CVD   R1,DOUBLE                                                08480000
         MVC   INSERT#1(10),VERP206B                                    08490000
         ED    INSERT#1(10),DOUBLE+4                                    08500000
         M$MSG L112$1                                                   08510000
         SR    R0,R0                                                    08520000
         L     R1,#VERCBLC         NUMBER OF CHARACTERS READ            08530000
         SRL   R2,1                AMOUNT FOR ROUNDING                  08540000
         AR    R1,R2                                                    08550000
         D     R0,#VERCBLK         AVERAGE CHARACTERS/BLOCK             08560000
         CVD   R1,DOUBLE                                                08570000
         MVC   INSERT#1(10),VERP206B                                    08580000
         ED    INSERT#1(10),DOUBLE+4                                    08590000
         M$MSG L113$1                                                   08600000
         SPACE 1                                                        08610000
VERP98B  TM    #VERUPDT,4+2        SINGLE MEMBER CHECK?                 08620000
         BO    NEWCMD              YES, DONE                            08630000
         LH    R0,DS1LSTAR         GET TT OF LAST TRACK USED            08640000
         S     R0,#VERCTRK         LESS THE AMOUNT AFTER THE COMPRESS   08650000
         BNM   *+6                 ZERO OR MORE, BRANCH                 08660000
         SR    R0,R0               NEGATIVE, ERROR (USE ZERO)           08670000
         CVD   R0,DOUBLE           NUMBER OF WHOLE COMPRESSED TRACKS    08680000
         MVC   INSERT#1(10),VERP206B                                    08690000
         ED    INSERT#1(10),DOUBLE+4                                    08700000
         M$MSG L114$1                                                   08710000
         B     VERP99B                                                  08720000
         SPACE 2                                                        08730000
VERP99   TM    #VERSTAT,2          STATISTICS DESIRED?                  08740000
         BO    NEWCMD              NO, BRANCH                           08750000
         TM    #VERUPDT,4+2        SINGLE MEMBER CHECK?                 08760000
         BO    NEWCMD              YES, DONE                            08770000
         M$ERRST MSGBLANK                                               08780000
         SPACE 1                                                        08790000
VERP99B  MVI   MTLEN,10            TEN BYTES OF INSERTED MESSAGE        08800000
         L     R1,#MEMLAST         LAST MEMBER POINTER                  08810000
         L     R2,#MEMPTR          START OF MEMBER LIST                 08820000
         LA    R2,0(,R2)           CLEAR HIGH-ORDER DIGIT               08830000
         SR    R1,R2               (END+1 - START) * 16                 08840000
         SRL   R1,4                DIVIDE BY 16                         08850000
         CVD   R1,DOUBLE                                                08860000
         MVC   INSERT#1(10),VERP206B                                    08870000
         ED    INSERT#1(10),DOUBLE+4                                    08880000
         M$MSG L115$1                                                   08890000
         M$ERRST MSGBLANK                                               08900000
         B     NEWCMD                                                   08910000
         SPACE 2                                                        08920000
VERMBR   ST    R2,#SAVEREG         SAVE REGISTER                        08930000
         ST    R1,MSGTEXT1         SAVE FOR LATER OUTPUT                08940000
         LA    R1,MEMNAME          ASSUME DATA SET CHECK                08950000
         TM    #VERUPDT,4+2        MEMBER NAME CHECK?                   08960000
         BNO   *+8                 NO, BRANCH                           08970000
         LA    R1,DIRNAME          YES, USE DIRECTORY NAME              08980000
         CLC   #VERMEM(8),0(R1)    MEMBER NAME DISPLAYED?               08990000
         BE    VERMBR20            YES, BRANCH                          09000000
         MVC   #VERMEM(8),0(R1)    MEMBER NAME DISPLAYED                09010000
         SPACE 1                                                        09020000
         MVC   MSGTEXT2(136),MSGBL132                                   09030000
         MVC   MSGTEXT2+4(2),VERLSTAR                                   09040000
         MVC   MSGTEXT2+4+3(8),##SUBCOM                                 09050000
         TM    DSORG,DS1DSGPO      PARTITIONED?                         09060000
         BNO   VERMBR10            NO, BRANCH                           09070000
         M$ERRST MSGBLANK          ONE BLANK LINE                       09080000
         MVC   MSGTEXT2+4+3+8+1(8),#VERMEM                              09090000
         TR    MSGTEXT2+4+3+8+1(8),TRLINE                               09100000
         MVC   DOUBLE(8),#VERMEM                                        09110000
         LA    R1,7                                                     09120000
         LA    R14,DOUBLE+8                                             09130000
         SPACE 1                                                        09140000
VERMBR02 BCTR  R14,0               SCAN                                 09150000
         CLI   0(R14),X'40'            BACKWARDS                        09160000
         BNE   *+8                              FOR FIRST               09170000
         BCT   R1,VERMBR02                               NON-BLANK      09180000
         SPACE 1                                                        09190000
         CLI   #VERMEM,C'0'        NUMERIC FIRST CHARACTER?             09200000
         BNL   VERMBR04            YES, NON-STANDARD                    09210000
         TRT   DOUBLE(*-*),TRTMEM  <<EXECUTED>>                         09220000
         EX    R1,*-6              VALID CHARACTERS?                    09230000
         BZ    VERMBR10            YES, BRANCH                          09240000
         SPACE 1                                                        09250000
VERMBR04 MVC   MSGTEXT2+4+3+8+1+8+2(2),=C'X'''                          09260000
         UNPK  MSGTEXT2+4+3+8+1+8+2+2(9),#VERMEM(5)                     09270000
         UNPK  MSGTEXT2+4+3+8+1+8+2+2+8(9),#VERMEM+4(5)                 09280000
         TR    MSGTEXT2+4+3+8+1+8+2+2(8+8),TRTABLE                      09290000
         MVI   MSGTEXT2+4+3+8+1+8+2+2+8+8,C''''                         09300000
         TM    #VERSTND,X'02'          STANDARD NAME CHECKING?          09310000
         BNZ   VERMBR10                NO, BRANCH                       09320000
         MVC   MSGTEXT2+48(24),VERLNONS                                 09330000
         M$ERRST MSGTEXT2          MEMBER HEADER MESSAGE                09340000
         L     R2,#SAVEREG         RESTORE REGISTER                     09350000
         BR    R2                                                       09360000
         SPACE 1                                                        09370000
VERMBR10 M$ERRST MSGTEXT2          MEMBER HEADER MESSAGE                09380000
         SPACE 1                                                        09390000
VERMBR20 L     R1,MSGTEXT1         MESSAGE IDENTIFIER OR MESSAGE        09400000
         LTR   R1,R1               ANY MESSAGE?                         09410000
         BZ    VERMBR30            NO, BRANCH                           09420000
         M$MSG (R1)                                                     09430000
VERMBR30 MVI   MTLEN,8             RESET THE MESSAGE LENGTH             09440000
         L     R2,#SAVEREG         RESTORE REGISTER                     09450000
         BR    R2                                                       09460000
         SPACE 2                                                        09470000
VERCOMP  ST    R0,#VERCREG                                              09480000
         SPACE 1                                                        09490000
VERCOMP2 L     R0,#VERCREG                                              09500000
         L     R1,#VERCREC                                              09510000
         A     R1,=F'1'            CURRENT COMPRESS RECORD              09520000
         ST    R1,#VERCREC                                              09530000
         ICM   R0,B'1000',#VERCREC+3  RECORD NUMBER IN RKDD (R OF RKDD) 09540000
         SPACE 1                                                        09550000
         PUSH  ACONTROL                                       DRK MAY08 09550133
         ACONTROL FLAG(NOPAGE0)                               DRK MAY08 09550232
         TRKCALC FUNCTN=TRKBAL,TYPE=BYTEUCB+1,REGSAVE=YES,             X09560000
               BALANCE=#VERCBAL+2,RKDD=(0),MF=(E,PARMLIST)              09570000
         POP   ACONTROL                                       DRK MAY08 09571032
         SPACE 1                                                        09580000
         LTR   R15,R15             FIT ON CURRENT TRACK?                09590000
         BZ    VERCOMPX            YES, BRANCH                          09600000
         SPACE 1                                                        09610000
         L     R1,#VERCTRK                                              09620000
         A     R1,=F'1'            START A NEW TRACK IN OUTPUT          09630000
         ST    R1,#VERCTRK                                              09640000
         MVI   #VERCREC+3,0        RECORD ZERO                          09650000
         B     VERCOMP2            TRY AGAIN                            09660000
         SPACE 1                                                        09670000
VERCOMPX ST    R0,#VERCBAL         SAVE THE TRACK BALANCE               09680000
         BR    R2                                                       09690000
         SPACE 3                                                        09700000
VERLSTAR DC    C'**'                                                    09710000
VERLNONS DC    CL24'NON-STANDARD MEMBER NAME'                           09720000
VERP2020 DC    X'4020206B20212040'                                      09730000
VERP206B DC    X'40206B2020206B202120'                                  09740000
VERRENT  DC    C'RENT'                                                  09750000
VERREUS  DC    C'REUS'                                                  09760000
VERREFR  DC    C'REFR'                                                  09770000
VERSCTR  DC    C'SCTR'                                                  09780000
AVERS00  DC    A(VERS00)                                                09790000
AVERSUMM DC    A(VERSUMM)                                               09791056
         SPACE 3                                                        09800000
VERAD00  CLI   #VERSIZE,2            NOSIZE REQUESTED?                  09810000
         BER   R14                   YES, BRANCH                        09820000
         SR    R0,R0                                                    09830000
         ICM   R0,B'0111',DIRSTORE   LOAD MODULE                        09840000
         CVD   R0,DOUBLE             CONVERT TO DECIMAL                 09850000
*        LA    R1,VERSUMM            VERIFY SUMMARY                     09861056
         L     R1,AVERSUMM           VERIFY SUMMARY                     09862056
         ST    R1,ADDRSUMR           SET FOR A LATTER CALL              09870000
         TM    DIRATTR3,DIRRMANY     RMODE ANY?                         09880000
         L     R1,=A(VERAD10)                                           09881072
         BOR   R1                    YES, BRANCH                        09882072
*        BO    VERAD10               YES, BRANCH                        09890072
         L     R1,ATTRCNT2                                              09900000
         LA    R1,1(,R1)             ADD ONE MORE                       09910000
         ST    R1,ATTRCNT2                                              09920000
         OI    ATTRTOT2+7,X'0F'      INSURE VALID PACKED SIGN           09930000
         AP    ATTRTOT2(8),DOUBLE(8) ADD IN CURRENT VALUE               09940000
         BR    R14                                                      09950000
VERAD10  L     R1,ATTRCNTA                                              09960000
         LA    R1,1(,R1)             ADD ONE MORE                       09970000
         ST    R1,ATTRCNTA                                              09980000
         OI    ATTRTOTA+7,X'0F'      INSURE VALID PACKED SIGN           09990000
         AP    ATTRTOTA(8),DOUBLE(8) ADD IN CURRENT VALUE               10000000
         BR    R14                                                      10010000
         SPACE 2                                                        10020000
***      SUMMARIZATION ROUTINE TO WRITE PDS117I MESSAGE                 10030000
         USING *,R8                                                     10040000
VERSUMM  XC    ADDRSUMR,ADDRSUMR   CLEAR THE SUMMARY ADDRESS            10050000
         CLI   #VERSIZE,2          NOSIZE REQUESTED?                    10060000
         BE    VERU90              YES, BRANCH                          10070000
         L     R1,ATTRCNT2                                              10080000
         A     R1,ATTRCNTA                                              10090000
         C     R1,=F'0'            ONE OR MORE ENTRIES?       DRK APR14 10101053
         BNH   VERU90              NO, BRANCH                           10110000
         MVI   MTLEN,16            GET LENGTH                           10120000
         MVI   MTLEN+4,16                                               10130000
         M$ERRST MSGBLANK          ONE BLANK LINE                       10140000
         OI    ATTRTOT2+7,X'0F'    INSURE VALID PACKED SIGN             10150000
         L     R1,ATTRCNT2         COUNT OF MODULES                     10160000
         CVD   R1,DOUBLE           IN PACKED FORM                       10170000
         BAS   R14,VERU99          GET THE FIRST COUNT                  10180000
         MVC   INSERT#1(16),0(R1)  MOVE INTO COUNT AREA                 10190000
         MVC   DOUBLE(8),ATTRTOT2  MOVE INTO COMMON AREA                10200000
         TM    FLAGSCC,RECFMU      LOAD MODULES?                        10210000
         BNO   VERU10              NO, BRANCH                           10220000
         AP    DOUBLE(8),VERSUFFF  ADD 1023                             10230000
         DP    DOUBLE(8),VERSU1K   DIVIDE BY 1024                       10240000
         ZAP   ATTRTOT2(8),DOUBLE(5) MOVE IN QUOTIENT                   10250000
         MVC   DOUBLE(8),ATTRTOT2  MOVE INTO COMMON AREA                10260000
VERU10   BAS   R14,VERU99          CONVERT SIZE                         10270000
         MVC   INSERT#2(16),0(R1)  MOVE IN SIZE PARAMETER               10280000
         TM    FLAGSCC,RECFMU      LOAD MODULES?                        10290000
         BO    VERU20              YES, BRANCH                          10300000
         M$MSG L117$2                                                   10310000
         B     VERU90                                                   10320000
VERU20   ICM   R1,B'1111',ATTRCNT2 ANY COUNT?                           10330000
         BZ    VERU25              NO, BRANCH                           10340000
         M$MSG L118$2                                                   10350000
VERU25   OI    ATTRTOTA+7,X'0F'    INSURE VALID PACKED SIGN             10360000
*                                                                       10370000
         ICM   R1,B'1111',ATTRCNTA ANY COUNT?                           10380000
         BZ    VERU90              NO, BRANCH                           10390000
         L     R1,ATTRCNTA         COUNT OF MODULES                     10400000
         CVD   R1,DOUBLE           IN PACKED FORM                       10410000
         BAS   R14,VERU99          GET THE FIRST COUNT                  10420000
         MVC   INSERT#1(16),0(R1)  MOVE INTO COUNT AREA                 10430000
         MVC   DOUBLE(8),ATTRTOTA  MOVE INTO COMMON AREA                10440000
         AP    DOUBLE(8),VERSUFFF  ADD 1023                             10450000
         DP    DOUBLE(8),VERSU1K   DIVIDE BY 1024                       10460000
         ZAP   ATTRTOTA(8),DOUBLE(5) MOVE IN QUOTIENT                   10470000
         MVC   DOUBLE(8),ATTRTOTA  MOVE INTO COMMON AREA                10480000
         BAS   R14,VERU99          CONVERT SIZE                         10490000
         MVC   INSERT#2(16),0(R1)  MOVE IN SIZE PARAMETER               10500000
         M$MSG L119$2                                                   10510000
*                                                                       10520000
VERU90   M$ERRST MSGBLANK                 ONE BLANK LINE                10530000
         XC    ATTRCNT2(4+4),ATTRCNT2     COUNTS                        10540000
         XC    ATTRTOT2(8+8),ATTRTOT2     TOTALS                        10550000
         MVI   MTLEN,8                    RESET LENGTH                  10560000
         MVI   MTLEN+4,8                  RESET LENGTH                  10570000
         BR    R2                                                       10580000
VERU99   DS    0H                                                       10590000
         MVC   INSERT#2+16(15),VERSUMMP EDIT PICTURE                    10600000
         MVC   INSERT#2+16+15(16),BLANK128                              10610000
         ED    INSERT#2+16(15),DOUBLE+2                                 10620000
         LA    R1,INSERT#2+16                                           10630000
         LA    R1,1(,R1)   <---+                                        10640000
         CLI   0(R1),X'40'     |                                        10650000
         BE    *-8         ----+                                        10660000
         BR    R14                                                      10670000
         SPACE 2                                                        10680000
*                 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5                         10690000
*                   1 2 , 3 4 5 , 6 7 8 , 9 0 1                         10700000
VERSUMMP DC    X'4020206B2020206B2020206B202120'                        10710000
VERSUFFF DC    PL3'1023'                                                10720000
VERSU1K  DC    PL3'1024'                                                10730000
         SPACE 3                                                        10740000
VERS00   BASR  R8,0                                                     10750000
         USING *,R8                                                     10760000
         OI    ##ADRPA#,$Q         ENTER QUIET MODE PROCESSING          10770000
         SPACE 1                                                        10780000
         MVC   MEMNAME(8),BLANKS   INITIALIZE THE MEMBER NAME           10790000
         MVC   DSNMEMQ(8),MEMNAME  MEMBER NAME TO CHECK                 10800000
         BAS   R2,ENQMTEST         MEMBER IN USE?                       10810000
         B     *+8                 YES, BRANCH                          10820000
         B     VERS40              NO, BRANCH                           10830000
         MVC   INSERT#1(8),INSERT#2  JOBNAME                            10840000
         M$MSG L851$1                                                   10850000
         SPACE 2                                                        10860000
VERS40   CLI   #VERREAD,X'02'      NOINPUT REQUESTED?                   10870000
         BE    VERS99              YES, BRANCH                          10880000
         SPACE 2                                                        10890000
         MVI   #MEMPTR,0           CLEAR THE MEMBER FLAG                10900000
         XC    #MEMCNT(4),#MEMCNT  COUNT OF INPUT LOGICAL RECORDS       10910000
         MVI   STARTTR+2,X'01'     TTR=000001 (START OF DATA SET)       10920000
         SPACE 2                                                        10930000
VERS76   L     R15,=V(EXCP)                                             10940000
         BASR  R14,R15                                                  10950000
         B     *+4(R15)            PROCESS RETURN CODE                  10960000
         B     VERS80                00 - SUCCESSFUL READ               10970000
         B     VERS90                04 - END OF FILE                   10980000
         B     VERS92                08 - END OF DATA SET               10990000
         B     VERS78                12 - I/O ERROR                     11000000
         SPACE 2                                                        11010000
*  PERMANENT I/O ERROR  -- SIMULATE END OF DATA SET                     11020000
VERS78   MVI   MTLEN,6             LENGTH OF THE TTR INSERT             11030000
*        MVC   INSERT#1(6),INSERT#1        FIRST PARAMETER              11040000
         M$MSG L991$1                      OUTPUT AN ERROR MESSAGE      11050000
         MVI   MTLEN,8                     RESET TO EIGHT               11060000
         B     VERS97                                                   11070000
         SPACE 2                                                        11080000
VERS80   LR    R3,R0               BUFFER START                         11090000
         L     R5,LS               BLOCK LENGTH                         11100000
         C     R5,#VERMAX          GREATER THAN MAXIMUM?                11110000
         BNH   *+8                 NO, BRANCH                           11120000
         ST    R5,#VERMAX          YES, SAVE NEW MAXIMUM                11130000
         L     R0,#VERCBLK         NUMBER                               11140000
         A     R0,=F'1'                  OF PHYSICAL                    11150000
         ST    R0,#VERCBLK                          BLOCKS              11160000
         L     R0,#VERCBLC         NUMBER                               11170000
         AR    R0,R5                     OF PHYSICAL                    11180000
         ST    R0,#VERCBLC                          CHARACTERS          11190000
         SPACE 1                                                        11200000
         CH    R5,#MAXBLKV         EXCEED MAXBLK?                       11210000
         BNH   VERS81              YES, BRANCH                          11220000
         OC    #MAXBLKV(2),#MAXBLKV  ANY MAXBLK()?                      11230000
         BZ    VERS80A               NO, BRANCH                         11240000
         TM    #MEMPTR,#MEMBLKE    BLKSIZE SIZE ERROR NOTED?            11250000
         BO    VERS81              YES, BRANCH                          11260000
         OI    #MEMPTR,#MEMBLKE    BLKSIZE ERROR NOTED NOW              11270000
         CVD   R5,DOUBLE                                                11280000
         MVC   INSERT#1(8),VERS2020                                     11290000
         ED    INSERT#1(7),DOUBLE+5                                     11300000
         M$MSG L806$1              BLKSIZE ERROR                        11310000
         SPACE 1                                                        11320000
VERS80A  CH    R5,BLKSI            BLKSIZE VALID?                       11330000
         BNH   VERS81              YES, BRANCH                          11340000
         TM    #MEMPTR,#MEMBLKE    BLKSIZE SIZE ERROR NOTED?            11350000
         BO    VERS81              YES, BRANCH                          11360000
         OI    #MEMPTR,#MEMBLKE    BLKSIZE ERROR NOTED NOW              11370000
         CVD   R5,DOUBLE                                                11380000
         MVC   INSERT#1(8),VERS2020                                     11390000
         ED    INSERT#1(7),DOUBLE+5                                     11400000
         M$MSG L812$1                                                   11410000
         SPACE 1                                                        11420000
VERS81   TM    FLAGSCC,RECFMF      FIXED FORMAT?                        11430000
         BNO   VERS82              NO, BRANCH                           11440000
         LH    R14,LRECL           CURRENT LRECL                        11450000
         TM    #MEMPTR,#MEMDIVE    BLKSIZE/LRECL ERROR NOTED?           11460000
         BO    VERS82              YES, BRANCH                          11470000
         LR    R0,R5               BLOCK LENGTH                         11480000
         SRDA  R0,32                                                    11490000
         DR    R0,R14              BLKSIZE/LRECL                        11500000
         LTR   R0,R0               ANY REMAINDER?                       11510000
         BZ    VERS82              YES, BRANCH                          11520000
         OI    #MEMPTR,#MEMDIVE    BLKSIZE/LRECL ERROR NOTED NOW        11530000
         CVD   R5,DOUBLE                                                11540000
         MVC   INSERT#1(8),VERS2020                                     11550000
         ED    INSERT#1(7),DOUBLE+5                                     11560000
         M$MSG L814$1                                                   11570000
         LH    R14,LRECL           CURRENT LRECL                        11580000
         SPACE 1                                                        11590000
VERS82   LR    R1,R5                                                    11600000
         AR    R5,R3               END OF BUFFER                        11610000
         BCTR  R5,0                END OF BUFFER -1                     11620000
         TM    FLAGSCC,RECFMF      RECFM=F?                             11630000
         LH    R4,LRECL                                                 11640000
         BO    VERS88              YES, BRANCH                          11650000
         TM    FLAGSCC,RECFMU      RECFM=U?                             11660000
         LR    R4,R1                                                    11670000
         BO    VERS88              YES, BRANCH                          11680000
         TM    FLAGSCC,RECFMV      RECFM=V?                             11690000
         BNO   VERS88              NO, ASSUME RECFM=U                   11700000
         AH    R3,=H'4'            SKIP BLOCK LENGTH WORD               11710000
         B     VERS86                                                   11720000
         SPACE 3                                                        11730000
         CNOP  0,8                 ALIGN FOR LOOP                       11731059
VERS84   BXLE  R3,R4,VERS86        GET THE NEXT LOGICAL RECORD          11740000
         B     VERS76              END OF BLOCK, BRANCH                 11750000
         SPACE 2                                                        11760000
VERS86   TM    FLAGSCC,RECFMV      RECFM=V?                             11770000
         BNO   VERS88              NO, BRANCH                           11780000
         SR    R4,R4                                                    11790000
         ICM   R4,B'0011',0(R3)    RECORD LENGTH +4                     11800000
         LR    R14,R4              RECORD LENGTH +4                     11810000
         MVC   FULLWORD(1),2(R3)   SEGMENT CONTROL CODE (SDW) DRK NOV13 11810151
         C     R14,#VERMAXV        GREATER THAN MAX?          DRK DEC06 11810230
         BNH   *+8                 NO                         DRK DEC06 11810330
         ST    R14,#VERMAXV        YES, SAVE NEW MAXIMUM      DRK DEC06 11810430
         AH    R3,=H'4'            SKIP RECORD LENGTH WORD              11820000
         SH    R4,=H'4'            RECORD LENGTH VALID?                 11830000
         BP    VERS88              YES, BRANCH                          11840000
         TM    #MEMPTR,#MEMLRL0    LRECL ERROR NOTED?                   11850000
         BO    VERS76              YES, BRANCH                          11860000
         OI    #MEMPTR,#MEMLRL0    LRECL ERROR NOTED                    11870000
         MVI   MTLEN,1             LENGTH OF MESSAGE                    11880000
         LA    R14,240(,R14)       RECORD LENGTH IN DISPLAY             11890000
         STC   R14,INSERT#1        PLACE IN THE MESSAGE                 11900000
         M$MSG L811$1                                                   11910000
         MVI   MTLEN,8                     RESET TO EIGHT               11920000
         B     VERS76              YES, BRANCH                          11930000
         SPACE 2                                                        11940000
VERS88   L     R1,#MEMCNT          ANOTHER                              12001350
         LA    R1,1(,R1)                  OUTPUT                        12001450
         ST    R1,#MEMCNT                       RECORD                  12001550
         SPACE 1                                              DRK NOV13 12001650
         TM    RECFM,X'48'         RECFM=VS                   DRK NOV13 12001750
         BNO   VERS88A             NO, COUNT                  DRK NOV13 12001850
         CLI   FULLWORD,2          0=COMPLETE, 1=FIRST SEGMENT?       " 12001950
         BNL   VERS88B             NO, DON'T COUNT AS LREC    DRK NOV13 12002050
VERS88A  DS    0H                                             DRK NOV13 12002150
         L     R0,#VERCLOG         NUMBER                               12002250
         A     R0,=F'1'                  OF LOGICAL                     12002350
         ST    R0,#VERCLOG                         RECORDS              12002450
VERS88B  DS    0H                                             DRK NOV13 12002550
         CH    R14,LRECL           VALID LRECL VALUE?                   12010000
         BNH   VERS84              YES, BRANCH                          12020000
         TM    FLAGSCC,RECFMU      RECFM=U?                             12030000
         BO    VERS84              YES, BRANCH                          12040000
         TM    #MEMPTR,#MEMLRLE    LRECL ERROR NOTED?                   12050000
         BO    VERS84              YES, BRANCH                          12060000
         OI    #MEMPTR,#MEMLRLE    LRECL ERROR HAS BEEN NOTED           12070000
         CVD   R14,DOUBLE                                               12080000
         MVC   INSERT#1(8),VERS2020                                     12090000
         ED    INSERT#1(7),DOUBLE+5                                     12100000
         M$MSG L813$1                                                   12110000
         B     VERS84                                                   12120000
         SPACE 2                                                        12130000
VERS90   M$ERRST MSGBLANK                                               12140000
         M$MSG L005                       END OF FILE                   12150000
         M$ERRST MSGBLANK                                               12160000
         B     VERS76                     LOOP                          12170000
         SPACE 2                                                        12180000
VERS92   M$ERRST MSGBLANK                                               12190000
         MVI   MTLEN,44            LENGTH OF INSERT           DRK JUL16 12190155
         MVC   INSERT#1(44),DSNAME                            DRK JUL16 12190255
         M$MSG L006$1              END OF DATA SET            DRK JUL16 12191055
         M$ERRST MSGBLANK                                     DRK JUL16 12192057
         SPACE 2                                                        12210000
VERS97   MVI   MTLEN,10                                                 12220000
         TM    FLAGSCC,RECFMU      RECFM=U?                             12230000
         BO    VERS98              YES, BRANCH                          12240000
         SPACE 1                                                        12240130
         TM    FLAGSCC,RECFMV      RECFM=V?                   DRK DEC06 12240228
         BNO   VERS97F             NO, BRANCH                 DRK DEC06 12240328
         SPACE 1                                                        12240435
         L     R2,#VERCBLK         NUMBER OF PHYSICAL BLOCKS INPUT      12240539
         LTR   R2,R2               ANY RECORDS?               DRK FEB09 12240639
         BNP   VERS99              NO, BRANCH                 DRK FEB09 12240739
         SR    R0,R0                                          DRK FEB09 12240935
         L     R1,#VERCBLC         NUMBER OF CHARACTERS READ  DRK FEB09 12241035
         S     R1,=F'4'            SUBTRACT 1 BDW LENGTH      DRK FEB09 12241191
         D     R0,#VERCLOG         AVERAGE CHARACTERS/LREC    DRK FEB09 12241235
         CVD   R1,DOUBLE                                      DRK FEB09 12241335
         MVC   INSERT#1(10),VERS206B                          DRK FEB09 12241437
         ED    INSERT#1(10),DOUBLE+4                          DRK FEB09 12241535
         M$MSG L108$1                                         DRK FEB09 12241635
         SPACE 1                                                        12241735
         L     R0,#VERMAXV         MAXIMUM LRECL VALUE        DRK DEC06 12241828
         CVD   R0,DOUBLE                                      DRK DEC06 12241928
         MVC   INSERT#1(10),VERS206B                          DRK DEC06 12242029
         ED    INSERT#1(10),DOUBLE+4                          DRK DEC06 12242128
         M$MSG L109$1                                         DRK DEC06 12242228
         SPACE 1                                                        12242330
VERS97F  DS    0H                                             DRK DEC06 12243028
         L     R0,#VERCLOG         NUMBER OF LOGICAL RECORDS INPUT      12250000
         CVD   R0,DOUBLE                                                12260000
         MVC   INSERT#1(10),VERS206B                                    12270000
         ED    INSERT#1(10),DOUBLE+4                                    12280000
         M$MSG L110$1              NO                                   12282149
         TM    RECFM,X'48'         RECFM=VS?                  DRK NOV13 12282251
         BNO   VERS98              NO                         DRK NOV13 12282351
         L     R0,#MEMCNT          NUMBER OF SPANNED SEGMENT RECS     " 12282451
         CVD   R0,DOUBLE                                      DRK NOV13 12282551
         MVC   INSERT#1(10),VERS206B                          DRK NOV13 12282651
         ED    INSERT#1(10),DOUBLE+4                          DRK NOV13 12282751
         M$MSG L121$1                                         DRK NOV13 12282851
         SPACE 1                                                        12300000
VERS98   L     R2,#VERCBLK         NUMBER OF PHYSICAL BLOCKS INPUT      12310000
         CVD   R2,DOUBLE                                                12320000
         MVC   INSERT#1(10),VERS206B                                    12330000
         ED    INSERT#1(10),DOUBLE+4                                    12340000
         M$MSG L111$1                                                   12350000
         SPACE 1                                                        12360000
         LTR   R2,R2               ANY RECORDS?                         12370000
         BNP   VERS99              NO, BRANCH                           12380000
         L     R1,#VERMAX          MAXIMUM CHARACTERS/BLOCK             12390000
         CVD   R1,DOUBLE                                                12400000
         MVC   INSERT#1(10),VERS206B                                    12410000
         ED    INSERT#1(10),DOUBLE+4                                    12420000
         M$MSG L112$1                                                   12430000
         SR    R0,R0                                                    12440000
         L     R1,#VERCBLC         NUMBER OF CHARACTERS READ            12450000
         SRL   R2,1                AMOUNT FOR ROUNDING                  12460000
         AR    R1,R2                                                    12470000
         D     R0,#VERCBLK         AVERAGE CHARACTERS/BLOCK             12480000
         CVD   R1,DOUBLE                                                12490000
         MVC   INSERT#1(10),VERS206B                                    12500000
         ED    INSERT#1(10),DOUBLE+4                                    12510000
         M$MSG L113$1                                                   12520000
         B     NEWCMD                                                   12530000
         SPACE 2                                                        12540000
VERS99   M$ERRST MSGBLANK                                               12550000
         LA    R1,L116                                                  12560000
         B     MSGNEW                                                   12570000
VERS2020 DC    X'4020206B20212040'                                      12580000
VERS206B DC    X'40206B2020206B202120'                                  12590000
         SPACE 1                                                        12590169
VERRM64  DS    0H                                                       12590570
         USING *,R15                                                    12590673
         ST    R14,R14SAVE                 M$MSG USES R14     DRK APR18 12590774
         LA    R1,=C'ANY'                  ASSUME AMODE IS ANY        " 12592369
         TM    MODESAVE,DIRAM64+DIRAM31 03 AMODE ANY?         DRK APR18 12592478
         BO    VERRM64A                    YES, INVALID       DRK APR18 12592569
         LA    R1,=C'31 '                  ASSUME AMODE IS 31         " 12592670
         TM    MODESAVE,DIRAM31         02 AMODE 31?          DRK APR18 12592778
         BO    VERRM64A                    YES, INVALID       DRK APR18 12592869
         TM    MODESAVE,DIRAM64         01 AMODE 64?          DRK APR18 12592978
         BO    VERRM64B                    YES, VALID         DRK APR18 12593071
         LA    R1,=C'24 '               00 AMODE IS 24        DRK APR18 12593178
VERRM64A DS    0H                                                       12593271
         MVI   MTLEN,3                     MESSAGE LENGTH               12593369
         MVC   INSERT#1(3),0(R1)           MOVE IN THE AMODE TEXT       12593469
         LA    R1,L879$1A                  RMODE ANY/AMODE CONFLICT     12593576
         BAS   R2,VERMBR64                 OUTPUT AN ERROR MESSAGE      12593676
VERRM64B DS    0H                                                       12593871
         L     R14,R14SAVE                 RESTORE R14        DRK APR18 12594074
         BR    R14                         RETURN             DRK APR18 12600073
L879$1A  DC    C'879'                                         DRK APR18 12610071
         SPACE 2                                                        12610176
VERMBR64 DS    0H                                             DRK APR18 12610279
         ST    R2,#SAVEREG         SAVE REGISTER                        12610376
         ST    R1,MSGTEXT1         SAVE FOR LATER OUTPUT                12610476
         LA    R1,MEMNAME          ASSUME DATA SET CHECK                12610676
         TM    #VERUPDT,4+2        MEMBER NAME CHECK?                   12610776
         BNO   *+8                 NO, BRANCH                           12610876
         LA    R1,DIRNAME          YES, USE DIRECTORY NAME              12610976
         CLC   #VERMEM(8),0(R1)    MEMBER NAME DISPLAYED?               12611076
         BE    VERRM64$            YES, BRANCH                          12611176
         MVC   #VERMEM(8),0(R1)    MEMBER NAME DISPLAYED                12611276
         MVC   MSGTEXT2(136),MSGBL132                                   12611376
         MVC   MSGTEXT2+4(2),=C'**'                                     12611476
         MVC   MSGTEXT2+4+3(8),##SUBCOM                                 12611576
         MVC   MSGTEXT2+4+3+8+1(8),#VERMEM                              12611676
         TR    MSGTEXT2+4+3+8+1(8),TRLINE                               12611776
         M$ERRST MSGBLANK          ONE BLANK LINE                       12611876
         M$ERRST MSGTEXT2          MEMBER HEADER MESSAGE                12611976
VERRM64$ DS    0H                                                       12612076
         L     R1,MSGTEXT1         MESSAGE IDENTIFIER OR MESSAGE        12612176
         M$MSG (R1)                                                     12612476
         MVI   MTLEN,8             RESET THE MESSAGE LENGTH             12612577
         L     R2,#SAVEREG         RESTORE REGISTER                     12612676
         BR    R2                                                       12612776
         DROP  R15                                                      12612876
